melkorbsd/ru-freebsd-man/man1/dd.1
.\"-
.\" Авторское право (c) 1990, 1993
.\" Ректоры Калифорнийского университета. Все права защищены.
.\"
.\" Этот код произведен на основе программного обеспечения, предоставленного в Беркли
.\" Китом Мюллером из Калифорнийского университета, Сан-Диего.
.\"
.\" Разрешение на распространение и использование в исходной и бинарной формах,
.\" с изменениями или без них, разрешается при условии соблюдения следующих условий:
.\" 1. Распространение исходного кода должно сохранять приведенное выше уведомление о копирайте,
.\"    этот список условий и следующий отказ от ответственности.
.\" 2. Распространение в бинарной форме должно воспроизводить приведенное выше уведомление о копирайте,
.\"    этот список условий и следующий отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых вместе с распространением.
.\" 3. Ни название университета, ни имена его участников
.\"    не могут использоваться для продвижения производных продуктов
.\"    без явного предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО РЕГЕНТАМИ И УЧАСТНИКАМИ «КАК ЕСТЬ», И
.\" ЛЮБЫЕ ПРЯМЫЕ ИЛИ КОСВЕННЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ,
.\" ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ И СООТВЕТСТВИЯ КОНКРЕТНОЙ ЦЕЛИ,
.\" ОТКАЗЫВАЮТСЯ. В НИКАКОМ СЛУЧАЕ РЕГЕНТЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПОКАЗАТЕЛЬНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ
.\" УЩЕРБЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ЗАМЕЩАЮЩИХ ТОВАРОВ
.\" ИЛИ УСЛУГ; УТРАТОЙ ПРАВА ПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ЛИБО ПРЕРЫВАНИЕМ ДЕЯТЕЛЬНОСТИ)
.\" НЕЗАВИСИМО ОТ ТОГО, НА КАКОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, ДОГОВОРНОЙ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТНОЙ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНОЕ)
.\" ОСНОВЫВАЕТСЯ ЛИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО СООБЩЕНО О
.\" ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.\"     @(#)dd.1	8.2 (Беркли) 1/13/94
.\"
.Dd 4 июня 2020 года
.Dt DD 1
.Os
.Sh НАЗВАНИЕ
.Nm dd
.Nd конвертировать и копировать файл
.Sh СИНТАКСИС
.Nm
.Op Ar operands ...
.Sh ОПИСАНИЕ
Программа
.Nm
копирует стандартный ввод в стандартный вывод.
Данные считываются и записываются блоками по 512 байт.
Если считывание ввода неполное, данные из нескольких считываний объединяются
для формирования выходного блока.
По завершении,
.Nm
выводит количество полных и частичных входных и выходных блоков,
а также усеченные входные записи в стандартный поток ошибок.
.Pp
Доступны следующие операнды:
.Bl -tag -width "of=file"
.It Cm bs Ns = Ns Ar n
Установить размер блока для ввода и вывода в
.Ar n
байтов, заменяя операнды
.Cm ibs
и
.Cm obs.
Если не указаны другие значения преобразования, кроме
.Cm noerror ,
.Cm notrunc
или
.Cm sync ,
то каждый входной блок копируется в выходной как
отдельный блок без агрегации коротких блоков.
.It Cm cbs Ns = Ns Ar n
Установить размер записи преобразования в
.Ar n
байтов.
Размер записи преобразования требуется для преобразований, ориентированных на запись.
.It Cm count Ns = Ns Ar n
Скопировать только
.Ar n
входных блоков.
.It Cm files Ns = Ns Ar n
Скопировать
.Ar n
входных файлов перед завершением.
Этот операнд применим только когда входное устройство — магнитная лента.
.It Cm fillchar Ns = Ns Ar c
При заполнении блока в режиме преобразования или из-за использования
.Cm noerror
и
.Cm sync
заполнить используя указанный
.Tn ASCII
символ, а не пробел или
.Dv NUL .
.It Cm ibs Ns = Ns Ar n
Установить размер входного блока в
.Ar n
байтов вместо стандартных 512.
.It Cm if Ns = Ns Ar file
Читать входные данные из
.Ar file
а не из стандартного ввода.
.It Cm iflag Ns = Ns Ar value Ns Op , Ns Ar value ...
Где
.Cm value
— один из символов из следующего списка.
.Bl -tag -width "fullblock"
.It Cm fullblock
Чтение из входного файла может не дать полный блок.
Когда чтение возвращает неполный блок, продолжать чтение, чтобы заполнить блок.
Без этого флага,
.Cm count
ограничивает количество вызовов
.Xr read 2
на входе, а не количество полностью скопированных блоков.
Может не использоваться совместно с
.Cm conv=sync .
.It Cm direct
Установить флаг O_DIRECT на входном файле, чтобы чтения миновали локальное кэширование.
.El
.It Cm iseek Ns = Ns Ar n
Поиск во входном файле
.Ar n
блоков.
Это то же самое, что и
.Cm skip Ns = Ns Ar n .
.It Cm obs Ns = Ns Ar n
Установить размер выходного блока в
.Ar n
байтов вместо стандартных 512.
.It Cm of Ns = Ns Ar file
Записать вывод в
.Ar file
а не в стандартный вывод.
Любой обычный выходной файл будет усечен, если не указано значение преобразования
.Cm notrunc
Если первоначальная часть выходного файла пропускается (см. операнд
.Cm oseek ),
выходной файл усекается в этой точке.
.It Cm oflag Ns = Ns Ar value Ns Op , Ns Ar value ...
Где
.Cm value
— один из символов из следующего списка.
.Bl -tag -width "direct"
.It Cm fsync
Установить флаг O_FSYNC на выходном файле, чтобы записи были синхронными.
.It Cm sync
Установить флаг O_SYNC на выходном файле, чтобы записи были синхронными.
Это то же самое, что и значение
.Cm fsync
.It Cm direct
Установить флаг O_DIRECT на выходном файле, чтобы записи миновали локальное кэширование.
.El
.It Cm oseek Ns = Ns Ar n
Поиск в выходном файле
.Ar n
блоков.
Это то же самое, что и
.Cm seek Ns = Ns Ar n .
.It Cm seek Ns = Ns Ar n
Искать
.Ar n
блоков с начала выходного файла перед копированием.
На устройствах, не являющихся ленточными, используется операция
.Xr lseek 2
В противном случае существующие блоки читаются, а данные отбрасываются.
Если пользователь не имеет прав на чтение с ленты, позиционирование осуществляется
с использованием функций
.Xr ioctl 2
Если операция поиска выходит за пределы файла, пространство от текущего
конца файла до указанного смещения заполняется блоками
.Dv NUL
байтов.
.It Cm skip Ns = Ns Ar n
Пропустить
.Ar n
блоков с начала входных данных перед копированием.
На входных данных, поддерживающих поиск, используется операция
.Xr lseek 2 .
В противном случае входные данные читаются и отбрасываются.
Для каналов считывается правильное количество байтов.
Для всех остальных устройств считывается правильное количество блоков, без различия между частичным или полным блоком.
.It Cm speed Ns = Ns Ar n
Ограничить скорость копирования до
.Ar n
байт в секунду.
.It Cm status Ns = Ns Ar value
Где
.Cm value
— один из символов из следующего списка.
.Bl -tag -width "progress"
.It Cm noxfer
Не выводить статистику передачи в последней строке статуса.
.It Cm none
Не выводить статус.
Показываются сообщения об ошибках; информационные сообщения не показываются.
.It Cm progress
Выводить основную статистику передачи раз в секунду.
.El
.It Cm conv Ns = Ns Ar value Ns Op , Ns Ar value ...
Где
.Cm value
— один из символов из следующего списка.
.Bl -tag -width "unblock"
.It Cm ascii , oldascii
То же, что и значение
.Cm unblock ,
за исключением того, что символы преобразуются из
.Tn EBCDIC
в
.Tn ASCII
перед преобразованием записей.
(Эти значения подразумевают
.Cm unblock ,
если также указан операнд
.Cm cbs.)
Существует две карты преобразования для
.Tn ASCII .
Значение
.Cm ascii
указывает рекомендуемую карту, совместимую с
.At V .
Значение
.Cm oldascii
указывает карту, использовавшуюся в исторических
.At
и
.No pre- Ns Bx 4.3 reno
системах.
.It Cm block
Обрабатывать входные данные как последовательность переменных по длине записей, завершаемых символом новой строки или концом файла, независимо от границ входных и выходных блоков.
Любой завершающий символ новой строки удаляется.
Каждая входная запись преобразуется в выходную запись фиксированной длины, где
длина указывается операндом
.Cm cbs .
Входные записи, короче размера записи преобразования, дополняются пробелами.
Входные записи, длиннее размера записи преобразования, усекаются.
Количество усеченных входных записей, если таковые имеются, сообщается в стандартный поток ошибок по завершении копирования.
.It Cm ebcdic , ibm , oldebcdic , oldibm
То же, что и значение
.Cm block ,
за исключением того, что символы преобразуются из
.Tn ASCII
в
.Tn EBCDIC
после преобразования записей.
(Эти значения подразумевают
.Cm block ,
если также указан операнд
.Cm cbs .)
Существует четыре карты преобразования для
.Tn EBCDIC .
Значение
.Cm ebcdic
указывает рекомендуемую карту, совместимую с
.At V .
Значение
.Cm ibm
указывает немного отличающуюся карту, совместимую с
.At V
.Cm ibm
значением.
Значения
.Cm oldebcdic
и
.Cm oldibm
являются картами, использовавшимися в исторических
.At
и
.No pre- Ns Bx 4.3 reno
системах.
.It Cm fdatasync
Выполнить операцию
.Xr fdatasync 2
на выходном файле перед его закрытием.
.It Cm fsync
Выполнить операцию
.Xr fsync 2
на выходном файле перед его закрытием.
.It Cm lcase
Преобразовать символы верхнего регистра в символы нижнего регистра.
.It Cm pareven , parnone , parodd , parset
Выводить данные с указанной четностью.
Бит четности на входе удаляется, если не указано также преобразование
.Tn EBCDIC
в
.Tn ASCII .
.It Cm noerror
Не прекращать обработку при ошибке ввода.
При возникновении ошибки ввода диагностическое сообщение вместе с текущими счетчиками ввода и вывода будет записано в стандартный поток ошибок в том же формате, что и стандартное сообщение о завершении.
Если также указано преобразование
.Cm sync ,
любые недостающие входные данные заменяются
.Dv NUL
байтами (или пробелами, если указано преобразование, ориентированное на блок) и обрабатываются как обычный входной буфер.
Если указана опция
.Cm fillchar ,
указанный символ заполнения в командной строке переопределяет автоматический выбор символа заполнения.
Если преобразование
.Cm sync
не указано, входной блок опускается из вывода.
На входных файлах, не являющихся лентами или каналами, смещение файла будет позиционировано после блока, в котором произошла ошибка, с использованием операции
.Xr lseek 2 .
.It Cm notrunc
Не усекать выходной файл.
Это сохраняет любые блоки в выходном файле, не явно записанные
.Nm .
Значение
.Cm notrunc
не поддерживается для лент.
.It Cm osync
Заполнить последний выходной блок до полного размера выходного блока.
Если входной файл не кратен размеру выходного блока
после преобразования, это преобразование заставляет последний выходной блок быть такого же размера, как предыдущие блоки для использования на устройствах, требующих регулярно размерные блоки для записи.
Эта опция несовместима с использованием
.Cm bs Ns = Ns Ar n
спецификации размера блока.
.It Cm sparse
Если один или несколько выходных блоков состояли бы исключительно из
.Dv NUL Ns s ,
попытаться переместить выходной файл на необходимое пространство вместо заполнения их
.Dv NUL Ns s ,
что приведет к созданию разреженного файла.
.It Cm swab
Поменять местами каждую пару входных байтов.
Если входной буфер содержит нечетное количество байтов, последний байт будет
игнорироваться при обмене.
.It Cm sync
Заполнить каждый входной блок до размера входного буфера.
В качестве байтов заполнения используются пробелы, если указано значение преобразования, ориентированное на блок, в противном случае используются
.Dv NUL
байты.
.It Cm ucase
Преобразовать символы нижнего регистра в символы верхнего регистра.
.It Cm unblock
Обрабатывать входные данные как последовательность записей фиксированной длины, независимо от границ входных и выходных блоков.
Длина входных записей указывается операндом
.Cm cbs .
Любые завершающие пробелы удаляются, и добавляется символ новой строки.
.El
.El
.Pp
Где размеры или скорость указаны, ожидается десятичное, восьмеричное или шестнадцатеричное число байтов.
Если число заканчивается на
.Dq Li b ,
.Dq Li k ,
.Dq Li m ,
.Dq Li g ,
.Dq Li t ,
.Dq Li p ,
или
.Dq Li w ,
число умножается соответственно на 512, 1024 (1Кб), 1048576 (1Мб), 1073741824 (1Гб),
1099511627776 (1Тб), 1125899906842624 (1Пб)
или число байтов в целом, соответственно.
Два или более числа могут быть разделены
.Dq Li x
для указания произведения.
.Pp
По завершении,
.Nm
выводит количество полных и частичных входных и выходных блоков,
усеченных входных записей и блоков нечетной длины при обмене байтами в
стандартный поток ошибок.
Частичный входной блок — это тот, в котором считано меньше, чем размер входного блока.
Частичный выходной блок — это тот, в котором записано меньше, чем размер выходного блока.
Частичные выходные блоки на ленточных устройствах считаются фатальными ошибками.
В противном случае остаток блока будет записан.
Частичные выходные блоки на символьных устройствах вызовут предупреждающее сообщение.
Усеченный входной блок — это тот, в котором ориентированное на запись преобразование значения указывало на входную строку, слишком длинную, чтобы поместиться в запись преобразования, или не завершенную символом новой строки.
.Pp
Обычно данные, полученные в результате ввода или преобразования, или обоих, агрегируются
в выходные блоки указанного размера.
После достижения конца ввода любой оставшийся вывод записывается как блок.
Это означает, что последний выходной блок может быть короче, чем размер выходного блока.
.Pp
Если
.Nm
получает сигнал
.Dv SIGINFO
(см. аргумент
.Cm status
для
.Xr stty 1) ,
текущие счетчики входных и выходных блоков будут записаны в стандартный поток ошибок
в том же формате, что и стандартное сообщение о завершении.
Если
.Nm
получает сигнал
.Dv SIGINT ,
текущие счетчики входных и выходных блоков будут записаны в стандартный поток ошибок
в том же формате, что и стандартное сообщение о завершении, и
.Nm
завершит работу.
.Sh КОД ЗАВЕРШЕНИЯ
.Pp
Приложение завершается с кодом 0 в случае успеха, и с кодом >0, если произошла ошибка.
.Sh ПРИМЕРЫ
Проверьте, что на жестком диске нет битых блоков:
.Pp
.Dl "dd if=/dev/ada0 of=/dev/null bs=1m"
.Pp
Обновите жесткий диск, чтобы предотвратить переход в настоящее время восстанавливаемых ошибок чтения в невосстанавливаемые:
.Pp
.Dl "dd if=/dev/ada0 of=/dev/ada0 bs=1m"
.Pp
Удалите бит четности из файла:
.Pp
.Dl "dd if=file conv=parnone of=file.txt"
.Pp
Проверьте на наличие (четных) ошибок четности в файле:
.Pp
.Dl "dd if=file conv=pareven | cmp -x - file"
.Pp
Чтобы создать образ CD-ROM в Mode-1, который является обычно используемым форматом
для дисков CD-ROM с данными, используйте размер блока 2048 байт:
.Pp
.Dl "dd if=/dev/cd0 of=filename.iso bs=2048"
.Pp
Запишите образ файловой системы на флешку, дополняя конец нулями,
при необходимости, до границы в 1 Мб:
.Pp
.Dl "dd if=memstick.img of=/dev/da0 bs=1m conv=noerror,sync"
.Sh СМОТРИ ТАКЖЕ
.Xr cp 1 ,
.Xr mt 1 ,
.Xr recoverdisk 1 ,
.Xr tr 1 ,
.Xr geom 4 ,
.Xr trim 8
.Sh СТАНДАРТЫ
Предполагается, что утилита
.Nm
есть надмножество стандарта
.St -p1003.2 .
Операнды
.Cm files
и
.Cm status
и значения
.Cm ascii ,
.Cm ebcdic ,
.Cm ibm ,
.Cm oldascii ,
.Cm oldebcdic
и
.Cm oldibm
являются расширениями стандарта
.Tn POSIX .
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v5 .
.Sh ОШИБКИ
Механизмы защиты в подсистеме
.Xr geom 4
могут помешать суперпользователю записывать блоки на диск.
Инструкции по временному отключению этих механизмов защиты можно найти на странице руководства
.Xr geom 4 .
