melkorbsd/ru-freebsd-man/man1/domainname.1
.\"-
.\"  Авторское право (c) 1983, 1988, 1990, 1993
.\" Ректоры Калифорнийского университета. Все права защищены.
.\"
.\" Разрешение на распространение и использование в исходной и бинарной формах,
.\" с изменениями или без них, разрешается при условии соблюдения следующих условий:
.\" 1. Распространение исходного кода должно сохранять приведенное выше уведомление о копирайте,
.\"    этот список условий и следующий отказ от ответственности.
.\" 2. Распространение в бинарной форме должно воспроизводить приведенное выше уведомление о копирайте,
.\"    этот список условий и следующий отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых вместе с распространением.
.\" 3. Ни название университета, ни имена его участников
.\"    не могут использоваться для продвижения производных продуктов
.\"    без явного предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО РЕГЕНТАМИ И УЧАСТНИКАМИ «КАК ЕСТЬ», И
.\" ЛЮБЫЕ ПРЯМЫЕ ИЛИ КОСВЕННЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ,
.\" ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ И СООТВЕТСТВИЯ КОНКРЕТНОЙ ЦЕЛИ,
.\" ОТКАЗЫВАЮТСЯ. В НИКАКОМ СЛУЧАЕ РЕГЕНТЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПОКАЗАТЕЛЬНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ
.\" УЩЕРБЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ЗАМЕЩАЮЩИХ ТОВАРОВ
.\" ИЛИ УСЛУГ; УТРАТОЙ ПРАВА ПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ЛИБО ПРЕРЫВАНИЕМ ДЕЯТЕЛЬНОСТИ)
.\" НЕЗАВИСИМО ОТ ТОГО, НА КАКОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, ДОГОВОРНОЙ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТНОЙ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНОЕ)
.\" ОСНОВЫВАЕТСЯ ЛИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО СООБЩЕНО О
.\" ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.\"	От: @(#)hostname.1	8.1 (Беркли) 5/31/93
.\"
.Dd 22 апреля 2013 года
.Dt DOMAINNAME 1
.Os
.Sh НАЗВАНИЕ
.Nm domainname
.Nd установить или напечатать имя текущего YP/NIS домена
.Sh СИНТАКСИС
.Nm
.Op Ar ypdomain
.Sh ОПИСАНИЕ
Утилита
.Nm
выводит имя текущего YP/NIS домена.
Суперпользователь может
установить имя домена, указав аргумент; это обычно делается с помощью переменной
.Va nisdomainname
в файле
.Pa /etc/rc.conf ,
обычно выполняемом при загрузке системы.
.Sh ЗАМЕТКИ
Имя домена YP/NIS (ранее называвшееся "Желтые страницы", но переименованное по юридическим причинам)
не обязательно связано с именем домена системы доменных имен, хотя они часто устанавливаются равными для административного удобства.
.Sh СМ. ТАКЖЕ
.Xr getdomainname 3 ,
.Xr rc.conf 5
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.Fx 1.1 ,
на основе аналогичной команды в
.Tn SunOS .