melkorbsd/ru-freebsd-man/man1/ssh.1
.\"
.\" Author: Tatu Ylonen <ylo@cs.hut.fi>
.\" Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi>, Espoo, Finland
.\"                    All rights reserved
.\"
.\" As far as I am concerned, the code I have written for this software
.\" can be used freely for any purpose.  Any derived versions of this
.\" software must be clearly marked as such, and if the derived work is
.\" incompatible with the protocol description in the RFC file, it must be
.\" called by a name other than "ssh" or "Secure Shell".
.\"
.\" Copyright (c) 1999,2000 Markus Friedl.  All rights reserved.
.\" Copyright (c) 1999 Aaron Campbell.  All rights reserved.
.\" Copyright (c) 1999 Theo de Raadt.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $OpenBSD: ssh.1,v 1.437 2023/07/23 20:04:45 naddy Exp $
.Dd $Mdocdate: July 23 2023 $
.Dt SSH 1
.Os
.Sh ИМЯ
.Nm ssh
.Nd клиент удаленного входа OpenSSH
.Sh СИНТАКСИС
.Nm ssh
.Op Fl 46AaCfGgKkMNnqsTtVvXxYy
.Op Fl B Ar bind_interface
.Op Fl b Ar bind_address
.Op Fl c Ar cipher_spec
.Op Fl D Oo Ar bind_address : Oc Ns Ar port
.Op Fl E Ar log_file
.Op Fl e Ar escape_char
.Op Fl F Ar configfile
.Op Fl I Ar pkcs11
.Op Fl i Ar identity_file
.Op Fl J Ar destination
.Op Fl L Ar address
.Op Fl l Ar login_name
.Op Fl m Ar mac_spec
.Op Fl O Ar ctl_cmd
.Op Fl o Ar option
.Op Fl P Ar tag
.Op Fl p Ar port
.Op Fl Q Ar query_option
.Op Fl R Ar address
.Op Fl S Ar ctl_path
.Op Fl W Ar host : Ns Ar port
.Op Fl w Ar local_tun Ns Op : Ns Ar remote_tun
.Ar destination
.Op Ar command Op Ar argument ...
.Sh ОПИСАНИЕ
.Nm
(SSH клиент) это программа для входа на удаленную машину и 
выполнения команд на удаленной машине.
Она предназначена для обеспечения безопасной шифрованной связи между 
двумя ненадежными хостами через небезопасную сеть.
X11 подключения, произвольные TCP-порты и 
.Ux Ns -domain
сокеты домена Unix также могут быть перенаправлены через безопасный канал.
.Pp
.Nm
подключается и входит на указанный
.Ar destination ,
который может быть указан как
.Sm off
.Oo пользователь @ Oc hostname
.Sm on
или URI в виде
.Sm off
.No ssh:// Oo пользователь @ Oc hostname Op : port .
.Sm on
Пользователь должен доказать
свою личность на удаленной машине, используя один из нескольких методов 
(см. ниже).
.Pp
Если
.Ar command
указана,
она будет выполнена на удаленном хосте вместо входа в оболочку.
Полная командная строка может быть указана как
.Ar command ,
или она может иметь дополнительные аргументы.
Если указаны аргументы, они будут добавлены к команде, разделенные
пробелами, перед отправкой на сервер для выполнения.
.Pp
Допустимы следующие параметры:
.Pp
.Bl -tag -width Ds -compact
.It Fl 4
Принудительное
.Nm
использование только IPv4-адресов.
.Pp
.It Fl 6
Принудительное
.Nm
использование только IPv6-адресов.
.Pp
.It Fl A
Включает перенаправление соединений от agent аутентификации, такого как
.Xr ssh-agent 1 .
Это также можно указать для каждого хоста в файле конфигурации.
.Pp
Перенаправление agent следует включать осторожно.
Пользователи с возможностью обойти права доступа к файлам на удаленном хосте
(для агента
.Ux Ns -domain
сокета) могут получить доступ к локальному agent через перенаправленное соединение.
Атакующий не может получить материал ключей из agent,
однако он может выполнять операции с ключами, позволяющие ему аутентифицироваться с использованием идентификаторов, загруженных в agent.
Более безопасной альтернативой может быть использование прыжкового хоста
(см.
.Fl J ) .
.Pp
.It Fl a
Отключает перенаправление соединения agent аутентификации.
.Pp
.It Fl B Ar bind_interface
Привязывает к адресу интерфейса
.Ar bind_interface
перед попыткой подключения к хосту назначения.
Это полезно только на системах с более чем одним адресом.
.Pp
.It Fl b Ar bind_address
Использует
.Ar bind_address
на локальной машине в качестве исходного адреса 
соединения.
Полезно только на системах с более чем одним адресом.
.Pp
.It Fl C
Запрашивает сжатие всех данных (включая stdin, stdout, stderr, и
данные для перенаправленных X11, TCP и
.Ux Ns -domain
соединений).
Алгоритм сжатия такой же, как используется в
.Xr gzip 1 .
Сжатие желательно на модемных линиях и других 
медленных соединениях, но оно только замедлит работу на быстрых сетях.
Значение по умолчанию можно установить для каждого хоста в
файлах конфигурации; см.
.Cm Compression
параметр в
.Xr ssh_config 5 .
.Pp
.It Fl c Ar cipher_spec
Выбор спецификации шифрования для шифрования сессии.
.Ar cipher_spec
это список шифров, разделенных запятыми,
перечисленных в порядке предпочтения.
См
.Cm Ciphers
ключевое слово в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl D Xo
.Sm off
.Oo Ar bind_address : Oc
.Ar port
.Sm on
.Xc
Указывает локальный
.Dq dynamic
порт прикладного уровня для перенаправления.
Это работает путем выделения сокета для прослушивани
.Ar port
с локальной стороны, опционально привязанного к указанному 
.Ar bind_address .
Когда соединение устанавливается с этим портом, 
соединение перенаправляется через безопасный канал, а затем применяется 
протокол приложения для определения, куда подключаться с 
удаленной машины.
В настоящее время SOCKS4 и SOCKS5 протоколы поддерживаются,и
.Nm
будет действовать как SOCKS сервер.
Только root может перенаправлять привилегированные порты.
Динамические переадресации портов также могут быть указаны в файле конфигурации.
.Pp
IPv6 адреса могут быть указаны, заключив адрес в квадратные скобки.
Только суперпользователь может перенаправлять привилегированные порты.
По умолчанию локальный порт привязывается в соответствии с
.Cm GatewayPorts
настройкой.
Однако явно укзанный
.Ar bind_address
может быть использован для привязки соединения к определенному адресу.
The
.Ar bind_address
со
.Dq localhost
значением указывает, что прослушивающий порт привязан только для локального использования, в то время как 
пустой адрес или
.Sq *
указывает, что порт должен быть доступен со всех интерфейсов.
.Pp
.It Fl E Ar log_file
Добавляет отладочные журналы в
.Ar log_file
вместо стандартного вывода ошибок.
.Pp
.It Fl e Ar escape_char
Устанавливает символ экранирования для сеансов с pty (по умолчанию:
.Ql ~ ) .
Символ экранирования распознается только в начале строки.
Символ экранирования, за которым следует точка
.Pq Ql \&.
закрывает соединение;
за которым следует control-Z приостанавливает соединение;
и за которым следует сам символ экранирования отправляет его один раз.
Установка символа в
.Dq none
отключает любые экранирования и делает сеанс полностью прозрачным.
.Pp
.It Fl F Ar configfile
Указывает альтернативный файл конфигурации для каждого пользователя.
Если файл конфигурации указан в командной строке,
общесистемный файл конфигурации
.Pq Pa /etc/ssh/ssh_config
будет проигнорирован.
По умолчанию для файла конфигурации каждого пользователя используется
.Pa ~/.ssh/config .
Если установлено
.Dq none ,
файлы конфигурации не будут читаться.
.Pp
.It Fl f
Запрашивает у
.Nm
перейти в фоновый режим непосредственно перед выполнением команды.
Это полезно, если
.Nm
должен запросить пароли или фразы-пароли, но пользователь
хочет, чтобы это произошло в фоновом режиме.
Это подразумевает использование
.Fl n .
Рекомендуемый способ запуска программ X11 на удаленном сайте - это 
что-то вроде
.Ic ssh -f host xterm .
.Pp
Если
.Cm ExitOnForwardFailure
конфигурация установлена в
.Dq yes ,
то клиент, запущенный с
.Fl f
будет ждать успешного установления всех удаленных перенаправлений портов 
перед тем, как перейти в фоновый режим.
См. описание 
.Cm ForkAfterAuthentication
в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl G
Заставляет
.Nm
вывести свою конфигурацию после оценки 
.Cm Host
и
.Cm Match
блоков и выйти.
.Pp
.It Fl g
Позволяет удаленным хостам подключаться к локальным перенаправленным портам.
Если используется на мультиплексированном соединении, то эта опция должна быть указана на 
основном процессе.
.Pp
.It Fl I Ar pkcs11
Указывает PKCS#11 общую библиотеку
.Nm
должен использовать для общения с токеном PKCS#11, предоставляющим ключи для 
аутентификации пользователя.
.Pp
.It Fl i Ar identity_file
Выбирает файл, из которого считывается идентификатор (личный ключ) для 
аутентификации по открытому ключу.
Вы также можете указать файл открытого ключа для использования соответствующего 
личного ключа, загруженного в 
.Xr ssh-agent 1
если файл личного ключа отсутствует локально.
По умолчанию используются
.Pa ~/.ssh/id_rsa ,
.Pa ~/.ssh/id_ecdsa ,
.Pa ~/.ssh/id_ecdsa_sk ,
.Pa ~/.ssh/id_ed25519 ,
.Pa ~/.ssh/id_ed25519_sk
и
.Pa ~/.ssh/id_dsa .
Файлы идентификаторов также могут быть указаны на 
основе хоста в файле конфигурации.
Можно указать несколько
.Fl i
опций (и несколько идентификаторов, указанных в файлах 
конфигурации).
Если сертификаты не были явно указаны
.Cm CertificateFile
дерективой,
.Nm
также попытается загрузить информацию о сертификате из файла, полученного
путем добавления 
.Pa -cert.pub
к именам файлов
.Pp
.It Fl J Ar destination
Подключение к целевому хосту, сначала устанавливая
.Nm
соединение с промежуточным хостом, описанным в
.Ar destination
а затем установление TCP-переадресации к конечному пункту назначения
оттуда.
Можно указать несколько промежуточных хостов, разделяя их запятыми.
Это является сокращением для указания
.Cm ProxyJump
директивы конфигурации.
Обратите внимание, что директивы конфигурации, указанные в командной строке, обычно 
применяются к целевому хосту, а не к указанным промежуточным хостам.
Используйте
.Pa ~/.ssh/config
Для указания конфигурации для промежуточных хостов 
.Pp
.It Fl K
Включает аутентификацию на основе GSSAPI и передачу (делегирование)
учетных данных GSSAPI на сервер
.Pp
.It Fl k
Отключает передачу (делегирование) учетных данных GSSAPI на сервер.
.Pp
.It Fl L Xo
.Sm off
.Oo Ar bind_address : Oc
.Ar port : host : hostport
.Sm on
.Xc
.It Fl L Xo
.Sm off
.Oo Ar bind_address : Oc
.Ar port : remote_socket
.Sm on
.Xc
.It Fl L Xo
.Sm off
.Ar local_socket : host : hostport
.Sm on
.Xc
.It Fl L Xo
.Sm off
.Ar local_socket : remote_socket
.Sm on
.Xc
Указывает, что соединения с заданным TCP-портом или Unix-сокетом на локальном
(клиентском) хосте должны быть перенаправлены на указанный хост и порт или Unix-сокет
на удаленной стороне.
Это работает путем выделения сокета для прослушивания TCP
.Ar port
на локальной стороне, опционально привязанного к указанному
.Ar bind_address ,
или к Unix-socket.
Когда устанавливается соединение с локальным портом или сокетом, 
соединение перенаправляется через безопасный канал, и устанавливается 
соединение с
.Ar host
портом
.Ar hostport ,
или с Unix-socket
.Ar remote_socket ,
с удаленной машины.
.Pp
Переадресации портов также могут быть указаны в файле конфигурации.
Только суперпользователь может перенаправлять привилегированные порты.
IPv6-адреса могут быть указаны, заключив адрес в квадратные скобки.
.Pp
По умолчанию локальный порт привязывается в соответствии с
.Cm GatewayPorts
настройкой.
Однако явно указанный
.Ar bind_address
может быть использован для привязки соединения к определенному адресу.
The
.Ar bind_address
со значением
.Dq localhost
указывает, что прослушивающий порт привязан только для локального использования, в то время как
пустой адрес или
.Sq *
указывает, что порт должен быть доступен со всех интерфейсов.
.Pp
.It Fl l Ar login_name
Указывает пользователя для входа на удаленной машине.
Это также может быть указано на основе хоста в файле конфигурации.
.Pp
.It Fl M
Помещает
.Nm
клиент в
.Dq master
режим для общего использования соединения.
Несколько
.Fl M
параметров помещают
.Nm
в
.Dq master
режим но требуется подтверждение с помощью 
.Xr ssh-askpass 1
перед каждой операцией, изменяющей состояние мультиплексирования 
(например, открытие новой сессии).
См. описание 
.Cm ControlMaster
в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl m Ar mac_spec
Список алгоритмов MAC (код аутентификации сообщений), разделенных запятыми, 
указанных в порядке предпочтения.
См.
.Cm MACs
ключевое слово в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl N
Не выполнять удаленную команду.
Это полезно только для перенаправления портов.
См. описание 
.Cm SessionType
в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl n
Перенаправляет stdin из 
.Pa /dev/null
(фактически, предотвращает чтение из stdin).
Это должно использоваться при 
.Nm
запуске в фоновом режиме.
Частый трюк - использовать это для запуска программ X11 на удаленной машине.
Например,
.Ic ssh -n shadows.cs.hut.fi emacs &
запустит emacs на shadows.cs.hut.fi, и соединение X11 будет 
автоматически перенаправлено через зашифрованный канал.
Программа 
.Nm
будет запущена в фоновом режиме.
(Это не работает, если 
.Nm
должен запросить пароль или фразу-пароль; также см. 
.Fl f
параметр.)
См. описание 
.Cm StdinNull
в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl O Ar ctl_cmd
Управляет активным процессом мастер-мультиплексирования соединений.
Когда
.Fl O
указан параметр,
.Ar ctl_cmd
аргумент интерпретируется и передается процессу-мастеру.
Допустимые команды:
.Dq check
(проверить, что процесс-мастер работает),
.Dq forward
(запросить перенаправление без выполнения команды),
.Dq cancel
(отменить перенаправления),
.Dq exit
(запросить завершение работы мастера) и
.Dq stop
(запросить мастера прекратить принимать дальнейшие запросы на мультиплексирование).
.Pp
.It Fl o Ar option
Может использоваться для указания параметров в формате, используемом в файле конфигурации.
Это полезно для указания параметров, для которых нет отдельного флага 
командной строки.
Для полной информации о перечисленных ниже параметрах и их возможных значениях смотрите
.Xr ssh_config 5 .
.Pp
.Bl -tag -width Ds -offset indent -compact
.It AddKeysToAgent
.It AddressFamily
.It BatchMode
.It BindAddress
.It CanonicalDomains
.It CanonicalizeFallbackLocal
.It CanonicalizeHostname
.It CanonicalizeMaxDots
.It CanonicalizePermittedCNAMEs
.It CASignatureAlgorithms
.It CertificateFile
.It CheckHostIP
.It Ciphers
.It ClearAllForwardings
.It Compression
.It ConnectionAttempts
.It ConnectTimeout
.It ControlMaster
.It ControlPath
.It ControlPersist
.It DynamicForward
.It EnableEscapeCommandline
.It EscapeChar
.It ExitOnForwardFailure
.It FingerprintHash
.It ForkAfterAuthentication
.It ForwardAgent
.It ForwardX11
.It ForwardX11Timeout
.It ForwardX11Trusted
.It GatewayPorts
.It GlobalKnownHostsFile
.It GSSAPIAuthentication
.It GSSAPIDelegateCredentials
.It HashKnownHosts
.It Host
.It HostbasedAcceptedAlgorithms
.It HostbasedAuthentication
.It HostKeyAlgorithms
.It HostKeyAlias
.It Hostname
.It IdentitiesOnly
.It IdentityAgent
.It IdentityFile
.It IPQoS
.It KbdInteractiveAuthentication
.It KbdInteractiveDevices
.It KexAlgorithms
.It KnownHostsCommand
.It LocalCommand
.It LocalForward
.It LogLevel
.It MACs
.It Match
.It NoHostAuthenticationForLocalhost
.It NumberOfPasswordPrompts
.It PasswordAuthentication
.It PermitLocalCommand
.It PermitRemoteOpen
.It PKCS11Provider
.It Port
.It PreferredAuthentications
.It ProxyCommand
.It ProxyJump
.It ProxyUseFdpass
.It PubkeyAcceptedAlgorithms
.It PubkeyAuthentication
.It RekeyLimit
.It RemoteCommand
.It RemoteForward
.It RequestTTY
.It RequiredRSASize
.It SendEnv
.It ServerAliveInterval
.It ServerAliveCountMax
.It SessionType
.It SetEnv
.It StdinNull
.It StreamLocalBindMask
.It StreamLocalBindUnlink
.It StrictHostKeyChecking
.It TCPKeepAlive
.It Tunnel
.It TunnelDevice
.It UpdateHostKeys
.It User
.It UserKnownHostsFile
.It VerifyHostKeyDNS
.It VisualHostKey
.It XAuthLocation
.El
.Pp
.It Fl P Ar tag
Укажите имя тега, которое может использоваться для выбора конфигурации в
.Xr ssh_config 5 .
Смотрите
.Cm Tag
и
.Cm Match
ключевые слова в
.Xr ssh_config 5
для получения дополнительной информации.
.It Fl p Ar port
Порт для подключения к удаленному хосту.
Это можно указать на основе
каждого хоста в файле конфигурации.
.Pp
.It Fl Q Ar query_option
Запросы для поддерживаемых алгоритмов одной из следующих функций:
.Ar cipher
(поддерживаемые симметричные шифры),
.Ar cipher-auth
(поддерживаемые симметричные шифры, поддерживающие аутентификацию),
.Ar help
(поддерживаемые термины запросов для использования с
.Fl Q
флагом),
.Ar mac
(поддерживаемые коды целостности сообщений),
.Ar kex
(алгоритмы обмена ключами),
.Ar key
(типы ключей),
.Ar key-ca-sign
(действительные алгоритмы подписи CA для сертификатов),
.Ar key-cert
(типы ключей сертификатов),
.Ar key-plain
(не сертифицированные типы ключей),
.Ar key-sig
(все типы ключей и алгоритмы подписи),
.Ar protocol-version
(поддерживаемые версии протокола SSH) и
.Ar sig
(поддерживаемые алгоритмы подписи).
В качестве альтернативы любое ключевое слово из
.Xr ssh_config 5
или
.Xr sshd_config 5
которое принимает список алгоритмов, в качестве псевдонима для соответствующей
query_option.
.Pp
.It Fl q
Тихий режим.
Причиной большинства предупреждений и диагностических сообщений будет подавляться.
.Pp
.It Fl R Xo
.Sm off
.Oo Ar bind_address : Oc
.Ar port : host : hostport
.Sm on
.Xc
.It Fl R Xo
.Sm off
.Oo Ar bind_address : Oc
.Ar port : local_socket
.Sm on
.Xc
.It Fl R Xo
.Sm off
.Ar remote_socket : host : hostport
.Sm on
.Xc
.It Fl R Xo
.Sm off
.Ar remote_socket : local_socket
.Sm on
.Xc
.It Fl R Xo
.Sm off
.Oo Ar bind_address : Oc
.Ar port
.Sm on
.Xc
Указывает, что соединения с заданным TCP портом или Unix сокетом на удаленном
(серверном) хосте должны быть перенаправлены на локальную сторону.
.Pp
Это работает путем выделения сокета для прослушивания либо TCP, 
.Ar port
либо к Unix сокету на удаленной стороне.
Когда устанавливается соединение с этим портом или Unix сокетом, 
соединение перенаправляется через защищенный канал, и устанавливается соединение
с локальной машиной либо с явно указанным назначением, заданным параметрами
.Ar host
порта
.Ar hostport ,
или
.Ar local_socket ,
или, если явное назначение не было указано,
.Nm
будет действовать как прокси SOCKS 4/5 и перенаправлять соединения к назначениям, запрошенным
удаленным клиентом SOCKS.
.Pp
Перенаправления портов также могут быть указаны в файле конфигурации.
Привилегированные порты могут быть перенаправлены только 
при входе в систему под root на удаленной машине.
IPv6-адреса могут быть указаны, заключив адрес в квадратные скобки.
.Pp
По умолчанию TCP-слушающие сокеты на сервере будут привязаны только к 
интерфейсу обратной связи.
Это может быть изменено путем указания
.Ar bind_address .
Пустое значение
.Ar bind_address ,
или адрес
.Ql * ,
указывает, что удаленный сокет должен прослушивать все интерфейсы.
Указание удаленного
.Ar bind_address
будет успешным только в том случае, если сервера
.Cm GatewayPorts
параметр включен (см.
.Xr sshd_config 5 ) .
.Pp
Если
.Ar port
аргумент это
.Ql 0 ,
прослушиваемый порт будет динамически выделен на сервере и сообщен 
клиенту во время выполнения.
При использовании вместе с
.Ic -O forward ,
выделенный порт будет напечатан на стандартный вывод.
.Pp
.It Fl S Ar ctl_path
Указывает расположение контрольного сокета для совместного использования соединения 
или строку
.Dq none
для отключения совместного использования соединения.
Смотрите описание
.Cm ControlPath
и
.Cm ControlMaster
в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl s
Может использоваться для запроса вызова подсистемы на удаленной системе.
Подсистемы облегчают использование SSH
в качестве безопасного транспорта для других приложений (например,\&
.Xr sftp 1 ) .
Подсистема указывается как удаленная команда.
Смотрите описание 
.Cm SessionType
в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl T
Отключить выделение псевдо-терминала.
.Pp
.It Fl t
Принудительное выделение псевдо-терминала.
Это может использоваться для выполнения произвольных программ на
основе экрана на удаленной машине, что может быть очень полезно, 
например, при реализации меню-сервисов.
Несколько
.Fl t
параметров принудительно выделяют tty, даже если у
.Nm
нет локального tty.
.Pp
.It Fl V
Отобразить номер версии и выйти.
.Pp
.It Fl v
Режим подробного вывода.
Позволяет
.Nm
печатать отладочные сообщения о своем выполнении.
Это полезно при
отладке проблем соединения, аутентификации и конфигурации.
Несколько
.Fl v
параметров увеличивают уровень подробности.
Максимум-3.
.Pp
.It Fl W Ar host : Ns Ar port
Запрашивает перенаправление стандартного ввода и вывода клиента на
.Ar host
на
.Ar port
через защищенный канал.
Подразумевает
.Fl N ,
.Fl T ,
.Cm ExitOnForwardFailure
и
.Cm ClearAllForwardings ,
хотя их можно переопределить в файле конфигурации или с помощью 
.Fl o
параметров команды
.Pp
.It Fl w Xo
.Ar local_tun Ns Op : Ns Ar remote_tun
.Xc
Запрашивает
перенаправление тунельного
устройства с указанными
.Xr tun 4
устройствами между клиентом
.Pq Ar local_tun
и сервером
.Pq Ar remote_tun .
.Pp
Устройства могут быть указаны числовым идентификатором или ключевым словом
.Dq any ,
которое использует следующее доступное туннельное устройство.
Если
.Ar remote_tun
не указано, по умолчанию используется
.Dq any .
Смотрите также
.Cm Tunnel
и
.Cm TunnelDevice
директивы в
.Xr ssh_config 5 .
.Pp
Если
.Cm Tunnel
директива не установлена, она будет установлена в режим туннеля по умолчанию, который является 
.Dq point-to-point .
Если требуется другой
.Cm Tunnel
режим перенаправления туннеля, он должен быть указан до 
.Fl w .
.Pp
.It Fl X
Включает перенаправление X11.
Это также может быть указано на основе каждого хоста в файле конфигурации.
.Pp
Перенаправление X11 следует активировать осторожно.
Пользователи с возможностью обойти права доступа к файлам на удаленном хосте
(для базы данных авторизации X пользователя)
могут получить доступ к локальному дисплею X11 через перенаправленное соединение.
Злоумышленник может затем выполнять действия, такие как мониторинг нажатий клавиш.
.Pp
По этой причине перенаправление X11 подвергается ограничениям 
расширения X11 SECURITY по умолчанию.
См.
.Nm
.Fl Y
параметр и
.Cm ForwardX11Trusted
директиву в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
.It Fl x
Отключает перенаправление X11.
.Pp
.It Fl Y
Включает доверенное перенаправление X11.
Доверенные перенаправления X11 не подвергаются 
контролю расширения X11 SECURITY.
.Pp
.It Fl y
Отправляет информацию журнала с использованием
.Xr syslog 3
модуля системы.
По умолчанию эта информация отправляется в stderr.
.El
.Pp
.Nm
может дополнительно получать данные конфигурации из
файла конфигурации для каждого пользователя и файла конфигурации системы.
Формат файла и параметры конфигурации описаны в
.Xr ssh_config 5 .
.Sh АУТЕНТИФИКАЦИЯ
Клиент SSH OpenSSH поддерживает протокол SSH 2.
.Pp
Доступные методы аутентификации:
аутентификация на основе GSSAPI,
аутентификация на основе хоста,
аутентификация с использованием открытого ключа,
интерактивная аутентификация по паролю,
и аутентификация по паролю.
Методы аутентификации пробуются в указанном выше порядке,
хотя
.Cm PreferredAuthentications
может использоваться для изменения порядка по умолчанию.
.Pp
Аутентификация на основе хоста работает следующим образом:
Если машина, с которой пользователь входит в систему, указана в
.Pa /etc/hosts.equiv
или
.Pa /etc/shosts.equiv
на удаленной машине, пользователь не является root и имена пользователей
совпадают на обеих сторонах, или если файлы
.Pa ~/.rhosts
или
.Pa ~/.shosts
существуют в домашнем каталоге пользователя на
удаленной машине и содержат строку с именем клиентской
машины и именем пользователя на этой машине, пользователь рассматривается
для входа в систему.
Кроме того, сервер
.Em должен
быть способен проверить 
хост-ключ клиента (см. описание
.Pa /etc/ssh/ssh_known_hosts
и
.Pa ~/.ssh/known_hosts ,
ниже)
для разрешения входа.
Этот метод аутентификации закрывает уязвимости из-за IP-подделки,
DNS-подделки и маршрутизации подделки.
[Примечание для администратора:
.Pa /etc/hosts.equiv ,
.Pa ~/.rhosts ,
и протокол rlogin/rsh в целом, по своей природе небезопасны и должны быть
отключены, если требуется безопасность.]
.Pp
Аутентификация с использованием открытого ключа работает следующим образом:
Схема основана на криптографии с открытым ключом,
используя криптосистемы,
где шифрование и дешифрование выполняются с использованием разных ключей,
и невозможно вывести ключ дешифрования из ключа шифрования.
Идея заключается в том, что каждый пользователь создает публичный/частный
ключевую пару для целей аутентификации.
Сервер знает открытый ключ, и только пользователь знает частный ключ.
.Nm
автоматически реализует протокол аутентификации с открытым ключом,
используя один из алгоритмов DSA, ECDSA, Ed25519 или RSA.
Раздел ИСТОРИЯ в
.Xr ssl 8
содержит краткое обсуждение алгоритмов DSA и RSA.
.Pp
Файл
.Pa ~/.ssh/authorized_keys
содержит список публичных ключей, разрешенных для входа в систему.
Когда пользователь входит в систему,
.Nm
программа сообщает серверу, какую пару ключей он хотел бы использовать для
аутентификации.
Клиент доказывает, что у него есть доступ к частному ключу,
и сервер проверяет, что соответствующий открытый ключ
авторизован для принятия учетной записи.
.Pp
Сервер может сообщить клиенту об ошибках, которые препятствовали успешной аутентификации 
с открытым ключом после завершения аутентификации с использованием 
другого метода.
Их можно просмотреть, увеличив уровень журналирования 
.Cm LogLevel
до
.Cm DEBUG
или выше (например, используя 
.Fl v
флаг).
.Pp
Пользователь создает свою пару ключей, запустив
.Xr ssh-keygen 1 .
Это сохраняет частный ключ в
.Pa ~/.ssh/id_dsa
(DSA),
.Pa ~/.ssh/id_ecdsa
(ECDSA),
.Pa ~/.ssh/id_ecdsa_sk
(сервер-хранимый ECDSA),
.Pa ~/.ssh/id_ed25519
(Ed25519),
.Pa ~/.ssh/id_ed25519_sk
(сервер-хранимый Ed25519),
и
.Pa ~/.ssh/id_rsa
(RSA)
и сохраняет открытый ключ в
.Pa ~/.ssh/id_dsa.pub
(DSA),
.Pa ~/.ssh/id_ecdsa.pub
(ECDSA),
.Pa ~/.ssh/id_ecdsa_sk.pub
(сервер-хранимый ECDSA),
.Pa ~/.ssh/id_ed25519.pub
(Ed25519),
.Pa ~/.ssh/id_ed25519_sk.pub
(сервер-хранимый Ed25519),
или
.Pa ~/.ssh/id_rsa.pub
(RSA)
в домашнем каталоге пользователя.
Затем пользователь должен скопировать открытый ключ
в
.Pa ~/.ssh/authorized_keys
в своем домашнем каталоге на удаленной машине.
Файл
.Pa authorized_keys
соответствует обычному 
.Pa ~/.rhosts
файлу, и содержит один ключ
на строку, хотя строки могут быть очень длинными.
После этого пользователь может войти без ввода пароля.
.Pp
Вариант аутентификации с использованием открытого ключа
доступен в виде аутентификации по сертификату:
вместо набора открытых/закрытых ключей
используются подписанные сертификаты.
Это имеет преимущество того, что один доверенный орган сертификации
может быть использован вместо множества открытых/закрытых ключей.
См. раздел СЕРТИФИКАТЫ в
.Xr ssh-keygen 1
для получения дополнительной информации.
.Pp
Наиболее удобным способом использования аутентификации с открытым ключом или сертификатом
может быть использование агента аутентификации. 
См.
.Xr ssh-agent 1
и (по желанию)
.Cm AddKeysToAgent
директиву в
.Xr ssh_config 5
для получения дополнительной информации.
.Pp
Аутентификация с интерактивным вводом с клавиатуры работает следующим образом: 
сервер отправляет произвольный
.Qq challenge
запрашивает ответ, возможно, несколько раз. 
Примеры аутентификации с интерактивным вводом включают
.Bx
аутентификацию (см.
.Xr login.conf 5 )
и PAM (некоторые
.Pf non- Ox
сиситемы).
.Pp
Наконец, если другие методы аутентификации не удалось использовать
.Nm
запрашивает у пользователя пароль. 
Пароль отправляется на удаленный 
хост для проверки; однако, поскольку все коммуникации зашифрованы, 
пароль не может быть прочитан кем-то, кто прослушивает сеть.
.Pp
.Nm
автоматически поддерживает и проверяет базу данных, содержащую
идентификацию всех хостов, с которыми он когда-либо использовался.
Ключи хостов хранятся в
.Pa ~/.ssh/known_hosts
в домашнем каталоге пользователя.
Кроме того, файл 
.Pa /etc/ssh/ssh_known_hosts
автоматически проверяется на известные хосты.
Новые хосты автоматически добавляются в файл пользователя. 
Если идентификация хоста когда-либо изменится,
.Nm
предупреждает об этом и отключает аутентификацию по паролю для предотвращения подделки
сервера или атак типа man-in-the-middle, 
которые могли бы быть использованы для обхода шифрования.
Опция
.Cm StrictHostKeyChecking
может использоваться для контроля входа на машины, ключ 
хоста которых неизвестен или изменился.
.Pp
Когда идентификация пользователя была принята сервером, сервер 
либо выполняет указанную команду в неинтерактивном сеансе, либо,
если команда не была указана, выполняет вход на машину и предоставляет
пользователю обычную оболочку в интерактивном сеансе. 
Вся связь с 
удаленной командой или оболочкой будет автоматически зашифрована.
.Pp
Если запрашивается интерактивный сеанс,
.Nm
по умолчанию будет запрашивать псевдотерминал (pty) для интерактивных
сеансов только в том случае,если он есть у клиента.
Флаги
.Fl T
и
.Fl t
могут использоваться для изменения этого поведения.
.Pp
Если псевдотерминал был выделен, 
пользователь может использовать символы экранирования, перечисленные ниже.
.Pp
Если псевдотерминал не был выделен,
сеанс является прозрачным и может использоваться для надежной передачи двоичных данных.
На большинстве систем установка символа экранирования на
.Dq none
также делает сеанс прозрачным, даже если используется tty.
.Pp
Сеанс завершается, когда команда или оболочка на удаленной 
машине завершается, и все соединения X11 и TCP закрыты.
.Sh ЭКРАНИРОВАНИЕ СИМВОЛОВ
Когда запрошен псевдотерминал,
.Nm
поддерживает ряд функций с помощью символа экранирования.
.Pp
Один символ тильды может быть отправлен как
.Ic ~~
или после тильды следует символ, отличный от описанных ниже.
Символ экранирования должен всегда следовать за символом новой строки, чтобы быть интерпретированным как специальный.
Символ экранирования можно изменить в конфигурационных файлах с помощью
.Cm EscapeChar
директивы или в командной строке с помощью
.Fl e
опции.
.Pp
Поддерживаемые экранирования (при условии, что используется значение по умолчанию
.Ql ~ )
включают:
.Bl -tag -width Ds
.It Cm ~.
Отключение.
.It Cm ~^Z
Фоновый режим
.Nm .
.It Cm ~#
Список перенаправленных соединений.
.It Cm ~&
Фоновый режим
.Nm
при выходе, когда ожидается завершение перенаправленного соединения / сеансов X11.
.It Cm ~?
Показать список символов экранирования.
.It Cm ~B
Отправить BREAK на удаленную систему
(полезно только при поддержке партнером).
.It Cm ~C
Открыть командную строку.
В настоящее время это позволяет добавлять перенаправления портов с использованием 
.Fl L ,
.Fl R
и
.Fl D
параметров (см.выше).
Также это позволяет отменять существующие перенаправления портов
с помощью
.Sm off
.Fl KL Oo Ar bind_address : Oc Ar port
.Sm on
для локальных,
.Sm off
.Fl KR Oo Ar bind_address : Oc Ar port
.Sm on
для удаленных и
.Sm off
.Fl KD Oo Ar bind_address : Oc Ar port
.Sm on
для динамических перенаправлений портов.
.Ic !\& Ns Ar command
позволяет пользователю выполнить локальную команду, если
.Ic PermitLocalCommand
параметр включен в
.Xr ssh_config 5 .
Базовая справка доступна с использованием 
.Fl h
параметра.
.It Cm ~R
Запрос на повторное установление соединения
(полезно только если пир поддерживает это).
.It Cm ~V
Уменьшить подробность
.Pq Ic LogLevel
когда ошибки записываются в stderr.
.It Cm ~v
Увеличить подробность
.Pq Ic LogLevel
когда ошибки записываются в stderr.
.El
.Sh TCP ПЕРЕАДРЕСАЦИЯ
Переадресация произвольных TCP-соединений через защищенный канал
может быть указана как в командной строке, так и в файле конфигурации.
Одним из возможных применений переадресации TCP является безопасное соединение с
почтовым сервером; другим является прохождение через брандмауэры.
.Pp
В приведенном ниже примере мы рассматриваем шифрование коммуникации для клиента IRC,
даже если сервер IRC, к которому он подключается, не 
поддерживает прямого шифрования.
Это работает следующим образом:
пользователь подключается к удаленному хосту, используя
.Nm ,
указывая порты, которые будут использоваться для перенаправления соединения.
После этого можно запустить программу локально,
и
.Nm
зашифрует и перенаправит соединение на удаленный сервер.
.Pp
Следующий пример создает туннель для сеанса IRC от клиента
к серверу IRC на
.Dq server.example.com ,
присоединяясь к каналу
.Dq #users ,
с никнеймом
.Dq pinky ,
используя стандартный IRC порт, 6667:
.Bd -literal -offset 4n
$ ssh -f -L 6667:localhost:6667 server.example.com sleep 10
$ irc -c '#users' pinky IRC/127.0.0.1
.Ed
.Pp
Параметр
.Fl f
фоновая
.Nm
и удаленная команда
.Dq sleep 10
указана для того, чтобы предоставить время
(10 секунд в примере)
для запуска программы, которая будет использовать туннель. 
Если соединения не устанавливаются в указанное время,
.Nm
завершит работу.
.Sh X11 ПЕРЕАДРЕСАЦИЯ
Если
.Cm ForwardX11
переменная установлена в
.Dq yes
(или смотрите описание из
.Fl X ,
.Fl x ,
и
.Fl Y
параметров выше)
и пользователь использует X11 (окружение
.Ev DISPLAY
переменной установлено), то соединение с дисплеем X11 
автоматически перенаправляется на удаленную сторону таким образом, что любые программы X11,
запущенные из оболочки (или команды), проходят через 
зашифрованный канал, и соединение с реальным X-сервером будет установлено
с локальной машины. 
Пользователь не должен вручную устанавливать
.Ev DISPLAY .
Перенаправление соединений X11 можно 
настроить через командную строку или в конфигурационных файлах.
.Pp
Значение
.Ev DISPLAY
установленное
.Nm
будет указывать на серверную машину, но с номером дисплея больше нуля.
Это нормально, потому что
.Nm
создает
.Dq proxy
сервер X на серверной машине для перенаправления 
соединений по зашифрованному каналу.
.Pp
.Nm
также автоматически настроит данные Xauthority на серверной машине. 
Для этого он сгенерирует случайный авторизационный файл cookie, 
сохранит его в Xauthority на сервере и проверит, что все перенаправленные 
соединения содержат этот файл cookie и заменит его на реальный cookie при 
открытии соединения.
Реальный аутентификационный файл cookie никогда 
не отправляется на серверную машину (и никакие файлы cookie не отправляются в открытом виде).
.Pp
Если
.Cm ForwardAgent
переменная установлена
.Dq yes
(или смотрите описание из
.Fl A
и
.Fl a
параметров выше) и
пользователь использует агент аутентификации, соединение с агентом
автоматически перенаправляется на удаленную сторону.
.Sh ПРОВЕРКА КЛЮЧЕЙ ХОСТА
При первом подключении к серверу 
пользователю представляется отпечаток открытого ключа сервера 
(только если параметр
.Cm StrictHostKeyChecking
не отключен).
Отпечатки могут быть определены с помощью
.Xr ssh-keygen 1 :
.Pp
.Dl $ ssh-keygen -l -f /etc/ssh/ssh_host_rsa_key
.Pp
Если отпечаток уже известен, его можно сопоставить, 
и ключ можно принять или отклонить.
Если доступны только устаревшие (MD5) отпечатки для сервера
.Xr ssh-keygen 1
.Fl E
параметр можно использовать для снижения уровня алгоритма отпечатка.
.Pp
Из-за сложности сравнения ключей хоста
только по отпечаткам строк
также есть поддержка визуального сравнения ключей хоста
с помощью
.Em случайного искусства .
Установив
.Cm VisualHostKey
параметр в
.Dq yes ,
на каждом входе на сервер отображается небольшая графика ASCII, независимо
от того, интерактивна ли сама сессия или нет. 
Изучив шаблон известного сервера, пользователь легко
может выяснить, что ключ хоста изменился, когда отображается совершенно 
другой шаблон.
Однако поскольку эти шаблоны неоднозначны, шаблон, который выглядит
похожим на запомненный шаблон, дает лишь хорошую вероятность того, что
ключ хоста тот же самый, но не гарантированное доказательство.
.Pp
Для получения списка отпечатков вместе с их "случайным искусством" для
всех известных хостов можно использовать следующую команду:
.Pp
.Dl $ ssh-keygen -lv -f ~/.ssh/known_hosts
.Pp
Если отпечаток неизвестен, 
доступен альтернативный метод проверки:
SSH проверенные через DNS.
Дополнительный ресурсный запись (RR),
SSHFP,
добавляется в файл зоны,
и подключающийся клиент способен сопоставить отпечаток 
с представленным ключом
.Pp
В этом примере мы подключаем клиента к серверу 
.Dq host.example.com .
Сначала ресурсные записи SSHFP должны быть добавлены в файл зоны для 
host.example.com:
.Bd -literal -offset indent
$ ssh-keygen -r host.example.com.
.Ed
.Pp
Строки вывода должны быть добавлены в файл зоны
Чтобы проверить, отвечает ли зона на запросы отпечатков: 
.Pp
.Dl $ dig -t SSHFP host.example.com
.Pp
Наконец, клиент подключается:
.Bd -literal -offset indent
$ ssh -o "VerifyHostKeyDNS ask" host.example.com
[...]
Найден совпадающий отпечаток ключа хоста в DNS
Вы уверены, что хотите продолжить подключение (да/нет\)?
.Ed
.Pp
Смотрите
.Cm VerifyHostKeyDNS
параметр в
.Xr ssh_config 5
для получения дополнительной информации.
.Sh SSH-BASED ВИРТУАЛЬНЫЕ ЧАСТНЫЕ СЕТИ
.Nm
поддерживает туннелирование по виртуальной частной сети (VPN) 
с использованием
.Xr tun 4
network псевдоустройства
позволяющего безопасно соединять две сети.
Параметр
.Xr sshd_config 5
конфигурации опции
.Cm PermitTunnel
определяет,поддерживает ли сервер это
и на каком уровне (уровень трафика 2 или 3).
.Pp
В следующем примере будет установлено соединение клиентской сети 10.0.50.0/24
с удаленной сетью 10.0.99.0/24 с использованием точечного соединения 
от 10.1.1.1 to 10.1.1.2,
при условии, что SSH-сервер, работающий на шлюзе к удаленной сети 
на 192.168.1.15, разрешает это.
.Pp
На клиенте:
.Bd -literal -offset indent
# ssh -f -w 0:1 192.168.1.15 true
# ifconfig tun0 10.1.1.1 10.1.1.2 netmask 255.255.255.252
# route add 10.0.99.0/24 10.1.1.2
.Ed
.Pp
на сервере:
.Bd -literal -offset indent
# ifconfig tun1 10.1.1.2 10.1.1.1 netmask 255.255.255.252
# route add 10.0.50.0/24 10.1.1.1
.Ed
.Pp
Доступ клиента может быть более тонко настроен через 
.Pa /root/.ssh/authorized_keys
файл (см.ниже) и
.Cm PermitRootLogin
параметр сервера.
Следующая запись разрешит подключения на
.Xr tun 4
устройстве 1 от пользователя
.Dq jane
и на tun устройстве 2 от пользователя
.Dq john ,
Если
.Cm PermitRootLogin
установлен как
.Dq forced-commands-only :
.Bd -literal -offset 2n
tunnel="1",command="sh /etc/netstart tun1" ssh-rsa ... jane
tunnel="2",command="sh /etc/netstart tun2" ssh-rsa ... john
.Ed
.Pp
Поскольку настройка на основе SSH требует значительных накладных расходов,
она может быть более подходящей для временных настроек,
таких как беспроводные VPN.
Более постоянные VPN лучше предоставляются с помощью инструментов типа
.Xr ipsecctl 8
и
.Xr isakmpd 8 .
.Sh ОКРУЖАЮЩАЯ СРЕДА
.Nm
обычно устанавливается следующим образом:
.Bl -tag -width "SSH_ORIGINAL_COMMAND"
.It Ev DISPLAY
Переменная
.Ev DISPLAY
указывает местоположение сервера X11.
Она автоматически устанавливается
.Nm
чтобы указывать значение в виде
.Dq hostname:n ,
где
.Dq hostname
указывает на хост, где запущен shell, а
.Sq n
целое число \*(Ge 1.
.Nm
использует эту специальную переменную для перенаправления соединений X11 через защищенный 
канал.
Пользователь обычно не должен устанавливать
.Ev DISPLAY
явно, так как
это сделает соединение X11 небезопасным (и потребует от пользователя
вручную копировать необходимые файлы авторизации).
.It Ev HOME
Устанавливается в путь к домашнему каталогу пользователя.
.It Ev LOGNAME
Синоним для
.Ev USER ;
установлен для совместимости с системами, использующими эту переменную.
.It Ev MAIL
Устанавливается в путь к почтовому ящику пользователя.
.It Ev PATH
Устанавливается по умолчанию
.Ev PATH ,
как указано при компиляции
.Nm .
.It Ev SSH_ASKPASS
Если
.Nm
требуется пароль, он будет считывать пароль с текущего
терминала, если был запущен из терминала.
Если
.Nm
нет ассоциированного с ним терминала, но
.Ev DISPLAY
и
.Ev SSH_ASKPASS
установлены, он выполнит программу, указанную в
.Ev SSH_ASKPASS
и откроет окно X11 для ввода пароля.
Это особенно полезно при вызове
.Nm
из
.Pa .xsession
или сопутствующего скрипта.
(Обратите внимание, что на некоторых машинах
может потребоваться перенаправление ввода с
.Pa /dev/null
для корректной работы.)
.It Ev SSH_ASKPASS_REQUIRE
Позволяет дополнительно контролировать использование программы askpass.
Если эта переменная установлена в
.Dq never
то
.Nm
никогда не будет пытаться использовать ее.
Если она установлена в
.Dq prefer ,
то
.Nm
предпочтет использовать программу askpass вместо TTY при запросе 
паролей.
Наконец, если переменная установлена в
.Dq force ,
то программа askpass будет использоваться для всех запросов пароля независимо
от того,
.Ev DISPLAY
установлен ли.
.It Ev SSH_AUTH_SOCK
Определяет путь к 
.Ux Ns -domain
сокету, используемому для общения с агентом.
.It Ev SSH_CONNECTION
Идентифицирует клиентский и серверный концы соединения.
Переменная содержит 
четыре значения, разделенных пробелами: IP-адрес клиента, номер порта клиента,
IP-адрес сервера и номер порта сервера.
.It Ev SSH_ORIGINAL_COMMAND
Эта переменная содержит оригинальную командную строку, если
выполнена принудительная команда.
Ее можно использовать для извлечения оригинальных аргументов.
.It Ev SSH_TTY
Устанавливается в имя tty (путь к устройству), связанное 
с текущим оболочкой или командой.
Если текущий сеанс не имеет tty,
эта переменная не устанавливается.
.It Ev SSH_TUNNEL
По желанию устанавливается
.Xr sshd 8
для содержания имен интерфейсов, назначенных, если было 
запрошено туннельное перенаправление клиентом.
.It Ev SSH_USER_AUTH
По желанию устанавливается
.Xr sshd 8 ,
эта переменная может содержать путь к файлу, в котором перечислены успешно использованные 
методы аутентификации при установлении сеанса, включая любые
использованные открытые ключи.
.It Ev TZ
Эта переменная устанавливается для указания текущего часового пояса, если он 
был установлен при запуске демона (т.е. демон передает значение
новым соединениям).
.It Ev USER
Устанавливается в имя пользователя, входящего в систему.
.El
.Pp
Кроме того,
.Nm
читает
.Pa ~/.ssh/environment ,
и добавляет строки формата
.Dq VARNAME=value
в окружение, если файл существует и пользователям разрешено 
изменять свое окружение.
Для получения дополнительной информации смотрите 
.Cm PermitUserEnvironment
параметр в
.Xr sshd_config 5 .
.Sh ФАЙЛЫ
.Bl -tag -width Ds -compact
.It Pa ~/.rhosts
Этот файл используется для аутентификации на основе хоста (см. выше).
На некоторых машинах этот файл может потребоваться сделать доступным для 
чтения всем, если домашний каталог пользователя находится на разделе NFS,
потому что
.Xr sshd 8
читает его как root.
Кроме того, этот файл должен принадлежать пользователю 
и не иметь прав на запись для других.
Рекомендуемое
разрешение для большинства машин - чтение/запись для пользователя и
недоступность для других.
.Pp
.It Pa ~/.shosts
Этот файл используется точно так же, как и
.Pa .rhosts ,
но позволяет аутентификацию на основе хоста без разрешения входа с помощью
rlogin/rsh.
.Pp
.It Pa ~/.ssh/
Этот каталог является местом по умолчанию для всей пользовательской конфигурации 
и информации об аутентификации.
Общее требование к хранению всего содержимого этого каталога в тайне 
отсутствует, но рекомендуемые разрешения - чтение/запись/выполнение для пользователя
и недоступность для других.
.Pp
.It Pa ~/.ssh/authorized_keys
Перечисляет открытые ключи (DSA, ECDSA, Ed25519, RSA)
которые могут быть использованы для входа в систему под этим пользователем.
Формат этого файла описан в 
.Xr sshd 8
странице руководства.
Этот файл не является высокочувствительным, но рекомендуемые 
разрешения - чтение/запись для пользователя и недоступность для других.
.Pp
.It Pa ~/.ssh/config
Это файл конфигурации для каждого пользователя.
Формат файла и параметры конфигурации описаны в
.Xr ssh_config 5 .
Из-за потенциальной возможности злоупотребления данными, этот файл должен иметь строгие права доступа:
чтение/запись для пользователя и недоступность для записи другими.
.Pp
.It Pa ~/.ssh/environment
Содержит дополнительные определения переменных окружения; см.
.Sx ENVIRONMENT ,
выше.
.Pp
.It Pa ~/.ssh/id_dsa
.It Pa ~/.ssh/id_ecdsa
.It Pa ~/.ssh/id_ecdsa_sk
.It Pa ~/.ssh/id_ed25519
.It Pa ~/.ssh/id_ed25519_sk
.It Pa ~/.ssh/id_rsa
Содержат закрытый ключ для аутентификации.
Эти файлы 
содержат чувствительные данные и должны быть доступны только для чтения пользователем, но не
доступны для других (чтение/запись/выполнение).
.Nm
просто проигнорирует файл закрытого ключа, если он доступен для других.
При генерации ключа можно указать пароль, 
который будет использоваться для шифрования
чувствительной части этого файла с помощью AES-128.
.Pp
.It Pa ~/.ssh/id_dsa.pub
.It Pa ~/.ssh/id_ecdsa.pub
.It Pa ~/.ssh/id_ecdsa_sk.pub
.It Pa ~/.ssh/id_ed25519.pub
.It Pa ~/.ssh/id_ed25519_sk.pub
.It Pa ~/.ssh/id_rsa.pub
Содержат открытый ключ для аутентификации.
Эти файлы не являются
чувствительными и могут (но не обязательно) быть доступными для чтения любым пользователем.
.Pp
.It Pa ~/.ssh/known_hosts
Содержит список ключей хостов для всех хостов, в которые пользователь вошел и которые еще
не находятся в системном списке известных ключей хостов.
Смотрите
.Xr sshd 8
для более подробной информации о формате этого файла.
.Pp
.It Pa ~/.ssh/rc
Команды в этом файле выполняются
.Nm
при входе пользователя, непосредственно перед запуском оболочки
пользователя (или команды).
См.
.Xr sshd 8
на странице руководства для доп.информации.
.Pp
.It Pa /etc/hosts.equiv
Этот файл предназначен для аутентификации на основе хоста (см. выше).
Он должен быть доступен только для записи root.
.Pp
.It Pa /etc/shosts.equiv
Этот файл используется точно так же, как и
.Pa hosts.equiv ,
но позволяет аутентификацию на основе хоста без разрешения входа через
rlogin/rsh.
.Pp
.It Pa /etc/ssh/ssh_config
Файл конфигурации для всей системы.
Формат файла и параметры конфигурации описаны в
.Xr ssh_config 5 .
.Pp
.It Pa /etc/ssh/ssh_host_key
.It Pa /etc/ssh/ssh_host_dsa_key
.It Pa /etc/ssh/ssh_host_ecdsa_key
.It Pa /etc/ssh/ssh_host_ed25519_key
.It Pa /etc/ssh/ssh_host_rsa_key
Эти файлы содержат закрытые части ключей хостов
и используются для аутентификации на основе хоста.
.Pp
.It Pa /etc/ssh/ssh_known_hosts
Системный список известных ключей хостов.
Этот файл должен быть подготовлен администратором 
системы для содержания публичных ключей хостов всех машин в
организации.
Он должен быть доступен для чтения всем.
См.
.Xr sshd 8
для более подробной информации о формате этого файла.
.Pp
.It Pa /etc/ssh/sshrc
Команды в этом файле выполняются
.Nm
при входе пользователя, непосредственно перед запуском оболочки пользователя (или команды).
См.
.Xr sshd 8
на странице руководоства для доп.информации.
.El
.Sh СТАТУС ВЫХОДА
.Nm
выходит с кодом завершения удаленной команды или с 255
если произошла ошибка.
.Sh СМ.ТАКЖЕ
.Xr scp 1 ,
.Xr sftp 1 ,
.Xr ssh-add 1 ,
.Xr ssh-agent 1 ,
.Xr ssh-keygen 1 ,
.Xr ssh-keyscan 1 ,
.Xr tun 4 ,
.Xr ssh_config 5 ,
.Xr ssh-keysign 8 ,
.Xr sshd 8
.Sh СТАНДАРТЫ
.Rs
.%A S. Lehtinen
.%A C. Lonvick
.%D Январь 2006
.%R RFC 4250
.%T TПротокол безопасной оболочки (SSH) Назначенные номера
.Re
.Pp
.Rs
.%A T. Ylonen
.%A C. Lonvick
.%D Январь 2006
.%R RFC 4251
.%T Архитектура протокола безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A T. Ylonen
.%A C. Lonvick
.%D Январь 2006
.%R RFC 4252
.%T Протокол аутентификации безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A T. Ylonen
.%A C. Lonvick
.%D Январь 2006
.%R RFC 4253
.%T Протокол транспортного уровня безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A T. Ylonen
.%A C. Lonvick
.%D Январь 2006
.%R RFC 4254
.%T Протокол соединения безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A J. Schlyter
.%A W. Griffin
.%D Январь 2006
.%R RFC 4255
.%T Использование DNS для безопасной публикации отпечатков ключей безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A F. Cusack
.%A M. Forssen
.%D Январь 2006
.%R RFC 4256
.%T Общий протокол аутентификации обмена сообщениями для протокола безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A J. Galbraith
.%A P. Remaker
.%D Январь 2006
.%R RFC 4335
.%T Расширение канала сеанса безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A M. Bellare
.%A T. Kohno
.%A C. Namprempre
.%D Январь 2006
.%R RFC 4344
.%T Режимы шифрования транспортного уровня безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A B. Harris
.%D Январь 2006
.%R RFC 4345
.%T Улучшенные режимы Arcfour для протокола транспортного уровня безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A M. Friedl
.%A N. Provos
.%A W. Simpson
.%D Март 2006
.%R RFC 4419
.%T Обмен группы Диффи-Хеллмана для протокола транспортного уровня безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A J. Galbraith
.%A R. Thayer
.%D Ноябрь 2006
.%R RFC 4716
.%T Формат файла открытого ключа безопасной оболочки (SSH)
.Re
.Pp
.Rs
.%A D. Stebila
.%A J. Green
.%D Декабрь 2009
.%R RFC 5656
.%T Интеграция алгоритма эллиптической кривой в транспортный уровень Secure Shell
.Re
.Pp
.Rs
.%A A. Perrig
.%A D. Song
.%D 1999
.%O Международный семинар по криптографическим методам и электронной коммерции (CrypTEC '99)
.%T Визуализация хэшей: новый метод повышения безопасности в реальном мире
.Re
.Sh АВТОРЫ
OpenSSH является производным от оригинального и бесплатного 
ssh 1.2.12 выпуска Тату Илонена.
Аарон Кэмпбелл, Боб Бек, Маркус Фридл, Нильс Провос,
Тео де Раадт и Даг Сонг
устранили множество ошибок, добавили новые функции и
создали OpenSSH.
Маркус Фридл внёс вклад в поддержку 
протоколов SSH версий 1.5 и 2.0.
