melkorbsd/ru-freebsd-man/man1/vidcontrol.1
.\"
.\" vidcontrol - a utility for manipulating the syscons or vt video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\"
.Dd Апрель 6, 2022
.Dt VIDCONTROL 1
.Os
.Sh ИМЯ
.Nm vidcontrol
.Nd утилита управления и настройки системной консоли 
.Sh СИНТАКСИС
.Nm
.Op Fl CdHLPpx
.Op Fl b Ar цвет
.Op Fl c Ar внешний вид
.Op Fl E Ar эмулятор
.Oo
.Fl f
.Oo
.Op Ar размер
.Ar файла
.Oc
.Oc
.Op Fl g Ar геометрия
.Op Fl h Ar размер
.Op Fl i Cm активный | адаптер | режим
.Op Fl l Ar screen_map
.Op Fl M Ar char
.Op Fl m Cm on | off
.Op Fl r Ar foreground Ar background
.Op Fl S Cm on | off
.Op Fl s Ar number
.Op Fl T Cm xterm | cons25
.Op Fl t Ar N | Cm off
.Op Ar режим
.Op Ar foreground Op Ar background
.Op Cm show
.Sh ОПИСАНИЕ
Утилита
.Nm
используется для установки различных параметров для консольного драйвера
.Xr syscons 4
или
.Xr vt 4
,
таких как видеорежим, цвета, курсор форма, карта вывода на экран, шрифт и время ожидания экранной заставки.
Только небольшое количество параметров поддерживается
.Xr vt 4 .
Неподдерживаемые параметры приводят к появлению сообщений об ошибках, обычно содержащих текст "Неподходящий ioctl для устройства".
.Pp
Поддерживаются следующие параметры командной строки:
.Bl -tag -width indent
.It Ar mode
Выбрать новый видеорежим.
В настоящее время распознаются следующие режимы:
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x30 ,
.Ar VGA_80x50 ,
.Ar VGA_80x60 ,
.Ar VGA_90x25 ,
.Ar VGA_90x30 ,
.Ar VGA_90x43 ,
.Ar VGA_90x50 ,
.Ar VGA_90x60 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60 .
.\"The graphic mode
.\".Ar VGA_320x200
.\"and
Режим растрового текста
.Ar VESA_800x600
может тоже быть выбран.
В качестве альтернативы, режим можно указать с его номером, используя название режима
в форме
.Li MODE_ Ns Aq Ar NUMBER .
Список допустимых номеров режимов можно получить с помощью параметра
.Режим Fl i Cm
.
Просматривать
.Sx Поддержка видеорежима
приведена ниже.
.It Ar передний план вместо фона
Изменять цвета при отображении текста.
Укажзывать цвет переднего плана
(e.g.,
.Dq vidcontrol white ) ,
или как цвета переднего плана, так и фона
(e.g.,
.Dq vidcontrol yellow blue ) .
Использовать
.Cm show
нажматием кнопки ниже, чтобы просмотреть доступные цвета.
.It Cm show
Просматривает, какие цвета поддерживаются на данной платформе.
.It Fl b Ar color
Устанавливает цвет границы равным
.Ar color .
Возможно, эта опция не всегда поддерживается видеодрайвером.
.It Fl C
Очищать буфер истории.
.It Fl c Ar setting Ns Op , Ns Ar setting ...
Изменять внешний вид курсора.
Изменение задается непустым списком параметров, разделенных запятыми.
.Ar setting Ns s .
каждый
.Ar setting
переопределяет или изменяет предыдущие в порядке слева направо.
.Pp
Следующее переопределение
.Ar setting Ns s
доступны:
.Bl -tag -width indent
.It Cm Нормальные
Устанавливать в блок, занимающий ячейку размером в 1 символ, с зависящей от конфигурации раскраской, которая в худшем случае должна быть обратной видео.
.It Cm деструктивные
Установлен мигающий подблок с
.Cm высотой
строк сканирования начиная с
.Cm основания .
Название
.Dq деструктивный
плохо влияет на обратную совместимость. 
не следует форсировать деструктивность,
и теперь это дает деструктивность только в некоторых
конфигурациях (обычно для аппаратных курсоров
в текстовом режиме).
Мигание ограничивает деструктивность.
Эта
.Ar настройка
теперь должно быть написано по буквам
.Cm normal , Ns Cm blink , Ns Cm noblock .
Немигающий деструктивный курсор был бы непригоден для использования,
поэтому старые версии
.Nm
не поддерживается,
и в этой версии для него нет переопределения.
It Cm base Ns = Ns Ar-значение , Cm height Ns = Ns Ar-значение
Установите указанные параметры линии развертки.
Эти параметры активны только в
.Cm noblock
режим.
.Cm значение
является целым числом в любой базе, поддерживаемой
.Xr strtol 3 .
Настраивание
.Cm роста
до значения 0 отключает курсор
.Cm noblock
режим.
Негативные
.Ar значения Ns s
игнорируются.
Позитивные
.Ar значения Ns s
зажимаются так, чтобы они помещались в ячейку символа при наведении курсора.
.El
.Pp
Следующие настройки 
.Ar setting Ns s
доступны:
.Bl -tag -width indent
.It Cm blink , noblink
Устанавливать или снимите мигающий атрибут.
Это не совсем совместимо с предыдущими версиями.
В старых версиях
.Nm , Cm blinkмигание
было заменено на блокировку мигания.
.It Cm block , noblock
Устанавливать или очищать атрибут
.Cm block
.
Этот атрибут является обратным по отношению к флагу
.Dv CONS_CHAR_CURSOR
в реализации.
Он отключает параметры скана линии
и выражает предпочтение использованию более
простого метода реализации.
Его обратное значение приводит к обратному результату.
Когда параметры scanline задают полный блок,
этот атрибут уменьшается до бита выбора метода.
Метод
.Cm block
, как правило, дает лучшую окраску.
.It Cm hidden , nohidden
Устанавливать или снимите скрытый атрибут.
.El
.Pp
Следующие (не прилипающие) флаги управляют применением
.Ar setting Ns s :
.Bl -tag -width indent
.It Cm charcolors
Применять к
.Cm base
и
.Cm height
к списку предпочтительных цветов курсора (символа), а не к его форме.
Обратите внимание, что номера цветов являются необработанными индексами палитры VGA,
а не номерами цветов ANSI.
Индексы уменьшаются до 8, 16 или 256
или игнорируются,
в зависимости от видеорежима и средства визуализации.
.It Cm mousecolors
Цвета для курсора мыши в графическом режиме.
Как
.Cm charcolors ,
за исключением того, что здесь нет никаких предпочтений или последовательности;
.Cm base
gives the mouse border color and
.Cm height
Together with
.Cm charcolors ,
это дает 2 бита выбора, которые выбирают
только между 3 из 4 подпунктов назначения из 4 пунктов назначения, выбранных пользователем.
.Cm default
и
.Cm local
(by ignoring
.Cm mousecolors
if
.Cm charcolors
is also set).
.It Cm по умолчанию
Примените изменения к настройкам по умолчанию, а затем к активным настройкам,
а не только к активным настройкам.
Вместе с
.Cm local ,
Предлагать 2 бита выбора, которые выбирают между 4 пунктами назначения.
.It Cm shapeonly
Игнорировать любые изменения в
.Cm блоке
и
.Cm скрытых
атрибутах.
.It Cm local
Применять изменения к текущему vty.
По умолчанию они применяются к глобальному местоположению
и копируются оттуда во все vty.
.It Cm reset
Сбрасывать все настройки.
По умолчанию сброс не выполняется.
Когда параметр
.Cm local
указан, текущие локальные настройки сбрасываются
на локальные настройки по умолчанию.
В противном случае текущие глобальные настройки сбрасываются на
глобальные настройки по умолчанию, а затем копируются на текущие настройки и
настройки по умолчанию для всех vtys.
.It Cm show
Показывать текущие изменения.
.El
.It Fl d
Выносить текущую карту выходного экрана.
.It Fl E Ar emulator
Устанавливать эмулятор терминала в
.Ar emulator .
.It Fl e
Показывать активные и доступные эмуляторы терминала.
.It Xo
.Fl f
.Oo
.Op Ar размер
.Ar файл
.Oc
.Xc
Load font
.Ar файл
for
.Ar размер
(в настоящее время только
.Cm 8x8 ,
.Cm 8x14
или
.Cm 8x16 ) .
Файл шрифта может быть как в формате uuencoded, так и в необработанном двоичном формате.
Вы можете также использовать меню, управляемое командой
.Xr vidfont 1
для загрузки шрифта по вашему выбору.
.Pp
.Ar Размер
может быть опущен в данном случае
.Nm
попытаемся угадать это по размеру файла шрифта.
.Pp
Когда используется
.Xr vt 4
и
.Ar размер
и
.Ar файл
могут быть опущены и загружен будет шрифт по умолчанию.
.Pp
Обратите внимание, что старые видеокарты, такие как MDA и CGA, не поддерживают
программный шрифт.
См. также
.Sx Поддержка видеорежима
и
.Sx ПРИМЕРЫ
находится ниже и на справочной странице для любого из 
.Xr syscons 4
или
.Xr vt 4
(в зависимости от того, какой драйвер вы используете).
.It Fl g Ar geometry
См.
.Ar геометрию
текстового режима для режимов с возможностью выбора
геометрии.
В настоящее время доступны только растровые режимы, такие как
.Ar VESA_800x600 ,
поддержитвает этот параметр.
См. также
.Sx Поддержка видеорежима
и
.Sx ПРИМЕРЫ
ниже.
.It Fl h Ar size
Установите размер буфера истории (обратной прокрутки) равным 
.Ar размеру
строк.
.It Fl i Cm active
Показывает активный номер vty.
.It Fl i Cm adapter
Показывает информацию о текущем видеоадаптере.
.It Fl i Cm mode
Показывает возможные режимы видеосъемки с использованием текущего видеооборудования.
.It Fl l Ar screen_map
Устанавливает файл карты вывода на экран из
.Ar screen_map .
См. также
.Xr syscons 4
или
.Xr vt 4
(в зависимости от того, какой драйвер вы используете).
.It Fl L
Устанавливает карту вывода на экран по умолчанию.
.It Fl M Ar char
Устанавливает базовый символ, используемый для отображения указателя мыши в
.Ar char .
.It Fl m Cm on | off
Меняет указатель мыши
.Cm on
или
.Cm off .
Используется вместе с
.Xr moused 8
для вырезания и вставки текста в текстовом режиме.
.It Fl p
Захватывает текущее содержимое видеобуфера, соответствующего 
устройству, на которое ссылается стандартный ввод.
Утилита
.Nm
записывает содержимое видеобуфера в стандартный
вывод в необработанном двоичном формате.
Подробнее об этом
формате смотрите в 
.Sx Формат дампа видеобуфера
ниже.
Поддерживается только с
.Xr syscons 4 .
.It Fl P
Тот же, что и
.Fl p ,
но содержимое видеобуфера выводится в обычном текстовом формате, игнорируя непечатаемые символы и информацию об
атрибутах текста.
Поддерживается только с
.Xr syscons 4 .
.It Fl H
Когда используется с
.Fl p
или
.Fl P ,
it instructs
.Nm
чтобы сбросить весь буфер истории, а не только видимую часть
видеобуфера.
.It Fl r Ar foreground background
Изменяет цвета в обратном режиме на
.Ar передний план
и
.Ar задний план .
.It Fl S Cm on | off
Включает или выключает функцию vty.
Если функция vty выключена, то все
попытки переключиться на другой виртуальный терминал завершатся неудачей.
(По умолчанию разрешено переключение на vty.)
Эту защиту можно легко обойти, если ядро скомпилировано с
использованием параметра
.Dv DDB
.
Однако вам, вероятно, не следует компилировать отладчик ядра на сервере, который
должен быть физически защищен.
.It Fl s Ar number
Устанавливает активный vty на
.Ar номер .
.It Fl T Cm xterm | cons25
Переключается между стилями эмуляцией терминала xterm и cons25.
.It Fl t Ar N | Cm off
Устанавливает перерыв экранной заставки на
.Ar N
секунд или выключает ее
.Cm off .
.It Fl x
Для вывода использует шестнадцатеричные цифры.
.El
.Ss Video Mode Support
Обратите внимание, что не все режимы, перечисленные выше, могут поддерживаться
видеооборудованием.
Вы можете проверить, какой режим поддерживается видеооборудованием, используя параметр
.Fl i Cm mode
.
.Pp
Поддержка VESA BIOS должна быть подключена к ядру
или загружена в виде модуля KLD, если вы хотите использовать видеорежимы VESA
или режимы с 132 столбцами
(см.
.Xr vga 4 ) .
.Pp
Вам необходимо скомпилировать свое ядро с помощью параметра
.Ar VGA_WIDTH90
если вы хотите использовать режимы VGA с 90 колонками
(см.
.Xr vga 4 ) .
.Pp
Видеорежимы, отличные от режимов с 25 и 30 строками, могут потребовать определенный размер шрифта.
Воспользуйтесь параметром 
.Fl f
выше, чтобы загрузить файл шрифта в ядро.
Если необходимый размер шрифта не был загружен в ядро,
.Nm
произойдет сбой, если пользователь попытается установить новый видеорежим.
.Pp
.Bl -column "25 line modes" "8x16 (VGA), 8x14 (EGA)" -compact
.Sy Modes Ta Sy Font size
.No 25 line modes Ta 8x16 (VGA), 8x14 (EGA)
.No 30 line modes Ta 8x16
.No 43 line modes Ta 8x8
.No 50 line modes Ta 8x8
.No 60 line modes Ta 8x8
.El
.Pp
Лучше всегда загружать все три размера (8x8, 8x14 и 8x16)
одного и того же шрифта.
.Pp
Вы можете задать переменные в
.Pa /etc/rc.conf
or
.Pa /etc/rc.conf.local
таким образом, нужные файлы шрифтов будут автоматически загружены
при запуске системы.
Смотреть ниже.
.Pp
Если вы хотите использовать любой из режимов растрового текста, вам необходимо перекомпилировать ваше ядро с помощью параметра
.Dv SC_PIXEL_MODE.
См.
.Xr syscons 4
или
.Xr vt 4
(в зависимости от того, какой драйвер вы используете)
для получения более подробной информации об этом параметре ядра.
.Ss Формат дампа видеобуфера
Утилита
.Nm
использует
.Xr syscons 4
.\" is it supported on vt(4)???
или
.Xr vt 4
.Dv CONS_SCRSHOT
.Xr ioctl 2
для захвата текущего содержимого видеобуфера.
Утилита
.Nm
записывает версию и дополнительную информацию в стандартный
вывод, за которым следует содержимое видеобуфера.
.Pp
видеопамять VGA обычно состоит из двух байтовых кортежей,
по одному на позицию символа.
В каждом кортеже первый байт будет кодом символа,
а второй байт - атрибутом цвета символа.
.Pp
Байт атрибута цвета VGA выглядит следующим образом:
.Bl -column "X:X" "<00000000>" "width" "bright foreground color"
.Sy "bits#		width	meaning"
.Li "7	<X0000000>	1	character blinking"
.Li "6:4	<0XXX0000>	3	background color"
.Li "3	<0000X000>	1	bright foreground color"
.Li "2:0	<00000XXX>	3	foreground color"
.El
.Pp
Вот список базовых цветов шириной в три бита:
.Pp
.Bl -hang -offset indent -compact
.It 0
Черный
.It 1
Синий
.It 2
Зеленый
.It 3
Голубой
.It 4
Красный
.It 5
Пурпурный
.It 6
Коричневый
.It 7
Светло-серый
.El
.Pp
Базовые цвета с установленным битом 3 (флаг яркого переднего плана):
.Pp
.Bl -hang -offset indent -compact
.It 0
Темно-серый
.It 1
Светло-синий
.It 2
Светло-зеленый
.It 3
Светло-голубой
.It 4
Светло-красный
.It 5
Светло-пурпурный
.It 6
Желтый
.It 7
Белый
.El
.Pp
Например два байта
.Pp
.Dl "65 158"
.Pp
указывают заглавную букву A (код символа 65), мигающую
(установлен бит 7) желтым цветом (биты 3:0) на синем фоне
(bits 6:4).
.Pp
Выходные данные
.Nm
содержат небольшой заголовок, который содержит дополнительную
информацию, которая может быть полезна утилитам, обрабатывающим
выходные данные.
.Pp
Первые 10 байт всегда располагаются следующим образом:
.Bl -column "Byte range" "Contents" -offset indent
.It Sy "Byte Range	Contents"
.It "1 - 8	Literal text" Dq Li SCRSHOT_
.It "9	File format version number"
.It "10	Remaining number of bytes in the header"
.El
.Pp
Последующие байты зависят от номера версии.
.Bl -column "Version" "13 and up" -offset indent
.It Sy "Version	Byte	Meaning"
.It "1	11	Terminal width, in characters"
.It "	12	Terminal depth, in characters"
.It "	13 and up	The snapshot data"
.El
.Pp
So a dump of an 80x25 screen would start (in hex)
.Bd -literal -offset indent
53 43 52 53 48 4f 54 5f 01 02 50 19
----------------------- -- -- -- --
          |              |  |  |  ` 25 decimal
          |              |  |  `--- 80 decimal
          |              |  `------ 2 remaining bytes of header data
          |              `--------- File format version 1
          `------------------------ Literal "SCRSHOT_"
.Ed
.Sh КОНФИГУРАЦИЯ ВИДЕОВЫХОДА
.Ss Boot Time Configuration
Вы можете установить следующие переменные в
.Pa /etc/rc.conf
или
.Pa /etc/rc.conf.local
чтобы настроить видеовыход во время загрузки.
.Pp
.Bl -tag -width foo_bar_var -compact
.It Ar blanktime
Устанавливает значение паузы для параметра
.Fl t
.
.It Ar font8x16 , font8x14 , font8x8
Определяет файлы шрифтов для параметра
.Fl f
.
.It Ar scrnmap
Определяет файл карты вывода на экран для параметра
.Fl l
.
.El
.Pp
См.
.Xr rc.conf 5
для получения более подробной информации.
.Ss Driver Configuration
Драйвер видеокарты может позволить вам изменить параметры конфигурации
по умолчанию, такие как шрифт по умолчанию, так что вам не нужно будет настраивать
параметры во время загрузки.
Смотрите руководства по драйверам видеокарт (напр.,
.Xr vga 4 )
для деталей
.Sh ФАЙЛЫ
.Bl -tag -width /usr/share/syscons/scrnmaps/foo-bar -compact
.It Pa /usr/share/syscons/fonts/*
.It Pa /usr/share/vt/fonts/*
файлы шрифтов.
.It Pa /usr/share/syscons/scrnmaps/*
файлы карт вывода на экран (соответствующие только для
.Xr syscons 4
).
.El
.Sh ПРИМЕРЫ
Если вы хотите загрузить
.Pa /usr/share/syscons/fonts/iso-8x16.fnt
к ядру, запустите
.Nm
as:
.Pp
.Dl vidcontrol -f 8x16 /usr/share/syscons/fonts/iso-8x16.fnt
.Pp
До тех пор, пока файл шрифта находится в
.Pa /usr/share/syscons/fonts
(при использовании системы syscons) или
.Pa /usr/share/vt/fonts
(при использовании vt),
вы можете сократить имя файла как
.Pa iso-8x16 :
.Pp
.Dl vidcontrol -f 8x16 iso-8x16
.Pp
Кроме того, вы также можете не указывать размер шрифта
.Dq Li 8x16 :
.Pp
.Dl vidcontrol -f iso-8x16
.Pp
Кроме того, суффикс, указывающий размер шрифта, также может быть опущен; в
этом случае,
.Nm
будет использовать размер отображаемого в данный момент шрифта для создания
суффикса:
.Pp
.Dl vidcontrol -f iso
.Pp
Аналогичным образом, вы также можете сократить имя файла карты, выводимой на экран, для параметра
.Fl l
если файл найден в
.Pa /usr/share/syscons/scrnmaps .
.Pp
.Dl vidcontrol -l iso-8859-1_to_cp437
.Pp
Приведенная выше команда загрузит
.Pa /usr/share/syscons/scrnmaps/iso-8859-1_to_cp437.scm .
.Pp
Следующая команда настроит режим растрового текста размером 100х37 (полезно для
некоторых моделей ЖК-дисплеев).:
.Pp
.Dl vidcontrol -g 100x37 VESA_800x600
.Pp
Следующая команда захватит содержимое первого
видеобуфера виртуального терминала и перенаправит выходные данные в
.Pa shot.scr
файл:
.Pp
.Dl vidcontrol -p < /dev/ttyv0 > shot.scr
.Pp
Следующая команда преобразует содержимое четвертого видеобуфера виртуального терминала
в стандартный вывод в удобочитаемом формате:
.Pp
.Dl vidcontrol -P < /dev/ttyv3
.Sh СМОТРИТЕ ТАКЖЕ
.Xr kbdcontrol 1 ,
.Xr vidfont 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr vt 4 ,
.Xr rc.conf 5 ,
.Xr kldload 8 ,
.Xr moused 8 ,
.Xr watch 8
.Pp
Различные утилиты
.Pa scr2*
в
.Pa graphics
и
.Pa textproc
категориях
.Em "Ports Collection" .
.Sh АВТОРЫ
.An S\(/oren Schmidt Aq Mt sos@FreeBSD.org
.An Саша Вильднер Aq Mt saw@online.de
.Sh УЧАСТНИКИ
.An -split
.An Максим Соболев  Aq Mt sobomax@FreeBSD.org
.An Ник Клейтон Aq Mt nik@FreeBSD.org
