melkorbsd/ru-freebsd-man/man1/whereis.1
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Copyright 2002	Joerg Wunsch
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)whereis.1	8.2 (Berkeley) 12/30/93
.\"
.Dd Август 22, 2002
.Dt WHEREIS 1
.Os
.Sh ИМЯ
.Nm whereis
.Nd поиск программ
.Sh КРАТКОЕ СОДЕРЖАНИЯ
.Nm
.Op Fl abmqsux
.Op Fl BMS Ar dir ... Fl f
.Ar program ...
.Sh ОПИСАНИЕ
Утилита
.Nm
проверяет стандартный двоичный файл, страницу руководства и исходный код 
каталоги для указанных программ, распечатывая пути к любым из них, 
которые она находит
Поставляемый названия программы сначала раздели ведущих путь наименование компонентов, ни один продольный расширения, добавленные с помощью
.Xr gzip 1 ,
.Xr compress 1 ,
или
.Xr bzip2 1 ,
и лидирующий
.Ql s.\&
или трейлинг
.Ql ,v
из системы управления исходным кодом.
.Pp
Путь по умолчанию представляет собой строку, возвращаемую утилитой
.Xr sysctl 8
для строки
.Dq user.cs_path
с
.Pa /usr/libexec
и текущего
.Ev $PATH
пользователя
Поиск по страницам руководства осуществляется по умолчанию вместе с
.Ev $MANPATH .
Исходные тексты программы расположены в списке известных стандартных мест, 
включая все подкаталоги
.Pa /usr/src
и
.Pa /usr/ports .
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl B
Указывает каталоги для поиска двоичных файлов. 
Требуется параметр
.Fl f .
.It Fl M
Указывает каталоги для поиска страниц руководства. 
Требуется параметр
.Fl f .
.It Fl S
Указывает каталоги для поиска исходных текстов программы. 
Требуется параметр
.Fl f .
.It Fl a
Докладывает о всех совпадениях, а не только о первых с каждого запроса.
.It Fl b
Поиск двоичных файлов
.It Fl f
Определяет границы списка каталогов после 
.Fl B ,
.Fl M ,
или
.Fl S
параметров, указывает начало списка 
.Ar program .
.It Fl m
Поиск страниц руководства.
.It Fl q
.Pq Dq quiet .
Отключает вывод названия утилиты перед обычной строкой вывода. 
Это может пригодиться для использования в замене командной строки командной строки в кавычках, см 
.Sx ПРИМЕРЫ.
.It Fl s
Выполняет поиск исходных каталогов.
.It Fl u
Поиск
.Dq необычными
записей.
Файл считается необычным, если в нем нет хотя бы 
одной записи каждого запрошенного типа.
Печатается только название необычной записи.
.It Fl x
Не использует
.Dq дорогие
инструменты при поиске исходных указаний.
Обычно, после безуспешного исследования полностью первого уровня подкаталогов из списка исходного каталог, 
.Nm
попросит
.Xr locate 1
найти запись от его имени
Поскольку это может занять гораздо больше времени, его можно отключить с помощью
.Fl x .
.El
.Sh ПРИМЕРЫ
Следующий находит все коммунальные услуги в соответствии с
.Pa /usr/bin
не имеющие документации:
.Pp
.Dl whereis -m -u /usr/bin/*
.Pp
Переходит к каталогу исходного кода
.Xr ls 1 :
.Pp
.Dl cd `whereis -sq ls`
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr find 1 ,
.Xr locate 1 ,
.Xr man 1 ,
.Xr which 1 ,
.Xr sysctl 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Bx 3.0 .
В этой версии повторно реализована историческая функциональность, 
которая была утрачена в версии 
.Bx 4.4 .
.Sh АВТОРЫ
Эта реализация команды 
.Nm
была написана
.An J\(:org Wunsch .
.Sh ОШИБКИ
Эта повторная реализация утилиты
.Nm
не совместима с историческими версиями "ошибка за ошибкой".
Считается, что он совместим с версией, которая поставлялась с 
.Fx 2.2
через
.Fx 4.5
через.
.Pp
Утилита
.Nm
может сообщать о некоторых несвязанных исходных записях, если указан параметр
.Fl a .
