melkorbsd/ru-freebsd-man/man1/xargs.1
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" John B. Roll Jr. and the Institute of Electrical and Electronics
.\" Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)xargs.1	8.1 (Berkeley) 6/6/93
.\" $xMach: xargs.1,v 1.2 2002/02/23 05:23:37 tim Exp $
.\"
.Dd Сентябрь 21, 2020
.Dt XARGS 1
.Os
.Sh ИМЯ
.Nm xargs
.Nd "создает список(ки) аргументов и запускает утилиту"
.Sh СИНТАКСИС
.Nm
.Op Fl 0oprt
.Op Fl E Ar eofstr
.Oo
.Fl I Ar replstr
.Op Fl R Ar замены
.Op Fl S Ar replsize
.Oc
.Op Fl J Ar replstr
.Op Fl L Ar номер
.Oo
.Fl n Ar номер
.Op Fl x
.Oc
.Op Fl P Ar maxprocs
.Op Fl s Ar размер
.Op Ar utility Op Ar argument ...
.Sh ОПИСАНИЕ
Утилита
.Nm
считывает строки, разделенные пробелом, табуляцией, новой строкой и концом файла, из стандартного ввода и выполняет
.Ar утилиту
с строками в качестве аргумента.
.Pp
Все аргументы, указанные в командной строке, передаются 
.Ar утилите
при каждом вызове, за которым следует некоторое количество аргументов, считываемых
из стандартного ввода
.Nm .
Это повторяется до тех пор, пока не будет исчерпан стандартный ввод.
.Pp
Пробелы, символы табуляции и новые строки могут быть вставлены в аргументы с помощью одинарные
(``\ '\ '')
или двойныйх (``"'') кавычек или обратной косой черты (``\e'').
Одинарные кавычки заключают в себя все символы, не заключенные в одинарные кавычки, за исключением перевода строки,
вплоть до соответствующей одинарной кавычки.
Двойные кавычки заключают в себя все символы, не заключенные в двойные кавычки, за исключением перевода строки,
вплоть до соответствующей двойной кавычки.
Любой отдельный символ, включая символы новой строки, может быть экранирован обратной косой чертой.
Возможны следующие параметры:
.Bl -tag -width indent
.It Fl 0 , Fl -null
Менять
.Nm
на ожидание нулевого значения
(``\\0'')
символы в качестве разделителей вместо пробелов и новой строки.
Подразумевается, что это будет использоваться совместно с функцией
.Fl print0
в
.Xr find 1 .
.It Fl E Ar eofstr
Использовать
.Ar eofstr
в качестве логического маркера EOF.
.It Fl I Ar replstr
Исключать
.Ar утилиту
для каждой строки ввода, заменяя одно или несколько вхождений в
.Ar replstr
вплоть до
.Ar замен
(или до 5, если флаги
.Fl R
не указаны) аргументы к
.Ar утилите
со всей строкой ввода.
Результирующим аргументам после выполнения замены не будет разрешено выходить
за пределы
.Ar replsize
(или за 255, если флаг
.Fl S
не указан)
байт; это реализуется с помощью объединения как можно большей части аргумента, содержащего
.Ar replstr
насколько это возможно, к построенным аргументам для
.Ar утилиты ,
вплоть до
.Ar replsize
байт.
Ограничение по размеру не применяется к аргументам для
.Ar утилиты ,
которая не содержит
.Ar replstr ,
и, кроме того, никакая замена не будет производиться на саму
.Ar утилиту
.
Подразумевается, что
.Fl x .
.It Fl J Ar replstr
Если этот параметр указан, то 
.Nm
будет использовать данные, считанные из стандартного ввода, для замены первого вхождения
.Ar replstr
вместо того, чтобы добавлять эти данные после всех остальных аргументов.
Этот параметр не повлияет на то, сколько аргументов будет считываться из входных данных
.Pq Fl n ,
или размер команды(команд)
.Nm
сформирует
.Pq Fl s .
Параметр просто перемещает место, где эти аргументы будут помещены в выполняемые команды.

.Ar replstr
должен проявиться как отдельный
.Ar аргумент
к
.Nm .
Оно не будет распознано, если, например, оно находится в середине
строки, заключенной в кавычки.
Более того, только первое вхождение
.Ar replstr
будет заменено.
Например, следующая команда скопирует список файлов и
каталогов, которые начинаются с заглавной буквы в текущем
каталоге, в
.Pa destdir :
.Pp
.Dl /bin/ls -1d [A-Z]* | xargs -J % cp -Rp % destdir
.It Fl L Ar number
Call
.Ar utility
для каждого
.Ar номера
прочитанной строки.
Если достигнуто значение EOF и было прочитано меньше строк, чем
.Ar указанное число ,
тогда
.Ar утилита
будет вызван с помощью доступных строк.
.It Fl n Ar number , Fl -max-args= Ns Ar number
Устанавливает максимальное количество аргументов, получаемых из стандартного ввода, для каждого вызова
.Ar утилиты .
Вызов
.Ar утилиты
использует меньшее
.Ar число ,
чем стандартные входные аргументы, если количество накопленных байт (см. параметр
.Fl s
) превышает заданный
.Ar размер
или их меньше, чем
.Ar число
аргументов, оставшихся для последнего вызова
.Ar утилиты .
Текущим значением по умолчанию для
.Ar числа
является 5000.
.It Fl o
Переоткрывать stdin в качестве
.Pa /dev/tty
в дочернем процессе перед выполнением команды.
Это пригождается, если вы хотите
.Nm
запустить интерактивное приложение
.It Fl P Ar maxprocs , Fl -max-procs= Ns Ar maxprocs
Параллельный режим: работает не более
.Ar maxprocs
вызовов 
.Ar утилиты
одновременно.
Если
.Ar maxprocs
значение установлено на 0, то
.Nm
будет запущено как можно больше процессов.
.It Fl p , Fl -interactive
Повторять каждую команду, которая должна быть выполнена, и спрашивайте пользователя, следует ли ее выполнять.
Положительный ответ,
.Ql y
в языковом стандарте POSIX
вызывает выполнение команды, любой другой ответ приводит к ее
пропуску.
Команды не выполняются, если процесс не подключен к терминалу.
.It Fl r , Fl -no-run-if-empty
Совместимость с GNU
.Nm .
Версия GNU для
.Nm
запускает аргумент
.Ar утилиты
хотя бы один раз, даже если
.Nm
входные данные пусты, и он поддерживает параметр
.Fl r ,
чтобы исключить такое поведение.
Версия
.Fx
.Nm
не запускает
.Ar утилиту
аргумента для пустых входных данных, но она поддерживает параметр
.Fl r
для обеспечения совместимости командной строки с GNU
.Nm ,
но параметр
.Fl r
не имеет никакого значения
.Fx
в версии
.Nm .
.It Fl R Ar замены
Указывать максимальное количество аргументов, которые
.Fl I
сделают замену.
Если
.Ar замены
является отрицательным, количество аргументов, в которых требуется замена, не ограничено.
.It Fl S Ar replsize
Указывать объем пространства (в байтах), который
.Fl I
может быть использован для замены.
Значением по умолчанию для
.Ar replsize
является 255.
.It Fl s Ar размер , Fl -max-chars= Ns Ar размер
Устанавливать максимальное количество байт для длины командной строки, указанной в
.Ar утилите .
Итоговое значение длины имени утилиты, аргументов, переданы в
.Ar утилиту
(в том числе и
.Dv NULL
терминалы) и текущая среда окажется меньше или равна
этому значению.
Текущим значением по умолчанию для
.Ar размера
является
.Dv ARG_MAX
- 4096.
.It Fl t , Fl -verbose
Выводит команду, которая должна быть выполнена, на стандартную ошибку непосредственно перед ее выполнением.
.It Fl x , Fl -выход
Принудительно
.Nm
завершать работу немедленно, если командная строка, содержащая
.Ar число
аргументов не будет вписываться в указанную (или установленную по умолчанию) длину командной строки.
.El
.Pp
Если
.Ar утилита
опущена, тто используется
.Xr echo 1
.
.Pp
Неопределенное поведение может возникнуть, если
.Ar утилита
считывается из стандартного ввода.
.Pp
Если командная строка не может быть собрана или вызвана, или если вызов
.Ar утилиты
приостанавливается сигналом,
или вызовом 
.Ar утилиты ,
то работа завершается при значении 255,
.Nm
утилита прекращает обработку входных данных и завершает работу после того, как все вызовы
.Ar утилиты
заканчивают обработку.
.Sh СТАТУС ВЫХОДА
Утилита
.Nm
завершает работу со значением 0, если не возникает никаких ошибок.
Если
.Ar утилита
не может быть обнаружена,
.Nm
завершает работу со значением 127, в противном случае, если
.Ar утилита
не может быть выполнена,
.Nm
завершает работу со значением 126.
Если возникают какие-либо другие ошибки,
.Nm
завершает работу со значением 1.
.Sh ПРИМЕРЫ
Создание матрицы 3x3 с числами от 1 до 9.
Каждый
.Xr echo 1
экземпляр получает в качестве аргументов три строки:
.Bd -literal -offset indent
$ seq 1 9 | xargs -L3 echo
1 2 3
4 5 6
7 8 9
.Ed
.Pp
Дублирует каждую строку из стандартного ввода:
.Bd -literal -offset indent
$ echo -e "one\\ntwo\\nthree" | xargs -I % echo % %
one one
two two
three three
.Ed
.Pp
Выполняет одновременно не более двух экземпляров
.Xr find 1
каждый из которых использует один из каталогов стандартного ввода:
.Bd -literal -offset indent
echo -e "/usr/ports\\n/etc\\n/usr/local" | xargs -J % -P2 -n1 find % -имя файла
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr echo 1 ,
.Xr find 1 ,
.Xr execvp 3
.Sh СТАНДАРТЫ
Утилита
.Nm
должна соответствовать 
.St -p1003.2
стандарту.
Параметры
.Fl J , o , P , R
и
.Fl S
являются нестандартными
.Fx
расширениями, которые могут быть недоступны в других операционных системах.
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в PWB UNIX.
.Sh ОШИБКИ
Если
.Ar утилита
попытается вызвать другую команду таким образом, чтобы увеличить количество аргументов или
размер среды, это может привести к риску
.Xr execvp 3
потерпеть неудачу с
.Er E2BIG .
.Pp
Утилита
.Nm
не учитывает многобайтовые символы при выполнении
сравнения строк для параметров
.Fl I
и
.Fl J
что может привести к неверным результатам в некоторых задействованных местах.
