melkorbsd/ru-freebsd-man/man5/acct.5
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)acct.5	8.1 (Berkeley) 6/5/93
.\"
.Dd 13 февраля, 2017
.Dt ACCT 5
.Os
.Sh ИМЯ
.Nm acct
.Nd файл учёта выполнения 
.Sh СИНТАКСИС
.In sys/types.h
.In sys/acct.h
.Sh ОПИСАНИЕ
Ядро поддерживает следующую структуру
.Fa acct
информации для всех
процессов.
Если процесс завершает работу и учёт включён,  
ядро вызывает функцию
.Xr acct 2
для подготовки и добавления записи
в файл учёта.  
.Bd -literal
#define AC_COMM_LEN 16

/*
 * Структура учёта версия 3 (текущая).
 * Первый байт всегда равен нулю.
 * Единицы времени — микросекунды.
 */

struct acctv3 {
	uint8_t  ac_zero;		/* ноль идентифицирует новую версию */
	uint8_t  ac_version;		/* номер версии записи */
	uint16_t ac_len;		/* длина записи */

	char	  ac_comm[AC_COMM_LEN];	/* имя команды */
	float	  ac_utime;		/* время пользователя */
	float	  ac_stime;		/* системное время */
	float	  ac_etime;		/* прошедшее время */
	time_t	  ac_btime;		/* время начала */
	uid_t	  ac_uid;		/* идентификатор пользователя */
	gid_t	  ac_gid;		/* идентификатор группы */
	float	  ac_mem;		/* среднее использование памяти */
	float	  ac_io;		/* количество IO блоков */
	__dev_t   ac_tty;		/* управляющий tty */

	uint16_t ac_len2;		/* длина записи */
	union {
		uint32_t  ac_align;	/* выравнивание для совместимости с v1 */

#define	AFORK	0x01			/* был вызван fork, но не exec'ed */
/* ASU больше не поддерживается */
#define	ASU	0x02			/* использованы права суперпользователя */
#define	ACOMPAT	0x04			/* использован режим совместимости */
#define	ACORE	0x08			/* создан дамп памяти */
#define	AXSIG	0x10			/* убит сигналом */
#define ANVER	0x20			/* новая версия записи */

		uint8_t  ac_flag;	/* флаги учёта */
	} ac_trailer;

#define ac_flagx ac_trailer.ac_flag
};
.Ed
.Pp
Если завершённый процесс был создан с помощью имя
.Xr execve 2 ,
исполняемого файла (не более десяти символов)  
сохраняется в поле
.Fa ac_comm
и его статус сохраняется путём установки одного или нескольких из следующих флагов в  
.Fa ac_flag :
.Dv AFORK ,
.Dv ACOMPAT ,
.Dv ACORE
и
.Dv ASIG .
.Dv ASU
больше не поддерживается.  
.Dv ANVER
всегда установлен в вышеуказанной структуре.
.Sh СМОТРИ ТАКЖЕ
.Xr lastcomm 1 ,
.Xr acct 2 ,
.Xr execve 2 ,
.Xr sa 8
.Sh ИСТОРИЯ
Формат файла  
.Nm
появился в 
.At v7 .
Текущий формат записи был введён в мае 2007 года.  
Он обратно совместим с предыдущим форматом,  
который всё ещё документирован в 
.In sys/acct.h
и поддерживается командами  
.Xr lastcomm 1
и
.Xr sa 8 .