melkorbsd/ru-freebsd-man/man5/adduser.conf.5
.\"
.\" Copyright (c) 2004 Tom Rhodes
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 12 апреля, 2007
.Dt ADDUSER.CONF 5
.Os
.Sh ИМЯ
.Nm adduser.conf
.Nd
.Xr adduser 8
8 файл конфигурации 
.Sh ОПИСАНИЕ
Файл
.Pa /etc/adduser.conf
автоматически создается
.Xr adduser 8
утилитой при вызове с
.Fl C
параметром.
Он не предназначен для редактирования вручную.
.Pp
Файл
.Pa /etc/adduser.conf
используется для предварительной настройки определенных параметров конфигурации 
для
.Xr adduser 8
утилиты.
Когда
.Xr adduser 8
вызывается, он проверяет, существует ли этот файл, и,
если да, то конфигурация будет использована или предложена в качестве 
настроек по умолчанию.
Файл
.Nm
предлагает три типа конфигурации: 
.Bl -bullet
.It
Настройки по умолчанию, предлагаемые 
.Xr adduser 8 .
Эти параметры указаны в конфигурационном файле и предлагаются 
по умолчанию при каждом вызове
.Xr adduser 8
утилиты.
.It
Параметры конфигурации, которые могут быть установлены в 
.Nm ,
но могут быть переопределены путем передачи флага в 
.Xr adduser 8 .
.It
Конфигурация, поддерживаемая 
.Xr adduser 8
но не предлагающаяся через флаг или во время начального вызова. 
.El
.Pp
В первом случае эти параметры могут быть установлены в 
.Nm
но все равно будут предложены, когда
.Xr adduser 8
вызывается.
Во втором случае ,
.Xr adduser 8
будет читать данные конфигурации, если не был передан флаг 
для их переопределения. 
Например,
.Va defaultshell
параметр.
В третьем случае конфигурация будет использоваться, но 
пользователь никогда не будет запрашиваться изменить настройки по умолчанию 
ни с помощью флага, ни через 
.Xr adduser 8
запрос.
Например,
.Va upwexpire
настройка.
.Pp
Следующие параметры конфигурации могут быть установлены в
.Nm :
.Bl -tag -width ".Va defaultgroups" -offset indent
.It Va defaultLgroup
Группа по умолчанию, в которую будут добавлены новые пользователи
.It Va defaultclass
Класс по умолчанию, в который помещаются пользователи, как описано в 
.Xr login.conf 5 .
.It Va defaultgroups
Этот параметр используется для указания других групп, в которые 
должна быть добавлена новая учетная запись.
.It Va passwdtype
Может быть одним из значений
.Cm no , none , random ,
или
.Cm yes ,
как описано в 
.Xr adduser 8 .
Поэтому текст не дублируется здесь и может быть
прочитан в
.Xr adduser 8 .
.It Va homeprefix
Префикс домашнего каталога по умолчанию, обычно
.Pa /home .
.It Va defaultshell
Шелл по умолчанию для пользователя, который может быть любым из шеллов, указанных в 
.Xr shells 5 .
.It Va udotdir
Определяет местоположение файлов конфигурации по умолчанию 
для шелла и окружения.
.It Va msgfile
Местоположение файла сообщения для новых пользователей по умолчанию.
Это сообщение будет отправлено всем новым пользователям, если указано
здесь или от
.Xr adduser 8
запроса.
.It Va disableflag
Сообщение по умолчанию, заключенное в скобки для
запроса блокировки учетной записи.
.It Va upwexpire
Время истечения срока действия пароля по умолчанию.
Формат даты — либо
.Ux
в десятичном формате, либо дата в
.Sm off
.Ar dd No - Ar mmm No - Ar yy Op Ar yy
.Sm on
формате, где
.Ar dd
это день,
.Ar mmm
это месяц в числовом или 
алфавитном формате, и
.Ar yy Ns Op Ar yy
это либо двухзначный, либо четырехзначный год. 
Этот параметр также принимает относительную дату в форме
.Sm off
.Ar n Op Ar m h d w o y
.Sm on
где
.Ar n
это десятичная, восьмеричная (с ведущим 0) или шестнадцатеричная (с ведущим 0x) цифра,
за которой следует количество минут, часов, дней, недель, месяцев или 
лет от текущей даты
на которое будет установлено время истечения срока действия.
.It Va uexpire
Время истечения срока действия учетной записи по умолчанию. 
Формат аналогичен
.Va upwexpire
параметру.
.It Va ugecos
Информация по умолчанию, которая будет храниться в поле GECOS файла
.Pa /etc/master.passwd .
.It Va uidstart
Настройка идентификатора пользователя по умолчанию. 
Это должно быть число выше 1000 и меньше 65534.
.It Va Zflag
Не пытайтесь создать набор данных ZFS для домашнего каталога.
.El
.Sh ПРИМЕРЫ
Следующий пример показывает
.Nm
файл созданный с помощью
.Fl C
.Xr adduser 8
флага и модифицированный.
.Bd -literal -offset indent
# Конфигурационный файл для adduser(8).
# ЗАМЕТКА: сохраняются только *некоторые* переменные.
# Последнее изменение в пятницу 30 марта 14:04:05 EST 2004.

defaultLgroup=
defaultclass=
defaultgroups=
passwdtype=yes
homeprefix=/home
defaultshell=/bin/csh
udotdir=/usr/share/skel
msgfile=/etc/adduser.msg
disableflag=
upwexpire=91d # Срок действия паролей истекает через 91 день после создания.
.Ed
.Sh СМОТРИ ТАКЖЕ
.Xr group 5 ,
.Xr passwd 5 ,
.Xr adduser 8 ,
.Xr pw 8 ,
.Xr rmuser 8
.Sh ИСТОРИЯ
Страница руковдства
.Nm
впервые появилась в
.Fx 5.3 .
.Sh АВТОРЫ
Эта страница руководства была написана
.An Tom Rhodes Aq Mt trhodes@FreeBSD.org .
.Sh ОШИБКИ
Внутренние переменные, описанные здесь, могут изменяться без предварительного уведомления.
Не полагайтесь на них.
Чтобы изменить этот файл, вызовите
.Xr adduser 8
с
.Fl C
опцией вместо этого.
