melkorbsd/ru-freebsd-man/man5/aliases.5
.\" Copyright (c) 1998-2000 Proofpoint, Inc. and its suppliers.
.\"	 All rights reserved.
.\" Copyright (c) 1983, 1997 Eric P. Allman.  All rights reserved.
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     $Id: aliases.5,v 8.20 2013-11-22 20:51:55 ca Exp $
.\"
.TH ALIASES 5 "$Date: 2013-11-22 20:51:55 $"
.SH ИМЯ
aliases
\- aliases - файл псевдонимов для sendmail
.SH СИНТАКСИС
.B aliases
.SH ОПИСАНИЕ
Этот файл описывает пользовательские
ID
псевдонимы, используемые
sendmail.
Файл находится в
/etc/mail
и
форматируется как серия строк вида
.IP
name: addr_1, addr_2, addr_3, . . .
.PP
The
.I name
это имя для псевдонима, а
.I addr_n
псевдонимы для этого имени. 
.I addr_n
может быть другим псевдонимом, локальным именем пользователя, локальным файлом,
командой, 
файлом включения
или внешним адресом.
.TP
.B Локальное имя пользователя
username
.IP
Имя пользователя должно быть доступно через getpwnam(3).
.TP
.B Локальный файл
/path/name
.IP
Сообщения добавляются в файл, указанный полным путем 
(начинающимся со слеша (/))
.TP
.B Команда
|command
.IP
Команда начинается с символа вертикальной черты (|),
она получает сообщения через стандартный ввод.
.TP
.B Файл включения
:include: /path/name
.IP
Псевдонимы в указанном пути добавляются к псевдонимам для
.I name.
.TP
.B E-Mail адрес
user@domain
.IP
E-mail адрес в формате RFC 822.
.PP
Строки, начинающиеся с пробела, являются продолжением строк. 
Другим способом продолжения строк является размещение обратной косой черты 
непосредственно перед новой строкой. 
Строки, начинающиеся с
#
являются комментариями.
.PP
Псевдонимизация происходит только для локальных имен.
Циклы не могут возникать, так как ни одно сообщение не будет отправлено ни одному человеку более одного раза.
.PP
Если найден псевдоним для
.IR name ,
sendmail затем проверяет наличие псевдонима для 
.IR owner-name .
Если он найден и результат поиска расширяется до единственного 
адреса, адрес отправителя сообщения переписывается на
этот адрес.
Если он найден и результат расширяется до нескольких адресов, 
адрес отправителя изменяется на
.IR owner-name .
.PP
После завершения псевдонимизации локальные и действительные получатели, у которых есть файл
``.forward''
в домашнем каталоге, получают сообщения, перенаправленные на
список пользователей, определенных в этом файле.
.PP
Это только необработанный файл данных; фактическая информация о псевдонимах 
помещается в бинарный формат в файл 
/etc/mail/aliases.db
с помощью программы 
newaliases(1).
Команда
newaliases
должна выполняться каждый раз, когда файл псевдонимов изменяется, чтобы 
изменения вступили в силу.
.SH СМОТРИ ТАКЖЕ
newaliases(1),
dbm(3),
dbopen(3),
db_open(3),
sendmail(8)
.PP
.I
SENDMAIL Установка и эксплуатация почтового маршрутизатора.
.PP
.I
SENDMAIL Межсетевой почтовый маршрутизатор.
.SH ОШИБКИ
Если вы скомпилировали
sendmail
с поддержкой DBM вместо NEWDB,
вы могли столкнуться с проблемами в 
dbm(3)
ограничивающими один псевдоним примерно 1000 байт информации.
Вы можете получить более длинные псевдонимы, "связывая"; то есть сделать последнее имя в 
псевдониме фиктивным именем, которое является продолжением псевдонима.
.SH ИСТОРИЯ
Формат файла
.B aliases
псевдонимов появился в
4.0BSD.