melkorbsd/ru-freebsd-man/man5/audit_class.5
.\" Copyright (c) 2004 Apple Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1.  Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\" 2.  Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\" 3.  Neither the name of Apple Inc. ("Apple") nor the names of
.\"     its contributors may be used to endorse or promote products derived
.\"     from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY APPLE AND ITS CONTRIBUTORS "AS IS" AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL APPLE OR ITS CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 24 января,2004 
.Dt AUDIT_CLASS 5
.Os
.Sh ИМЯ
.Nm audit_class.Nd "описания классов событий аудита"
.Sh ОПИСАНИЕ
Файл
.Nm 
содержит описания классов событий, подлежащих аудиту, в системе. 
Каждое событие аудита является членом класса события.
Каждая строка сопоставляет маску события аудита (битовую карту) 
с классом и описанием. Записи имеют следующий формат:
.Pp
.D1 Ar classmask Ns : Ns Ar eventclass Ns : Ns Ar description
.Pp
Примеры записей в этом файле:
.Bd -literal -offset indent
0x00000000:no:недопустимый класс
0x00000001:fr:чтение файла
0x00000002:fw:запись файла
0x00000004:fa:доступ к атрибутам файла
0x00000080:pc:процесс
0xffffffff:all:все флаги установлены
.Ed
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/security/audit_class" -compact
.It Pa /etc/security/audit_class
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr audit 4 ,
.Xr audit_control 5 ,
.Xr audit_event 5 ,
.Xr audit_user 5
.Sh ИСТОРИЯ
Реализация OpenBSM была создана McAfee Research, исследовательским подразделением безопасности McAfee Inc., по контракту с Apple Computer Inc. в 2004 году. 
Позже она была принята проектом TrustedBSD как основа
для дистрибутива OpenBSM.
.Sh АВТОРЫ
.An -nosplit
Это программное обеспечение было создано McAfee Research, исследовательским подразделением безопасности McAfee, Inc., по контракту с Apple Computer Inc. Дополнительные авторы включают:
.An Уэйн Саламан,
.An Роберт Уотсон,
и SPARTA Inc.
.Pp
Интерфейс Основного Модуля Безопасности (BSM) для аудиторских записей и формат потока событий аудита были определены компанией Sun Microsystems.