melkorbsd/ru-freebsd-man/man5/audit_event.5
.\" Copyright (c) 2004 Apple Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1.  Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\" 2.  Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\" 3.  Neither the name of Apple Inc. ("Apple") nor the names of
.\"     its contributors may be used to endorse or promote products derived
.\"     from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY APPLE AND ITS CONTRIBUTORS "AS IS" AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL APPLE OR ITS CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 24 января,2004
.Dt AUDIT_EVENT 5
.Os
.Sh ИМЯ
.Nm audit_event
.Nd "описания событий аудита"
.Sh ОПИСАНИЕ
Файл
.Nm 
содержит описания событий, подлежащих аудиту, в системе.
Каждая строка сопоставляет номер события аудита с именем, описанием и классом. Записи имеют следующий формат:
.Pp
.Sm off
.D1 Ar eventnum : eventname : description : eventclass
.Sm on
.Pp
Каждый
.Ar eventclass 
должен иметь соответствующую запись в файле
.Xr audit_class 5.
.Pp
Примеры записей в этом файле:
.Bd -literal -offset indent
0:AUE_NULL:недопустимый системный вызов:no
1:AUE_EXIT:выход(2):pc
2:AUE_FORK:fork(2):pc
3:AUE_OPEN:open(2):fa
.Ed
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/security/audit_event" -compact
.It Pa /etc/security/audit_event
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr audit 4 ,
.Xr audit_class 5 ,
.Xr audit_control 5 ,
.Xr audit_user 5
.Sh ИСТОРИЯ
Реализация OpenBSM была создана McAfee Research, исследовательским подразделением безопасности McAfee Inc., по контракту с Apple Computer Inc. в 2004 году. 
Позже она была принята проектом TrustedBSD как основа 
для дистрибутива OpenBSM.
.Sh АВТОРЫ
.An -nosplit
Это программное обеспечение было создано McAfee Research, исследовательским подразделением безопасности McAfee, Inc., по контракту с Apple Computer Inc. Дополнительные авторы включают:
.An Уэйн Саламан,
.An Роберт Уотсон,
и SPARTA Inc.
.Pp
Интерфейс Основного Модуля Безопасности (BSM) для аудиторских записей и формат потока событий аудита были определены компанией Sun Microsystems.