melkorbsd/ru-freebsd-man/man5/audit_warn.5
.\" Copyright (c) 2004 Apple Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1.  Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\" 2.  Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\" 3.  Neither the name of Apple Inc. ("Apple") nor the names of
.\"     its contributors may be used to endorse or promote products derived
.\"     from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY APPLE AND ITS CONTRIBUTORS "AS IS" AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL APPLE OR ITS CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 17 марта, 2004
.Dt AUDIT_WARN 5
.Os
.Sh ИМЯ
.Nm audit_warn
.Nd "уведомление при выдаче предупреждений демоном аудита"
.Sh ОПИСАНИЕ
Скрипт
.Nm
выполняется, когда
.Xr auditd 8
генерирует сообщения предупреждений.
.Pp
По умолчанию
.Nm
является скриптом, первый параметр которого — это тип предупреждения; скрипт
добавляет свои аргументы в файл
.Pa /etc/security/audit_messages.
Администраторы могут заменить этот скрипт: более комплексный скрипт может
выполнять различные действия в зависимости от типа предупреждения.
Например, предупреждение о низком уровне дискового пространства
может привести к отправке электронного письма администратору.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/security/audit_messages" -compact
.It Pa /etc/security/audit_warn
.It Pa /etc/security/audit_messages
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr audit 4,
.Xr auditd 8.
.Sh ИСТОРИЯ
Реализация OpenBSM была создана McAfee Research, исследовательским
подразделением безопасности McAfee Inc., по контракту с Apple Computer Inc. в 2004 году.
Позже она была принята проектом TrustedBSD как основа для
дистрибутива OpenBSM.
.Sh АВТОРЫ
.An -nosplit
Это программное обеспечение было создано McAfee Research, исследовательским подразделением безопасности
McAfee, Inc., по контракту с Apple Computer Inc.
Дополнительные авторы включают:
.An Уэйн Саламан,
.An Роберт Уотсон,
и SPARTA Inc.
.Pp
Интерфейс Основного Модуля Безопасности (BSM) для аудиторских записей и формат потока
событий аудита были определены компанией Sun Microsystems.