melkorbsd/ru-freebsd-man/man5/audit_user.5
.\" Copyright (c) 2004 Apple Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1.  Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\" 2.  Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\" 3.  Neither the name of Apple Inc. ("Apple") nor the names of
.\"     its contributors may be used to endorse or promote products derived
.\"     from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY APPLE AND ITS CONTRIBUTORS "AS IS" AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL APPLE OR ITS CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 4 января, 2008 
.Dt AUDIT_USER 5
.Os
.Sh ИМЯ
.Nm audit_user
.Nd "события, подлежащие аудиту для заданных пользователей"
.Sh ОПИСАНИЕ
Файл
.Nm 
указывает, какие классы событий аудита должны быть проверены для заданных пользователей.
Если указано, эти флаги комбинируются с флагами аудита на уровне системы из файла
.Xr audit_control 5,
чтобы определить, какие классы событий следует проверять для этого пользователя. Эти настройки вступают в силу, когда пользователь выполняет вход в систему.
.Pp
Каждая строка сопоставляет имя пользователя со списком классов, которые должны быть проверены, и списком классов, которые не должны быть проверены.
Записи имеют следующий формат:
.Pp
.D1 Ar username Ns : Ns Ar alwaysaudit Ns : Ns Ar neveraudit
.Pp
В указанном формате,
.Ar alwaysaudit
это набор классов событий, которые всегда подлежат аудиту, а
.Ar neveraudit
это набор классов событий, которые не должны подлежать аудиту.
Эти наборы могут указывать на включение
или исключение нескольких классов, а также на то, следует ли проверять успешные или неудачные события. 
См.
.Xr audit_control 5 
для получения дополнительной информации о флагах аудита.
.Pp
Примеры записей в этом файле:
.Bd -literal -offset indent
root:lo,ad:no
jdoe:-fc,ad:+fw
.Ed
.Pp
Эти настройки приведут к тому, что события входа/выхода и административные события, выполняемые от имени пользователя
.Dq Li root,
будут проверяться.
События неудачи не подлежат аудиту.
Для пользователя
.Dq Li jdoe,
события неудачного создания файла будут проверяться, административные события будут проверяться, а успешные события записи файла никогда не будут проверяться.
.Sh ЗАМЕТКИ ПО РЕАЛИЗАЦИИ
Конфигурация предвыбора аудита для каждого пользователя и глобальная конфигурация оцениваются во время входа в систему, поэтому пользователи должны выйти из системы и войти снова, чтобы изменения аудита, относящиеся к предвыбору, вступили в силу.
.Pp
Предвыбор записей аудита происходит относительно идентификатора аудита, 
связанного с процессом, а не относительно идентификатора пользователя или группы UNIX.
Идентификатор аудита устанавливается как часть контекста учетных данных пользователя во время входа в систему и обычно не изменяется в результате выполнения
приложений setuid или setgid, таких как
.Xr su 1.
Это имеет преимущество в том, что события, происходящие после выполнения
.Xr su 1,
могут быть проверены на оригинального аутентифицированного пользователя, как требуется CAPP, 
но это может быть неожиданным, если не ожидалось.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/security/audit_user" -compact
.It Pa /etc/security/audit_user
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr login 1,
.Xr su 1,
.Xr audit 4,
.Xr audit_class 5,
.Xr audit_control 5,
.Xr audit_event 5
.Sh ИСТОРИЯ
Реализация OpenBSM была создана McAfee Research, исследовательским
подразделением безопасности McAfee Inc., по контракту с Apple Computer Inc. в 2004 году.
Позже она была принята проектом TrustedBSD как основа
для дистрибутива OpenBSM.
.Sh АВТОРЫ
.An -nosplit
Это программное обеспечение было создано McAfee Research, исследовательским
подразделением безопасности McAfee Inc., по контракту с Apple Computer Inc.
Дополнительные авторы включают:
.An Уэйн Саламан,
.An Роберт Уотсон,
и SPARTA Inc.
.Pp
Интерфейс Основного Модуля Безопасности (BSM) для аудиторских записей и формат потока
событий аудита были определены компанией Sun Microsystems.