melkorbsd/ru-freebsd-man/man5/autofs.5
.\" Copyright (c) 2014 The FreeBSD Foundation
.\"
.\" This software was developed by Edward Tomasz Napierala under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 2 декабря, 2017 
.Dt AUTOFS 5
.Os
.Sh ИМЯ
.Nm autofs
.Nd "файловая система автоматического монтирования"
.Sh СИНТАКСИС
Чтобы скомпилировать этот драйвер в ядро,
добавьте следующую строку в
файл конфигурации ядра:
.Bd -ragged -offset indent
.Cd "options AUTOFS"
.Ed
.Pp
В качестве альтернативы, чтобы загрузить драйвер как
модуль при загрузке, добавьте следующую строку в
.Xr loader.conf 5 :
.Bd -literal -offset indent
autofs_load="YES"
.Ed
.Sh ОПИСАНИЕ
Драйвер
.Nm
является компонентом ядра инфраструктуры автоматического монтирования.
Его задача — передавать запросы на монтирование демону
.Xr automountd 8,
и приостанавливать процессы, пытающиеся получить доступ к автоматически смонтированной файловой системе,
пока монтирование не завершится.
Он монтируется с помощью
.Xr automount 8.
.Sh ОПЦИИ
Эти опции доступны при монтировании файловых 
систем
.Nm :
.Bl -tag -width indent
.It Cm master_options
Опции монтирования для всех файловых систем, указанных в записи карты.
.It Cm master_prefix
Префикс точки монтирования файловой системы.
.El
.Sh ПЕРЕМЕННЫЕ SYSCTL
Следующие переменные доступны как переменные
.Xr sysctl 8,
так и как настраиваемые параметры
.Xr loader 8 :
.Bl -tag -width indent
.It Va vfs.autofs.debug
Уровень подробности для сообщений журналирования от
драйвера
.Nm.
Установите в 0, чтобы отключить логирование, или в 1, чтобы предупреждать о потенциальных проблемах.
Более крупные значения включают вывод отладки.
По умолчанию установлено в 1.
.It Va vfs.autofs.interruptible
Установите в 1, чтобы разрешить прерывание запросов на монтирование сигналом.
По умолчанию установлено в 1.
.It Va vfs.autofs.retry_delay
Количество секунд перед повторной попыткой запроса на монтирование.
По умолчанию установлено в 1.
.It Va vfs.autofs.retry_attempts
Количество попыток перед неудачным монтированием.
По умолчанию установлено в 3.
.It Va vfs.autofs.cache
Количество секунд ожидания перед повторным вызовом
.Xr automountd 8
для любого данного файла или каталога.
По умолчанию установлено в 600.
.It Va vfs.autofs.timeout
Количество секунд ожидания, чтобы
.Xr automountd 8
обработал запрос на монтирование.
По умолчанию установлено в 30.
.It Va vfs.autofs.mount_on_stat
Установите в 1, чтобы инициировать монтирование при вызове
.Xr stat 2
на точке монтирования.
По умолчанию установлено в 0.
.El
.Sh ПРИМЕРЫ
Чтобы размонтировать все смонтированные файловые системы
.Nm :
.Pp
.Dl "umount -At autofs"
.Pp
Чтобы смонтировать файловые системы
.Nm
указанные в 
.Xr auto_master 5 :
.Pp
.Dl "automount"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr auto_master 5 ,
.Xr automount 8 ,
.Xr automountd 8 ,
.Xr autounmountd 8 
.Sh ИСТОРИЯ
Драйвер 
.Nm 
впервые появился в 
.Fx 10.1 .
.Sh АВТОРЫ
Драйвер 
.Nm 
был разработан 
.An Edward Tomasz Napierala Aq Mt trasz@FreeBSD.org 
при поддержке Фонда FreeBSD.