melkorbsd/ru-freebsd-man/man5/bhyve_config.5
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2021 John H. Baldwin <jhb@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 19, 2022
.Dt BHYVE_CONFIG 5
.Os
.Sh НАИМЕНОВАНИЕ
.Nm bhyve_config
.Nd "переменные конфигурации bhyve"
.Sh ОПИСАНИЕ
.Xr bhyve 8
использует иерархическое дерево переменных конфигурации для описания глобальных
настроек и настроек для каждого устройства.
Внутренние узлы в этом дереве не имеют значения, значения имеют только конечные
узлы.
В этом руководстве описаны переменные конфигурации, понятные
.Xr bhyve 8 .
Если определены дополнительные переменные,
.Xr bhyve 8
проигнорирует их и не выдаст ошибок для неизвестных переменных.
Однако на эти дополнительные переменные могут ссылаться другие переменные, как
описано ниже.
.Sh Значения переменных
Значения переменных конфигурации хранятся в виде строк.
Значение переменной конфигурации может ссылаться на одно или несколько других
значений конфигурации по имени.
Экземпляры шаблона
.Sq % Ns Pq Ar var
заменяются значением конфигурационной переменной
.Va var .
Чтобы избежать нежелательного расширения, символы
.Sq %
могут быть экранированы начальным знаком
.Sq % .
Например,
если переменная конфигурации
.Va disk
использует значение
.Pa /dev/zvol/bhyve/%(name) ,
то конечным значением переменной
.Va disk
будет путь к тому ZFS, имя которого совпадает с именем виртуальной машины
в пуле
.Pa bhyve .
.Pp
Некоторые переменные конфигурации могут интерпретироваться как логические
значения.
Для этих переменных могут использоваться следующие значения без учета регистра,
чтобы указать true:
.Pp
.Bl -bullet -offset indent -compact
.It
true
.It
on
.It
yes
.It
1
.El
.Pp
Следующие значения могут использоваться для указания ложности:
.Pp
.Bl -bullet -offset indent -compact
.It
false
.It
off
.It
no
.It
0
.El
.Pp
Некоторые переменные конфигурации могут интерпретироваться как целые числа.
Для этих переменных,
может использоваться любой синтаксис поддерживаемый
.Xr strtol 3 .
.Sh Глобальные параметры
.Ss Архитектурно-нейтральные настройки
.Bl -column "memory.guest_in_core" "integer" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va name Ta string Ta Ta
Имя виртуальной машины.
.It Va cpus Ta integer Ta 1 Ta
Общее количество виртуальных процессоров.
.It Va cores Ta integer Ta 1 Ta
Количество виртуальных ядер в каждом виртуальном сокете.
.It Va threads Ta integer Ta 1 Ta
Количество виртуальных процессоров в каждом виртуальном ядре.
.It Va sockets Ta integer Ta 1 Ta
Количество виртуальных сокетов.
.It Va memory.guest_in_core Ta bool Ta false Ta
Включите гостевую память в основной файл.
.It Va memory.size Ta string Ta 256M Ta
Размер гостевой физической памяти в байтах.
Значение должно быть отформатировано, как описано в
.Xr expand_number 3 .
.It Va memory.wired Ta bool Ta false Ta
Проводная гостевая память.
.It Va acpi_tables Ta bool Ta false Ta
Создайте таблицы ACPI.
.It Va acpi_tables_in_memory Ta bool Ta true Ta
.Xr bhyve 8
всегда предоставляет таблицы ACPI с помощью FwCfg.
Для обратной совместимости bhyve также копирует их в гостевую память.
Это может вызвать проблемы, если гость использует версию в оперативной памяти,
поскольку некоторые расширенные функции, такие как эмуляция TPM доступны только
через FwCfg.
Поэтому рекомендуется установить для этого флага значение false при запуске 
гостей Windows.
.It Va destroy_on_poweroff Ta bool Ta false Ta
Уничтожьте виртуальную машину при отключении питания по инициативе гостя.
.It Va gdb.address Ta string Ta localhost Ta
Hostname, IP address, или IPv6 адрес сервера отладки.
.It Va gdb.port Ta integer Ta 0 Ta
Номер TCP-порта для сервера отладки.
Если для этого параметра установлено ненулевое значение, сервер отладки будет
прослушивать соединения через этот порт.
.It Va gdb.wait Ta bool Ta false Ta
Если сервер отладки включен, дождитесь подключения отладчика, прежде чем
запускать гостевую систему.
.It Va keyboard.layout Ta string Ta Ta
Укажите имя раскладки клавиатуры с именем файла в
.Ar /usr/share/bhyve/kbdlayout .
Это значение работает только при загрузке в режиме UEFI для VNC и использовании
клиента VNC, который не поддерживает сообщение о расширенном ключевом событии
QEMU (например, TightVNC).
.It Va tpm.path Ta string Ta Ta
Путь к хост-устройству TPM.
Обычно это /dev/tpm0.
.It Va tpm.type Ta string Ta Ta
Тип устройства TPM, передаваемого гостю.
В настоящее время поддерживается только "passthru".
.It Va tpm.version Ta string Ta 2.0 Ta
Версия устройства TPM согласно спецификации TCG.
На данный момент поддерживается только версия 2.0.
.It Va rtc.use_localtime Ta bool Ta true Ta
Часы реального времени используют местное время хоста.
Если для этого параметра установлено значение false, часы реального времени
используют время в формате UTC.
.It Va uuid Ta string Ta Ta
Универсальный уникальный идентификатор (UUID), используемый в структуре System
Management BIOS System Information гостевого компьютера.
Если явное значение не задано, действительный UUID генерируется из имени хоста
и имени виртуальной машины.
.It Va virtio_msix Ta bool Ta true Ta
Используйте прерывания MSI-X для устройств PCI VirtIO.
Если установлено значение false, вместо этого используются прерывания MSI.
.It Va config.dump Ta bool Ta false Ta
Если для этого значения установлено значение true после того, как
.Xr bhyve 8
завершил анализ параметров командной строки,
тогда
.Xr bhyve 8
запишет все свои переменные конфигурации в стандартный вывод и завершит работу.
Ни одна виртуальная машина не запустится.
.It Va bios.vendor Ta string Ta BHYVE Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va bios.version Ta string Ta 14.0 Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va bios.release_date Ta string Ta 10/17/2021 Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va system.family_name Ta string Ta Virtual Machine Ta
Семейство, к которому принадлежит компьютер.
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va system.manufacturer Ta string Ta FreeBSD Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va system.product_name Ta string Ta BHYVE Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va system.serial_number Ta string Ta None Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va system.sku Ta string Ta None Ta
Складская единица компьютера.
Его также называют идентификатором продукта или номером заказа на поставку.
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va system.version Ta string Ta 1.0 Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va board.manufacturer Ta string Ta FreeBSD Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va board.product_name Ta string Ta BHYVE Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va board.version Ta string Ta 1.0 Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va board.serial_number Ta string Ta None Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va board.asset_tag Ta string Ta None Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va board.location Ta string Ta None Ta
Описывает расположение платы внутри корпуса.
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va chassis.manufacturer Ta string Ta FreeBSD Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va chassis.version Ta string Ta 1.0 Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va chassis.serial_number Ta string Ta None Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va chassis.asset_tag Ta string Ta None Ta
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.It Va chassis.sku Ta string Ta None Ta
Складская единица компьютера.
Его также называют идентификатором продукта или номером заказа на поставку.
Это значение используется для структуры System Management BIOS System
Information гостевого компьютера.
.El
.Ss x86-Specific Settings
.Bl -column "x86.vmexit_on_pause" "integer" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va x86.mptable Ta bool Ta true Ta
Генерировать MPTable.
.It Va x86.x2apic Ta bool Ta false Ta
Настройка локальных APIC гостя в режиме x2APIC.
.It Va x86.strictio Ta bool Ta false Ta
Выйти, если гость обращается к порту ввода/вывода, который не является
эмулирован.
По умолчанию, записи игнорируются, а чтение возвращает все установленные биты.
.It Va x86.strictmsr Ta bool Ta true Ta
Вызвать общий сбой защиты, если гость обращается к регистру Model Specific
Register (MSR), который не эмулируется.
Если это неверно, запись игнорируется, а чтение возвращает ноль.
.It Va x86.vmexit_on_hlt Ta bool Ta false Ta
Принудительный выход из виртуальной машины при выполнении гостевым процессором
инструкции
.Dv HLT .
Это позволяет простаивающим гостевым процессорам уступить место главному
процессору.
.It Va x86.vmexit_on_pause Ta bool Ta false Ta
Принудительный выход из виртуальной машины, когда гостевой процессор выполняет
инструкцию
.Dv PAUSE .
.El
.Sh Параметры оборудования
Настройки устройства хранятся в узле устройства.
Имя узла устройства задается родительской шиной устройства.
.Ss Настройки устройств PCI
Устройства PCI описываются узлом устройства с именем
.Dq pci . Ns Ar bus . Ns Ar slot . Ns Ar function
где каждая из
.Ar bus ,
.Ar slot ,
и
.Ar function
форматируется как десятичное значение без подстановки.
Все узлы устройств PCI должны содержать переменную конфигурации с именем
.Dq device ,
которая указывает используемую модель устройства.
Поддерживаются следующие модели PCI-устройств:
.Bl -tag -indent
.It Li hostbridge
Обеспечивает простое устройство моста PCI-Host.
Обычно оно конфигурируется по адресу pci0:0:0 и требуется большинством гостевых
операционных систем.
.It Li ahci
AHCI контроллер хранения данных.
.It Li e1000
Intel e82545 сетевой интерфейс.
.It Li fbuf
Устройство фреймбуфера VGA, подключенное к VNC-серверу.
.It Li lpc
LPC PCI-ISA мост с последовательными портами COM1-COM4 16550,
загрузочным ПЗУ,
дополнительным типом fwcfg,
и дополнительным отладочным/тестовым устройством.
Это устройство должно быть сконфигурировано на шине 0.
.It Li hda
Аудиоконтроллер высокой четкости..
.It Li nvme
NVM Express (NVMe) контроллер.
.It Li passthru
Проходное устройство PCI.
.It Li uart
Последовательное устройство PCI 16550.
.It Li virtio-9p
Интерфейс VirtIO 9p (VirtFS).
.It Li virtio-blk
Интерфейс блочного хранилища VirtIO.
.It Li virtio-console
Консольный интерфейс VirtIO.
.It Li virtio-input
Входной интерфейс VirtIO.
.It Li virtio-net
Сетевой интерфейс VirtIO.
.It Li virtio-rnd
Интерфейс VirtIO RNG.
.It Li virtio-scsi
Интерфейс VirtIO SCSI.
.It Li xhci
Extensible Host Controller Interface (XHCI) USB контроллер.
.El
.Ss USB Device Settings
Устройства USB-контроллера содержат ноль или более дочерних USB-устройств,
подключенных к слотам.
Каждое USB-устройство хранит свои настройки в узле с именем
.Dq slot. Ns Va N
в узле устройства контроллера.
.Va N
это номер слота, к которому подключено USB-устройство.
Обратите внимание, что номера USB-слотов начинаются с 1.
Все узлы USB-устройств должны содержать переменную конфигурации с именем
.Dq device ,
в которой указывается используемая модель устройства. 
Поддерживаются следующие модели USB-устройств:
.Bl -tag -indent
.It Li tablet
Планшетное USB-устройство, обеспечивающее точную синхронизацию курсора.
.El
.Ss Настройки блочных устройств
Блочные устройства используют следующие настройки для конфигурирования своего
резервного хранилища.
Эти настройки хранятся в узле конфигурации соответствующего устройства.
.Bl -column "sectorsize" "logical[/physical]" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It path Ta string Ta Ta
Путь к файлу или дисковому устройству, используемому в качестве резервного 
хранилища.
.It nocache Ta bool Ta false Ta
Отключить кэширование резервного файла, открыв резервный файл с помощью
.Dv O_DIRECT .
.It nodelete Ta bool Ta false Ta
Отключить эмуляцию гостевых запросов на обрезку через запросы
.Dv DIOCGDELETE .
.It sync Ta bool Ta false Ta
Запись изменений в резервный файл с помощью синхронной записи.
.It direct Ta bool Ta false Ta
Псевдоним для
.Va sync .
.It ro Ta bool Ta false Ta
Отключить запись в резервный файл.
.It sectorsize Ta Va logical Ns Op / Ns Va physical Ta Ta
Укажите логический и физический размер сектора эмулируемого диска.
Если физический размер не указан, он равен логическому.
.El
.Ss Настройки сетевого бэкэнда
Сетевые устройства используют следующие настройки для конфигурирования своего
бэкэнда.
Бэкэнд отвечает за передачу пакетов между моделью устройства и желаемым пунктом
назначения. 
Настройка бэкенда требует установки переменной переменной
.Va backend
Тип бэкенда может быть задан либо явно через переменную
.Va type ,
либо может быть выведен из значения
.Va backend .
.Pp
Поддерживаются следующие типы бэкендов:
.Bl -tag -width "netgraph"
.It tap
Используется
.Xr tap 4
интерфейс названный
.Va backend
как бэкенд.
.It netgraph
Используется хук сокета
.Xr netgraph 4
в качестве бэкенда.
Этот бэкэнд использует следующие дополнительные переменные:
.Bl -column "peerhook" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va path Ta string Ta Ta
Имя узла
.Xr netgraph 4
как узла назначения.
.It Va peerhook Ta string Ta Ta
Имя целевого хука.
.It Va socket Ta string Ta Ta
Имя созданного узла
.Xr ng_socket 4 .
.It Va hook Ta string Ta vmlink Ta
Имя исходного хука на созданном узле
.Xr ng_socket 4 .
.El
.It netmap
Используйте
.Xr netmap 4
либо для сетевого интерфейса, либо для порта на
.Xr vale 4
моста в качестве бэкенда.
Значение
.Va backend
передается в
.Xr nm_open
для подключения к порту netmap.
.El
.Pp
Если значение
.Va type
не указано явно, то оно выводится из значения
.Va backend
на основе следующих шаблонов:
.Bl -column -offset indent "valuebridge:port"
.It Sy Шаблон Ta Sy Тип
.It tap Ns Va N Ta tap
.It vmnet Ns Va N Ta tap
.It netgraph Ta netgraph
.It netmap: Ns Va interface Ta netmap
.It vale Ns Va bridge : Ns Va port Ta netmap
.El
.Ss Настройки устройства UART
.Bl -column "Наименование" "Формат" "По умолчанию"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Description
.It Va path Ta path Ta Ta
Внутреннее устройство для последовательного порта.
Либо имя пути символьного устройства, либо
.Dq stdio
для использования стандартного ввода и вывода процесса
.Xr bhyve 8 .
.El
.Ss Host Bridge Settings
.Bl -column "pcireg.*" "integer" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va pcireg.* Ta integer Ta Ta
Значения регистра PCI.
.Bl -column "device" "Default"
.It Sy Наименование Ta Sy По умолчанию
.It Va vendor Ta integer Ta 0x1275 Ta
.It Va device Ta integer Ta 0x1275 Ta
.El
.El
.Ss Настройки контроллера AHCI
Устройства с контроллером AHCI содержат ноль или более портов, каждый из
которых предоставляет устройство хранения данных.
Каждый порт хранит свои настройки в узле с именем
.Dq port. Ns Va N
под узлом устройства контроллера.
Значение
.Va N
форматируются как последовательные десятичные значения, начиная с 0.
В дополнение к настройкам блочных устройств, описанным выше, каждый порт
поддерживает следующие настройки:
.Bl -column "model" "integer" "generated"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va type Ta string Ta Ta
Тип эмулируемого устройства хранения данных.
Должно быть установлено значение
.Dq cd
или
.Dq hd .
.It Va nmrr Ta integer Ta 0 Ta
Номинальная скорость вращения носителя, также известная как известная как число
оборотов в минуту.
Значение 1 указывает на устройство без скорости, например Solid State Disk.
.It Va ser Ta string Ta generated Ta
Серийный номер до двадцати символов.
Серийный номер по умолчанию генерируется с помощью хэша имени пути хранилища
резервных копий.
.It Va rev Ta string Ta 001 Ta
Номер ревизии до восьми символов.
.It Va model Ta string Ta Ta
Номер модели длиной до сорока символов.
Отдельные строки моделей по умолчанию
.Dq cd
и
.Dq hd
типов.
.El
.Ss e1000 Settings
В дополнение к настройкам бэкэнда сети сетевые интерфейсы Intel e82545
поддерживают следующие переменные:
.Bl -column "Name" "MAC address" "generated"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va mac Ta MAC address Ta generated Ta
MAC address.
Если явный адрес не указан, MAC-адрес генерируется из хэша PCI-адреса
устройства.
.El
.Ss Настройки буфера кадров
.Bl -column "password" "[IP:]port" "127.0.0.1:5900"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va wait Ta bool Ta false Ta
Ожидание удаленного соединения перед запуском виртуальной машины.
.It Va rfb Ta Oo Ar IP Ns : Oc Ns Ar port Ta 127.0.0.1:5900 Ta
TCP-адрес для прослушивания удаленных соединений.
IP-адрес должен быть указан в виде числового адреса.
IPv6-адреса должны быть заключены в квадратные скобки и поддерживать
scoped-идентификаторы, как описано в
.Xr getaddrinfo 3 .
Может быть задан пустой номер порта в этом случае используется IPv4
используется адрес localhost.
.It Va vga Ta string Ta io Ta
Конфигурация VGA.
Более подробная информация приведена в
.Xr bhyve 8 .
.It Va w Ta integer Ta 1024 Ta
Ширина буфера кадра в пикселях. 
.It Va h Ta integer Ta 768 Ta
Высота буфера кадра в пикселях.
.It Va password Ta string Ta Ta
Пароль, используемый для аутентификации VNC.
Этот тип аутентификации известен как криптографически слабый и не предназначен
для использования в ненадежных сетях.
.El
.Ss Настройки аудио высокого разрешения
.Bl -column "Name" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va play Ta path Ta Ta
Хост устройства воспроизведения,
обычно
.Pa /dev/dsp0 .
.It Va rec Ta path Ta Ta
Хост устройства записи,
обычно
.Pa /dev/dsp0 .
.El
.Ss Настройки устройств LPC
Мост LPC хранит свою конфигурацию в узле верхнего уровня
.Va lpc
а не в узле устройства PCI LPC.
Следующие узлы доступны в узле
.Va lpc :
.Bl -column "pc-testdev" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описанию
.It Va bootrom Ta path Ta Ta
Путь к загрузочному ПЗУ. 
Содержимое этого файла копируется в память гостя, заканчиваясь непосредственно
перед физическим адресом 4 Гб.
Если загрузочное ПЗУ, интерфейсное устройство прошивки также включается
устройство интерфейса микропрограммы для использования загрузочного ПЗУ.
.It Va bootvars Ta path Ta Ta
Путь к загрузочным VARS.
Содержимое  этого файла копируется в загрузочного ПЗУ.
Микропрограмма может записывать в него для сохранения переменных.
Все переменные сохраняются даже при перезагрузке гостя.
.It Va com1 Ta node Ta Ta
Настройки для последовательного порта COM1 устройство.
.It Va com2 Ta node Ta Ta
Настройки для устройства последовательного порта COM2.
.It Va com3 Ta node Ta Ta
Настройки для устройства последовательного порта COM3.
.It Va com4 Ta node Ta Ta
Настройки для устройства последовательного порта COM4.
.It Va fwcfg Ta string Ta bhyve Ta
Используемый тип fwcfg.
Поддерживаются следующие значения
.Dq bhyve
для fwctl и
.Dq qemu
для fwcfg.
.It Va pc-testdev Ta bool Ta false Ta
Включить устройство отладки/тестирования ПК.
.It Va pcireg.* Ta integer Ta Ta
Значения регистра PCI.
Также принимает значение
.Ar host ,
чтобы использовать pci id хост-системы. 
Это значение необходимо для того, чтобы драйвер Intel GOP для правильной работы.
.Bl -column "subvendor" "Default"
.It Sy Наименование Ta Sy По умолчанию
.It Va vendor Ta 0x8086
.It Va device Ta 0x7000
.It Va revid Ta 0
.It Va subvendor Ta 0
.It Va subdevice Ta 0
.El
.El
.Ss Настройки контроллера NVMe
Каждый контроллер NVMe поддерживает одно устройство хранения данных.
Это устройство может быть основано либо на диске памяти, описываемом переменной
.Va ram ,
либо на блочном устройстве с использованием настроек блочного устройства,
описанных выше.
Кроме того, каждый контроллер поддерживает следующие настройки:
.Bl -column "ioslots" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va maxq Ta integer Ta 16 Ta
Максимальное количество пар очередей отправки и завершения ввода-вывода.
.It Va qsz Ta integer Ta 2058 Ta
Количество элементов в каждой очереди ввода-вывода.
.It Va ioslots Ta integer Ta 8 Ta
Максимальное количество одновременных запросов ввода-вывода.
.It Va sectsz Ta integer Ta Ta
Размер сектора.
Может быть одним из 512, 4096 или 8192.
Устройства, основанные на диске памяти, по умолчанию используют 4096.  
Устройства, основанные на блочном устройстве, по умолчанию используют размер
сектора блочного устройства.
.It Va ser Ta string Ta Ta
Серийный номер длиной до двадцати символов.
Серийный номер по умолчанию генерируется с помощью хэша PCI-адреса устройства.
.It Va eui64 Ta integer Ta Ta
Расширенный уникальный идентификатор IEEE.
Если EUI не указан, по умолчанию генерируется контрольная сумма PCI-адреса
устройства.
.It Va dsm Ta string Ta auto Ta
Нужно ли рекламировать поддержку DataSet Management.
Одно из значений
.Dq auto ,
.Dq enable ,
или
.Dq disable .
Параметр
.Dq auto
рекламирует поддержку только в том случае, если резервное хранилище
поддерживает освобождение ресурсов, например с помощью TRIM.
.It Va ram Ta integer Ta Ta
Если установлено, то в качестве резервного хранилища выделяется диск с памятью. 
Значение этой переменной - размер диска памяти в мегабайтах.
.El
.Ss Настройки PCI Passthrough
Драйвер устройства
.Xr ppt 4
должен быть подключен к проходному PCI-устройству.
Проходное устройство может быть идентифицировано либо по имени, либо по
расположению на шине PCI хоста.
.Bl -column "Name" "integer" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описанию
.It Va bus Ta integer Ta Ta
Адрес шины PCI хоста устройства, через которое осуществляется проход.
.It Va slot Ta integer Ta Ta
Адрес слота PCI хоста устройства, через которое осуществляется проход.
.It Va func Ta integer Ta Ta
Адрес функции PCI хоста устройства, через которое будет осуществляться проход.
.It Va pptdev Ta string Ta Ta
Имя устройства
.Xr ppt 4 ,
через которое нужно пройти.
.It Va rom Ta path Ta Ta
ROM-файла устройства, который будет выполнен OVMF для инициализации устройства.
.El
.Ss Настройки VirtIO 9p
Каждое устройство VirtIO 9p открывает одну файловую систему из пути хоста.
.Bl -column "sharename" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va sharename Ta string Ta Ta
Имя ресурса, открываемого гостю.
.It Va path Ta path Ta Ta
Путь к каталогу на хосте для экспорта гостю.
.It Va ro Ta bool Ta false Ta
Если true, то гостевая файловая система доступна только для чтения.
.El
.Ss Настройки блочных устройств VirtIO
В дополнение к настройкам блочных устройств, описанным выше, каждое блочное
устройство VirtIO поддерживает следующие настройки:
.Bl -column "model" "integer" "generated"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va ser Ta string Ta generated Ta
Серийный номер до двадцати символов.
По умолчанию серийный номер генерируется с помощью хэша имени пути хранилища резервных копий.
.El
.Ss Настройки устройства VirtIO Console
Каждое устройство VirtIO Console содержит один или несколько консольных портов.
Каждый порт хранит свои настройки в узле с именем
.Dq port. Ns Va N
в узле устройства контроллера.
Значения
.Va N
форматируются как последовательные десятичные значения, начиная с 0.
Каждый порт поддерживает следующие настройки:
.Bl -column "Name" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va name Ta string Ta Ta
Имя порта, открываемого гостю.
.It Va path Ta path Ta Ta
Путь сокета домена UNIX, обеспечивающего хост-соединение для данного порта.
.El
.Ss Настройки интерфейса VirtIO Input
Каждое устройство VirtIO Input содержит одно устройство входных событий.
Все события ввода события устройства ввода передаются гостю через интерфейс
VirtIO Input interface.
Входные интерфейсы VirtIO поддерживают следующие переменные:
.Bl -column "Name" "Format" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va path Ta path Ta Ta
Путь устройства входных событий, открываемого гостю.
.El
.Ss Настройки сетевых интерфейсов VirtIO
В дополнение к настройкам сетевого бэкэнда сетевые интерфейсы VirtIO
поддерживают следующие переменные:
.Bl -column "Name" "MAC address" "generated"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va mac Ta MAC address Ta generated Ta
MAC-адрес.
Если явный адрес не указан,
MAC-адрес генерируется из хэша PCI-адреса устройства.
.It Va mtu Ta integer Ta 1500 Ta
Наибольший поддерживаемый MTU, рекламируемый гостю.
.El
.Ss Параметры VirtIO SCSI
.Bl -column "Name" "integer" "Default"
.It Sy Наименование Ta Sy Формат Ta Sy По умолчанию Ta Sy Описание
.It Va dev Ta path Ta Ta
Путь к устройству целевого уровня CAM (CTL) для экспорта:
.Pa /dev/cam/ctl Ns Oo Ar pp . Ns Ar vp Oc .
.It Va iid Ta integer Ta 0 Ta
Идентификатор инициатора для использования при отправке запросов на порт CTL.
.El
.Sh СМОТРИ ТАКЖЕ
.Xr expand_number 3 ,
.Xr getaddrinfo 3 ,
.Xr strtol 3 ,
.Xr netgraph 4 ,
.Xr netmap 4 ,
.Xr ng_socket 4 ,
.Xr tap 4 ,
.Xr vale 4 ,
.Xr vmnet 4 ,
.Xr bhyve 8
