melkorbsd/ru-freebsd-man/man5/bluetooth.device.conf.5
.\" Copyright (c) 2005 Maksim Yevmenkin <m_evmenkin@yahoo.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 29 сентября, 2021
.Dt BLUETOOTH.DEVICE.CONF 5
.Os
.Sh ИМЯ
.Nm bluetooth.device.conf
.Nd Конфигурационный файл устройства Bluetooth
.Sh ОПИСАНИЕ
Фреймворк конфигурации устройств Bluetooth предоставляет возможность настраивать определенные
параметры устройств Bluetooth для каждого устройства в отдельности.
.Pp
Конфигурационные файлы устройств Bluetooth — это текстовые файлы, которые должны соответствовать
базовому синтаксису
.Xr sh 1.
Хотя устройства Bluetooth не являются точно оболочными скриптами,
они обрабатываются и передаются через команду оболочки
.Ic eval.
Это делает возможным использование различных приемов оболочки в конфигурационных файлах
устройств Bluetooth.
.Pp
Скрипт
.Pa /etc/rc.d/bluetooth 
используется для запуска и остановки устройств Bluetooth.
Этот скрипт не выполняется по умолчанию при загрузке системы.
Он вызывается
.Xr devd 8 
в ответ на события появления и исчезновения устройств Bluetooth.
Этот скрипт можно выполнить вручную, если это необходимо.
Скрипт принимает имя драйвера устройства Bluetooth в качестве дополнительного параметра.
.Pp
Конфигурационный файл устройств Bluetooth для всей системы называется
.Pa /etc/defaults/:bluetooth.device.conf . 
Параметры конфигурации, установленные в конфигурационном
файле для всей системы, применяются ко всем устройствам Bluetooth, подключенным к системе.
.Pp
Параметры конфигурации, которые переопределяют настройки для конкретных устройств Bluetooth, 
должны быть размещены в файле
.Pa /etc/bluetooth/Ns Ar DEVICE_DRIVER_NAME Ns Pa .conf
где
.Ar DEVICE_DRIVER_NAME
это имя драйвера устройства Bluetooth.
.Pp
Следующий список предоставляет имя и краткое описание каждой
переменной, которую можно установить в конфигурационном файле устройства Bluetooth.
.Bl -tag -width indent-two.
.It Va authentication_enable
.Pq Vt bool
Параметр
.Va authentication_enable
управляет тем, требует ли устройство аутентификацию удаленного устройства
при установке соединения.
Если установлено значение
.Dq Li YES,
устройство попытается аутентифицировать другое устройство при установке соединения.
Запросы на аутентификацию Bluetooth обрабатываются демоном
.Xr hcsecd 8 .
.It Va class.
.Pq Vt str
Параметр
.Va class
используется для указания возможностей устройства для
других устройств. 
Для получения дополнительных сведений см. документ 
.Dq "Назначенные номера - базовая полоса пропускания Bluetooth".
.It Va connectable
.Pq Vt bool
Параметр
.Va connectable
управляет тем, должно ли устройство периодически сканировать
попытки подключения от других устройств.
Если установлено значение
.Dq Li YES,
устройство будет периодически сканировать попытки подключения от других устройств.
.It Va discoverable.
.Pq Vt bool
Параметр
.Va discoverable
управляет тем, должно ли устройство периодически сканировать
запросы на обнаружение от других устройств.
Если установлено значение
.Dq Li YES,
устройство будет периодически сканировать запросы на обнаружение от других устройств.
.It Va encryption_mode.
.Pq Vt str
Параметр
.Va encryption_mode
управляет тем, требуется ли для устройства шифрование удаленного устройства
при установке соединения.
При установке соединения только устройства с включенным параметром 
.Va authentication_enable 
и включенным параметром 
.Va encryption_mode 
попытаются зашифровать соединение с другим устройством.
Возможные значения:
.Dq Li NONE
шифрование отключено,
.Dq Li P2P
шифрование только для точечных пакетов,
или 
.Dq Li ALL
шифрование как для точечных, так и для широковещательных пакетов.
.It Va hci_debug_level.
.Pq Vt int
Уровень отладки HCI-узла.
Более высокие значения означают более подробный вывод.
.It Va l2cap_debug_level.
.Pq Vt int
Уровень отладки L2CAP-узла.
Более высокие значения означают более подробный вывод.
.It Va local_name.
.Pq Vt str
Параметр 
.Va local_name 
предоставляет возможность изменить удобное для пользователя имя устройства.
.It Va role_switch.
.Pq Vt bool
Параметр 
.Va role_switch
copy
управляет тем, должен ли локальный устройство выполнять переключение ролей.
По умолчанию, если поддерживается переключение ролей, локальное устройство попытается выполнить
переключение ролей и стать ведущим при входящем соединении.
Некоторые устройства не поддерживают переключение ролей, и поэтому входящие соединения от
таких устройств будут неудачными.
Если 
.Va role_switch 
отключено, принимающее устройство останется ведомым.
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/defaults/bluetooth.device.conf" -compact
.It Pa /etc/defaults/bluetooth.device.conf
.It Pa /etc/rc.d/bluetooth
.El
.Sh ПРИМЕРЫ
Файл
.Pa /etc/bluetooth/ubt0.conf
должен использоваться для указания параметров конфигурации, которые переопределяют настройки
для первого USB Bluetooth устройства 
(имя драйвера устройства — 
.Li ubt0).
.Pp
Файл
.Pa /etc/bluetooth/ubt1.conf
должен использоваться для указания параметров конфигурации, которые переопределяют настройки
для второго USB Bluetooth устройства.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr ng_hci 4 , 
.Xr ng_l2cap 4 ,
.Xr ng_ubt 4 , 
.Xr devd 8 ,
.Xr hccontrol 8 , 
.Xr hcsecd 8 ,
.Xr l2control 8
.Sh АВТОРЫ
.An Maksim Yevmenkin Aq Mt m_evmenkin@yahoo.com