melkorbsd/ru-freebsd-man/man5/bluetooth.hosts.5
.\" Copyright (c) 2003 Maksim Yevmenkin <m_evmenkin@yahoo.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: bluetooth.hosts.5,v 1.5 2003/05/20 22:52:39 max Exp $
.\"
.Dd 8 мая, 2003
.Dt BLUETOOTH.HOSTS 5
.Os
.Sh ИМЯ
.Nm bluetooth.hosts
.Nd База данных имен хостов Bluetooth
.Sh ОПИСАНИЕ
Файл
.Pa /etc/bluetooth/hosts
содержит информацию о известных Bluetooth-хостах.
Для каждого Bluetooth-хоста должна быть представлена одна строка
с следующей информацией:
.Bd -unfilled -offset indent
Bluetooth-адрес
официальное имя хоста
псевдонимы
.Ed
.Pp
Элементы разделяются любым количеством пробелов и/или табуляций. 
.Ql # 
указывает на начало комментария; символы до конца строки
не интерпретируются процедурами, которые ищут файл.
.Pp
Bluetooth-адреса указываются в виде шести шестнадцатеричных байтов, разделенных двоеточиями
(BD_ADDR).
Имена хостов могут содержать любые печатные символы, кроме разделителей полей,
символа новой строки или символа комментария.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/bluetooth/hosts" -compact
.It Pa /etc/bluetooth/hosts
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr bluetooth 3
.Sh АВТОРЫ
.An Maksim Yevmenkin Aq Mt m_evmenkin@yahoo.com