melkorbsd/ru-freebsd-man/man5/bootparams.5
.\"
.\" Copyright (c) 1994 Gordon W. Ross
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: Id: bootparams.5,v 1.2 1994/10/03 19:26:13 gwr Exp
.\"
.Dd 2 октября, 1994
.Dt BOOTPARAMS 5
.Os
.Sh ИМЯ
.Nm bootparams
.Nd База данных параметров загрузки
.Sh СИНТАКСИС
.Nm /etc/bootparams
.Sh ОПИСАНИЕ
Файл
.Nm указывает параметры загрузки, которые могут запрашивать клиенты
.Xr diskless 8
при загрузке по сети.
Каждый клиент, поддерживаемый этим сервером, должен иметь запись в файле
.Nm
содержащую пути к его
.Dq root
и (по желанию)
.Dq swapareas.
.Pp
Каждая строка в файле 
(за исключением строк комментариев, начинающихся с
.Ql #) 
указывает имя клиента, за которым следуют пути, которые
клиент может запрашивать под своими логическими именами.
Компоненты строки разделяются пробелами или табуляцией 
и могут продолжаться на нескольких строках с помощью обратной косой черты.
.Pp
Например:
.Bd -literal -offset indent
dummy  root=host:/export/dummy/root \\
       swap=host:/export/dummy/swap \\ 
       dump=host:/export/dummy/swap
.Ed
.Pp
Когда клиент с именем
.Dq dummy
запрашивает путь к своему логическому 
.Dq root
ему будет возвращен путь 
.Dq Pa host:/export/dummy/root
в ответ на его 
.Tn RPC 
запрос.
Компонент 
.Dq host:
должен быть предоставлен.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/bootparams -compact
.It Pa /etc/bootparams
файл конфигурации по умолчанию.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr bootparamd 8 ,
.Xr diskless 8