melkorbsd/ru-freebsd-man/man5/boot.config.5
.\" Copyright (c) 2007 Daniel Gerzo <danger@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd 12 октября, 2020
.Dt BOOT.CONFIG 5
.Os
.Sh ИМЯ
.Nm boot.config
.Nd "Конфигурационный файл для загрузочных блоков"
.Sh ОПИСАНИЕ
Файл
.Nm 
содержит параметры для кода загрузочного блока
.Fx .
.Pp
Когда загрузчик
.Fx
запускается, он ищет файл
.Nm 
в разделе загрузки (в результате, разделы, в которых отсутствует раздел
.Dq Li a, требуют вмешательства пользователя в процессе загрузки).
Если файл
.Nm 
найден, его содержимое используется в качестве параметров конфигурации
по умолчанию для кода загрузочного блока и выводится на консоль системы.
.Pp
Допустимый формат этого файла — указать номер BIOS-диска, тип контроллера,
номер устройства, раздел, имя файла ядра и любые другие допустимые
параметры
.Xr boot 8 
на одной строке, как это делается на приглашении
.Dq Li "boot:".
.Pp
Параметры, связанные с выбором образа загрузки, описанные ниже, и все
другие доступные параметры для
.Nm
документированы подробно в странице руководства
.Xr boot 8 .
.Sh ФАЙЛЫ
.Bl -tag -width /boot.config -compact
.It Pa /boot.config 
параметры для загрузочных блоков (необязательно)
.It Pa /boot/config 
альтернативное местоположение для информации о конфигурации загрузки
.El
.Sh ПРИМЕРЫ
Команда:
.Bd -literal -offset indent
# echo "-P" > /boot.config
.Ed
.Pp 
активирует последовательную консоль
.Fx 
если клавиатура отсутствует, в противном случае будет использоваться видеоконсоль.
.Pp 
Команда:
.Bd -literal -offset indent
# echo "1:ad(1,a)/boot/loader" > /boot.config
.Ed
.Pp 
укажет второй стадии
.Xr boot 8 
на первом диске загрузиться с третьей стадии 
.Xr boot 8 
со второго диска.
.Pp Команда:
.Bd -literal -offset indent
# echo "1:ad(1,a)/boot/loader -P" > /boot.config
.Ed
.Pp выполнит оба вышеуказанных действия.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr boot 8 ,
.Xr loader 8.
.Sh АВТОРЫ
Эта страница руководства была написана 
.An Daniel Gerzo Aq Mt danger@FreeBSD.org.