melkorbsd/ru-freebsd-man/man5/cd9660.5
.\"
.\" Copyright (c) 2017 Enji Cooper
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS DOCUMENTATION IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 25 апреля, 2023
.Dt CD9660 5
.Os
.Sh ИМЯ
.Nm cd9660
.Nd "Файловая система ISO-9660"
.Sh СИНТАКСИС
Чтобы встроить в ядро:
.Bd -ragged -offset indent
.Cd "options CD9660"
.Ed
.Pp
В качестве альтернативы, чтобы загрузить драйвер как
модуль во время загрузки, добавьте следующую строку в
.Xr loader.conf 5 :
.Bd -literal -offset indent
cd9660_load="YES"
.Ed
.Sh ОПИСАНИЕ
Драйвер
.Nm 
позволит ядру
.Fx 
получить доступ к файловой системе
.Tn cd9660.
.Sh ПРИМЕРЫ
Чтобы смонтировать том
.Nm
расположенный на
.Pa /dev/cd0 :
.Pp
.Dl "mount -t cd9660 /dev/cd0 /mnt"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr nmount 2 ,
.Xr unmount 2 ,
.Xr cd 4 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr mount_cd9660 8
.Sh ИСТОРИЯ
Драйвер
.Nm 
впервые появился в
.Bx 4.4 Lite.
.Sh АВТОРЫ
.An -nosplit
Реализация ядра 
.Nm
была первоначально написана
.An Pace Willisson Aq Mt pace@blitz.com
и
.An Atsushi Murai Aq Mt amurai@spec.co.jp.
.Pp
Эта справочная страница была написана
.An Enji Cooper Aq Mt ngie@FreeBSD.org.