melkorbsd/ru-freebsd-man/man5/devd.conf.5
.\"
.\" Copyright (c) 2002 M. Warner Losh <imp@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" The section on comments was taken from named.conf.5, which has the
.\" following copyright:
.\" Copyright (c) 1999-2000 by Internet Software Consortium
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM DISCLAIMS
.\" ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL INTERNET SOFTWARE
.\" CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\"
.Dd December 1, 2022
.Dt DEVD.CONF 5
.Os
.Sh ИМЯ
.Nm devd.conf
.Nd файл конфигурации для
.Xr devd 8
.Sh Описание
.Ss Общий синтакс
Конфигурация
.Xr devd 8
состоит из двух основных компонентов: операторов и коментариев.
Все операторы заканчиваются точкой с запятой.
Многие операторы могут содержать вложенные инструкции, которые также 
заканчиваются точкой с запятой.
.Pp
Поддерживаются следующие инструкции:
.Bl -tag -width ".Ic options"
.It Ic attach
Определяет различные критерии соответствия и действия, которые необходимо выполнить, когда
новое подключенное утройство соответствует указанным критериями.
.It Ic detach
Определяет различные критерии соответствия и действия, которые необходимо выполнить, когда
недавно отключенное устройство соответствует указанным критериям.
.It Ic nomatch
Определяет различные критерии соответствия и действия, которые необходимо выполнить, если
ни один драйвер устройства, загруженный в ядро, не соответствует (новому)
устройству.
.It Ic notify
Определяет различные критерии соответствия и действия, которые необходимо выполнить, когда ядро
отправляет уведомление о событиии в пользвательскую часть.
.It Ic options
Определяет различные опции и параметры для работы
.Xr devd 8 .
.El
.Pp
Утверждения могут встречаться в конфигурационном файле в любом порядке и могут
повторяться столько раз, сколько потребуется.
Более подробная информация о синтаксисе и значении
каждого утверждения и их подстановок описаны ниже.
.Pp
Каждое утверждение, за исключением
.Ic опций ,
имеет приоритет (произвольное число). где '0' определяется как самый низкий приоритет.

Если два оператора соответствуют одному и тому же событию, будет выполнено только действие оператора
с наивысшим приоритетом. 
Таким образом, общие инструкции могут быть переопределены для устройств
или уведомлений, требующих особого внимания.
.Pp
Общий синтакс оператора:
.Bd -literal -offset indent
statement priority {
	substatement "значение";
	...
	substatement "значение";
};
.Ed
.Ss Вспомогательные операторы
Следующие вспомогательные операторы поддерживаются в операторе
.Ic options
.Bl -tag -width ".Ic directory"
.It Ic каталог Qq Ar /some/path ;
Добавляет данный каталог в список каталогов, из которых
.Xr devd 8
будет считывать все файлы с именем "*.conf" в качестве дополнительных
конфигурационных файлов.
 Можно использовать любое количество инструкций для
.Ic каталогов
.It Ic pid-file Qq Pa /var/run/devd.pid ;
Указывает PID-файл.
.It Ic set Ar regexp-name Qq Ar (some|regexp) ;
Создает регулярное выражение и присваивает его переменной
.Ar regexp-name .
Переменная доступна во всем остальном 
конфигурационном файле. 
Если строка начинается с
.Ql \&! ,
она соответствует, если регулярное выражение, образованное остальной частью строки,
не соответствует.
Все регулярные выражения имеют неявный символ
.Ql ^$
.El
.Pp
Следующие вложенные инструкции поддерживаются в командах
.Ic attach
и
.Ic detach
.Bl -tag -width ".Ic directory"
.It Ic action Qq Ar command ;
Команда, выполняемая при успешном совпадении.
Пример
.Dq Li "/etc/pccard_ether $начало имени" .
.It Ic class Qq Ar string ;
Это сокращение для
.Dq Ic match Qo Li class Qc Qq Ar string .
.It Ic device-name Qq string ;
Это сокращение для
.Dq Ic match Qo Li device-name Qc Qq Ar string .
Это соответствует устройству с именем 
.Ar string ,
оторое может быть регулярным выражением или ранее созданной переменной, 
содержащей регулярное выражение. 
Переменная
.Dq Li device-name
оступна для последующего использования с инструкцией 
.Ic action
.It Ic match Qo Ar variable Qc Qq Ar value ;
Сопоставляет содержимое
.Ar значение
с
.Ar переменной ;
содержимое
.Ar значения
может быть регулярным выражением.
Не требуется во время событий
.Ic присоединения
или
.Ic отсоединения ,
поскольку оператор
.Ic device-name
обеспечивает сопоставление всех устройств. 
Неполный список переменных приведен ниже.
.It Ic media-type Qq Ar string ;
Для сетевых устройств,
.Ic media-type
будет соответствовать устройствам, имеющим указанный тип носителя.
Допустимыми типами носителей являются:
.Dq Li Ethernet ,
.Dq Li 802.11 ,
и
.Dq Li ATM .
.It Ic subdevice Qq Ar string ;
Это сокращение для 
.Dq Ic match Qo Li subdevice Qc Qq Ar string .
.El
.Pp
Следующие вложенные инструкции поддерживаются в инструкции
.Ic nomatch :
.Bl -tag -width ".Ic directory"
.It Ic action Qq Ar command ;
То же, что и выше
.It Ic match Qo Ar variable Qc Qq Ar value ;
Сопоставляет содержимое
.Ar value
с
.Ar variable ;
Содержимое
.Ar value
может быть регулярным выражением.
Неполный список переменных приведён ниже.
.El
.Pp
Следующие вложенные инструкции поддерживаются в инструкции
.Ic notify
Переменная
.Dq Li notify
доступна внутри этой инструкции и содержит значение, зависящее от 
системы и подсистемы, которые передали событие.
.Bl -tag -width ".Ic directory"
.It Ic action Qq Ar command ;
Команда, которую нужно выполнить при успешном совпадении.
Пример
.Dq Li "/etc/rc.d/power_profile $notify" .
.It Ic match Qo Ar system | subsystem | type | notify Qc Qq Ar value ;
Любое количество операторов
.Ic match
может существовать внутри оператора
.Ic notify ;
.Ar значение
может быть как фиксированной строкой, так и регулярным выражением.
Снизу приведён список доступных систем, подсистем и типов.
.It Ic media-type Qq Ar string ;
См. выше.
.El
.Ss Переменные, которые можно использовать с оператором match
Неполный список переменных и их возможных значений, которые можно использовать с оператором
.Ic match .
Переменные публикуются шиной на основе характеристик устройства,
сгенерировшего ивент (для ивентов устройств).
Переменные для других классов ивентов зависят от этих событий.
.Pp
.Bl -tag -width ".Li manufacturer" -compact
.It Ic Переменная
.Ic Описание
.It Li *
Всё сообщение из текущего ивента.
.It Li _
Всё сообщение из текущего ивента, после начального типа символа.
.It Li timestamp
время, в течение которого это событие было обработано, в секундах с 1970 года.
.It Li bus
Имя устройства родительской шины.
.It Li cdev
Путь к узлу устройства, если он создан с помощью
.Xr devfs 5
файловой системы.
.It Li class
Класс устройства.
.It Li comm
Имя исполняемого файла (ядро).
.It Li core
Путь к файлу ядра.
.It Li device
Идентификатор устройства.
.It Li devclass
Класс устройства (USB).
.It Li devsubclass
Подкласс устройств (USB).
.It Li device-name
Название подключенного/отсоединенного устройства.
.It Li endpoints
Количество конечных точек (USB).
.It Li function
Функции карты.
.It Li interface
Идентификатор интерфейса (USB).
.It Li intclass
Класс интерфейса (USB).
.It Li intprotocol
Протокол интерфейса (USB).
.It Li intsubclass
Подкласс интерфейса (USB).
.It Li jail
Имя Jail-сервера для процесса, запускающего правило (RCTL).
.It Li mode
Периферийный режим (USB).
.It Li notify
Соответствует значению переменной
.Dq Li notify
.It Li parent
Родительское устройство.
.It Li pid
PID процесса, запускающего правило (RCTL).
.It Li port
Номер порта концентратора (USB).
.It Li product
Идентификатор продукта (USB).
.It Li release
Аппаратная ревизия (USB).
.It Li ruid
Реальный идентификатор процесса, запускающего правило (RCTL).
.It Li rule
Правило (RCTL).
.It Li sernum
Серийный номер (USB).
.It Li slot
Слот для карт памяти.
.It Li subvendor
Идентификатор субвендора (PCI).
.It Li subdevice
Идентификатор вспомогательного устройства (PCI).
.It Li subsystem
Matches a subsystem of a system, see below.
.It Li system
Соответствует подсистеме системы, см. ниже.
.It Li type
Тип уведомления, см. ниже.
.It Li vendor
Идентификатор вендора.
.El
.Ss Уведомления о совпадениях
Неполный список систем, подсистем и типов, используемых в рамках механизма
.Ic уведомлений
.\"
.\" Please keep these tables sorted. Also, please use the same parameters
.\" for each of the tables so that things line up in columns nicely.
.\" Please do not omit the type column for notifiers that omit it.
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li ACPI Ta Ta Ta
События, связанные с подсистемой ACPI.
.It Li ACPI Ta Li ACAD Ta Ta
AC line state ($notify=0x00 is offline, 0x01 is online).
.It Li ACPI Ta Li Button Ta Ta
Состояние AC ($notify=0x00 отключен, 0x01 подключен к сети).
.It Li ACPI Ta Li CMBAT Ta Ta
События, связанные с батареей.
.It Li ACPI Ta Li Dock Ta Ta
Состояние стыковки ($notify=0x00 отстыкован, 0x01 пристыкован).
.It Li ACPI Ta Li Lid Ta Ta
Состояние крышки ($notify=0x00 - закрыта, 0x01 - открыта).
.It Li ACPI Ta Li PROCESSOR Ta Ta
Состояние/конфигурация процессора ($notify=0x81 - изменение доступных состояний Cx).
.It Li ACPI Ta Li Resume Ta Ta
Уведомление о возобновлении работы.
.It Li ACPI Ta Li Suspend Ta Ta
Приостановить уведомление.
.It Li ACPI Ta Li Thermal Ta Ta
События в термальных зонах.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li AEON Ta Li power Ta Li press Ta
На Amiga была нажата кнопка питания.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li CAM Ta Ta Ta
События, связанные с системой
.Xr cam 4 .
.It Li CAM Ta Li periph Ta Ta
События, связанные с периферийными устройствами.
.It Li CAM Ta Li periph Ta Li error Ta
Общие ошибки.
.It Li CAM Ta Li periph Ta Li timeout Ta
Тайм-ауты команд.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li CARP Ta Ta Ta
События, связанные с протоколом
.Xr carp 4 .
.It CARP Ta Ar vhid@inet Ta Ta
.Dq Подсистема
содержит фактический vhid CARP и название сетевого интерфейса
на котором и произошло это событие.
.It CARP Ta Ar vhid@inet Ta MASTER Ta
Узел становится ведущим для виртуального хоста.
.It CARP Ta Ar vhid@inet Ta BACKUP Ta
Узел становится ведущим для виртуального хоста.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li coretemp Ta Ta Ta
События, связанные с устройством
.Xr coretemp 4 .
.It Li coretemp Ta Li Thermal Ta Ta
Уведомление о том, что ядро процессора достигло критической температуры.
.It Li coretemp Ta Li Thermal Ta Li temperature Ta
Строка, содержащая температуру ядра, которое стало слишком горячим.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li DEVFS
.It Li DEVFS Ta Li CDEV Ta Li CREATE Ta
Узел
.Xr devfs 5
создан.
.It Li DEVFS Ta Li CDEV Ta Li DESTROY Ta
Узел
.Xr devfs 5
уничтожен.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li ETHERNET Ta Ar inet Ta IFATTACH Ta
Уведомление о том, что подключен экземпляр виртуальной сети по умолчанию для интерфейса
.Em inet
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li GEOM Ta Ta Ta
События, связанные с фреймворком
.Xr geom 4.
Разница по сравнению с
.Li DEVFS
заключается в том, что
.Li GEOM
включает только дископодобные устройства.
.It Li GEOM Ta Li DEV Ta Li CREATE Ta
Провайдер
.Xr geom 4
создан.
.It Li GEOM Ta Li DEV Ta Li DESTROY Ta
Провайдер
.Xr geom 4
уничтожен.
.It Li GEOM Ta Li DEV Ta Li GEOM::physpath Ta
Физический путь к устройству изменился.
.It Li GEOM Ta Li DEV Ta Li GEOM::rotation_rate Ta
Скорость вращения диска изменилась.
.It Li GEOM Ta Li DEV Ta Li MEDIACHANGE Ta
Физические носители информации изменились.
.It Li GEOM Ta Li DEV Ta Li SIZECHANGE Ta
Размер провайдера
.Xr geom 4
изменился.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li IFNET
.It Li IFNET Ta Em inet Ta Ta
.Dq subsystem
это фактическое название сетевого интерфейса, на котором
произошло событие.
.It Li IFNET Ta Em inet Ta Li LINK_UP Ta
Статус носителя изменен на "UP".
.It Li IFNET Ta Em inet Ta Li LINK_DOWN Ta
Статус носителя изменен на DOWN.
.It Li IFNET Ta Em inet Ta Li ATTACH Ta
Сетевой интерфейс подключен к системе.
.It Li IFNET Ta Em inet Ta Li DETACH Ta
Сетевой интерфейс отсоединен от системы.
.It Li IFNET Ta Em inet Ta Li RENAME Ta
Сетевой интерфейс будет переименован.
.It Li IFNET Ta Em inet Ta Li ADDR_ADD Ta
Добавлен адрес сетевого интерфейса.
.It Li IFNET Ta Em inet Ta Li ADDR_DEL Ta
Удален адрес сетевого интерфейса.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li kernel Ta Li signal Ta Li coredump Ta
Уведомление о том, что процесс завершился сбоем и случился дамп ядра.
.It Li kernel Ta Li power Ta Li resume Ta
Уведомление о том, что система вышла из приостановленного состояния.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li PMU Ta Ta Ta
Оповещение о событиях от различных типов блоков управления питанием.
.It Li PMU Ta Li "AC" Ta Ta
Уведомления о событиях, связанных с питанием от сети переменного тока.
.It Li PMU Ta Li "AC" Ta Li overvoltage Ta
На линии электропередачи переменного тока было обнаружено перенапряжение.
.It Li PMU Ta Li "AC" Ta Li plugged Ta
К линии электропередачи переменного тока подано питание.
.It Li PMU Ta Li "AC" Ta Li unplugged Ta
Из сети переменного тока было отключено питание.
.It Li PMU Ta Li Battery Ta Ta
.It Li PMU Ta Li Battery Ta absent Ta
Аккумулятора больше не отсутствует.
.It Li PMU Ta Li Battery Ta charged Ta
Аккумулятор полностью заряжен.
.It Li PMU Ta Li Battery Ta charging Ta
Батарея начала заряжаться.
.It Li PMU Ta Li Battery Ta disconnected Ta
Аккумулятор был отсоединен.
.It Li PMU Ta Li Battery Ta high-temp Ta
Батарея сообщила о превышении предельной температуры.
.It Li PMU Ta Li Battery Ta low-temp Ta
Батарея сообщала о том, что температура ниже предельного значения.
.It Li PMU Ta Li Battery Ta plugged Ta
Аккумулятор подключен к розетке (например, подсоединен).
.It Li PMU Ta Li Battery Ta shutdown-threshold Ta
Уровень заряда аккумулятора упал ниже порогового значения отключения.
.It Li PMU Ta Li Battery Ta warning-threshold Ta
Уровень заряда батареи упал ниже порогового значения предупреждения пользователя.
.It Li PMU Ta Li Button Ta pressed Ta
Кнопка на 
.Xr adb 4
или
.Xr pmu 4
была нажата.
.It Li PMU Ta Li keys Ta Ta
Была нажата одна из клавиш на клавиатуре
.Xr adb 4.
.It Li PMU Ta Li keys Ta brightness Ta
Поступил запрос на изменение уровня яркости.
Направление находится в переменной $notify.
.It Li PMU Ta Li keys Ta mute Ta
Клавиша отключения звука
.It Li PMU Ta Li keys Ta volume Ta
Поступил запрос на изменение уровня громкости.
Направление находится в переменной $notify.
.It Li PMU Ta Li keys Ta eject Ta
Поступил запрос на выдачу
.It Li PMU Ta Li lid Ta close Ta
Устройство
.Xr pmc 4
зафиксировало закрытие крышки.
.It Li PMU Ta Li lid Ta open Ta
Устройство
.Xr pmc 4
зафиксировало открытие крышки
.It Li PMU Ta Li POWER Ta ACLINE Ta
Устройство
.Xr pmc 4
обнаружило состояние сети переменного тока ($notify=0x00 отключено, 0x01 подключено к сети).
.It Li PMU Ta Li USB Ta overvoltage Ta
Состояние перенапряжения на линиях питания для контактов питания USB.
.It Li PMU Ta Li USB Ta plugged Ta
Устройство было подключено к USB-устройству.
.It Li PMU Ta Li USB Ta undervoltage Ta
Пониженное напряжение на линиях питания для контактов питания USB.
.It Li PMU Ta Li USB Ta unplugged Ta
Устройство было подключено к USB-разъему.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li RCTL Ta Ta Ta
События, связанные с фреймворком
.Xr rctl 8
.It Li RCTL Ta Li rule Ta Li matched Ta
Было запущено правило с действием, указанным как "devctl".
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li USB Ta Ta Ta
События, связанные с подсистемой USB.
.It Li USB Ta Li DEVICE Ta Li ATTACH Ta
К системе подключено USB-устройство.
.It Li USB Ta Li DEVICE Ta Li DETACH Ta
К системе подключено USB-устройство.
.It Li USB Ta Li INTERFACE Ta Li ATTACH Ta
USB-интерфейс подключен к устройству
.It Li USB Ta Li INTERFACE Ta Li DETACH Ta
USB-интерфейс отсоединен от устройства.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li VFS Ta Ta Ta
События из системы vfs.
.It Li VFS Ta Li FS Ta Ta
События, которые изменяют то, что подключено к системе.
.It Li VFS Ta Li FS Ta Li MOUNT Ta
Уведомление о том, что файловая система монтируется в первый раз.
.It Li VFS Ta Li FS Ta Li REMOUNT Ta
Уведомление о перемонтировании файловой системы (независимо от того, изменяются ли параметры на самом деле).
.It Li VFS Ta Li FS Ta Li UNMOUNT Ta
Уведомление о размонтировании файловой системы.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li VT Ta BELL Ta RING Ta
Уведомление о том, что прозвенел звонок консоли.
Подробности см. в
.Xr vt 4.
.El
.Pp
.Bl -column "System" "Subsystem" "1234567" -compact
.Sy "Система" Ta Sy "Подсистема" Ta Sy "Тип" Ta Sy "Описание"
.It Li ZFS Ta ZFS Ta Ta
События, связанные с подсистемой ZFS.
Подробности см. в
.Xr zfsd 8
и
.Pa /etc/devd/zfs.conf
.El
.Pp
.\"
.\" End of tables
.\"
Изменение состояния соединения на UP в интерфейсе
.Dq Li fxp0
приведет к следующему событию уведомления:
.Bd -literal -offset indent
system=IFNET subsystem=fxp0 type=LINK_UP
.Ed
.Pp
Изменение состояния линии переменного тока на
.Dq offline
приведет к следующему событию:
.Bd -literal -offset indent
system=ACPI subsystem=ACAD notify=0x00
.Ed
.Ss Комментарии
Комментарии могут появляться в любом
месте файла конфигурации, где могут появляться пробелы.
Чтобы заинтересовать программистов всех мастей, они могут
быть написаны на C, C++ или конструкциях shell/Perl.
.Pp
Комментарии в стиле C начинаются с двух символов
.Ql /*
((косая черта, звездочка) и заканчивать словами
.Ql */
(звёздочка, косая черта).
Поскольку они полностью разделены этими символами,
их можно использовать для комментирования только части строки или для
заполнения нескольких строк.
.Pp
Комментарии в стиле C не могут быть вложенными.
Например, приведенный ниже
текст недопустим, поскольку весь комментарий заканчивается первым
.Ql */ :
.Bd -literal -offset indent
/* This is the start of a comment.
   This is still part of the comment.
/* This is an incorrect attempt at nesting a comment. */
   This is no longer in any comment. */
.Ed
.Pp
Комментарии в стиле C++ начинаются с двух символов
.Ql //
(косая черта, косая черта) и продолжайте до конца физической строки.
Они не могут быть продолжены в нескольких физических строках; чтобы
один логический комментарий охватывал несколько строк, в каждой строке должна использоваться
пара
.Ql //
Например:
.Bd -literal -offset indent
// This is the start of a comment.  The next line
// is a new comment, even though it is logically
// part of the previous comment.
.Ed
.Ss Примечания по расширению переменной
Чтобы избежать проблем со специальными символами оболочки, для каждой переменной выполняется 
следующее
.Ic $foo .
.Bl -enum
.It
Вставляются символы
.Dq $'
.It
Cтрока
.Dq $foo
удаляется
.It
Значение переменной
.Ic foo
вставляется в буфер со всеми символами одинарных кавычек, перед которыми
ставится обратная косая черта.
.El
.Pp
См. значение контрукции в
.Xr sh 1 .
Это безопасно во всех контекстах, кроме одного: внутри одинарных кавычек.
Если foo=meta и bar=var, то применяется правило, подобное следующему:
.Bd -literal -offset indent -compact
action "echo '$foo $bar'";
.Ed
будет передан в оболочку через
.Xr system 3
как
.Bd -literal -offset indent -compact
echo '$'meta' $'var''
.Ed
который выдает следующий результат:
.Bd -literal -offset indent -compact
$meta $var
.Ed
как его результат.
Это непредвиденный результат.
В будущей версии этого программного обеспечения это поведение изменится.
Пользователям не рекомендуется использовать одинарные кавычки внутри значения
.Ic action
без должной осторожности
.Pp
Все вышесказанное должно быть записано следующим образом
.Bd -literal -offset indent -compact
action "echo $foo' '$bar"
.Ed
чтобы создать единственный аргумент для echo.
Учитывая приведенное выше расширение, сопоставление простых переменных с
выражениями, заключенными в одинарные кавычки, приведет к правильному выводу
независимо от значения переменной.
.Sh FILES
.Bl -tag -width ".Pa /etc/devd.conf" -compact
.It Pa /etc/devd.conf
Конфигурационный файл
.Xr devd 8
.El
.Sh EXAMPLES
.Bd -literal
#
# Это приведет к перехвату событий отключения ссылок на интерфейсах fxp0 и ath0
#
notify 0 {
	match "system"			"IFNET";
	match "subsystem"		"(fxp0|ath0)";
	match "type"			"LINK_DOWN";
	action "logger $subsystem is DOWN";
};

#
# Сопоставление событий открытия/закрытия крышки.
# Их можно объединить в одно событие, 
# передав значение $notify внешнему скрипту.
#
notify 0 {
	match "system"			"ACPI";
	match "subsystem"		"Lid";
	match "notify"			"0x00";
	action "logger Lid closed, we can sleep now!";
};

notify 0 {
	match "system"			"ACPI";
	match "subsystem"		"Lid";
	match "notify"			"0x01";
	action "logger Lid opened, the sleeper must awaken!";
};

#
# Сопоставление типов USB-устройств
#
notify 0 {
	match "system"			"USB";
	match "subsystem"		"INTERFACE";
	match "type"			"ATTACH";
	match "intclass"		"0x0e";
	action "logger USB video device attached";
};

#
# Попробуйте настроить собственные устройства с помощью pccard_ether
# по мере их подключения.
#
attach 0 {
        device-name "(ath|iwn)[0-9]+";
        action "/etc/pccard_ether $device-name start";
};

#
# Останавливайте собственные устройства, когда они отсоединены
# от системы.
#
detach 0 {
        device-name "(ath|iwn)[0-9]+";
        action "/etc/pccard_ether $device-name stop";
};
.Ed
.Pp
Файл, установленный по этому пути:
.Pa /etc/devd.conf
содержит множество дополнительных примеров.
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr cam 4 ,
.Xr coretemp 4 ,
.Xr devfs 5 ,
.Xr re_format 7 ,
.Xr devd 8
.Sh ОШИБКИ
Взаимодействие с расширением переменной с помощью одинарных кавычек является
неоптимальным и неожиданным.