melkorbsd/ru-freebsd-man/man5/devfs.conf.5
.\" Copyright (c) 2004 Roland Smith <rsmith@xs4all.nl>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 25, 2019
.Dt DEVFS.CONF 5
.Os
.Sh ИМЯ
.Nm devfs.conf
.Nd boot-time devfs configuration information
.Sh ОПИСАНИЕ
Файл
.Nm
file предоставляет простой способ установить права собственности и разрешения, а также создать
ссылки для устройств, доступных при загрузке.
.Pp
Он не работает для устройств, подключенных и отключенных после запуска системы
например, \& USB-устройства.
См.
.Xr devfs.rules 5
для установки прав собственности и разрешений для всех узлов устройства, и
.Xr devd.conf 5
для действий, которые будут выполняться при подключении или отсоединении устройств.
.Pp
Строки, начинающиеся с хэш-знака
.Pq Ql #
и пустые строки игнорируются.
Строки, в которых указаны
.Nm
состоят из трех параметров, разделенных пробелами:
.Bl -tag -width indent
.It Ar action
Действие, которое необходимо предпринять для устройства.
Имена действий имеют значение только до первого уникального символа.
.It Ar devname
Имя устройства, созданного
.Xr devfs 5 .
.It Ar arg
Аргумент действия
.Ar action .
.El
.Pp
В настоящее время поддерживаются следующие действия:
.Bl -tag -width indent
.It Ic link
Это действие создает символическую ссылку с именем
.Ar arg
которая указывает на
.Ar devname ,
имя устройства, созданного
.Xr devfs 5 .
.It Ic own
Это действие изменяет право собственности на
.Ar devname .
Параметр
.Ar arg
должен быть представлен в виде
.Ar owner Ns : Ns Ar group
в том же виде, что и 
.Xr chown 8 .
.It Ic perm
Это действие изменяет права доступа к
.Ar devname .
Параметр
.Ar arg
должен быть 
.Ar mode
как объясняется в
.Xr chmod 1 .
.El
.Sh ФАЙЛЫ
.Bl -tag -compact -width Pa
.It Pa /etc/devfs.conf
.It Pa /usr/share/examples/etc/devfs.conf
.El
.Sh ПРИМЕРЫ
Чтобы создать
.Pa /dev/cdrom
ссылку, указывающую на первый CD-ROM,
можно добавить следующе
.Nm :
.Bd -literal -offset indent
link	cd0	cdrom
.Ed
.Pp
Чтобы задать владельца устройства,
.Ic own
может быть указано:
.Bd -literal -offset indent
own	cd0	root:cdrom
.Ed
.Pp
Чтобы установить разрешения для устройства,
.Ic perm
следует использовать действие разрешения:
.Bd -literal -offset indent
perm	cd0	0660
.Ed
.Sh SEE ALSO
.Xr chmod 1 ,
.Xr devd.conf 5 ,
.Xr devfs 5 ,
.Xr devfs.rules 5 ,
.Xr chown 8
.Sh АВТОРЫ
Эта страница руководства была написана
.An Roland Smith Aq Mt rsmith@xs4all.nl .