melkorbsd/ru-freebsd-man/man5/devfs.5
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 30 июня, 2022 
.Dt DEVFS 5
.Os
.Sh ИМЯ
.Nm devfs.Nd "Файловая система устройств"
.Sh КРАТКИЙ ОБЗОР
.Bd -literal
devfs /dev devfs rw 0 0
.Ed
.Sh ОПИСАНИЕ
Файловая система устройств, или
.Nm
предоставляет доступ к пространству имен устройств ядра
в глобальном пространстве имен файловой системы.
Обычная точка монтирования — это
.Pa /dev .
.Pp
обеспечивает доступ к устройствам ядра
в глобальном пространстве имен файловой системы.
В среде chroot
окружение,
.Xr devfs 8
можно использовать для создания новой
.Pa /dev
точки монтирования.
.Pp
Инструмент
.Xr mknod 8
 можно использовать для восстановления удаленных записей устройства в файле
.Nm .
.Pp
Файловая система
.Xr fdescfs 5
вляется альтернативным средством для заполнения
.Pa /dev/fd .
Символьные устройства, которые оба
.Nm
и
.Xr fdescfs 5
присутствуют в
.Pa /dev/fd
соответствуют открытым дескрипторам файлов процесса
обращающегося к каталогу.
.Nm
создаёт файлы только для стандартных файловых дескрипторов
.Pa 0 ,
.Pa 1
и
.Pa 2 .
.Xr fdescfs 5
создает файлы для всех открытых дескрипторов..
.Pp
Возможны следующие варианты:
.Bl -tag -width indent
.It Fl o Ar options
Используйте указанные параметры mount
.Ar options ,
как описано в
.Xr mount 8 .
Доступны следующие опции, специфичные для файловой системы devfs:
.Bl -tag -width indent
.It Cm ruleset Ns No = Ns Ar ruleset
Установить номер набора правил
.Ar ruleset
в качестве текущего набора правил для точки монтирования и применить все его правила.
Если номер набора правил
.Ar ruleset
не существует, будет создан пустой набор правил с номером
.Ar ruleset
будет создан.
См.
.Xr devfs 8
для получения дополнительной информации о работе с наборами правил devfs.
.El
.El
.Sh ФАЙЛЫ
.Bl -tag -width /dev/XXXX -compact
.It Pa /dev
Нормальная
.Nm
точка установки.
.El
.Sh ПРИМЕРЫ
Для установки
.Nm
тома, расположенного на
.Pa /mychroot/dev :
.Pp
.Dl "mount -t devfs devfs /mychroot/dev"
.Sh SEE ALSO
.Xr fdescfs 5 ,
.Xr devfs 8 ,
.Xr mount 8 ,
.Xr make_dev 9
.Sh ИСТОРИЯ
Файловая система
.Nm
впервые появилась в
.Fx 2.0 .
Она стала предпочтительным методом доступа к устройствам в
.Fx 5.0
и единственным методом в
.Fx 6.0 .
Страница руководства
.Nm
впервые появилась в
.Fx 2.2 .
.Sh АВТОРЫ
Страница руководства
.Nm
была написана
.An Mike Pritchard Aq Mt mpp@FreeBSD.org .