melkorbsd/ru-freebsd-man/man5/devfs.rules.5
.\" Copyright (c) 2004 Roland Smith <rsmith@xs4all.nl>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 1, 2020
.Dt DEVFS.RULES 5
.Os
.Sh ИМЯ
.Nm devfs.rules
.Nd devfs configuration information
.Sh ОПИСАНИЕ
.Nm
файл обеспечивает простой способ создания и применения правил
.Xr devfs 8 ,
даже для устройств, которые недоступны при загрузке.
.Pp
Об устройствах, доступных при загрузке, см.
.Xr devfs.conf 5 .
.Pp
Формат этого файла прост.
Пустые строки и строки, начинающиеся с хэш-знака
.Pq Ql #
игнорируются.
Строка между скобками обозначает начало набора правил.
В скобках должно быть указано имя набора правил и его номер,
разделенные знаком равенства.
.Pp
Другие строки - это спецификации правил, как описано в
.Xr devfs 8 ,
в разделе
.Sx "Rule Specification" .
К этим строкам добавляется
.Dq Li rule
и передаются в
.Xr devfs 8
сценариями запуска системы.
Важно поместить элементы пути, содержащие
.Xr glob 3
специальные символы между кавычками.
.Pp
Наборы правил должны иметь уникальное имя и номер.
.Pp
Все правила, которые следуют за объявлением набора правил, принадлежат этому набору правил, пока не будет создан
пока не будет создан новый набор правил.
.Pp
Один набор пользовательских правил должен быть включен в
.Pa /etc/rc.conf ,
иначе он не будет применяться к
.Pa /dev
файловой системе по умолчанию при запуске системы.
Например, чтобы включить
.Dq Li localrules
набор правил для
.Pa /dev
в файловой системе .Pa /dev, вам нужно будет использовать что-то вроде этого
.Pa rc.conf
файл:
.Bd -literal -offset indent
devfs_system_ruleset="localrules"
.Ed
.Pp
Правила загружаются при загрузке через службу devfs.
Чтобы загрузить измененные правила после загрузки системы, выполните команду:
.Bd -literal -offset indent
service devfs restart
.Ed
.Sh FILES
.Bl -tag -compact -width Pa
.It Pa /etc/defaults/devfs.rules
Default
.Nm
configuration file.
.It Pa /etc/devfs.rules
Local
.Nm
configuration file.
Правила, приведенные здесь, отменяют правила, приведенные в
.Pa /etc/defaults/devfs.rules
с одинаковым номером набора правил, в противном случае оба файла будут эффективно объединены.
.El
.Sh ПРИМЕРЫ
Чтобы сделать все разделы
.Xr da 4
чтобы все разделы устройств .Xr da 4 были доступны для чтения и записи их владельцу и
.Dq Li usb
можно использовать следующее правило:
.Pp
.Dl "[localrules=10]"
.Dl "add path 'da*s*' mode 0660 group usb"
.Pp
Первая строка объявляет и запускает новый набор правил с именем
.Va localrules
и число 10.
.Pp
Чтобы дать
.Xr usbconfig 8
И
.Xr libusb 3
приложениям с правами доступа ко всем usb-устройствам для их владельца и
.Dq Li usb
можно использовать аналогичное правило:
.Pp
.Dl "add path 'usb/*' mode 0660 group usb"
.Sh SEE ALSO
.Xr glob 3 ,
.Xr devfs 5 ,
.Xr devfs.conf 5 ,
.Xr devfs 8 ,
.Xr service 8
.Sh АВТОРЫ
This manual page was written by
.An Roland Smith Aq Mt rsmith@xs4all.nl .
