melkorbsd/ru-freebsd-man/man5/device.hints.5
.\" Copyright (c) 2001
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 19, 2019
.Dt DEVICE.HINTS 5
.Os
.Sh ИМЯ
.Nm device.hints
.Nd device resource hints
.Sh ОПИСАНИЕ
.Nm
файл считывается при загрузке
.Xr loader 8
когда система собирается стартовать, и его содержимое
передается ядру.
Он содержит различные переменные для управления поведением загрузочного
ядра.
Эти переменные обычно
.Dq подсказки устройства ,
но могут включать любые настраиваемые значения ядра.
.Pp
Файл содержит по одной переменной в строке.
Строки, начинающиеся с
.Ql #
являются комментариями и игнорируются загрузчиком.
.Pp
После того как файл будет прочитан загрузчиком, вы можете изучить
переменные с помощью программы
.Ic show
и добавить новую переменную, изменить существующую,
или удалить переменную с помощью команды
.Ic set
и
.Ic unset
командами загрузчика
(см. .Xr loader 8 ).
.Pp
После запуска системы вы можете сбросить эти переменные
с помощью команды
.Xr kenv 1 .
.Sh ПОДСКАЗКИ УСТРОЙСТВА
Переменные подсказки устройства используются драйверами устройств для настройки
устройства.
Чаще всего они используются драйверами устройств ISA для указания
где драйвер будет искать соответствующие устройства и какие
какие ресурсы он будет пытаться использовать.
.Pp
Строка подсказки устройства выглядит следующим образом:
.Pp
.Sm off
.D1 Li hint. Ar driver . Ar unit . Ar keyword Li = Qq Ar value
.Sm on
.Pp
где
.Ar driver
это имя драйвера устройства,
.Ar unit
номер единицы, и
.Ar keyword
ключевое слово подсказки.
Ключевое слово может быть:
.Pp
.Bl -tag -width ".Li disabled" -compact -offset indent
.It Li at
указывает шину, к которой подключено устройство.
.It Li port
sзадает начальный адрес портов ввода/вывода, которые будут использоваться устройством.
.It Li portsize
указывает количество портов, используемых устройством.
.It Li irq
номер используемой строки прерывания.
.It Li drq
номер канала DMA.
.It Li maddr
указывает физический адрес памяти, используемый устройством.
.It Li msize
задает размер физической памяти, используемой устройством.
.It Li flags
устанавливает различные биты флагов для устройства.
.It Li disabled
может быть установлен на
.Qq 1
чтобы отключить устройство.
.El
.Pp
Драйвер устройства может потребовать одну или несколько строк подсказок с этими ключевыми словами,
и может принимать другие ключевые слова, не перечисленные здесь, через
.Xr resource_int_value 9 .
Обратитесь к страницам руководств отдельных драйверов устройств, чтобы узнать о доступных
ключевых слов и их возможных значений.
.\" .Sh CONTROL VARIABLES
.\" Lines not starting with
.\" .Dq hint.
.\" specify other control variables for the kernel.
.\" They look:
.\" .Pp
.\" .Dl <name>="<value>"
.\" XXX
.\" WE SHOULD LIST AVAILABLE VARIABLE NAMES AND THEIR POSSIBLE VALUES HERE!
.\" .Pp
.Sh FILES
.Bl -tag -width ".Pa /sys/ Ns Ar ARCH Ns Pa /conf/GENERIC.hints" -compact
.It Pa /boot/device.hints
Файл подсказок ресурсов устройства.
.It Pa /sys/ Ns Ar ARCH Ns Pa /conf/GENERIC.hints
Образцы подсказок по ресурсам для
.Pa GENERIC
ядра.
.It Pa /sys/ Ns Ar ARCH Ns Pa /conf/NOTES
Заметки о файле конфигурации ядра и подсказки о ресурсах устройств.
.El
.Sh EXAMPLES
В следующем примере задаются ресурсы для драйвера
.Xr uart 4
на шине ISA:
.Bd -literal -offset indent
hint.uart.0.at="isa"
hint.uart.0.port="0x3F8"
hint.uart.0.flags="0x10"
hint.uart.0.irq="4"
.Ed
.Pp
В следующем примере драйвер ACPI отключен:
.Bd -literal -offset indent
hint.acpi.0.disabled="1"
.Ed
.Pp
Установка настраиваемой переменной:
.Bd -literal -offset indent
vm.pmap.pg_ps_enabled=1
.Ed
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr kenv 1 ,
.Xr loader.conf 5 ,
.Xr loader 8 ,
.Xr resource_int_value 9
.Sh ИСТОРИЯ
The
.Nm
file first appeared in
.Fx 5.0 .
