melkorbsd/ru-freebsd-man/man5/fstab.5
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)fstab.5	8.1 (Berkeley) 6/5/93
.\"
.Dd April 14, 2014
.Dt FSTAB 5
.Os
.Sh ИМЯ
.Nm fstab
.Nd статическая информация о файловых системах
.Sh КРАТКИЙ ОБЗОР
.In fstab.h
.Sh ОПИСАНИЕ
Файл
.Nm
содержит описательную информацию о различных файловых
системах.
.Nm
читается только программами и не записывается;
в обязанности системного администратора входит надлежащее создание
и ведение этого файла.
Каждая файловая система описана в отдельной строке;
Поля в каждой строке разделены символами табуляции или пробелами.
Порядок следования записей в
.Nm
важен, протому что
.Xr fsck 8 ,
.Xr mount 8 ,
и
.Xr umount 8
последовательно проходят через
.Nm ,
выполняя свою работу.
.Pp
Первое поле,
.Pq Fa fs_spec ,
описывает специальное устройство или
удаленную файловую систему, которые должны быть подключены.
Содержимое расшифровывается с помощью функции
.Xr strunvis 3 .
Это позволяет использовать пробелы или символы табуляции в названии устройства, которые в противном случае были бы
интерпретированы как разделители полей.
.Pp
Второе поле, 
.Pq Fa fs_file ,
описывает точку подключения файловой системы.
Для разделов подкачки это поле должно быть указано как
.Dq none .
Содержимое расшифровывается с помощью функции
.Xr strunvis 3
как и выше.
.Pp
Третье поле,
.Pq Fa fs_vfstype ,
описывает тип файловой системы.
Система может поддерживать различные типы файловых систем.
Только файловые системы root, /usr и /tmp должны быть статически
скомпилированы в ядро;
все остальное будет автоматически загружено во
время монтирования.
(Исключение: в настоящее время FFS не может быть загружена по требованию.)
Некоторые пользователи по-прежнему предпочитают статически
компилировать и другие файловые системы.
.Pp
Четвертое поле,
.Pq Fa fs_mntops ,
описывает параметры монтирования, связанные с файловой системой.
Он представлен в виде списка параметров, разделенных запятыми.
В нем указан, по крайней мере, тип монтирования (см.
.Fa fs_type
ниже), а также любые дополнительные параметры, соответствующие типу файловой системы.
Смотрите флажок "Параметры".
.Pq Fl o
на странице
.Xr mount 8
и странице, относящаяся к конкретной файловой системе, например,
.Xr mount_nfs 8 ,
для получения дополнительных опций, которые могут быть указаны.
Все параметры, которые могут быть заданы командам монтирования, специфичным для файловой системы
, также могут быть использованы в
файле
.Nm
Их просто нужно отформатировать немного по-другому.
Аргументы параметра
.Fl o
можно использовать без предшествующего
.Fl o
флага.
Для других параметров требуются как флаг, относящийся к конкретной файловой системе, так и его аргумент,
разделенные знаком равенства.
Например, для установки
.Xr msdosfs 5
filesystem, the options
.Bd -literal -offset indent
-o sync -o noatime -m 644 -M 755 -u foo -g bar
.Ed
.Pp
должно быть записано как
.Bd -literal -offset indent
sync,noatime,-m=644,-M=755,-u=foo,-g=bar
.Ed
.Pp
in the option field of
.Nm .
.Pp
Если параметры
.Dq userquota
и/или
.Dq groupquota
указаны,
файловая система автоматически обрабатывает
.Xr quotacheck 8
команду, а пользовательские и/или групповые дисковые квоты включаются с помощью
.Xr quotaon 8 .
По умолчанию
квоты файловой системы сохраняются для файлов с именами
.Pa quota.user
и
.Pa quota.group
которые расположены в корневом каталоге соответствующей файловой системы.
Эти значения по умолчанию можно изменить, поставив знак равенства
и альтернативный абсолютный путь после параметра quota.
Таким образом, если файл пользовательской квоты для
.Pa /tmp
хранятся в
.Pa /var/quotas/tmp.user ,
это местоположение может быть указано следующим образом:
.Bd -literal -offset indent
userquota=/var/quotas/tmp.user
.Ed
.Pp
Если опция
.Dq failok
указана, то
система будет игнорировать любую ошибку, возникающую при монтировании этой файловой системы,
которая в противном случае привела бы к переходу системы в однопользовательский режим.
Эта опция реализована с помощью команды
.Xr mount 8
и не будет передана ядру.
.Pp
Если опция
.Dq noauto
указана, то файловая система не будет автоматически
монтироваться при запуске системы.
Обратите внимание, что для сетевых файловых систем
сторонних
производителей (т.е. типов, поддерживаемых дополнительным программным
обеспечением, не входящим в базовую систему)
будет автоматически монтироваться при запуске системы,
Переменная
.Va extra_netfs_types
.Xr rc.conf 5
должна использоваться для расширения
списка типов сетевых файловых систем в сценарии запуска
.Xr rc 8
.Pp
Если опция
.Dq late
указана, то  tфайловая система будет автоматически подключена
на этапе запуска системы после установки удаленных точек монтирования.
Более подробную информацию об этой опции
смотрите в разделе
.Xr mount 8
.Pp
Если указана опция
.Dq update ,
is это означает, что статус уже смонтированной файловой
системы должен быть соответствующим образом изменен.
Это позволяет, например, обновлять файловые системы, подключенные только для
чтения, для записи и наоборот.
По умолчанию запись, соответствующая уже
подключенной файловой системе, будет пропущена при обработке
.Nm ,
если только это не корневая файловая система, и в этом случае логика аналогична
.Dq update ,
применяется автоматически.
.Pp
Опция
.Dq update
обычно используется в сочетании с двумя
.Nm
файлами.
Первый файл
.Nm
используется для настройки исходного набора файловых систем.
Затем запускается второй файл
.Nm
для обновления исходного набора файловых систем и
добавления дополнительных файловых систем.
.Pp
Тип монтирования извлекается из поля
.Fa fs_mntops
и сохраняется отдельно в поле
.Fa fs_type
(он не удаляется из поля
.Fa fs_mntops
).
Если
.Fa fs_type
равен
.Dq rw
или
.Dq ro
то файловая система, имя которой указано в поле
.Fa fs_file
обычно монтируется для чтения-записи или только для чтения в
указанном специальном файле.
.Pp
Если
.Fa fs_type
равен
.Dq sw
то специальный файл становится доступным как часть пространства подкачки
с помощью команды
.Xr swapon 8
в конце процедуры перезагрузки системы.
Для устройств подкачки ключевое
слово 
.Dq trimonce
запускает отправку команды на устройство.
.Dv BIO_DELETE
Эта команда помечает блоки устройства как неиспользуемые, за исключением тех, в которых
может храниться метка диска.
Эта пометка может стереть аварийный дамп.
Чтобы отложить замену
.Nm swapon
для устройства до тех пор, пока
.Nm savecore
не скопирует аварийный дамп в другое место, используйте опцию
.Dq late .
Для пространств подкачки, поддерживаемых vnode, поддерживается файл
.Dq file
в поле
.Fa fs_mntops
Когда
.Fa fs_spec
- это файл устройства
.Xr md 4
.Pq Do md Dc or Do md[0-9]* Dc
и
.Dq file
указан в 
.Fa fs_mntopts ,
устройство
.Xr md 4
создается с использованием указанного файла, используемого в качестве резервного хранилища,
а затем новое устройство используется в качестве пространства подкачки.
Замена записей на устройствах с расширением
.Pa .eli
приведет к автоматическому созданию зашифрованных устройств.
Опции
.Dq ealgo ,
.Dq aalgo ,
.Dq keylen ,
.Dq notrim ,
и
.Dq sectorsize
могут быть переданы для управления 
.Xr geli 8
параметрам.
Поля, отличные от
.Fa fs_spec
и
.Fa fs_type
не используются.
Если
.Fa fs_type
указан как
.Dq xx
, запись игнорируется.
Это полезно для отображения разделов диска, которые в данный момент не используются.
.Pp
Пятое поле,
.Pq Fa fs_freq ,
используется для этих файловых систем командой
.Xr dump 8
чтобы определить, какие файловые системы необходимо удалить.
Если пятое поле отсутствует, возвращается нулевое значение, и
.Nm dump
будет считать, что файловая система не нуждается в удалении.
Если пятое поле больше 0, то оно указывает количество дней
между удалениями для этой файловой системы.
.Pp
Шестое поле
.Pq Fa fs_passno ,
используется программами
.Xr fsck 8
и
.Xr quotacheck 8
для определения порядка, в котором выполняются проверки файловой системы и квот
во время перезагрузки.
Поле
.Fa fs_passno
может содержать любое значение от 0 до
.Ql INT_MAX Ns -1 .
.Pp
Корневая файловая система должна быть указана с номером
.Fa fs_passno
равным
1, а другие файловые системы должны иметь значение
.Fa fs_passno
 равное 2 или более.
Файловая система с параметром
.Fa fs_passno
без значения 1 всегда проверяется последовательно и завершается перед
обработкой другой файловой системы, и она будет обработана перед
всеми файловыми системами с большим значением
.Fa fs_passno .
.Pp
При любом заданном значении параметра
.Fa fs_passno ,
файловые системы на диске будут проверяться последовательно,
но файловые системы на разных дисках будут проверяться
одновременно, чтобы использовать параллелизм, доступный в аппаратном обеспечении.
Как только все проверки файловой системы будут завершены для текущего
.Fa fs_passno ,
тот же процесс начнется заново для следующего
.Fa fs_passno .
.Pp
Если шестое поле отсутствует или равно нулю,
возвращается нулевое значение и
.Xr fsck 8
и
.Xr quotacheck 8
будут предполагать, что файловая система не нуждается в проверке.
.Pp
Поле
.Fa fs_passno
может использоваться для более точного управления, когда
системные утилиты могут определить, что файловая система находится
на другом физическом устройстве, хотя на самом деле это не так, как в случае с устройством
.Xr ccd 4 .
Все файловые системы с более низким значением
.Fa fs_passno
будут завершены перед запуском в файловых системах с более высоким
значением
.Fa fs_passno .
Например, все файловые системы с номером
.Fa fs_passno
равным 2, будут завершены до запуска любых файловых систем с номером
.Fa fs_passno
равным 3 или более.
Между различными значениями 
.Fa fs_passno
допускаются пробелы
Например, файловые системы, перечисленные в файле
.Pa /etc/fstab
могут иметь
.Fa fs_passno
такие значения, как 0, 1, 2, 15, 100, 200, 300, и могут располагаться в любом порядке
внутри
.Pa /etc/fstab .
.Bd -literal
#define	FSTAB_RW	"rw"	/* read/write device */
#define	FSTAB_RQ	"rq"	/* read/write with quotas */
#define	FSTAB_RO	"ro"	/* read-only device */
#define	FSTAB_SW	"sw"	/* swap device */
#define	FSTAB_XX	"xx"	/* ignore totally */

struct fstab {
	char	*fs_spec;	/* block special device name */
	char	*fs_file;	/* file system path prefix */
	char	*fs_vfstype;	/* File system type, ufs, nfs */
	char	*fs_mntops;	/* Mount options ala -o */
	char	*fs_type;	/* FSTAB_* from fs_mntops */
	int	fs_freq;	/* dump frequency, in days */
	int	fs_passno;	/* pass number on parallel fsck */
};
.Ed
.Pp
Правильный способ чтения записей из
.Pa fstab
заключается в использовании процедур
.Xr getfsent 3 ,
.Xr getfsspec 3 ,
.Xr getfstype 3 ,
и
.Xr getfsfile 3 .
.Sh FILES
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
Файл
.Nm
Находится по следующему пути:
.Pa /etc .
.El
.Sh EXAMPLES
.Bd -literal
# Устройство	Точка монтирования	FStype	Опции	Дамп	Pass#
#
# Файловая система UFS.
/dev/da0p2	/		ufs	rw		1	1
#
# Пространство подкачки на заблокированном устройстве
/dev/da0p1	none		swap	sw		0	0
#
# Пространство подкачки с помощью заблокированного устройства с шифрованием GBDE/GELI.
# доступны варианты algo, ealgo, keylen, sectorsize
# для устройств .eli.
/dev/da1p1.bde	none		swap	sw		0	0
/dev/da1p2.eli	none		swap	sw		0	0
#
# tmpfs.
tmpfs		/tmp		tmpfs	rw,size=1g,mode=1777	0 0
#
#Файловая система UFS на md с поддержкой подкачки(4). 
# Автоматически создается файл /dev/md10. Если это "md", то 
# автоматически будет выбран номер устройства.
md10		/scratch	mfs	rw,-s1g		0	0
#
# Пространство подкачки на md с поддержкой vnode(4).
md11		none		swap	sw,file=/swapfile	0 0
#
# CD-ROM. Обычно используется опция "noauto", поскольку носитель
# является съемным.
/dev/cd0	/cdrom		cd9660	ro,noauto	0	0
#
# NFS-экспортируемая файловая система. "serv" - это имя сервера NFS
# или IP-адрес.
serv:/export	/nfs		nfs	rw,noinet6	0	0
.Ed
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr getfsent 3 ,
.Xr getvfsbyname 3 ,
.Xr strunvis 3 ,
.Xr ccd 4 ,
.Xr dump 8 ,
.Xr fsck 8 ,
.Xr geli 8 ,
.Xr mount 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8 ,
.Xr swapon 8 ,
.Xr umount 8
.Sh ИСТОРИЯ
Формат файля
.Nm
появился в версии
.Bx 4.0 .
