melkorbsd/ru-freebsd-man/man5/group.5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)group.5	8.3 (Berkeley) 4/19/94
.\"
.Dd 8 февраля, 2013
.Dt GROUP 5
.Os
.Sh ИМЯ
.Nm group
.Nd формат разрешений файла разрешений группы
.Sh ОПИСАНИЕ
Файл
.Nm
является локальным источником информации о группе.
Он может быть использован вместе с Hesiod доменом
`group', а также NIS картами `group.byname' и `group.bygid',
контроллируемыми
.Xr nsswitch.conf 5 .
.Pp
Файл
.Nm
состоит из разделенных разрывом строки
.Tn ASCII
записей, одна на группу, содержащих четыре разделенных двотечиями
.Ql \&:
поля.
Этими полями являются:
.Bl -tag -width password -offset indent -compact
.It group
Название группы.
.It passwd
.Em зашифрованный
пароль группы.
.It gid
ID группы в десятичном формате.
.It member
Члены группы.
.El
.Pp
Строчки, первым символом (кроме пробела) которых является символ фунта (#)
являются комментариями и игнорируются.
Пустые строчки, которые состоят 
только из пробелов, табуляций или разрывов строки также игнорируются.
.Pp
Поле 
.Ar group
является именем группы, которое используется для предоставления файлового доступа
пользователям, которые являются членами группы.
Поле
.Ar gid
является числом, связанное с именем группы.
Они оба должны быть уникальны для всей системы (и
зачастую для целой группы систем), поскольку они 
контроллируют доступ к файлам.
Поле
.Ar passwd
является необязательным
.Em зашифрованным
паролем.
Это поле редко используется и обычно оно
заполняется звездочкой вместо того, чтобы 
оставлять его пустым.
Поле
.Ar member
содержит имена пользователей, имеющих разрешения группы
.Ar group .
Имена пользователей отделены запятыми без пробелов или разрывов строки.
Пользователь автоматически находится в группе 
если она прописана в их записи в
.Pa /etc/passwd
и его не нужно добавлять в эту группу в файле
.Nm
.\" .Pp
.\" Когда система читает файл
.\" .Pa /etc/group
.\" ,поля считываются из структуры
.\" .Fa group
.\" , объявленной в
.\" .In grp.h :
.\" .Bd -literal -offset indent
.\" struct group {
.\"	char    *gr_name;        /* group name */
.\"	char    *gr_passwd;      /* group password */
.\"	int     gr_gid;          /* group id */
.\"	char    **gr_mem;        /* group members */
.\" };
.\" .Ed
.Sh УКАЗАНИЯ ПО РЕАЛИЗАЦИИ
Команда
.Xr passwd 1
не изменяет пароли
.Nm
Вместо нее, команда
.Xr pw 8
программы
.Cm groupmod
рекомендуется к использованию.
.Sh ОГРАНИЧЕНИЯ
Существуют различные ограничения, которые обьясняются в 
функции, где они случаются; смотрите секцию
.Sx SEE ALSO .
.Pp
В старых реализациях,
в группе не может состоять более двухсот человек.
Максимальная длина строки файла
.Pa /etc/group
является 1024 символа.
Более длинные строки пропускаются.
Это ограничение исчезло в
.Fx 3.0 .
Старые двоичные файлы со статической связью 
зависят от старых разделяемых библиотек или от
.No non- Ns Fx
двоичных файлов в режиме совместимости.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/group -compact
.It Pa /etc/group
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr newgrp 1 ,
.Xr passwd 1 ,
.Xr setgroups 2 ,
.Xr crypt 3 ,
.Xr getgrent 3 ,
.Xr initgroups 3 ,
.Xr nsswitch.conf 5 ,
.Xr passwd 5 ,
.Xr chkgrp 8 ,
.Xr pw 8 ,
.Xr yp 8
.Sh ИСТОРИЯ
Файловый формат
.Nm
появился в
.At v6 .
Поддержка комментариев впервые появилась в
.Fx 3.0 .
