melkorbsd/ru-freebsd-man/man5/hosts.equiv.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 25, 2013
.Dt HOSTS.EQUIV 5
.Os
.Sh ИМЯ
.Nm hosts.equiv ,
.Nm .rhosts
.Nd база данных доверенных удаленных хостов и имен пользователей
.Sh ОПИСАНИЕ
.Nm
и
.Nm .rhosts
содержат информацию о
доверенных узлов и пользователей в сети.
.Pp
simple
.Bd -unfilled -offset indent
hostname [username]
.Ed
.Pp
or the more verbose
.Bd -unfilled -offset indent
[+-][hostname|@netgroup] [[+-][username|@netgroup]]
.Ed
.Pp
.Dq @
указывает на хост по сетевой группе или пользователя по сетевой группе.
Одиночный
.Dq +
соответствует всем хостам или пользователям.
Имя хоста с ведущим
.Dq -
отклонит
все совпадающие хосты и всех их пользователей.
Имя пользователя с ведущим
.Dq -
отклонит всех подходящих пользователей с подходящих хостов.
.Pp
Элементы разделяются любым количеством пробелов и/или
символами табуляции.
.Dq #
указывает на начало
комментария; cсимволы до конца строки
не интерпретируются программами, выполняющими поиск в файле.
.Pp
Имена хостов указываются в традиционной интернет-системе DNS
домены с точками
.Dq .\&
(точка), используя нотацию
.Xr inet_addr 3
процедура
из библиотеки манипулирования интернет-адресами,
.Xr inet 3 .
Имена хостов могут содержать любой печатаемый
символ, кроме разделителя полей, новой строки,
или символа комментария.
.Pp
В целях безопасности пользовательские
.Nm .rhosts
будет проигнорирован, если он не является обычным файлом, или если он
не принадлежит пользователю, или
если он доступен для записи кому-либо, кроме пользователя.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/hosts.equivxxx -compact
.It Pa /etc/hosts.equiv
Файл
.Nm
находится в
.Pa /etc .
.It Pa $HOME/.rhosts
.Nm .rhosts
файл находится в
.Pa $HOME .
.El
.Sh ПРИМЕРЫ
.Dl bar.com foo
.Pp
Доверять пользователю
.Dq foo
от хоста
.Dq bar.com .
.Pp
.Dl +@allclient
.Pp
Доверять всем хостам из группы
.Dq allclient .
.Pp
.Dl +@allclient -@dau
.Pp
Доверять всем хостам из группы
.Dq allclient
и их пользователям,
кроме пользователей из группы
.Dq dau .
.Sh SEE ALSO
.Xr rcp 1 ,
.Xr gethostbyname 3 ,
.Xr inet 3 ,
.Xr innetgr 3 ,
.Xr ruserok 3 ,
.Xr netgroup 5 ,
.Xr ifconfig 8 ,
.Xr yp 8
.Sh ОШИБКИ
Эта страница руководства неполная.
Для получения дополнительной информации читайте
исходный текст в
.Pa src/lib/libc/net/rcmd.c
или на странице руководства по SunOS.
