melkorbsd/ru-freebsd-man/man5/hosts.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)hosts.5	8.2 (Berkeley) 12/11/93
.\"
.Dd September 15, 2022
.Dt HOSTS 5
.Os
.Sh ИМЯ
.Nm hosts
.Nd host name data base
.Sh ОПИСАНИЕ
Файл
.Nm
файл содержит информацию об
известных хостов в сети.
Она может использоваться совместно с DNS и картами NIS
картами `hosts.byaddr' и `hosts.byname', как это контролируется в
.Xr nsswitch.conf 5 .
Для каждого хоста должна присутствовать одна строка
со следующей информацией:
.Bd -unfilled -offset indent
Интернет-адрес
официальное имя хоста
псевдонимы
.Ed
.Pp
Элементы разделяются любым количеством пробелов и/или
символами табуляции.
Символ ``#'' указывает на начало
комментарий; символы до конца строки
не интерпретируются программами, выполняющими поиск в файле.
.Pp
Этот файл представляет собой резервную копию, используемую, когда сервер имен
не работает.
Для сервера имен рекомендуется включать в этот файл только несколько адресов
включать в этот файл.
К ним относятся адреса для локальных интерфейсов, которые
.Xr ifconfig 8
во время загрузки и нескольких машин в локальной сети.
.Pp
Сетевые адреса указываются либо в обычной форме
``.'' (точка) для IPv4 или в шестнадцатеричной нотации двоеточия для IPv6,
в соответствии с пониманием
.Xr inet_pton 3
рутина
из библиотеки манипулирования интернет-адресами,
.Xr inet 3 .
Имена хостов могут содержать любой печатаемый
символ, кроме разделителя полей, новой строки,
или символа комментария.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/hosts -compact
.It Pa /etc/hosts
Файл
.Nm
распологается в
.Pa /etc .
.El
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr gethostbyname 3 ,
.Xr inet 3 ,
.Xr nsswitch.conf 5 ,
.Xr ifconfig 8
.Sh ИСТОРИЯ
Формат
.Nm
файла появился в
.Bx 4.1c .
