melkorbsd/ru-freebsd-man/man5/hosts.lpd.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 1, 1996
.Dt HOSTS.LPD 5
.Os
.Sh ИМЯ
.Nm hosts.lpd
.Nd trusted hosts that may use local print services
.Sh ОПИСАНИЕ
Файл
.Nm
содержит список имен хостов или IP-адресов
которым разрешено использовать ваши локальные службы печати.
Список всех имён хостов или IP-адресов в отдельной строке.
.Pp
Если вы хотите разрешить доступ для всех хостов,
вы обычно можете использовать функцию NIS netgroups, чтобы
добавив строку с одним символом
.Ql +
символом.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/hosts.lpdxxxxx -compact
.It Pa /etc/hosts.lpd
Файл
.Nm
распологается в 
.Pa /etc .
.El
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr printcap 5 ,
.Xr lpd 8
