melkorbsd/ru-freebsd-man/man5/hosts_options.5
.TH HOSTS_OPTIONS 5
.SH ИМЯ
hosts_options \- расширения языка управления доступом к хостам
.SH ОПИСАНИЕ
Этот документ описывает необязательные расширения языка, описанного
в документе hosts_access(5). Расширения включаются во время
во время сборки программы. Например, путем редактирования Makefile и включения опции 
PROCESS_OPTIONS во время компиляции.
.PP
Расширяемый язык использует следующий формат:
.sp
.ti +3
daemon_list : client_list : option : option ...
.PP
Первые два поля описаны на странице руководства hosts_access(5).
Остальная часть правил представляет собой список из нуля или более опций.  Любые ":"
в опциях должны быть защищены обратной косой чертой.
.PP
Опция имеет вид "ключевое слово" или "значение ключевого слова". Опции
обрабатываются в указанном порядке. Некоторые опции подвергаются
%<буква>. Для обеспечения обратной совместимости с
предыдущими версиями, между ключевым словом и значением допускается символ "=".
.SH РЕГИСТРАЦИЯ
.IP "severity mail.info"
.IP "severity notice"
Измените уровень серьезности, на котором будет регистрироваться событие. Объект
имена (например, mail) являются необязательными и не поддерживаются в системах
со старыми версиями syslog. Параметр серьезности можно использовать
чтобы подчеркнуть или проигнорировать определенные события.
.SH КОНТРОЛЬ ДОСТУПА
.IP "allow"
.IP "deny"
Разрешить (запретить) обслуживание. Эти параметры должны находиться в конце правила.
.PP
Ключевые слова \fIallow\fR и \fIdeny\fR позволяют хранить все
правила управления доступом в одном файле, например, в файле
\fIhosts.allow\fR.
.sp
Чтобы разрешить доступ только с определенных хостов:
.sp
.ne 2
.ti +3
ALL: .friendly.domain: ALLOW
.ti +3
ALL: ALL: DENY
.sp
Разрешить доступ со всех узлов, кроме нескольких проблемных:
.sp
.ne 2
.ti +3
ALL: .bad.domain: DENY
.ti +3
ALL: ALL: ALLOW
.sp
Обратите внимание на ведущую точку в шаблонах доменных имен.
.SH ВЫПОЛНЕНИЕ ДРУГИХ КОМАНЛ
.IP "spawn shell_command"
Выполнение в дочернем процессе указанной команды оболочки после
выполнения расширений %<букв>, описанных на странице руководства hosts_access(5)
странице руководства.  Команда выполняется с stdin, stdout и stderr
подключенными к нулевому устройству, чтобы не испортить
чтобы не испортить разговор с клиентским хостом. Пример:
.sp
.nf
.ti +3
spawn (/some/where/safe_finger -l @%h | /usr/ucb/mail root) &
.fi
.sp
выполняет в фоновом дочернем процессе команду оболочки "safe_finger
-l @%h | mail root", заменив %h на имя или адрес
удаленного хоста.
.sp
В примере используется команда "safe_finger" вместо обычной команды
"finger", чтобы ограничить возможный ущерб от данных, отправленных сервером finger
сервером. Команда "safe_finger" является частью пакета оболочки daemon
пакета; это оболочка поверх обычной команды finger, которая фильтрует
данные, отправляемые удаленным хостом.
.IP "twist shell_command"
Заменить текущий процесс экземпляром указанной команды оболочки
после выполнения расширений %<букв>, описанных на странице руководства
странице руководства hosts_access(5).  Stdin, stdout и stderr подключаются к
клиентскому процессу. Этот параметр должен находиться в конце правила.
.sp
Чтобы отправить клиенту настроенное сообщение об отказе, вместо того чтобы
запуска настоящего ftp-daemon:
.sp
.nf
.ti +3
in.ftpd : ... : twist /bin/echo 421 Some bounce message
.fi
.sp
Альтернативный способ общения с клиентскими процессами см.
\fIbanners\fR ниже.
.sp
Чтобы запустить /some/other/in.telnetd, не загрязняя его командную строку
массив командной строки или окружение процесса:
.sp
.nf
.ti +3
in.telnetd : ... : twist PATH=/some/other; exec in.telnetd
.fi
.sp
Внимание: в случае UDP-сервисов не следует выполнять команды, использующие
стандартный ввод-вывод или процедуры чтения(2)/записи(2) для взаимодействия с
клиентским процессом; UDP требует других примитивов ввода/вывода.
.SH ОПЦИИ СЕТИ
.IP "keepalive"
Заставляет сервер периодически отправлять сообщение клиенту.  Соединение
соединение считается разорванным, если клиент не отвечает. Опция
keepalive может быть полезен, когда пользователь выключает машину, а она
пока он все еще подключен к серверу.  Опция keepalive не полезна
для служб дейтаграмм (UDP).
.IP "linger number_of_seconds"
Указывает, как долго ядро будет пытаться доставить еще не доставленные
данные после того, как серверный процесс закроет соединение. 
.SH ПОИСК ИМЕНИ ПОЛЬЗОВАТЕЛЯ
.IP "rfc931 [ timeout_in_seconds ]"
Поиск имени пользователя клиента с помощью протокола RFC 931 (TAP, IDENT, RFC 1413)
протоколом.  Этот параметр молча игнорируется в случае служб, основанных на
транспортах, отличных от TCP.  Она требует, чтобы в клиентской системе был запущен
RFC 931 (IDENT и т. д.) - совместимый daemon, и может вызвать заметные
задержек при соединениях с не-UNIX клиентами.  Период таймаута является
необязательным. Если тайм-аут не указан, используется значение по умолчанию, определенное при компиляции
принимается значение по умолчанию, определенное во время компиляции.
.SH ДОПОЛНИТЕЛЬНО
.IP "banners /some/directory"
Найдите в `/some/directory' файл с тем же именем, что и у процесса daemon
процесса (например, in.telnetd для службы telnet), и скопируйте его
содержимое на клиент. Символы новой строки заменяются на
каретка-возврат новой строки, а последовательности %<букв> расширяются (см.
страницу руководства hosts_access(5)).
.sp
В дистрибутив исходного кода tcp wrappers входит пример makefile
(Banners.Makefile) для удобного обслуживания баннеров.
.sp
Внимание: баннеры поддерживаются только для сетевых служб, ориентированных на соединение (TCP)
только для сетевых служб, ориентированных на соединение (TCP).
.IP "nice [ number ]"
Измените значение приятности процесса (по умолчанию 10).  Укажите положительное
чтобы тратить больше ресурсов процессора на другие процессы. 
.IP "setenv name value"
Поместите пару (имя, значение) в среду процесса. Значение
подвергается расширению %<букв> и может содержать пробелы (но
ведущие и последующие пробелы удаляются).
.sp
Внимание: многие сетевые daemon сбрасывают свое окружение перед тем, как породить
логина или процесса оболочки.
.IP "umask 022"
Например, команда umask, встроенная в оболочку. Значение umask, равное 022
предотвращает создание файлов с групповым и мировым правом записи.
Аргумент umask должен быть восьмеричным числом.
.IP "user nobody"
.IP "user nobody.kmem"
Примите привилегии идентификатора пользователя "nobody" (или пользователя "nobody", группы
"kmem"). Первая форма полезна для реализаций inetd, которые запускают
все службы с привилегиями root. Вторая форма полезна для
служб, которым нужны только привилегии специальных групп.
.SH ДИАГНОСТИКА
Если в правиле управления доступом обнаружена синтаксическая ошибка, она
будет сообщено daemon syslog; дальнейшие опции будут проигнорированы,
и в обслуживании будет отказано.
.SH СМОТРЕТЬ ТАКЖЕ
hosts_access(5), язык управления доступом по умолчанию
.SH АВТОРЫ
.na
.nf
Wietse Venema (wietse@wzv.win.tue.nl)
Department of Mathematics and Computing Science
Eindhoven University of Technology
Den Dolech 2, P.O. Box 513, 
5600 MB Eindhoven, The Netherlands
\" @(#) hosts_options.5 1.10 94/12/28 17:42:28
