melkorbsd/ru-freebsd-man/man5/INDEX.5
.\"
.\" Copyright (c) 2004 Paul Armstrong
.\" Copyright (c) 2009 Thomas Abthorpe
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\" notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\" notice, this list of conditions and the following disclaimer in the
.\" documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 14 октября, 2012
.Dt PORTINDEX 5
.Os
.Sh ИМЯ
.Nm INDEX
.Nd "Файл, содержащий информацию о состоянии дерева портов"
.Sh ОПИСАНИЕ
Файл индекса портов в
.Pa /usr/ports
содержит различные сведения о дереве портов.
Каждая основная ветвь
.Fx
имеет отдельный файл индекса, названный
.Dq INDEX- Ns Ar N ,
где
.Ar N
это номер основной версии
.Fx
ветви, т.е.:
.Pa INDEX-7 ,
или
.Pa INDEX-8 .
.Bl -tag -width XXXXXXXXXX
.It Cm \&name
Имя пакета.
.It Cm \&path
Путь к каталогу порта.
.It Cm \&install prefix
Префикс установки по умолчанию.
.It Cm \&short description
Краткое описание.
.It Cm \&full description
Путь к полному описанию.
.It Cm \&maintainer email
Адрес электронной почты поддерживающего.
.It Cm \&index
Категории, к которым относится этот порт.
.It Cm \&build dependencies
Порты, которые необходимо установить перед сборкой этого порта.
.It Cm \&run dependencies
Порты, которые необходимо установить для работы этого порта.
.It Cm \&website
Веб-сайт проекта для порта.
.It Cm \&e-deps
Порты, которые могут потребоваться для извлечения этого порта.
.It Cm \&p-deps
Порты, которые могут потребоваться для патча этого порта.
.It Cm \&f-deps
Порты, которые могут потребоваться для загрузки этого порта.
.El
.Sh ФАЙЛЫ
.Bl -tag -width /usr/ports/INDEX-8XX
.It Pa /usr/ports/INDEX- Ns Ar N
где
.Ar N
это номер основной версии
.Fx
ветви.
.El
.Sh ПРИМЕРЫ
.Bd -literal
vim-6.3.15|/usr/ports/editors/vim|/usr/local|Vi "аналог", с множеством дополнительных функций|/usr/ports/editors/vim/pkg-descr|obrien@FreeBSD.org|editors|libiconv-1.9.2_1|libiconv-1.9.2_1|http://www.vim.org/|||
.Ed
.Sh СМОТРИ ТАКЖЕ
.Xr build 7 ,
.Xr ports 7
.Sh АВТОРЫ
.An -nosplit
Эта страница руководства была написана
.An Paul Armstrong
и
.An Thomas Abthorpe Aq Mt tabthorpe@FreeBSD.org .