melkorbsd/ru-freebsd-man/man5/jail.conf.5
.\" Copyright (c) 2012 James Gritton
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 5 сентября, 2023
.Dt JAIL.CONF 5
.Os
.Sh ИМЯ
.Nm jail.conf
.Nd файл конфигурации для
.Xr jail 8
.Sh ОПИСАНИЕ
Файл конфигурации
.Xr jail 8
состоит из одного или более операторов определений jail,
а также параметер или операторы переменных внутри этих определений jail.
Оператор определения Jail выглядит примерно как составной оператор на языке C.
Оператор параметра выглядит как присваивание на языке C, 
включая точку с запятой.
.Pp
Примерный синтаксис определения jail выглядит так:
.Bd -literal -offset indent
jailname {
	parameter = "value";
	parameter = "value";
	...
}
.Ed
.Pp
Каждый jail должен иметь
.Va название
в начале его определения.
Это используется 
.Xr jail 8
чтобы обозначить jail на командной строке и сообщить 
о ней статусу jail. Оно также передается ядру когда 
создается новый jail.
.Ss Параметры
Jail задается несколько параметров, указанных внутри
определения jail.
.Em Смотрите
.Xr jail 8
.Em для полного списка параметров jail
передаваемых ядру, а также внутренних параметров, используемых при создании и
удалении jail.
.Pp
Обычно у параметра есть имя и значение.
Некоторые параметры булевые и могут быть определены значениями
.Dq true
или
.Dq false ,
или как ярлыки без значений с префиксом
.Dq no
, обозначающим ложное значение.
Например, оба этих параметра эквивалентны:
.Bd -literal -offset indent
allow.mount = "false";
allow.nomount;
.Ed
.Pp
Другие параметры могут иметь более чем одно значение.
Список значений, разделенных запятыми, может быть задан одним оператором.
К уже существующему списку можно добавить значение используя "+="
.Dq += :
.Bd -literal -offset indent
ip4.addr = 10.1.1.1, 10.1.1.2, 10.1.1.3;

ip4.addr = 10.1.1.1;
ip4.addr += 10.1.1.2;
ip4.addr += 10.1.1.3;
.Ed
.Pp
Важно заметить, что параметр
.Va name
неявно задан имени в определении jail.
.Ss Строчный формат
Значения параметров, включая имена jail, могут быть единичными токенами или строками
в кавычках.
Токеном является любая последовательность из символов, которые не считаяются специальными
в синтаксисе файла конфигурации (например, пробел или 
точка с запятой).
Если значение содержит что-то кроме букв, цифр, точек, тире
или подчеркиваний, то рекомендуется поставить кавычки вокруг данного значения.
Можно использовать и двойные и единичные кавычки.
.Pp
Специальные символы могут быть поставлены в кавычки с помощью обратного слэша.
Обычные коды символов обратного слэша на подобии языка C также поддерживаются, включая
управляющие символы и восьмеричные и шестнадцатеричные или коды ASCII.
Обратный слэш в конце строки игнорирует разрыв строки и продолжает строку 
в начале на следующей строке
.Ss Переменные
Строка может использовать замену переменных как в shell.
Параметр или имя переменной, перед которыми написан знак доллара, а также вложенные в фигурные скобки
будут заменены значением этого параметра или этой 
переменной.
Например, путь к jail может быть обозначен своим именем или именем своего
хоста:
.Bd -literal -offset indent
path = "/var/jail/$name";

path = "/var/jail/${host.hostname}";
.Ed
.Pp
Замена переменной происходит в токенах без кавычек или в строках с двойными кавычками,
но не с единичными.
.Pp
Переменная обозначается так же, как и параметр, за исключением того, что
перед именем переменной идет знак доллара:
.Bd -literal -offset indent
$parentdir = "/var/jail";
path = "$parentdir/$name";
.Ed
.Pp
Разница между параметром и переменной в том, что переменные
только используются для замены, когда параметры используются и
для замены и для передачи ядру.
.Ss Шаблоны поиска
Определение jail с именем
.Dq *
используется для обозначения шаблонов поиска.
Каждая определенная jail будет содержать и параметры из своего определения и параметры из определения
шаблона поиска.
.Pp
Замена переменных проводится для каждой jail, даже когда эта замена
предназначена для параметра из секции шаблона поиска.
Это полезно для параметров шаблона поиска, основанных на названии jail.
.Pp
Более поздние определения в файле конфигурации заменяют более ранние, 
поэтому секция шаблона поиска ставится перед (над) определением jail.
Или секция шаблона поиска может быть записана после (под) всеми jail и будет содержать все
параметры, которые всегда применяются к каждой jail.
Возможны несколько операторов, и параметры щаблонов могут быть
обозначены вне определения jail.
.Pp
Если существуют jail с иерархией, возможно частично-совпадающее 
определение шаблона поиска.
Например, определение с именем
.Dq foo.*
будет применимо к jail с именами
.Dq foo.bar
или
.Dq foo.bar.baz .
.Ss Включает
Строка формы
.Bd -literal -offset ident
\&.include "filename";
.Ed
.Pp
будет включать в себя другой файл в конфигурации.
Имя файла должно быть абсолютным или относительным к
директории файла конфигурации.  Оно не может содержать 
увеличения переменных, но может содержать шаблон
.Xr glob 3 .
.Pp
Вложенный файл обязан существовать, хотя шаблон поиска файла может найти один или несколько файлов.  
Это позволяет включение любого/всех файлов в директории,
по типу
.Dq /etc/jail.conf.d/*.conf ,
или условное включение единичного файла, например как
.Dq jail.foo[.]conf .
.Ss Комментарии
Файл конфигурации может содержать комментарии в форматах shell, языков 
C и C++:
.Bd -literal -offset indent
/* Это комментарий в стиле C.
 * Он может простираться на несколько строк.
 */

// Это комментарий в стиле C++.

#  Это комментарий в стиле shell.
.Ed
.Pp
Комментарии допустимы там, где допустимы пробелы, т.е.. везде кроме
середины строки или токена.
.Sh ФАЙЛЫ
.Bl -tag -width "indent" -compact
.It Pa /etc/jail.conf
.It Pa /etc/jail.*.conf
.It Pa /etc/jail.conf.d/*.conf
.It Pa /usr/share/examples/jails/
.El
.Sh ПРИМЕРЫ
.Bd -literal
# Typical static defaults:
# Используйте rc скрипты чтобы запустить и остановить jail'ы.  Смонтируйте директорию /dev jail'а.
exec.start = "/bin/sh /etc/rc";
exec.stop = "/bin/sh /etc/rc.shutdown jail";
exec.clean;
mount.devfs;

# Динамичный параметр шаблона поиска:
# Основывайте путь с названия jail.
path = "/var/jail/$name";

# Обычная jail.
foo {
	host.hostname = "foo.com";
	ip4.addr = 10.1.1.1, 10.1.1.2, 10.1.1.3;
}

# Этот jail перезаписывает то, что было задано сверху.
bar {
	exec.start = '';
	exec.stop = '';
	path = /;
	mount.nodevfs;
	persist;	
}

# Включить конфигурации из страндартных путей.
\[char46]include "/etc/jail.conf.d/*.conf";
\[char46]include "/etc/jail.*.conf";
\[char46]include "/usr/local/etc/jail[.]conf";
\[char46]include "/usr/local/etc/jail.conf.d/*.conf";
\[char46]include "/usr/local/etc/jail.*.conf";
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr jail_set 2 ,
.Xr rc.conf 5 ,
.Xr jail 8 ,
.Xr jls 8
.Sh ИСТОРИЯ
Утилита
.Xr jail 8
появилась в
.Fx 4.0 .
Файл
.Nm
был добавлен в
.Fx 9.1 .
.Sh АВТОРЫ
.An -nosplit
jail был написана
.An Poul-Henning Kamp
для R&D Associates
, кто отдал это
.Fx .
.Pp
.An James Gritton
добавил другие параметры jail и файл конфигурации.
