melkorbsd/ru-freebsd-man/man5/nologin.5
.\" Авторское право (c) 1993
.\"	Регенты Калифорнийского университета.  Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" модификацией, разрешается при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\" 3. Ни название Университета, ни имена его соавторов
.\" не могут быть использованы для поддержки или продвижения продуктов, созданных на основе этого программного обеспечения
.\" без специального предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ РЕГЕНТАМИ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ РЕГЕНТЫ ИЛИ ВКЛАДЧИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.\"     @(#)nologin.8 8.1 (Berkeley) 6/19/93
.\"
.Dd 10 мая 2007 г.
.Dt NOLOGIN 5
.Os
.Sh ИМЯ
.Nm nologin
.Nd запрет входа в систему
.Sh ОПИСАНИЕ
Такие программы, как
.Xr login 1
запрещает вход в систему, если
.Nm
существует.
Эти программы отображают содержимое
.Nm
пользователю, если это возможно, и прерывают последовательность входа в систему.
Это позволяет временно предотвратить вход в систему в масштабах всей системы.
.Pp
Запрет входа в систему для каждой учетной записи,
изучите
.Xr nologin 8 .
.Sh БЕЗОПАСНОСТЬ
The
.Nm
по умолчанию игнорируется для пользователя root.
.Sh УКАЗАНИЯ ПО ВЗАИМОДЕЙСТВИЮ
The
.Nm
реализуется через
.Xr login.conf 5 ,
который позволяет изменять путь к
файла и расширить список пользователей
освобожденных от временного ограничения на вход.
.Pp
Программы, поддерживающие PAM, могут быть выборочно настроены на соблюдение
.Nm
с помощью
.Xr pam_nologin 8
через модуль
.Xr pam.conf 5 .
.Pp
The
.Nm
будет удален при загрузке системы, если он находится в
.Pa /var/run
и
.Va cleanvar_enable
установлено значение
.Dq Li YES
в
.Xr rc.conf 5 ,
которое используется по умолчанию.
Поэтому перезагрузка системы может эффективно восстановить вход в систему.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /var/run/nologin" -compact
.It Pa /var/run/nologin
расположение по умолчанию
.Nm
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr login 1 ,
.Xr login.conf 5,
.Xr pam.conf 5 ,
.Xr rc.conf 5 ,
.Xr nologin 8 ,
.Xr pam_nologin 8 ,
.Xr shutdown 8




 
