melkorbsd/ru-freebsd-man/man5/nscd.conf.5
.\" Copyright (c) 2005 Михаил Бушков <bushman@rsu.ru>
.\" Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" модификацией, разрешены при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ СОАВТОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 6 октября 2018 г.
.Dt NSCD.CONF 5
.Os
.Sh ИМЯ
.Nm nscd.conf
.Nd "файл конфигурации nscd"
.Sh ОПИСАНИЕ
The
.Nm
файл
используется 
.Xr nscd 8
и считывается при запуске службы.
Его синтаксис в основном похож на 
.Pa nscd.conf
синтаксис в
.Tn Linux
и
.Tn Solaris.
Он имеет некоторые отличия, хотя \[em] см. их ниже.
.Pp
В каждой строке указывается либо атрибут и
.Ar значение,
либо атрибут, значение
.Ar cachename
и
.Ar . значение
Обычно используются следующие кэш-имена
.Dq Li passwd ,
.Dq Li group ,
.Dq Li hosts ,
.Dq Li сервисы ,
.Dq Li протоколы
и
.Dq Li rpc .
Вы также можете использовать любое другое
.Ar cachename
(например, если стороннее
приложение использует nsswitch).
.Bl -tag -width indent
.It Va threads Op Ar value
Количество потоков, которые будут прослушивать соединения и обрабатывать запросы.
Минимальное значение 1.
Значение по умолчанию  8.
.It Va enable-cache Oo Ar cachename Oc Op Cm yes | no
Включает или выключает кэш для указанного
.Ar cachename .
.It Va positive-time-to-live Oo Ar cachename Oc Op Ar значение
Устанавливает TTL (время жизни) для указанного кэша в секундах.
Большие значения могут увеличить производительность системы, но они также могут повлиять на
согласованность кэша.
Значение по умолчанию - 3600.
.It Va positive-policy Oo Ar cachename Oc Op Cm fifo | lru | lfu
Политика, которая применяется для стирания некоторых элементов кэша, когда
предельный размер данного
.Ar cachename
превышается.
Возможные политики:
.Cm fifo
(первым пришел - первым ушел),
.Cm lru
(наименее часто используемый), и
.Cm lfu
(наименее часто используемый).
По умолчанию используется политика
.Cm lru .
.It Va negative-time-to-live Oo Ar cachename Oc Op Ar value
TTL отрицательных элементов кэша в секундах.
Большие значения могут значительно увеличить производительность системы в некоторых
средах (при работе с файлами с UID, которых нет в системных
базах данных, например).
Чтобы избежать проблем с когерентностью кэша, это число следует поддерживать на низком уровне.
Значение по умолчанию - 60.
.It Va negative-policy Oo Ar cachename Oc Op Cm fifo | lru | lfu
То же самое, что и positive-policy, но применяется к отрицательным
элементам данного
.Ar cachename .
По умолчанию используется политика fifo.
.It Va negative-confidence-threshold Oo Ar cachename Oc Op Ar value
Количество раз, когда запрос должен потерпеть неудачу, прежде чем кэш признает
что элемент не может быть найден.
При значении по умолчанию 1 каждый отрицательный результат запроса кэшируется и
немедленно возвращается из кэша при последующих запросах.
При более высоких значениях запросы будут повторно опробованы на сконфигурированных источниках данных
источниках данных заданное количество раз, прежде чем отрицательный результат будет
прежде чем отрицательный результат будет возвращен из кэша при последующих запросах.
Это позволяет проверить существование записи, а затем создать ее
ее, если она не существует, без того, чтобы отрицательный результат зондирования препятствовал
доступ к новой записи на время отрицательного TTL.
.It Va suggested-size Oo Ar cachename Oc Op Ar value
Это внутренний размер хэш-таблицы.
Для оптимальной производительности значение должно быть простым числом.
Это значение следует изменять только в том случае, если количество кэшируемых элементов
значительно (в 5-10 раз) больше, чем размер хэш-таблицы по умолчанию (257).
.It Va keep-hot-count Oo Ar cachename Oc Op Ar value
Ограничение размера кэша с заданным
.Ar cachename .
При его превышении будет применена политика.
Значение по умолчанию - 2048.
.It Va perform-actual-lookups Oo Ar cachename Oc Op Cm yes | no
Если включено, то
.Xr nscd 8
не просто получает и кэширует результаты NSS-запросов, а выполняет
все поиски самостоятельно и возвращает только ответы.
Если эта функция включена, то для заданного
.Ar cachename
.Xr nscd 8
будет действовать аналогично NSCD.
.Pp
.Sy ПРИМЕЧАНИЕ :
эта функция в настоящее время является экспериментальной \[em] она поддерживает только
.Dq Li passwd ,
.Dq Li group
и
.Dq Li services
cachenames.
.El
.Sh ПРИМЕЧАНИЯ
Вы можете использовать
.Ql #
в начале строки для комментариев.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/nscd.conf" -compact
.It Pa /etc/nscd.conf
.El
.Sh смотрите также
.Xr nscd 8
.Sh АВТОРЫ
.An Михаил Бушков Aq Mt bushman@FreeBSD.org



