melkorbsd/ru-freebsd-man/man5/nsmb.conf.5
.\" Авторское право (c) 2003
.\" Автор Сергей А. Осокин
.\" Переписано Томом Родсом
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" модификацией, разрешены при условии, что следующие условия
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ ``КАК ЕСТЬ`` И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 2 ноября 2018 г.
.Dt NSMB.CONF 5
.Os
.Sh ИМЯ
.Nm nsmb.conf
Файл конфигурации .Nd для
.Tn SMB
запросов
.Sh ОПИСАНИЕ
Файл
.Nm
содержит информацию о компьютерах, пользователях и общих ресурсах
или точках монтирования для
.Tn SMB
сетевого протокола.
.Pp
Файлы конфигурации загружаются в следующем порядке:
.Pp
.Bl -enum -offset indent -width "" -compact
.It
.Pa ~/.nsmbrc
.It
.Pa /etc/nsmb.conf
.El
.Pp
В результате,
.Pa /etc/nsmb.conf
настройки
переопределяют настройки в
.Pa ~/.nsmbrc .
.Pp
Иерархия конфигурации состоит из нескольких секций,
каждая из которых содержит несколько или несколько строк параметров
и присвоенные им значения.
Каждая из этих секций должна начинаться с имени секции, заключенного в
квадратных скобках, например:
.Pp
.D1 Bq Ar имя_раздела
.Pp
Конец каждой секции отмечается либо началом новой секции,
либо резким завершением файла, обычно называемым
.Tn EOF .
Каждая секция может содержать ноль или более параметров, например:
.Pp
.D1 Bq Ar Имя_секции
.D1 Ar ключ Ns = Ns Ar значение
.Pp
где
ключ .Ar
представляет собой имя параметра, а
значение .Ar
будет назначенным значением параметра.
.Pp
Сайт
.Tn SMB
использует следующую информацию для имен секций:
.Pp
.Bl -tag -width indent -compact
.It Ic A)
.Bq Li по умолчанию
.It Ic B)
.Bq Ar SERVER
.It Ic C)
.Bq Ar SERVER : Ns Ar USER
.It Ic D)
.Op Ar SERVER : Ns Ar USER : Ns Ar SHARE
.El
.Pp
Возможные ключевые слова могут включать:
.Bl -column ".Va retry_count" ".Sy Section"
.It Sy "Комментарий раздела ключевых слов"
.It Sy " A B C D"
.It Va addr Ta "- + - -" Ta "IP-адрес SMB-сервера"
.It Va charsets Ta "- + + +" Ta "пара локальный:удаленный charset"
.It Va nbns Ta "+ + - -" Ta "адрес сервера имен NetBIOS (WINS)"
.It Va nbscope Ta "+ + - - -" Ta "область действия NetBIOS"
.It Va nbtimeout Ta "+ + - -" Ta "таймаут для серверов имен NetBIOS"
.It Va password Ta "- - + + +" Ta "простой текстовый или простой зашифрованный пароль, используемый для доступа к данному ресурсу"
.It Va retry_count Ta "+ + - -" Ta "количество повторных попыток перед тем, как соединение будет отмечено как разорванное"
.It Va timeout Ta "+ + - - -" Ta "таймаут SMB-запроса"
.It Va workgroup Ta "+ + + +" Ta "имя рабочей группы"
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/nsmb.conf"
.It Pa /etc/nsmb.conf
Файл конфигурации удаленной точки монтирования по умолчанию.
.It Pa ~/.nsmbrc
Конфигурационный файл удаленной точки монтирования для конкретного пользователя.
.El
.Sh ПРИМЕРЫ
Ниже приведен пример файла конфигурации, который может,
или не соответствовать вашей среде:
.Bd -literal -offset indent
# Конфигурационный файл для example.com
[по умолчанию]
workgroup=SALES
# 'FSERVER' - это сервер NT.
[FSERVER]
charsets=koi8-r:cp866
addr=fserv.example.com
# Данные пользователя для FSERVER
[FSERVER:MYUSER]
password=$$16144562c293a0314e6e1
.Ed
.Pp
Все строки, начинающиеся с
.Ql #
являются комментариями и не будут разобраны.
По умолчанию
.Dq Li по умолчанию
описывает рабочую группу или домен по умолчанию, в данном случае
.Dq Li SALES .
Следующий раздел, изображенный здесь как
.Dq Li FSERVER ,
определяет раздел сервера, а затем назначает ему кодовую гарнитуру, которая требуется только в том случае.
требуется только в том случае, если не используются кириллические символы.
Значение имени хоста,
.Dq Li fserv.example.com ,
также присваивается в этом разделе.
.Dq Li FSERVER:USER ,
определяет настройки пользователя и полезен для сохранения пароля, используемого
во время конкретного соединения.
Пароль может быть открытым текстом или зашифрованным с помощью простого шифрования.
Простой зашифрованный пароль начинается с символов `$$1'.
Внимание: функция шифрования очень слабая и предназначена только для сокрытия
паролей с открытым текстом.
Если необходимо использовать простое шифрование, можно выполнить следующую команду
использовать следующую команду для пароля:
.Bd -literal -offset indent
smbutil crypt
.Ed
.Sh СМОТРИТЕ ТАКЖЕ 
.Xr smbutil 1 ,
.Xr mount_smbfs 8
Авторы .Sh
Эта страница руководства была написана
.An -nosplit
.An Сергей Осокин Aq Mt osa@FreeBSD.org
и
.An Том Родс Aq Mt trhodes@FreeBSD.org .
