melkorbsd/ru-freebsd-man/man5/nsswitch.conf.5
.\" $NetBSD: nsswitch.conf.5,v 1.14 1999/03/17 20:19:47 garbled Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999 The NetBSD Foundation, Inc.
.\" Все права защищены.
.\"
.\" Этот код получен из программного обеспечения, предоставленного The NetBSD Foundation
.\" Люком Мьюберном.
.\"
.\" Распространение и использование в исходных и бинарных формах, с модификацией или без
.\" модификацией, разрешены при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\" 3. Все рекламные материалы, упоминающие возможности или использование данного программного обеспечения
.\" должны содержать следующее подтверждение:
.\"    Данный продукт включает программное обеспечение, разработанное Люком Мьюберном.
.\" 4. Имя автора не может быть использовано для поддержки или продвижения продуктов.
.\" производных от данного программного обеспечения без специального предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ ``КАК ЕСТЬ`` И ЛЮБЫЕ ЯВНЫЕ ИЛИ
.\" ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ
.\" ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ, НЕ ПРИНИМАЮТСЯ.
.\" НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ,
.\" СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ОБРАЗЦОВЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ (ВКЛЮЧАЯ,
.\" НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ, ПРИОБРЕТЕНИЕ ЗАПАСНЫХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЯ
.\" ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВА В РАБОТЕ), ЧЕМ БЫ ОНИ НИ БЫЛИ ВЫЗВАНЫ И
.\" ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГАЯ ОТВЕТСТВЕННОСТЬ ИЛИ
.\" ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ ИЗ
.\" ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd 6 сентября 2020 г.
.Dt NSSWITCH.CONF 5
.Os
.Sh ИМЯ
.Nm nsswitch.conf
Файл конфигурации коммутатора службы имен .Nd
.Sh ОПИСАНИЕ
Файл
.Nm
определяет, как
.Xr nsdispatch 3
(диспетчер переключателей службы имен) в библиотеке C.
.Pp
Конфигурационный файл управляет тем, как процесс просматривает различные базы данных
содержащие информацию о хостах, пользователях (паролях), группах и т. д.
Каждая база данных поступает из определенного источника (например, из локальных файлов, DNS, NIS ,
и кэш), а порядок поиска источников указывается в файле
.Nm .
.Pp
Каждая запись в
.Nm
состоит из имени базы данных и списка источников, разделенных пробелами.
Каждый источник может иметь необязательный критерий, который определяет
будет ли использоваться следующий по списку источник, или поиск завершится на
текущем источнике.
Каждый критерий состоит из одного или нескольких кодов состояния и действий.
при возникновении этого кода состояния.
Источники .Ss
Следующие источники реализованы как часть базовой системы:
.Pp
.Bl -tag -width Источник -compact
.It Sy Источник
Описание .Sy
Файлы .It
Локальные файлы, такие как
.Pa /etc/hosts ,
и
.Pa /etc/passwd .
.It db
Локальная база данных.
.It dns
Система доменных имен Интернета.
.Dq hosts
и
сети .Sq
используют
.Sy IN
записи класса, все остальные базы данных используют
.Sy HS
записи класса (Hesiod).
.It nis
NIS (ранее YP)
.It compat
поддержка
.Sq +/-
в
.Dq passwd
и
.Dq group
базах данных.
Если он присутствует, он должен быть единственным источником для этой записи.
Кэш .It
использует
.Xr nscd 8
демона.
.El
.Pp
Дополнительные источники могут быть предоставлены сторонним программным обеспечением.
Базы данных .Ss
Следующие базы данных используются следующими функциями библиотеки C:
.Pp
.Bl -tag -width networks -compact
База данных .It Sy
.Sy "Используется"
.It group
.Xr getgrent 3 ,
.Xr getgrent_r 3 ,
.Xr getgrgid_r 3 ,
.Xr getgrnam_r 3 ,
.Xr setgrent 3 ,
.Xr endgrent 3
.It hosts
.Xr getaddrinfo 3 ,
.Xr gethostbyaddr 3 ,
.Xr gethostbyaddr_r 3 ,
.Xr gethostbyname 3 ,
.Xr gethostbyname2 3 ,
.Xr gethostbyname_r 3 ,
.Xr getipnodebyaddr 3 ,
.Xr getipnodebyname 3
.It сети
.Xr getnetbyaddr 3 ,
.Xr getnetbyaddr_r 3 ,
.Xr getnetbyname 3 ,
.Xr getnetbyname_r 3
.It passwd
.Xr getpwent 3 ,
.Xr getpwent_r 3 ,
.Xr getpwnam_r 3 ,
.Xr getpwuid_r 3 ,
.Xr setpwent 3 ,
.Xr endpwent 3
.It shells
.Xr getusershell 3
.It сервисы
.Xr getservent 3
.It rpc
.Xr getrpcbyname 3 ,
.Xr getrpcbynumber 3 ,
.Xr getrpcent 3
.It proto
.Xr getprotobyname 3 ,
.Xr getprotobynumber 3 ,
.Xr getprotoent 3
.It netgroup
.Xr getnetgrent 3 ,
.Xr getnetgrent_r 3 ,
.Xr setnetgrent 3 ,
.Xr endnetgrent 3 ,
.Xr innetgr 3
.El
.Ss Коды состояния
Доступны следующие коды состояния:
.Pp
.Bl -tag -width tryagain -compact
.It Sy Статус
.Sy Описание
.It успех
Запрошенная запись найдена.
.It notfound
Запись отсутствует в данном источнике.
.It tryagain
Источник занят и может отвечать на повторные попытки.
.It unavail
Источник не отвечает, или запись повреждена.
.El
.Ss Действия
Для каждого из кодов состояния возможно одно из двух действий:
.Pp
.Bl -tag -width continue -compact
.It Sy Действие
.Sy Описание
.It продолжить
Попробовать следующий источник
.It return
Возврат с текущим результатом
.El
.Ss Формат файла
BNF-описание синтаксиса файла
.Nm
это:
.Pp
.Bl -tag -width <критерий> -compact
.It <вход>
::=
<база данных> ":" [<источник> [<критерии>]]*
.It <критерии>
::=
"[" <критерий> + "]"
.It <критерий>
::=
<статус> "=" <действие>
.It <status>
::=
"success" | "notfound" | "unavail" | "tryagain"
.It <action>
::=
"возврат" | "продолжить"
.El
.Pp
Каждая запись начинается с новой строки в файле.
A
.Sq #
отделяет комментарий от конца строки.
Пустые строки игнорируются.
A
.Sq \e
в конце строки экранирует новую строку и заставляет следующую строку
продолжением текущей строки.
Все записи не чувствительны к регистру.
.Pp
По умолчанию возвращается при
.Dq успех ,
и продолжать при любом другом (т. е,
.Li "[success=return notfound=continue unavail=continue tryagain=continue]" ) .
Кэш .Ss
Вы можете включить кэширование для конкретной базы данных, указав
.Dq cache
в
.Nm
файле.
Он должен располагаться после
файлов .Dq ,
но перед удаленными источниками, такими как
.Dq nis .
Вы также должны включить кэширование для этой базы данных в файле
.Xr nscd.conf 5 .
Если для определенного запроса
.Dq cache
источник возвращает успех, то дальнейшие источники не запрашиваются.
С другой стороны, если нет ранее кэшированных данных, то
результат запроса будет помещен в кэш сразу после того, как
после обработки всех остальных источников.
Обратите внимание, что
кэш .Dq
требует
.Xr nscd 8
чтобы был запущен демон.
Режим .Ss Compat: +/- синтаксис
В исторических реализациях с несколькими исходными текстами в качестве синтаксиса используется
.Sq +
и
.Sq -
используются для указания импорта паролей пользователей и
групповой информации из NIS.
Хотя
.Nm
предоставляет альтернативные методы доступа к распределенным источникам, таким как NIS ,
указание единственного источника
.Dq compat
обеспечит историческое поведение.
.Pp
Альтернативный источник информации, доступ к которой осуществляется через
.Sq +/-
можно использовать, указав
.Dq passwd_compat: источник .
Источник .Dq
в этом случае может быть
.Sq dns ,
.Sq nis ,
или
любой другой источник, кроме
файлов .Sq
и
.Sq compat .
Примечания к .Ss
Исторически многие базы данных имели функции перечисления, часто в виде
вид
.Fn getXXXent .
Они имели смысл, когда базы данных находились в локальных файлах, но не имеют смысла или имеют меньшую актуальность, когда есть несколько источников.
смысла или имеют меньшее значение при наличии, возможно, нескольких источников,
каждый из которых имеет неизвестный размер.
Интерфейсы по-прежнему предоставляются для совместимости, но источник
может не предоставить полные записи, или могут быть получены дубликаты записей.
если указано несколько источников, содержащих схожую информацию.
указаны.
.Pp
Чтобы обеспечить совместимость с предыдущими и текущими реализациями, в разделе
.Dq compat
должен быть один источник для данной базы данных.
.Ss Списки источников по умолчанию
Если по какой-либо причине,
.Nm
не существует, или в нем отсутствуют или повреждены записи,
.Xr nsdispatch 3
по умолчанию будет введен список
файлы .Dq
для запрашиваемой базы данных.
Исключениями являются:
.Pp
.Bl -tag -width services_compat -compact
База данных .It Sy
.Sy "Список источников по умолчанию"
Группа .It
compat
.It group_compat
nis
.It hosts
файлы dns
.It passwd
совместимость
.It passwd_compat
nis
Службы .It
compat
.It services_compat
nis
.El
.Sh ФАЙЛЫ
.Bl -tag -width /etc/nsswitch.conf -compact
.It Pa /etc/nsswitch.conf
Файл
.Nm
находится в
.Pa /etc .
.El
.Sh ПРИМЕРЫ
Чтобы найти хосты в
.Pa /etc/hosts
затем в кэше,
а затем в DNS, и поиска информации о пользователях в файлах NIS, используйте:
.Pp
.Bl -tag -width passwd: -compact
.It hosts:
файлы кэш dns
.It passwd:
nis [notfound=return] files
.It group:
nis [notfound=return] files
.El
.Pp
Критерии
.Dq [notfound=return]
устанавливает политику "если пользователь не найден в nis, не пробовать файлы".
При этом nis рассматривается как авторитетный источник информации, за исключением случаев.
когда сервер не работает.
.Sh ПРИМЕЧАНИЯ
Сайт
.Nm
анализируется каждой программой только один раз.
Последующие изменения не будут применяться до тех пор, пока программа не будет
пока не будет перезапущена.
.Pp
Если система была скомпилирована с
.Va WITHOUT_NIS
необходимо удалить
.Sq nis
записи.
.Pp
.Fx Ns
.Lb libc
предоставляет заглушки для совместимости с модулями NSS
написанными для библиотеки GNU C.
.Nm nsswitch
интерфейса.
Однако эти заглушки поддерживают только использование интерфейса
.Dq Li passwd
и
.Dq Li group
базы данных.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr nsdispatch 3 ,
.Xr nscd.conf 5 ,
.Xr resolv.conf 5 ,
.Xr nscd 8 ,
.Xr ypbind 8
.Sh ИСТОРИЯ 
Сайт
.Nm
впервые появился в
.Fx 5.0 .
Он был импортирован из
.Nx
Project, где он впервые появился в
.Nx 1.4 .
.Sh АВТОРЫ
.An Люк Мьюберн Aq Mt lukem@netbsd.org
написал эту свободно распространяемую реализацию переключателя службы имен,
используя идеи из ULTRIX
.Xr svc.conf 5
и Solaris
.Xr nsswitch.conf 4
страницы руководства.
