melkorbsd/ru-freebsd-man/man5/periodic.conf.5
.\"-
.\" Copyright (c) 2000 Brian Somers <brian@Awfulhak.org>
.\" Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с или без
.\" модификацией, разрешены при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ СОАВТОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 9 марта 2022 г.
.Dt PERIODIC.CONF 5
.Os
.Sh ИМЯ
.Nm periodic.conf
.Nd информация о конфигурации периодических заданий
.Sh ОПИСАНИЕ
Файл
.Nm
содержит описание того, как должны выполняться ежедневные, еженедельные и ежемесячные задания по обслуживанию системы
ежедневного, еженедельного и ежемесячного обслуживания системы.
Он находится в папке
.Pa /etc/defaults
и его части могут быть переопределены одноименным файлом в каталоге
.Pa /etc ,
который сам может быть переопределен файлом
.Pa /etc/periodic.conf.local
файл.
.Pp
Файл
.Nm
файл
на самом деле создается как сценарий оболочки из каждого периодического сценария
и предназначен просто для предоставления переменных конфигурации по умолчанию.
.Pp
Следующие переменные используются
.Xr periodic 8
самостоятельно:
.Bl -tag -offset 4n -width 2n
.It Va local_periodic
.Pq Vt str
Список каталогов для поиска периодических скриптов.
Этот список всегда имеет префикс
.Pa /etc/periodic ,
и используется только в качестве аргумента к
.Xr periodic 8
не является абсолютным именем каталога.
.It Ao Ar dir Ac Ns Va _output
.Pq Vt путь Нет или список Vt
Что делать с выводом скриптов, выполняемых из
каталога
.Ar dir .
Если эта переменная имеет абсолютное имя пути, вывод записывается в
этот файл, в противном случае он будет принят как один или несколько адресов электронной почты, разделенных пробелами
и рассылается этим пользователям.
Если эта переменная не задана или пуста, вывод отправляется в стандартный вывод.
.Pp
Для необслуживаемой машины подходящие значения для
.Va ежедневный_вывод ,
.Va weekly_output ,
и
.Va monthly_output
могут быть следующими
.Dq Li /var/log/daily.log ,
.Dq Li /var/log/weekly.log ,
и
.Dq Li /var/log/monthly.log
соответственно, как
.Xr newsyslog 8
будет поворачивать эти файлы (если они существуют) в соответствующее время.
.It Ao Ar dir Ac Ns Va _show_success
.It Ao Ar dir Ac Ns Va _show_info
.It Ao Ar dir Ac Ns Va _show_badconfig
.Pq Vt bool
Эти переменные контролируют, будет ли
.Xr periodic 8
будет маскировать вывод выполняемых скриптов на основе их кода возврата
(где
.Ar dir
это имя базового каталога, в котором находится каждый скрипт).
Если код возврата скрипта
.Sq 0
и
.Ao Ar dir Ac Ns Va _show_success
установлено значение
.Dq Li NO ,
.Xr periodic 8
будет маскировать вывод скрипта.
Если код возврата сценария равен
.Sq 1
и
.Ao Ar dir Ac Ns Va _show_info
установлено значение
.Dq Li NO ,
.Xr periodic 8
будет маскировать вывод скрипта.
Если код возврата сценария равен
.Sq 2
и
.Ao Ar dir Ac Ns Va _show_badconfig
установлено значение
.Dq Li NO ,
.Xr periodic 8
будет маскировать вывод скрипта.
Если для этих переменных не установлено значение
.Dq Li YES
ни
.Dq Li NO ,
то по умолчанию они принимают значение
.Dq Li YES ,
.Dq Li YES
и
.Dq Li NO
соответственно.
.Pp
Обратитесь к
.Xr periodic 8
о том, как интерпретируются коды возврата сценария.
.It Va антиконгестия_время сна
.Pq Vt int
Максимальное количество секунд случайного сна для сглаживания скачкообразных нагрузок
на общий ресурс, например зеркало загрузки.
.El
.Pp
Следующие переменные используются стандартными скриптами, находящимися в папке
.Pa /etc/periodic/daily :
.Bl -tag -offset 4n -width 2n
.It Va daily_clean_disks_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите удалить все файлы, соответствующие
.Va daily_clean_disks_files
ежедневно.
.It Va daily_clean_disks_files
.Pq Vt str
Устанавливается в список имен файлов для проверки.
Допускаются дикие символы.
.It Va daily_clean_disks_days
.Pq Vt num
Когда
.Va daily_clean_disks_enable
установлено значение
.Dq Li YES ,
это значение также должно соответствовать количеству дней, в течение которых время доступа к файлу
и модификации файла, прежде чем он будет удален.
.It Va daily_clean_disks_verbose
.Pq Vt bool
Установить в
.Dq Li YES
если вы хотите, чтобы об удаленных файлах сообщалось в ежедневном выводе.
.It Va daily_clean_tmps_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите ежедневно очищать временные каталоги.
.It Va daily_clean_tmps_dirs
.Pq Vt str
Устанавливается в список каталогов, которые нужно очистить, если
.Va daily_clean_tmps_enable
установлено значение
.Dq Li YES .
.It Va daily_clean_tmps_days
.Pq Vt num
Когда
.Va daily_clean_tmps_enable
установлено, это значение также должно соответствовать количеству дней, в течение которых время доступа к файлу
и модификации, прежде чем он будет удален.
.It Va daily_clean_tmps_ignore
.Pq Vt str
Устанавливается в список файлов, которые не должны удаляться, когда
.Va daily_clean_tmps_enable
установлен в
.Dq Li YES .
Символы дикой карты разрешены.
.It Va daily_clean_tmps_verbose
.Pq Vt bool
Устанавливается в
.Dq Li YES
если вы хотите, чтобы об удаленных файлах сообщалось в ежедневном выводе.
.It Va daily_clean_preserve_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите удалить старые файлы из
.Pa /var/preserve .
.It Va daily_clean_preserve_days
.Pq Vt num
Устанавливает количество дней, в течение которых файлы не должны быть изменены, прежде чем
они будут удалены.
.It Va daily_clean_preserve_verbose
.Pq Vt bool
Устанавливает значение
.Dq Li YES
если вы хотите, чтобы об удаленных файлах сообщалось в ежедневном выводе.
.It Va daily_clean_msgs_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите, чтобы старые системные сообщения удалялись.
.It Va daily_clean_msgs_days
.Pq Vt num
Устанавливает количество дней, в течение которых файлы не должны быть изменены, прежде чем
они будут удалены.
Если оставить эту переменную пустой, то
.Xr msgs 1
используется значение по умолчанию.
.It Va daily_clean_rwho_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите, чтобы старые файлы в
.Pa /var/who
должны быть очищены.
.It Va daily_clean_rwho_days
.Pq Vt num
Устанавливает количество дней, в течение которых файлы не должны быть изменены, прежде чем
они будут удалены.
.It Va daily_clean_rwho_verbose
.Pq Vt bool
Устанавливает значение
.Dq Li YES
если вы хотите, чтобы об удаленных файлах сообщалось в ежедневном выводе.
.It Va daily_clean_hoststat_enable
.Pq Vt bool
Установите значение
.Dq Li YES
чтобы запустить
.Nm sendmail Fl bH
для автоматической очистки устаревших записей из
.Xr sendmail 8 Ns 's
кэша состояния хоста.
Файлы будут удаляться по тем же критериям, что и
.Xr sendmail 8
обычно используются при определении того, стоит ли верить кэшированной информации,
как настроено в
.Pa /etc/mail/sendmail.cf .
.It Va daily_backup_efi_enable
.Pq Vt bool
Установить в
.Dq Li YES
для создания резервной копии системного раздела EFI (ESP).
.It Va daily_backup_gmirror_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для создания резервной копии информации gmirror (т. е. вывода
.Nm gmirror Cm list ) ,
см.
.Xr gmirror 8 .
.It Va daily_backup_gmirror_verbose
.Pq Vt bool
Установить на
.Dq Li YES
чтобы сообщить о разнице между новой и существующей резервной копией
в ежедневном выводе.
.It Va daily_backup_gpart_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для создания резервных копий таблиц разделов и содержимого разделов bootcode.
.It Va daily_backup_gpart_verbose
.Pq Vt bool
Установите значение
.Dq Li YES
быть подробным, если существующие резервные копии kern.geom.conftxt или таблиц разделов отличаются
от новых резервных копий.
.It Va daily_backup_passwd_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите, чтобы
.Pa /etc/master.passwd
и
.Pa /etc/group
резервные копии файлов и отчеты о них.
Отчетность заключается в проверке обоих файлов на наличие изменений и выполнении команды
.Xr chkgrp 8
на
группа .Pa
файла.
.It Va daily_backup_aliases_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите, чтобы
.Pa /etc/mail/aliases
резервное копирование файла и отображение изменений в ежедневном выводе.
.It Va daily_backup_zfs_enable
.Pq Vt bool
Установите значение
.Dq Li YES
чтобы создать резервную копию выходных данных, сгенерированных из
.Xr zfs-list 8
и
.Xr zpool-list 8
утилиты.
.It Va daily_backup_zfs_list_flags
.Pq Vt str
Устанавливается в качестве аргументов для
.Xr zfs-list 8
утилиты.
По умолчанию используется стандартное поведение.
.It Va daily_backup_zpool_list_flags
.Pq Vt str
Устанавливается в качестве аргументов для утилиты
.Xr zpool-list 8
утилиты.
По умолчанию
.Fl v .
.It Va daily_backup_zfs_props_enable
.Pq Vt bool
Установить значение
.Dq Li YES
для создания резервной копии выходных данных, полученных в результате выполнения команды
.Xr zfs-get 8
и
.Xr zpool-get 8
утилиты.
.It Va daily_backup_zfs_get_flags
.Pq Vt str
Устанавливается в качестве аргументов для
.Xr zfs-get 8
утилиты.
По умолчанию
.Cm all .
.It Va daily_backup_zpool_get_flags
.Pq Vt str
Устанавливается в качестве аргументов для
.Xr zpool-get 8
утилиты.
По умолчанию
.Cm all .
.It Va daily_backup_zfs_verbose
.Pq Vt bool
Установить значение
.Dq Li YES
чтобы сообщить о разнице между новой и существующей резервной копией
в ежедневном выводе.
.It Va daily_calendar_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm календарь Fl а
ежедневно.
.It Va daily_accounting_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите ротировать файлы ежедневного учета процесса.
Ротация не требуется, если
.Va accounting_enable
включен в
.Xr rc.conf 5 .
.It Va daily_accounting_compress
.Pq Vt bool
Устанавливается в
.Dq Li YES
если вы хотите, чтобы файлы ежедневного учета были сжаты с помощью
.Xr gzip 1 .
.It Va daily_accounting_save
.Pq Vt num
Когда
.Va daily_accounting_enable
установлено, это значение также может быть установлено как количество файлов ежедневного учета, которые
должны быть сохранены.
По умолчанию
.Dq Li 3 .
.It Va daily_accounting_flags
.Pq Vt str
Задается аргументами, которые необходимо передать в программу
.Xr sa 8
(в дополнение к
.Fl s )
, когда
.Va daily_accounting_enable
установлен на
.Dq Li YES .
По умолчанию
.Fl q .
.It Va daily_status_disks_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Xr df 1
(с аргументами, указанными в
.Va daily_status_disks_df_flags )
и
.Nm dump Fl W .
.It Va daily_status_disks_df_flags
.Pq Vt str
Устанавливаются в качестве аргументов для
.Xr df 1
когда
.Va daily_status_disks_enable
установлено значение
.Dq Li YES .
По умолчанию
.Fl l Fl h .
.It Va daily_status_zfs_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Nm zpool Cm status
на вашем
.Xr zfs 8
пулов.
.It Va daily_status_zfs_zpool_list_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm zpool Cm list
на вашем
.Xr zfs 8
пулов.
Требуется
.Va daily_status_zfs_enable
должно быть установлено значение
.Li YES .
.It Va daily_status_gmirror_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Nm gmirror Cm status
на вашем
.Xr gmirror 8
устройства.
.It Va daily_status_graid3_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm graid3 Cm status
на вашем
.Xr graid3 8
устройствах.
.It Va daily_status_gstripe_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm gstripe Cm status
на вашем
.Xr gstripe 8
устройствах.
.It Va daily_status_gconcat_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm gconcat Cm status
на вашем
.Xr gconcat 8
устройства.
.It Va daily_status_mfi_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm mfiutil Cm status
на вашем
.Xr mfi 4
устройствах.
.It Va daily_status_network_enable
.Pq Vt bool
Установите значение
.Dq Li YES
если вы хотите запустить
.Nm netstat Fl i .
.It Va daily_status_network_netstat_flags
.Pq Vt str
Устанавливается в качестве дополнительных аргументов для
.Xr netstat 1
когда
.Va daily_status_network_enable
установлено значение
.Dq Li YES .
По умолчанию
.Fl d W .
.It Va daily_status_network_usedns
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Xr netstat 1
без
.Fl n
(для выполнения поиска DNS).
.It Va daily_status_uptime_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Xr uptime 1
(или
.Xr ruptime 1
если
.Va rwhod_enable
установлен в
.Dq Li YES
в
.Pa /etc/rc.conf ) .
.It Va daily_status_mailq_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Xr mailq 1 .
.It Va daily_status_mailq_shorten
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите сократить
.Xr mailq 1
вывод, когда
.Va daily_status_mailq_enable
установлен на
.Dq Li YES .
.It Va daily_status_include_submit_mailq
.Pq Vt bool
Установлено на
.Dq Li YES
если вы также хотите запустить
.Xr mailq 1
для очереди отправки почты, когда
.Va daily_status_mailq_enable
установлено значение
.Dq Li YES .
Это может не работать с MTA, отличными от
.Xr sendmail 8 .
.It Va daily_status_security_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить проверку безопасности.
Проверка безопасности - это еще один набор
.Xr периодических 8
скриптов.
Системные настройки по умолчанию находятся в
.Pa /etc/periodic/security .
Локальные скрипты должны быть размещены в
.Pa /usr/local/etc/periodic/security .
См.
.Xr periodic 8
для получения дополнительной информации.
.It Va daily_status_security_inline
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите, чтобы проверка безопасности выводилась в виде строки.
По умолчанию вывод отправляется по почте или записывается в журнал в зависимости от значения параметра
.Va daily_status_security_output .
.It Va daily_status_security_output
.Pq Vt str
Куда отправлять результаты проверки безопасности, если
.Va daily_status_security_inline
установлено значение
.Dq Li NO .
Эта переменная ведет себя так же, как и переменная
.Va *_output
переменные выше, а именно: она может быть установлена либо на один или несколько адресов электронной почты
либо на абсолютное имя файла.
.It Va daily_status_mail_rejects_enable
.Pq Vt bool
Установить в
.Dq Li YES
если вы хотите просуммировать отклонения почты, зарегистрированные в
.Pa /var/log/maillog
за предыдущий день.
.It Va daily_status_mail_rejects_logs
.Pq Vt num
Устанавливает количество файлов maillog, которые должны быть проверены
на предмет вчерашних отклонений почты.
.It Va daily_status_ntpd_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите включить проверку состояния NTP.
.It Va daily_status_world_kernel
.Pq Vt bool
Установите значение
.Dq Li YES
для проверки синхронизации запущенного пользовательского окружения и ядра.
.It Va daily_queuerun_enable
.Pq Vt bool
Устанавливается в
.Dq Li YES
если вы хотите вручную запускать почтовую очередь хотя бы раз в день.
.It Va daily_submit_queuerun
.Pq Vt bool
Установите значение
.Dq Li YES
если вы также хотите вручную запускать очередь отправки почты не реже одного раза в день.
когда
.Va daily_queuerun_enable
установлено значение
.Dq Li YES .
.It Va daily_scrub_zfs_enable
.Pq Vt bool
Установлено на
.Dq Li YES
если вы хотите периодически запускать скраб zfs.
.It Va daily_scrub_zfs_pools
.Pq Vt str
Список имен пулов zfs для очистки, разделенный пробелами.
Если список пуст или не задан, будут очищены все пулы zfs.
.It Va daily_scrub_zfs_default_threshold
.Pq Vt int
Количество дней между скрабами, если не задан порог для конкретного пула.
Если порог не задан, по умолчанию используется значение 35, что соответствует 5 неделям.
.It Va daily_scrub_zfs_ Ns Ao Ar poolname Ac Ns Va _threshold
.Pq Vt int
То же, что и
.Va daily_scrub_zfs_default_threshold
но для конкретного пула
.Ao Ar имя пула Ac Ns .
.It Va daily_local
.Pq Vt str
Устанавливается в список дополнительных сценариев, которые должны выполняться после всех остальных
ежедневных скриптов.
Все сценарии должны быть именами абсолютных путей.
.El
.Pp
Следующие переменные используются стандартными скриптами, которые находятся в папке
.Pa /etc/periodic/weekly :
.Bl -tag -offset 4n -width 2n
.It Va weekly_locate_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите запустить
.Pa /usr/libexec/locate.updatedb .
Этот скрипт запускается с помощью
.Nm nice Fl 5
как пользователь
.Dq Li nobody ,
и генерирует таблицу, используемую программой
.Xr locate 1
командой.
.It Va weekly_whatis_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите запустить
.Pa /usr/libexec/makewhatis.local .
Этот скрипт регенерирует базу данных, используемую программой
.Xr apropos 1
командой.
.It Va weekly_noid_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите находить осиротевшие файлы в системе.
Осиротевший файл - это файл с неправильным владельцем или группой.
.It Va weekly_noid_dirs
.Pq Vt str
Список каталогов, в которых будут искаться осиротевшие файлы.
Обычно это значение имеет вид
.Pa / .
.It Va weekly_status_security_enable
.Pq Vt bool
Недельный аналог
.Va daily_status_security_enable .
.It Va weekly_status_security_inline
.Pq Vt bool
Еженедельный аналог
.Va daily_status_security_inline .
.It Va weekly_status_security_output
.Pq Vt str
Еженедельный аналог
.Va daily_status_security_output .
.It Va weekly_status_pkg_enable
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите использовать
.Xr pkg-version 8
для перечисления установленных пакетов, которые устарели.
.It Va pkg_version
.Pq Vt str
Когда
.Va weekly_status_pkg_enable
установлено значение
.Dq Li YES ,
эта переменная задает программу, которая используется для определения устаревших
устаревших пакетов.
Если значение не установлено, то для определения устаревших пакетов используется программа
.Xr pkg-version 8
используется программа .Xr pkg-version 8.
В качестве примера, эта переменная может быть установлена в значение
.Dq Li portversion
если
.Pa ports/sysutils/portupgrade
был установлен порт.
.It Va pkg_version_index
.Pq Vt str
Эта переменная определяет
.Pa INDEX
файл из
.Pa /usr/ports
который должен использоваться
.Xr pkg-версии 8 .
Поскольку дерево зависимостей может существенно отличаться между версиями
.Fx ,
может существовать более одного
.Pa INDEX
файл в
.Pa /usr/ports .
.Pp
Обратите внимание, если
.Va pkg_version
переменная установлена в значение
.Dq Li portversion ,
необходимо также установить правильное значение
.Pa INDEX
файл указан
с помощью переменных окружения и чтобы
.Va pkg_version_index
очищен в
.Pa /etc/periodic.conf
.Pq Dq Li pkg_version_index= .
.It Va weekly_local
.Pq Vt str
Устанавливается в список дополнительных скриптов, которые должны выполняться после всех остальных
еженедельных скриптов.
Все скрипты должны иметь абсолютные имена путей.
.El
.Pp
Следующие переменные используются стандартными скриптами, которые находятся в папке
.Pa /etc/periodic/monthly :
.Bl -tag -offset 4n -width 2n
.It Va monthly_accounting_enable
.Pq Vt bool
Установить значение
.Dq Li YES
если вы хотите вести учет по логину, используя
.Xr ac 8
команда.
.It Va monthly_status_security_enable
.Pq Vt bool
Ежемесячный аналог команды
.Va daily_status_security_enable .
.It Va monthly_status_security_inline
.Pq Vt bool
Ежемесячный аналог
.Va daily_status_security_inline .
.It Va monthly_status_security_output
.Pq Vt str
Ежемесячный аналог
.Va daily_status_security_output .
.It Va monthly_local
.Pq Vt str
Устанавливается в список дополнительных сценариев, которые должны выполняться после всех остальных
ежемесячных скриптов.
Все скрипты должны иметь абсолютные имена путей.
.El
.Pp
Следующие переменные используются стандартными сценариями, которые находятся в папке
.Pa /etc/periodic/security .
Эти скрипты обычно запускаются ежедневно
.Pq Va daily_status_security_enable ,
еженедельно
.Pq Va weekly_status_security_enable ,
и ежемесячно
.Pq Va monthly_status_security_enable
периодические крючки.
Адрес
.Va ..._period
каждого сценария может быть настроен как
.Dq ежедневно ,
.Dq еженедельно ,
.Dq ежемесячно
или
.Dq NO .
Обратите внимание, что если периодические сценарии безопасности запускаются из
.Xr crontab 5 ,
они будут выполняться всегда, если только не будет установлено
.Va ..._enable
или
.Va ..._period
переменной установлено значение
.Dq NO .
.Bl -tag -offset 4n -width 2n
.It Va security_status_diff_flags
.Pq Vt str
Устанавливается в аргументы, которые необходимо передать в программу
.Xr diff 1
при генерации различий.
По умолчанию
.Fl b u .
.It Va security_status_chksetuid_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для сравнения режимов и времени модификации исполняемых файлов setuid со значениями
со значениями предыдущего дня.
.It Va security_status_chksetuid_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_chkportsum_enable
.Pq Vt bool
Установить на
.Dq Li YES
для проверки контрольных сумм всех установленных пакетов по известным контрольным суммам в
.Pa /var/db/pkg .
.It Va security_status_chkportsum_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_neggrpperm_enable
.Pq Vt bool
Установить на
.Dq Li YES
для проверки файлов, в которых группа файла имеет меньше прав, чем
чем в целом по миру.
Если пользователи входят в более чем 14 дополнительных групп, эти отрицательные
разрешения могут не выполняться через общие ресурсы NFS.
.It Va security_status_neggrpperm_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_chkmounts_enable
.Pq Vt bool
Установить на
.Dq Li YES
для проверки изменений смонтированных файловых систем по отношению к значениям предыдущего дня.
.It Va security_status_chkmounts_period
.Pq Vt str
Установите значение либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_noamd
.Pq Vt bool
Установить на
.Dq Li YES
если вы хотите игнорировать
.Xr amd 8
монтирования при сравнении со вчерашними монтированиями файловой системы в файле
.Va security_status_chkmounts_enable
проверка.
.It Va security_status_chkuid0_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для проверки
.Pa /etc/master.passwd
на наличие учетных записей с UID 0.
.It Va security_status_chkuid0_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_passwdless_enable
.Pq Vt bool
Установить на
.Dq Li YES
для проверки
.Pa /etc/master.passwd
на наличие учетных записей с пустыми паролями.
.It Va security_status_passwdless_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_logincheck_enable
.Pq Vt bool
Установить на
.Dq Li YES
для проверки
.Pa /etc/login.conf
права собственности, см.
.Xr login.conf 5
для получения дополнительной информации.
.It Va security_status_logincheck_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_ipfwdenied_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения записей в журнале для пакетов, запрещенных
.Xr ipfw 8
с момента вчерашней проверки.
.It Va security_status_ipfwdenied_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_ipfdenied_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения записей в журнале для пакетов, запрещенных
.Xr ipf 8
с момента вчерашней проверки.
.It Va security_status_ipfdenied_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_pfdenied_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения записей в журнале для пакетов, запрещенных
.Xr pf 4
с момента вчерашней проверки.
.It Va security_status_pfdenied_additionalanchors
.Pq Vt str
Разделенный пробелами список дополнительных якорей, записи журнала запрещенных пакетов которых необходимо
показать.
Основной набор правил (т. е. якорь с пустой строкой) и любые
.Xr черный списокd 8
если они присутствуют, всегда показываются.
.It Va security_status_pfdenied_period
.Pq Vt str
Устанавливается либо на
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_ipfwlimit_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения
.Xr ipfw 8
правила, достигшие предела сложности.
.It Va security_status_ipfwlimit_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_kernelmsg_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения нового
.Xr dmesg 8
с момента вчерашней проверки.
.It Va security_status_kernelmsg_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_loginfail_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения неудачных логинов из
.Pa /var/log/messages
за предыдущий день.
.It Va security_status_loginfail_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.It Va security_status_tcpwrap_enable
.Pq Vt bool
Установить на
.Dq Li YES
для отображения соединений, запрещённых tcpwrappers (см.
.Xr hosts_access 5 )
из
.Pa /var/log/messages
в течение предыдущего дня.
.It Va security_status_tcpwrap_period
.Pq Vt str
Установите либо
.Dq Li ежедневно ,
.Dq Li еженедельно ,
.Dq Li ежемесячно
или
.Dq Li NO .
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/defaults/periodic.conf"
.It Pa /etc/defaults/periodic.conf
Файл конфигурации по умолчанию.
Этот файл содержит все переменные и значения по умолчанию.
.It Pa /etc/periodic.conf
Обычный файл переопределения переменных, специфичных для системы.
.It Pa /etc/periodic.conf.local
Дополнительный файл переопределения, полезный, когда
.Pa /etc/periodic.conf
является общим или распространяемым.
.El
.Sh СМОТРИТЕ ТАКЖЕ 
.Xr apropos 1 ,
.Xr календарь 1 ,
.Xr df 1 ,
.Xr diff 1 ,
.Xr gzip 1 ,
.Xr locate 1 ,
.Xr man 1 ,
.Xr msgs 1 ,
.Xr netstat 1 ,
.Xr nice 1 ,
.Xr login.conf 5 ,
.Xr rc.conf 5 ,
.Xr ac 8 ,
.Xr chkgrp 8 ,
.Xr dump 8 ,
.Xr newsyslog 8 ,
.Xr periodic 8 ,
.Xr pkg-version 8 ,
.Xr sendmail 8
.Sh ИСТОРИЯ 
Сайт
.Nm
появился в
.Fx 4.1 .
.Sh АВТОРЫ
.An Брайан Сомерс Aq Mt brian@Awfulhak.org
