melkorbsd/ru-freebsd-man/man5/pf.os.5
.\"	$OpenBSD: pf.os.5,v 1.8 2007/05/31 19:19:58 jmc Exp $
.\"
.\" Copyright (c) 2003 Mike Frantzen <frantzen@w4g.org>
.\"
.\" Разрешение на использование, копирование, изменение и распространение данного программного обеспечения для любых
.\" цели с оплатой или без оплаты, настоящим предоставляется при условии, что вышеуказанное
.\" уведомление об авторских правах и это уведомление о разрешении будут присутствовать во всех копиях.
.\"
.\" ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ", И АВТОР ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ.
.\" В ОТНОШЕНИИ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ
.\" ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА
.\" ЛЮБЫЕ СПЕЦИАЛЬНЫЕ, ПРЯМЫЕ, КОСВЕННЫЕ ИЛИ ПОСЛЕДУЮЩИЕ УБЫТКИ ИЛИ ЛЮБЫЕ УБЫТКИ
.\" ВОЗНИКШИЕ В РЕЗУЛЬТАТЕ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БУДЬ ТО В
.\" ПО ДОГОВОРУ, ХАЛАТНОСТИ ИЛИ ДРУГИМ ДЕЛИКТНЫМ ДЕЙСТВИЯМ, ВОЗНИКАЮЩИМ ИЗ
.\" ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ РАБОТОЙ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.
.\"
.Dd 31 мая 2007 г.
.Dt PF.OS 5
.Os
.Sh ИМЯ
.Nm pf.os
Формат .Nd файла отпечатков пальцев операционной системы
.Sh ОПИСАНИЕ
Файл
.Xr pf 4
брандмауэр и
.Xr tcpdump 1
позволяют определить операционную систему узлов, с которых
создающих IPv4 TCP-соединения.
Файл состоит из записей, разделенных новой строкой, по одной на отпечаток,
содержащих девять двоеточий
.Pq Ql \&:
разделенных полей.
Эти поля выглядят следующим образом:
.Pp
.Bl -tag -width Description -offset indent -compact
.It окно
Размер окна TCP.
.It TTL
Время жизни IP-адреса.
.It df
Наличие бита IPv4 don't fragment.
.It Размер пакета
Размер начального TCP-пакета.
.It Опции TCP
Упорядоченный список опций TCP.
.It class
Класс операционной системы.
.It версия
Версия операционной системы.
.It subtype
Подтип уровня исправления операционной системы.
.It description
Общее текстовое описание операционной системы, версии и подтипа.
.El
.Pp
Окно
окно .Ar
соответствует полю th->th_win в заголовке TCP и представляет собой
объявленный размер окна TCP хоста-источника.
Он может быть от нуля до 65 535 включительно.
Размер окна может быть указан как кратное константе, для чего к размеру добавляется
размер со знаком процента
.Sq %
и это значение будет использовано в качестве модуля.
Для размера окна можно использовать три специальных значения:
.Pp
.Bl -tag -width xxx -offset indent -compact
.It *
Звездочка будет иметь подстановочный знак, поэтому подойдет любой размер окна.
.It S
Разрешить любой размер окна, кратный максимальному размеру сегмента (MSS).
.It T
Разрешить любой размер окна, кратный максимальному размеру блока передачи (MTU).
(MTU).
.El
.Pp
Адрес
.Ar ttl
это начальное время жизни в заголовке IP.
Код отпечатка будет учитывать изменчивость TTL пакета
по мере прохождения пакета через сеть.
.Pp
Сайт
.Ar df
соответствует биту Don't Fragment в заголовке IPv4.
Он указывает промежуточным маршрутизаторам не фрагментировать пакет и используется для
обнаружения MTU пути.
Он может быть либо нулем, либо единицей.
.Pp
Адрес
размер пакета .Ar
представляет собой буквальный размер полного IP-пакета и является функцией всех
параметров IP и TCP.
.Pp
Адрес
.Ar Опции TCP
представляет собой упорядоченный список отдельных опций TCP, которые появляются в пакете
SYN-пакете.
Каждая опция описывается одним символом, разделенным запятой, и
некоторые из них могут включать значение.
К опциям относятся:
.Pp
.Bl -tag -width Description -offset indent -compact
.It Mnnn
опция максимального размера сегмента (MSS).
Значение представляет собой максимальный размер пакета сетевого канала, который может
включать
.Sq %
или соответствовать всем MSS с модулем
.Sq *
значение.
.It N
опция NOP (NO Operation).
.It T[0]
параметр временной метки.
Некоторые операционные системы всегда начинают с нулевой метки времени, в этом случае
в этом случае к опции добавляется нулевое значение; в противном случае значение не добавляется.
.It S
опция Selective ACKnowledgement OK (SACKOK).
.It Wnnn
опция масштабирования окна.
Значение представляет собой размер масштабирования окна, который может включать в себя
.Sq %
или соответствовать всем масштабам окна с помощью параметра
.Sq *
значение.
.El
.Pp
Ни один параметр TCP в отпечатке пальца не может быть указан с одной точкой
.Sq \&. .
.Pp
Примером опций TCP в OpenBSD являются:
.Pp
.Dl M*,N,N,S,N,W0,N,N,T
.Pp
Первая опция
.Ar M*
является опцией MSS и будет соответствовать всем значениям.
Второй и третий варианты
.Ar N
будут соответствовать двум NOP.
Четвертая опция
.Ar S
будет соответствовать опции SACKOK.
Пятый
.Ar N
будет соответствовать еще одному NOP.
Шестой
.Ar W0
будет соответствовать опции масштабирования окна с нулевым размером масштаба.
Седьмой и восьмой
.Ar N
будут соответствовать двум NOP.
А девятый и последний параметр
.Ar T
будет соответствовать параметру timestamp с любым значением времени.
.Pp
Опции TCP в отпечатке пальца будут соответствовать только пакетам с
точно такими же опциями TCP в том же порядке.
.Pp
Адрес
класс .Ar
это класс, жанр или производитель операционной системы.
.Pp
Поле
версия .Ar
это версия операционной системы.
Используется для различения отпечатков пальцев операционных систем одного класса, но разных версий.
систем одного класса, но разных версий.
.Pp
Подтип
подтип .Ar
это подтип или уровень исправления версии операционной системы.
Он используется для различения различных отпечатков пальцев операционных систем
систем одного класса и одной версии, но слегка отличающихся
патчей или доработок.
.Pp
Сайт
описание .Ar
представляет собой общее описание операционной системы, ее версии,
уровень исправления и любые другие полезные сведения.
.Sh ПРИМЕРЫ
Отпечаток пальца обычного компьютера
.Ox 3.3
хоста:
.Bd -literal
  16384:64:1:64:M*,N,N,S,N,W0,N,N,T:OpenBSD:3.3::OpenBSD 3.3
.Ed
.Pp
Отпечаток пальца
.Ox 3.3
хоста, находящегося за брандмауэром с PF-скребком и правилом no-df, будет таким:
.Bd -литеральный
  16384:64:0:64:M*,N,N,S,N,W0,N,N,T:OpenBSD:3.3:!df:OpenBSD 3.3 scrub no-df
.Ed
.Pp
Абсолютно бессмысленный цифровой отпечаток  встроенной операционной системы:
.Bd -литеральный
  65535:255:0:40:.:DUMMY:1.1:p3:Dummy embedded OS v1.1p3
.Ed
.Pp
Сайт
.Xr tcpdump 1
вывод
.Bd -литеральный
  # tcpdump -s128 -c1 -nv 'tcp[13] == 2'
  03:13:48.118526 10.0.0.1.3377 > 10.0.0.2.80: S [tcp sum ok] \e
      534596083:534596083(0) win 57344 <mss 1460> (DF) [tos 0x10] \e
      (ttl 64, id 11315, len 44)
.Ed
.Pp
почти соответствует следующему цифровому отпечатку 
.Bd -литеральный
  57344:64:1:44:M1460: exampleOS:1.0::exampleOS 1.0
.Ed
.Sh СМОТРИТЕ ТАКЖЕ 
.Xr tcpdump 1 ,
.Xr pf 4 ,
.Xr pf.conf 5 ,
.Xr pfctl 8
