melkorbsd/ru-freebsd-man/man5/phones.5
.\" Авторское право (c) 1983, 1991, 1993
.\"	Регенты Калифорнийского университета.  Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" модификацией, разрешается при соблюдении следующих условий
.\" соблюдаются:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\" 3. Ни название Университета, ни имена его соавторов
.\" не могут быть использованы для поддержки или продвижения продуктов, созданных на основе этого программного обеспечения
.\" без специального предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ РЕГЕНТАМИ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ РЕГЕНТЫ ИЛИ ВКЛАДЧИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.\"     @(#)phones.5 8.1 (Berkeley) 6/5/93
.\"
.Dd 5 июня 1993 г.
.Dt PHONES 5
.Os
.Sh ИМЯ
.Nm телефоны
.Nd база данных телефонных номеров удаленных узлов
.Sh ОПИСАНИЕ
Файл
.Pa /etc/phones
содержит общесистемные
частные телефонные номера для
.Xr tip 1
программы.
Этот файл обычно не читается и может содержать
привилегированную информацию.
Формат файла представляет собой серию строк
вида: <имя системы>[\ \et]*<номер телефона>.
Имя системы - это
одно из тех, что определены в файле
.Xr remote 5
а номер телефона строится из любой последовательности
символов, заканчивающихся только символами ``,'' или концом строки.
Символы ``='' и ``*'' являются
индикаторы для устройств автоматического вызова, чтобы сделать паузу и дождаться второго сигнала набора номера
тона (при прохождении через АТС).
Символ ``='' требуется для
.Tn DF02-AC
а ``*'' требуется для
.Tn BIZCOMP
1030.
.Pp
Допускается только один телефонный номер на линию.
Однако, если более
одна строка в файле содержит одно и то же системное имя
.Xr tip 1
будет пытаться набрать каждый из них по очереди, пока не установит соединение.
Файлы .Sh
.Bl -tag -width /etc/phones -compact
.It Pa /etc/phones
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr tip 1 ,
.Xr remote 5
.Sh ИСТОРИЯ
The
.Nm
появился в
.Bx 4.2 .

