melkorbsd/ru-freebsd-man/man5/procfs.5
.\" Автор: Гаррет Воллман
.\" Этот файл является общественным достоянием.
.\"
.Dd 10 апреля 2023 г.
.Dt PROCFS 5
.Os
.Sh ИМЯ
.Nm procfs
.Nd файловая система процесса
.Sh SYNOPSIS
.Bd -литеральный
proc /proc procfs rw 0 0
.Ed
ОПИСАНИЕ .Sh
.Bf -символьный
Эта функциональность устарела.
Пользователям рекомендуется использовать
.Xr libprocstat 3
и
.Xr kvm 3
вместо них.
.Ef
.Pp
Файловая система процесса, или
.Nm ,
реализует представление таблицы системных процессов внутри файловой системы.
Обычно она монтируется в
.Pa /proc .
.Pp
Сайт
.Nm
обеспечивает двухуровневое представление пространства процессов, в отличие от предыдущей версии
.Fx 1.1
.Nm
реализации.
На самом высоком уровне именуются сами процессы в соответствии с
их идентификаторы процессов в десятичном исчислении без ведущих нулей.
Существует также
специальный узел под названием
.Pa curproc
который всегда ссылается на процесс, выполняющий запрос поиска.
.Pp
Каждый узел представляет собой каталог, содержащий следующие записи:
.Bl -tag -width status
.It Pa dbregs
Отладочные регистры, определенные
.Dv "struct dbregs"
в
.In machine/reg.h .
.Pa dbregs
в настоящее время реализована только на архитектуре i386.
.It Pa etype
Тип исполняемого файла, на который ссылается файл
файл .Pa
запись.
Файл .It Pa
Символическая ссылка на файл, из которого был прочитан текст процесса.
Она может быть использована для получения доступа к таблице символов процесса,
или для запуска другой копии процесса.
Если файл не удается найти, целью ссылки будет
.Ql неизвестно .
.It Pa fpregs
Регистры с плавающей точкой, как определено в
.Dv "struct fpregs"
в
.In machine/reg.h .
.Pa fpregs
реализуется только на машинах, имеющих отдельные наборы регистров общего
назначения и наборы регистров с плавающей запятой.
.It Pa map
Набор строк, описывающих области памяти процесса,
где каждая строка содержит следующие поля:
.Bl -tag -compact -width private-resident
.It start-address
Начальный адрес региона (включительно).
.It end-address
Конечный адрес региона (включительно).
.It resident
Количество резидентных страниц.
.It private-resident
Количество резидентных страниц, которые были приватными для процесса.
.It obj
Виртуальный адрес
.Vt struct vm_object
Структура данных ядра, описывающая область памяти.
.It access
Трехсимвольная строка, состоящая из символов
.Sq r ,
.Sq w
и
.Sq x ,
обозначающие разрешения на чтение, запись и выполнение соответственно.
Отсутствие разрешения представлено
.Sq - .
.It ref_count
Количество ссылок на регион.
.It shadow_count
Количество объектов VM, для которых этот регион является тенью.
.It flags
Флаги для объекта, см. флаги с именем
.Sy OBJ_*
в
.In vm/vm_object.h .
.It copy-on-write
Является ли регион копируемым при записи.
Одно из:
.Bl -tag -compact -width NCOW
.It COW
Регион с функцией копирования при записи.
.It NCOW
Область без копирования при записи.
.El
.It needs-copy
Нужна ли региону копия.
Одно из:
.Bl -tag -compact -width NNC
.It NC
Региону требуется копия.
.It NNC
Региону не нужна копия.
.El
.It тип
Тип региона.
Один из:
.Bl -tag -compact -width unknown
.It dead
Регион, связанный с мертвым объектом VM.
.It device
Регион, основанный на памяти устройства.
.It none
Регион, не поддерживаемый ничем.
.It phys
Регион, поддерживаемый физической памятью.
.It swap
Регион, поддерживаемый свопом.
.It unknown
Регион неизвестного типа.
.It vnode
Регион, поддерживаемый файлом.
.El
.It fullpath
Путь к файлу, поддерживающему регион памяти, или
.Sq -
если такой файл отсутствует.
.It cred
Одно из:
.Bl -tag -compact -width NCH
.It CH
Регион оплачивается пользователем, указанным в параметре
.Sq charged-uid
поле.
.It NCH
Регион не начисляется ни одному пользователю.
.El
.It charged-uid
UID пользователя, с которого взимается плата, или -1, если плата не взимается.
.El
.It Pa mem
Полный образ виртуальной памяти процесса.
Доступны только те адреса, которые существуют в процессе.
Чтение и запись в этот файл изменяют процесс.
Записи в текстовый сегмент остаются приватными для процесса.
.It Pa note
Используется для отправки сигналов процессу.
Не реализовано.
.It Pa notepg
Используется для отправки сигнала группе процессов.
Не реализовано.
.It Pa osrel
Позволяет читать и записывать значение osrel ядра, присвоенное процессу.
Оно влияет на шиммы совместимости, которые включаются и выключаются
в зависимости от значения.
Начальное значение процесса считывается из тега ABI note в исполняемом ELF-образе,
и равно нулю, если тег не поддерживается двоичным форматом или не был найден.
.It Pa regs
Позволяет читать и записывать набор регистров процесса.
Этот файл содержит двоичную структуру данных
.Dv "struct regs"
определенная в
.In machine/reg.h .
.Pa regs
может быть записана только после остановки процесса.
.It Pa rlimit
Это файл, доступный только для чтения, содержащий текущий и максимальный
пределы.
Каждая строка имеет формат
.Ar rlimit current max ,
с -1
означает бесконечность.
.It Pa status
Статус процесса.
Этот файл доступен только для чтения и возвращает одну строку, содержащую
несколько полей, разделенных пробелами, как показано ниже:
.Pp
.Bl -bullet -compact
.It
имя команды
.It
идентификатор процесса
.It
идентификатор родительского процесса
.It
идентификатор группы процессов
.It
идентификатор сессии
.It
имя устройства
управляющего терминала, или
знак минус
.Pq Dq -
если управляющий терминал отсутствует.
.It
список флагов процесса:
.Dv ctty
если есть управляющий терминал,
.Dv sldr
если процесс является лидером сеанса,
.Dv noflags
если ни один из двух других флагов не установлен.
.It
время запуска процесса в секундах и микросекундах,
через запятую.
.It
время пользователя в секундах и микросекундах,
через запятую.
.It
системное время в секундах и микросекундах,
через запятую.
.It
сообщение канала ожидания
.It
учетные данные процесса, состоящие из
идентификатора действительного пользователя
и списка групп (первый член которого
является идентификатор эффективной группы)
все через запятую.
.It
имя хоста тюрьмы, в которой выполняется процесс, или
.Ql -
чтобы указать, что процесс выполняется не в тюрьме.
.El
.El
.Pp
Каждый узел принадлежит пользователю процесса и входит в его
основной группе.
.Sh ФАЙЛЫ
.Bl -tag -width /proc/curproc/XXXXXXX -compact
.It Pa /proc
обычная точка монтирования для
.Nm .
.It Pa /proc/pid
каталог, содержащий информацию о процессе
.Pa pid .
.It Pa /proc/curproc
каталог, содержащий информацию о текущем процессе
.It Pa /proc/curproc/cmdline
имя исполняемого файла процесса
.It Pa /proc/curproc/etype
тип исполняемого файла
.It Pa /proc/curproc/file
образ исполняемого файла
.It Pa /proc/curproc/fpregs
набор регистров процесса с плавающей запятой
.It Pa /proc/curproc/map
карта виртуальной памяти процесса
.It Pa /proc/curproc/mem
полное виртуальное адресное пространство процесса
.It Pa /proc/curproc/note
используется для сигнализации процесса
.It Pa /proc/curproc/notepg
используется для сигнализации о группе процессов
.It Pa /proc/curproc/osrel
значение процесса osrel
.It Pa /proc/curproc/regs
набор регистров процесса
.It Pa /proc/curproc/rlimit
текущее и максимальное ограничение процесса
.It Pa /proc/curproc/status
текущий статус процесса
.El
.Sh ПРИМЕРЫ
Чтобы смонтировать
.Nm
файловую систему на
.Pa /proc :
.Pp
.Dl "mount -t procfs proc /proc"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr procstat 1 ,
.Xr mount 2 ,
.Xr sigaction 2 ,
.Xr unmount 2 ,
.Xr kvm 3 ,
.Xr libprocstat 3 ,
.Xr pseudofs 9
.Sh АВТОРЫ
.An -nosplit
Эта страница руководства написана
.An Гарреттом Вольманом ,
на основе описания,
предоставленного
.An Яном-Саймоном Пендри ,
и позднее переработана
.An Майком Причардом .


