melkorbsd/ru-freebsd-man/man5/publickey.5
.\" @(#)publickey.5 2.1 88/08/07 4.0 RPCSRC; с 1.6 88/02/29 SMI;
.Dd 19 октября 1987 г.
.Dt PUBLICKEY 5
.Os
.Sh ИМЯ
.Nm открытый ключ
.Nd "база данных открытых ключей"
.Sh SYNOPSIS
.Pa /etc/publickey
.Sh ОПИСАНИЕ
.Pa /etc/publickey
это база данных открытых ключей, используемая для безопасности 
RPC (удаленных вызовов процедур).
Каждая запись в
базе данных состоит из сетевого пользователя
имени (которое может относиться как к
пользователя или имя хоста), за которым следует открытый ключ пользователя
открытый ключ пользователя (в шестнадцатеричной
нотации), двоеточие, а затем секретный ключ пользователя
секретный ключ, зашифрованный с помощью
секретный ключ пользователя, зашифрованный его паролем для входа в систему (также в шестнадцатеричной системе счисления).
.Pp
Этот файл изменяется либо самим пользователем с помощью команды
.Xr chkey 1
либо системным администратором с помощью команды
.Xr newkey 8
командой.
Файл
.Pa /etc/publickey
должен содержать только данные о
.Tn NIS
главной машины, где он
преобразуется в
.Tn NIS
базу данных
.Pa publickey.byname .
.Sh СМОТРИТЕ ТАКЖЕ 
.Xr chkey  1 ,
.Xr publickey 3 ,
.Xr newkey 8 ,
.Xr ypupdated 8


