melkorbsd/ru-freebsd-man/man5/pw.conf.5
.\" Авторское право (C) 1996
.\" Дэвид Л. Ньюджент.  Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с или без
.\" модификацией, разрешается при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ДЭВИДОМ Л. НЮГЕНТОМ И СОАВТОРАМИ ``КАК ЕСТЬ`` И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ДЭВИД Л. НУДЖЕНТ ИЛИ СПОНСОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ОБРАЗЦОВЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 30 марта 2007 г.
.Dt PW.CONF 5
.Os
.Sh ИМЯ
.Nm pw.conf
.Nd формат файла конфигурации pw.conf
.Sh ОПИСАНИЕ
Файл
.Pa /etc/pw.conf
содержит данные конфигурации для
.Xr pw 8
утилиты.
Файл
.Xr pw 8
используется для обслуживания системных файлов паролей и групп
позволяющих добавлять, удалять и изменять пользователей и группы.
Этот файл можно изменить с помощью утилиты
.Xr pw 8
с помощью команды
.Ar useradd
и
.Fl D
или отредактировав ее непосредственно в текстовом редакторе.
.Pp
Каждая строка в
.Pa /etc/pw.conf
рассматривается либо как комментарий, либо как данные конфигурации;
Пустые строки и строки, начинающиеся со знака
.Ql \&#
считаются комментариями, а все оставшиеся строки
проверяются на наличие ведущего ключевого слова, за которым следуют соответствующие данные.
.Pp
Ключевые слова, распознаваемые
.Xr pw 8
являются:
.Bl -tag -width password_days -offset indent -compact
.It defaultpasswd
влияет на пароли, генерируемые для новых пользователей
.It reuseuids
повторно использовать пробелы в последовательности uid
.It reusegids
повторное использование пробелов в последовательностях gid
.It nispasswd
путь к
.Tn NIS
базе данных passwd
.It skeleton
место получения домашнего содержимого по умолчанию
.It newmail
почта для отправки новым пользователям
.It logfile
записывать изменения пользователей/групп в этот файл
.It home
корневой каталог для домашних директорий
.It homemode
разрешения для домашнего каталога
.It shellpath
пути, в которых должны располагаться программы оболочки
.It shells
список допустимых оболочек (без указания пути)
.It defaultshell
оболочка по умолчанию (без пути)
.It defaultgroup
группа по умолчанию
.It extragroups
добавлять новых пользователей в эти группы
.It defaultclass
поместить новых пользователей в этот класс логина
.It minuid
.It maxuid
диапазон допустимых идентификаторов пользователей по умолчанию
.It mingid
.It maxgid
диапазон действительных идентификаторов групп по умолчанию
.It expire_days
дни, после которых истекает срок действия учетной записи
.It password_days
дни, через которые истекает срок действия пароля
.El
.Pp
Допустимые значения для
.Ar defaultpasswd
являются:
.Bl -tag -width password_days -offset indent -compact
.It no
отключить вход во вновь созданные учетные записи
.It yes
заставить пароль быть именем учетной записи
.It none
принудительно вводить пустой пароль
.It random
генерировать случайный пароль
.El
.Pp
Второй и третий варианты небезопасны, и их следует избегать, если
если это возможно в общедоступной системе.
Первый вариант требует, чтобы суперпользователь выполнил команду
.Xr passwd 1
для установки пароля перед использованием учетной записи.
Это также может быть полезно для создания административных учетных записей.
Последний вариант заставляет
.Xr pw 8
печатать случайно сгенерированный пароль в stdout.
Это наиболее предпочтительный и безопасный вариант.
Сайт
.Xr pw 8
также предоставляет возможность задать определенный пароль для нового
пользователя через файловый манипулятор (командные строки небезопасны).
.Pp
Оба
.Ar reuseuids
и
.Ar reusegids
определяют метод, с помощью которого генерируются новые идентификационные номера пользователей и групп
генерируются новые идентификационные номера пользователей и групп.
A
.Ql \&да
в этом поле приведет к тому, что
.Xr pw 8
искать первый неиспользованный идентификатор пользователя или группы в пределах допустимого
диапазоне, в то время как
.Ql \&no
гарантирует, что ни один из существующих идентификаторов пользователя или группы в пределах диапазона
численно ниже, чем новый, и, следовательно, позволяет избежать
повторного использования пробелов в последовательности идентификаторов пользователей или групп, вызванных
предыдущими удалениями пользователей или групп.
Обратите внимание, что если группа по умолчанию не указана с помощью параметра
.Ar defaultgroup
ключевое слово,
.Xr pw 8
создаст новую группу для пользователя и попытается сохранить для нее
uid и gid нового пользователя.
Если uid нового пользователя в настоящее время используется в качестве идентификатора группы, то вместо него выбирается следующий
вместо него будет выбран следующий доступный идентификатор группы.
.Pp
На
.Tn NIS
серверах, которые содержат отдельную базу данных passwd в
.Pa /etc/master.passwd ,
эта опция позволяет одновременно обновлять дополнительный файл
при добавлении, изменении или удалении записей пользователей.
Если параметр пуст или имеет значение 'no', дополнительная база данных не будет обновляться.
Необходимо использовать абсолютное имя пути.
.Pp
Файл
скелет .Ar
назначает каталог, из которого строится содержимое
нового домашнего каталога пользователя.
Это
.Pa /usr/share/skel
по умолчанию.
Ключ
.Xr pw 8 Ns 's
.Fl m
заставляет домашний каталог пользователя быть созданным и заполненным
используя файлы, содержащиеся в
скелет .Ar
директории.
.Pp
Для отправки первоначального письма новым пользователям используется опция
.Ar newmail
можно использовать ключевое слово, чтобы указать путь к файлу, содержащему
тело отправляемого сообщения.
Чтобы не отправлять почту при создании учетных записей, оставьте этот элемент
пустой или укажите
.Ql \&no .
.Pp
Файл журнала
.Ar logfile
позволяет регистрировать изменения файла паролей в
назначенный файл журнала.
Чтобы не создавать и не добавлять такой файл, оставьте это поле
поле пустым или укажите
.Ql \&no .
.Pp
Сайт
.Ar home
является обязательным.
Оно задает расположение каталога, в котором создаются все новые пользовательские
создаются все новые домашние каталоги пользователей.
.Pp
Адрес
.Ar homeemode
является необязательным.
Оно задает маску создания домашнего каталога пользователя и изменяется командой
.Xr umask 2 .
.Pp
Ключ
.Ar shellpath
задает список каталогов, разделенных двоеточиями.
.Ql \&:
- которые содержат программы, используемые оболочками для входа в систему.
.Pp
Оболочка
.Ar shells
задает список программ, доступных для использования в качестве оболочек входа в систему
оболочек.
Этот список представляет собой разделенный запятыми список имен оболочек, которые не должны
не содержать путь.
Эти оболочки должны существовать в одном из каталогов, обозначенных
.Ar shellpath .
.Pp
Сайт
.Ar defaultshell
определяет, какую программу-оболочку использовать для новых пользователей, если
ни одна из них не указана в параметре
.Xr pw 8
командной строке.
.Pp
Адрес
.Ar defaultgroup
определяет основную группу (номер идентификатора группы в
файле паролей), используемую для новых учетных записей.
Если оставить это значение пустым или использовать слово
.Ql \&no
то для каждого нового пользователя будет автоматически создана соответствующая группа
будет создана автоматически.
Это рекомендуемая процедура для новых пользователей, так как она наилучшим образом защищает файлы каждого пользователя от
файлы каждого пользователя от вмешательства других пользователей системы
независимо от
.Em umask
обычно используемой пользователем.
.Pp
Сайт
.Ar extragroups
предоставляет автоматическое средство для помещения новых пользователей в группы внутри
в
.Pa /etc/groups
файла.
Это полезно в тех случаях, когда все пользователи совместно используют некоторые ресурсы, и предпочтительнее
чем размещение пользователей в одной основной группе.
Действие этого ключевого слова можно отменить с помощью параметра
.Fl G
в файле
.Xr pw 8
командной строки.
.Pp
Опция
.Ar defaultclass
определяет класс входа в систему (см.
.Xr login.conf 5 )
который будет присвоен новым пользователям, если он не будет перезаписан в поле
.Xr pw 8 .
.Pp
Поле
.Ar minuid ,
.Ar maxuid ,
.Ar mingid ,
.Ar maxgid
ключевые слова определяют допустимые диапазоны автоматически назначаемых идентификаторов пользователей
и идентификаторов групп.
Значения по умолчанию для идентификаторов пользователей и групп составляют 1000 и 32000 как
минимум и максимум соответственно.
Идентификаторы пользователя и группы фактически используются при создании учетной записи с помощью
.Xr pw 8
могут быть переопределены с помощью параметра
.Fl u
и
.Fl g
опции командной строки.
.Pp
Сайт
.Ar expire_days
и
.Ar password_days
используются для автоматического расчета количества дней с даты
создания учетной записи, когда срок действия учетной записи истечет или
пользователь будет вынужден изменить пароль учетной записи.
Значение
.Ql \&0
в любом из полей отключит соответствующую (учетную запись или пароль)
срок действия.
.Sh ОГРАНИЧЕНИЯ
Максимальная длина строки в файле
.Pa /etc/pw.conf
составляет 1024 символа.
Более длинные строки будут пропускаться и рассматриваться
как комментарии.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/pw.conf
.It Pa /etc/passwd
.It Pa /etc/master.passwd
.It Pa /etc/group
.El
.Sh СМОТРИТЕ ТАКЖЕ 
.Xr passwd 1 ,
.Xr umask 2 ,
.Xr group 5 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr pw 8

