melkorbsd/ru-freebsd-man/man5/pwd.db.5
.\"	$NetBSD: passwd.5,v 1.12.2.2 1999/12/17 23:14:50 he Exp $
.\"
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\" Portions Copyright (c) 1994, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)passwd.5	8.1 (Berkeley) 6/5/93
.\"
.Dd May 16, 2023
.Dt PASSWD 5
.Os
.Sh ИМЯ
.Nm passwd ,
.Nm master.passwd ,
.Nm pwd.db ,
.Nm spwd.db
.Nd формат файла паролей
.Sh ОПИСАНИЕ
файлы
.Nm
являются локальным источником информации о пароле.
Их можно использовать в сочетании с доменами Гесиода.
.Sq Li пароль
и 
.Sq Li uid ,
и
NIS
maps
.Sq Li master.passwdbyname ,
.Sq Li passwd.byuid ,
.Sq Li master.passwd.byuid ,
и 
.Sq Li master.passwd.byuid ,
как контролируется
.Xr nsswitch.conf 5 .
.Pp
Для единообразия ни один из этих файлов никогда не должен изменяться
вручную.
.Pp
файл
.Nm master.passwd
доступен для чтения только пользователю и состоит из записей, 
разделенных новой строкой, по одной для каждого пользователя и содержащих десять двоеточий.
.Pq Ql \&:
разделенне
поля.
Эти поля следующие:
.Bl -tag -width ".Ar password" -offset indent
.It Ar имя
Имя пользователя для входа.
.It Ar пароль
пользователя
.Em зашифрованный
пароль.
.It Ar uid
Идентификатор пользователя.
.It Ar gid
Идентификатор группы входа пользователя.
.It Ar class
Класс входа пользователя.
.It Ar change
Время смены пароля.
.It Ar expire
Срок действия учетной записи.
.It Ar gecos
Общая информация о пользователе.
.It Ar home_dir
Домашний каталог пользователя.
.It Ar shell
Оболочка входа пользователя.
.El
.Pp
файл
.Nm
создается из
.Nm master.passwd
файл по
.Xr pwd_mkdb 8 ,
имеет
.Ar class ,
.Ar change ,
и
.Ar expire
поля удалены, а
.Ar password
поле заменено на
.Ql *
символ
.Pp
поле
.Ar name
 — логин, используемый для доступа к учетной записи компьютера, а поле
.Ar uid
Поле — это число, связанное с ним.
Они оба должны быть уникальными
по всей системе (а часто и по группе систем), поскольку они
контролировать доступ к файлам.
.Pp
Хотя возможно иметь несколько записей с одинаковыми именами входа
и/или одинаковыми идентификаторами пользователей, обычно это является ошибкой.
Подпрограммы, которые манипулируют этими файлами,
часто возвращают только одну из нескольких записей, и то в результате случайного выбора.
.Pp
Имя для входа не должно начинаться с дефиса
.Pq Ql \&- ,
и не может содержать 8-битные символы, символы табуляции или пробелы, а также любой из этих
символов:
.Ql \&,:+&#%^\&(\&)!@~*?<>=|\e\\&/"\&; .
Символ доллара
.Pq Ql \&$
разрешен только в качестве последнего символа для использования с Samba.
Ни одно поле не может содержать 
двоеточие
.Pq Ql \&:
поскольку исторически это использовалось для разделения полей 
в пользовательской базе данных.
.Pp
Регистр имеет значение 
Имена для входа
.Ql Lrrr
и 
.Ql lrrr
представляют разных пользователей.
Помните об этом при взаимодействии с системами, 
в которых имена для входа не чувствительны к регистру.
.Pp
в
.Nm master.passwd
файл,
тот
.Ar password
поле - это
.Em encrypted
форму пароля смотрите здесь
.Xr crypt 3 .
Если
.Ar password
если поле пустое, пароль для доступа к компьютеру не потребуется.
Это почти всегда ошибка, поэтому компоненты аутентификации, 
такие как PAM, могут принудительно запретить удаленный доступ к учетным записям без пароля.
Поскольку этот файл содержит зашифрованные пароли пользователей, 
он не должен быть доступен для чтения никому без соответствующих привилегий.
.Pp
Пароль от
.Ql *
указывает, 
что проверка подлинности по паролю отключена для этой учетной
записи (вход в систему с помощью других способов
проверки подлинности, например, с помощью
.Xr ssh 1
ключи, все равно будут работать).
Поле содержит только зашифрованные пароли, а
.Ql *
это никогда не может быть результатом шифрования пароля.
.Pp
Зашифрованный пароль с префиксом
.Ql *LOCKED*
означает, что учетная запись временно заблокирована
и никто не может войти в нее с помощью какой-либо аутентификации.
Удобный интерфейс командной строки для блокировки учетной записи приведен в разделе
.Xr pw 8 .
.Pp
поле
.Ar group
- это группа, в которую пользователь будет включен при входе в систему.
Поскольку эта система поддерживает несколько групп (см.
.Xr groups 1 )
в настоящее время это поле не имеет особого значения.
.Pp
поле
.Ar class
является ключом для класса входа пользователя.
Классы входа 
определены в
.Xr login.conf 5 ,
который является
.Xr termcap 5
база данных стилей, содержащая пользовательские атрибуты, 
настройки учета, ресурсов и среды.
.Pp
поле
.Ar change
- это количество секунд с начала эпохи,
.Dv UTC ,
until the
password for the account must be changed.
This field may be left empty to turn off the password aging feature;
a value of zero is equivalent to leaving the field empty.
.Pp
поле
.Ar expire
- это количество секунд с начала регистрации,
.Dv UTC ,
пока не 
истечет срок действия учетной записи.
Это поле можно оставить пустым, чтобы отключить функцию "устаревание учетной записи"; 
нулевое значение эквивалентно тому, что поле остается пустым.
.Pp
поле
.Ar gecos
обычно содержит запятую
.Pq Ql \&,
разделенные подполя следующим образом:
.Pp
.Bl -метка -ширина ".Ar office" - отступ со смещением -компактный
.It Ar name
полное имя пользователя
.It Ar office
рабочий номер пользователя
.It Ar wphone
номер рабочего телефона пользователя
.It Ar hphone
номер домашнего телефона пользователя
.El
.Pp
Полный
.Ar name
может содержать амперсанд
.Pq Ql &
который будет заменен на
логин с заглавной буквы
.Ar name
когда
.Ar gecos
поле отображается или используется
различными программами, такими как
.Xr finger 1 ,
.Xr sendmail 8 ,
и т.д.
.Pp
подполя
.Ar office
 и номер телефона используются пользователем.
.Xr finger 1
программа и, возможно, другие приложения.
.Pp
Домашний каталог пользователя,
.Ar home_dir ,
является полным
.Ux
имя пути, по которому пользователь
будет помещен при входе в систему.
.Pp
поле
.Ar shell
- это интерпретатор команд, который предпочитает пользователь.
Если в поле
.Ar shell
филд, оболочка Борна
.Pq Pa /bin/sh
предполагается.
Обычный способ отключить вход в учетную запись раз и навсегда,
как это делается для системных учетных записей,
заключается в установке
.Ar shell
к
.Pa /sbin/nologin
.Pq see Xr nologin 8 .
.Sh HESIOD ПОДДЕРЖКА
Если
.Sq Li dns-сервер
указывается для
.Sq Li пароля 
в базе данных 
.Xr nsswitch.conf 5 ,
затем
.Nm
поиск происходит с помощью
.Sq Li 
Hesiod домена.
.Sh NIS SUPPORT
Если
.Sq Li Norton Internet Security
указывается для
.Sq Li паролей
 базы данных
.Xr nsswitch.conf 5 ,
затем
.Nm
поиск происходит с помощью
.Sq Li пароля ,
.Sq Li номер ID пользователя ,
.Sq Li имя пользователя , ,
и
.Sq Li главный идентификатор пароля
- это карты 
NIS.
.Sh COMPAT SUPPORT
Если
.Sq Li соответствие
указывается для
.Sq Li паролz
базы данных, или
.Sq Li dns-сервера
или
.Sq Li nis
указывается для
.Sq Li passwd_compat
базы данных 
.Xr nsswitch.conf 5 ,
затем
.Nm
файл также поддерживает стандартные
.Sq Li + Ns / Ns Li -
исключения и включения, основанные на именах пользователей и сетевых группах.
.Pp
Строки, начинающиеся с символа
.Ql -
(знак минус) отмечены ли записи как исключенные
из любых следующих включений, которые помечены знаком
.Ql +
(знак "плюс").
.Pp
Если второй символ строки является символом
.Ql @
(при подписании), 
операция включает в себя пользовательские поля всех записей в группе net, 
указанных оставшимися символами
.Ar name
поле.
В противном случае оставшаяся часть
.Ar name
предполагается, что это конкретное имя пользователя.
.Pp
авторизация
.Ql +
 также может быть одна в
.Ar name
поле, которое вызывает всех пользователей из любого домена Hesiod
.Nm
(с
.Sq Li passwd_compat: dns )
или
.Sq Li passwd.byname
и
.Sq Li passwd.byuid
NIS
maps (с
.Sq Li passwd_compat: nis )
быть включенным.
.Pp
Если запись содержит непустое поле
.Ar uid
или
.Ar gid
поля, указанные номера будут заменять информацию, 
полученную из домена Hesiod или
карт NIS.
Аналогично, если в
.Ar gecos ,
.Ar dir
или
.Ar shell
записи содержат текст, 
он будет заменять информацию, включенную через 
Hesiod или NIS.
В некоторых системах
.Ar passwd
поле также может быть переопределено.
.Sh FILES
.Bl -tag -width ".Pa /etc/master.passwd" -compact
.It Pa /etc/passwd
Американский стандартный код для обмена информацией
паролей для обмена информацией с удаленными паролями
.It Pa /etc/pwd.db
.Xr db 3 Ns -format
база данных паролей с удаленными паролями
Американский стандартный код для обмена информацией
файл паролей с сохраненными паролями
.It Pa /etc/spwd.db
.Xr db 3 Ns -format
база данных паролей с сохраненными паролями
.El
.Sh СОВМЕСТИМОСТЬ
С тех пор формат файла паролей изменился
.Bx 4.3 .
Следующий awk-скрипт можно использовать для преобразования вашего файла 
паролей старого образца в файл паролей нового образца.
Дополнительные поля
.Ar class ,
.Ar change
и
.Ar expire
добавляются, но по умолчанию отключены
.Pq setting these fields to zero is equivalent to leaving them blank .
Класс в настоящее время не реализован, но change и expire есть; чтобы установить их,
используйте текущий день в секундах от эпохи + любое количество секунд смещения, 
которое вы хотите.
.Bd -literal -offset indent
начать { FS = ":"}
{ print $1 ":" $2 ":" $3 ":" $4 "::0:0:" $5 ":" $6 ":" $7 }
.Ed
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr login 1 ,
.Xr passwd 1 ,
.Xr crypt 3 ,
.Xr getpwent 3 ,
.Xr login.conf 5 ,
.Xr netgroup 5 ,
.Xr nsswitch.conf 5 ,
.Xr adduser 8 ,
.Xr nologin 8 ,
.Xr pw 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8 ,
.Xr yp 8
.Pp
.%T "Managing NFS and NIS"
(O'Reilly & Associates)
.Sh ИСТОРИЯ
A
.Nm
формат файла впервые появился в
.At v1 .
.Pp
формат
NIS
.Nm
файла впервые появился в SunOS.
.Pp
Поддержка Гесиода впервые появилась в
.Fx 4.1 .
Он был импортирован из
.Nx
Проект, где он впервые появился в
.Nx 1.4 .
.Sh ОШИБКИ
Пользовательская информация должна храниться (и в конечном итоге будет храниться) в другом месте.
.Pp
Размещение
.Sq Li совместимость
исключения из файла после любых включений приведут
к неожиданным результатам.
