melkorbsd/ru-freebsd-man/man5/qop.5
.\" Copyright (c) 2005 Doug Rabson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd 26 января, 2010
.Dt MECH 5
.Os
.Sh ИМЯ
.Nm mech ,
.Nm qop
.Nd "GSS-API Mechanism and QOP files"
.Sh КРАТКИЙ ОБЗОР
.Pa "/etc/gss/mech"
.Pa "/etc/gss/qop"
.Sh ОПИСАНИЕ
Файл
.Pa "/etc/gss/mech"
содержит список установленных механизмов безопасности GSS-API.
Каждая строка файла либо содержит комментарий, если первым символом
является "#", либо содержит пять полей со следующими значениями:
.Bl -tag -width ".It Object identifier"
.It Имя
Название этого  GSS-API механизма.
.It Идентификатор объекта
OID для этого механизма.
.It Библиотека
Общая библиотека, содержащая реализацию этого механизма.
.It Модуль ядра
Дополнительный модуль ядра, содержащий реализацию этого механизма 
(пока не поддерживается в FreeBSD).
.It Параметры библиотеки
Необязательные параметры, интерпретируемые механизмом. Параметры библиотеки
должны быть заключены в квадратные скобки ([ ]) чтобы отличить их от
необязательной записи модуля ядра.
.El
.Pp
Первый механизм, перечисленный в
.Pa "/etc/gss/mech"
является механизмом по умолчанию.
Этот механизм будет использоваться с помощью
.Xr gss_init_sec_context 3
если пользователь не указывает конкретный механизм.
.Pp
Файл
.Pa "/etc/gss/qop"
содержит список значений качества защиты для использования с
GSS-API.
Каждая строка файла либо содержит комментарий, если первым параметром
является '#' или он содержит три поля со следующими значениями:
.Bl -tag -width ".It Mechanism name"
.It QOP string
Название алгоритма защиты этого качества.
.It QOP value
Числовое значение, используемое для выбора этого алгоритма для использования с функциями GSS-API, такими как
.Xr gss_get_mic 3 .
.It Mechanism name
Название механизма GSS-API, соответствующее этому алгоритму.
.El
.Sh ПРИМЕРЫ
Это типичная запись из
.Pa "/etc/gss/mech" :
.Bd -literal
kerberosv5	1.2.840.113554.1.2.2	/usr/lib/libgssapi_krb5.so.8	-
.Ed
.Pp
Это типичная запись из
.Pa "/etc/gss/qop" :
.Bd -literal
GSS_KRB5_CONF_C_QOP_DES		0x0100	kerberosv5
.Ed
.Sh ИСТОРИЯ
Страница руководства 
.Nm
впервые появилась в
.Fx 7.0 .
.Sh АВТОРЫ
Эта
страница руководства была написана
.An Doug Rabson Aq Mt dfr@FreeBSD.org .
