melkorbsd/ru-freebsd-man/man5/quota.group.5
.\" Copyright (c) 2001	Nik Clayton
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 30, 2007
.Dt QUOTA.USER 5
.Os
.Sh ИМЯ
.Nm quota.user , quota.group
.Nd для каждой базы данных квот файловой системы
.Sh ОПИСАНИЕ
Каждая файловая система с активными квотами должна содержать файл
.Pa quota.user
и файл
.Pa quota.group
в корневом каталоге файловой системы.
Эти файлы создаются с помощью
.Xr quotacheck 8 ,
и должны быть отредактированы с помощью
.Xr edquota 8 .
Можно указать другое местоположение и имя файла с помощью действия
.Dq Li userquota
и действия
.Dq Li groupquota
в файле
.Xr fstab 5
.
.Pp
Файлы данных содержат следующую информацию:
.Pp
.Bl -bullet -offset indent -compact
.It
Текущее использование блока
.It
Текущее количество файлов
.It
ограничение Soft блока
.It
ограничение Soft файлов
.It
ограничение Hard блока
.It
ограничение Hard файлов
.It
Заблокируйте оставшееся льготное время, если оно превышает установленный лимит
.It
Оставшееся время отсрочки подачи документов при превышении установленного лимита
.El
.Pp
См. раздел
.Xr edquota 8
для получения разъяснений по различным лимитам и льготным периодам.
.Pp
Во время обычных операций с квотами
.Xr quotactl 2
интерфейс используется для запроса или установки информации о квотах, и ядро
будет поддерживать файлы данных по мере необходимости.
Если квоты отключены в
файловой системе, но помечены как включенные в
.Xr fstab 5 ,
тогда файлы данных о квотах будут использоваться напрямую.
.Pp
Файлы данных хранятся в виде массива
.Dq Li struct dqblk
структуры, как определено в
.In ufs/ufs/quota.h ,
и индексируются по UID или GID.
По возможности файлы данных будут записаны в виде разреженного файла.
Данные сохраняются только для идентификаторов, которые имеют ненулевое использование или ненулевые ограничения
по квоте.
Если будет предпринята попытка получить доступ к данным по идентификатору, который существовал бы после
окончания текущего файла данных, будет создана структура квот со всеми значениями, равными
нулю, и файл данных будет расширен по мере необходимости.
Утилита
.Xr quotacheck 8
сократит файлы данных до минимального размера, необходимого
для хранения максимального идентификатора, либо при ненулевом использовании файла, либо
при ненулевых ограничениях квоты.
.Pp
Запись данных для идентификатора 0 имеет особое значение.
Если
.Dq Dv dqb_btime
или
.Dq Dv dbq_itime
поля не равны нулю, они используются для указания льготного периода в
данной файловой системе для пользователей, которые превысили установленный лимит.
Это время можно задать с помощью
.Xr edquota 8
с флагом
.Fl t
.
Если не был установлен явный льготный период с
.Xr edquota 8 ,
тогда будет использоваться значение по умолчанию, равное 7 дням.
Значения по умолчанию определяются
.Dv MAX_DQ_TIME
и
.Dv MAX_IQ_TIME
в
.In ufs/ufs/quota.h .
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr quotaoff 8 ,
.Xr quotaon 8 ,
.Xr repquota 8
