melkorbsd/ru-freebsd-man/man5/radius.conf (1).5
.\" Copyright 1998 Juniper Networks, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 30, 1999
.Dt RADIUS.CONF 5
.Os
.Sh имя
.Nm радиус.конф
.Nd Файл конфигурации клиента RADIUS
.Sh краткий обзор
.Pa /etc/radius.conf
.Sh описание
.Nm
содержит информацию, необходимую для настройки клиентской 
библиотеки RADIUS.
Он анализируется с помощью
.Xr rad_config 3 .
Файл содержит одну или несколько строк текста, каждая из которых описывает отдельный сервер RADIUS, 
который будет использоваться библиотекой.
Пробелы в начале текста игнорируются, как и пустые строки, а также строки, 
содержащие
только комментарии.
.Pp
RADIUS-сервер описывается тремя-семью полями в строке:
.Pp
.Bl -item -offset indent -compact
.It
Тип услуги
.It
Хост сервера
.It
Общий секрет
.It
Перерыв
.It
Повторные попытки
.It
Мертвое время
.It
Привязать адрес
.El
.Pp
Поля разделены пробелом.
То
.Ql #
с символа в начале поля начинается комментарий, 
который продолжается до конца строки.
Поле может быть заключено в двойные кавычки, 
в этом случае оно может содержать пробел и/или начинаться с
.Ql #
символа.
Внутри заключенной в кавычки строки символ двойной кавычки может быть 
представлен следующим образом
.Ql \e\&" ,
а обратная косая черта может быть представлена следующим образом
.Ql \e\e .
o поддерживаются и другие управляющие последовательности.
.Pp
В первом поле указывается тип услуги, либо
.Ql auth
для проверки подлинности RADIUS или
.Ql acct
для учета RADIUS.
Если оба сервиса предоставляются на одном сервере, 
в файле требуются две строки.
В более ранних версиях этого файла 
тип сервиса не указывался.
Для обеспечения обратной совместимости, 
если первое поле не указано
.Ql auth
или
.Ql acct
библиотека ведет себя так, как если бы
.Ql auth
были указаны, и интерпретирует поля в строке так, 
как если бы они были полями со второго по пятый.
.Pp
Во втором поле указывается хост сервера, 
либо в виде полного доменного имени, 
либо в виде четырехзначного IP-адреса.
За хостом может дополнительно следовать
.Ql \&:
и цифровой номер порта, без пробелов.
Если спецификация порта не указана, 
по умолчанию используется
.Ql radius
или
.Ql radacct
сервис в файле 
.Pa /etc/services
для типов сервисов
.Ql auth
и
.Ql acct ,
соответственно.
Если такой записи нет, используются стандартные порты 1812 и 1813.

.Pp
Третье поле содержит общий секрет, 
который должен быть известен только хостам клиента и сервера.
Это произвольная строка символов, 
хотя она должна быть заключена в двойные кавычки, 
если содержит пробелы.
Общий секрет может быть любой длины, 
но протокол RADIUS использует только первые 128 символов.
Примечание: на некоторых популярных серверах RADIUS есть ошибки, 
которые мешают им корректно работать с секретами длиной более 16 символов.


.Pp
Четвертое поле содержит десятичное целое число, указывающее время ожидания в
секундах для получения корректного ответа от сервера.
Если это поле
опущено, то по умолчанию оно равно 3 секундам.
.Pp
Пятое поле содержит десятичное целое число, указывающее максимальное
количество попыток, которые будут предприняты для аутентификации на сервере
перед отказом.
Если это значение опущено, по умолчанию используется значение 3 попытки.
Обратите внимание,
что это общее количество попыток, а не количество повторных попыток.
.Pp
Шестое поле содержит десятичное целое число, указывающее интервал времени
в секундах, когда сервер не будет запрашиваться, если он был недоступен
при последней попытке. 0 означает "запрашивать всегда".
.Pp
Седьмое поле содержит IP-адрес хоста с несколькими доменами. Все
запросы будут привязаны к этому IP-адресу.
.Pp
Для каждого типа сервиса может быть указано до 10 RADIUS-серверов.
Серверы проверяются
циклически, пока не будет получен корректный ответ или
не будет достигнуто максимальное количество попыток для всех серверов.
.Pp
Стандартным расположением для этого файла является
.Pa /etc/radius.conf .
Но при вызове функции может быть указан альтернативный путь к
.Xr rad_config 3 .
Поскольку файл содержит конфиденциальную информацию в виде
общих секретов, он не должен быть доступен для чтения никому, кроме пользователя root.
.Sh FILES
.Bl -tag -width Pa
.It Pa /etc/radius.conf
.El
.Sh EXAMPLES
.Bd -literal
# Простая запись с использованием всех параметров по умолчанию:
согласно   radius1.domain.com  Нашему маленькому секрету

# Сервер, все еще использующий устаревший порт RADIUS, с увеличенным
# временем и максимальное количество попыток:
auth  auth.domain.com:1645  "I can't see you"  5  4

# Как указано выше, но установите время ожидания и привяжите адрес 
auth  auth.domain.com:1645  "I can't see you"  5  4  60  192.168.1.8

# Сервер, указанный по его IP-адресу:
auth  192.168.27.81  $X*#..38947ax-+=
.Ed
.Sh SEE ALSO
.Xr libradius 3
.Rs
.%A C. Rigney, et al
.%T "Remote Authentication Dial In User Service (RADIUS)"
.%O RFC 2138
.Re
.Rs
.%A C. Rigney
.%T RADIUS Accounting
.%O RFC 2139
.Re
.Sh AUTHORS
Эта документация была написана
.An John Polstra ,
и пожертвован в фонд
.Fx
проект компании Juniper Networks, Inc.
