melkorbsd/ru-freebsd-man/man5/rc.conf.5
.\" Авторское право (c) 1995
.\"   Джордан К. Хаббард
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификациями или без
.\", разрешается при соблюдении следующих условий
.\" соблюдаются:
.\" 1. Распространение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Распространение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ ``КАК ЕСТЬ`` И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЕ
.\" ОБЯЗАТЕЛЬСТВА, ИЛИ ПРАВОНАРУШЕНИЯ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИЕ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 11 Мая, 2023
.Dt RC.CONF 5
.Os
.Sh ИМЯ
.Nm rc.conf
.Nd информация о конфигурации системы
.Sh ОПИСАНИЕ
Файл
.Nm
содержит описательную информацию об имени локального хоста, сведения о конфигурации
конфигурации всех возможных сетевых интерфейсов и о том, какие службы должны быть
запущены при начальной загрузке системы.
При новых установках файл
.Nm
обычно инициализируется утилитой установки системы.
.Pp
Назначением
.Nm
не является запуск команд или выполнение действий по запуску системы
непосредственно.
Вместо этого он включает
различные общие сценарии запуска в
.Pa /etc
которые обуславливают свои
внутренние действия в соответствии с содержащимися там настройками.
.Pp
Файл
.Pa /etc/rc.conf
включается из файла
.Pa /etc/defaults/rc.conf ,
в котором указаны настройки по умолчанию для всех доступных опций.
Опции необходимо указывать только в
.Pa /etc/rc.conf	
когда системный администратор хочет отменить эти настройки по умолчанию.
Файл
.Pa /etc/defaults/vendor.conf
позволяет поставщикам переопределять
.Fx
значения по умолчанию.	
.Pa /etc/rc.conf.local
используется для переопределения настроек в
.Pa /etc/rc.conf
по историческим причинам.
.Pp
.Pp
Команда sysrc(8) предоставляет скриптовый интерфейс для изменения системных
конфигурационных файлов.
.Pp
В дополнение к
.Pa /etc/rc.conf.local
вы также можете разместить меньшие конфигурационные файлы для каждого
.Xr rc 8
в
.Pa /etc/rc.conf.d
каталог или
.Ao Ar dir Ac Ns Pa /rc.conf.d
каталогах (где
.Ao Ar dir Ac
это каждая запись, указанная в
.Va local_startup ,
но с любыми примыкающими
.Pa /rc.d
удалены),
которые будут включены в
.Va load_rc_config
функцией.
Для jail-конфигурации можно использовать файл
.Pa /etc/rc.conf.d/jail
для хранения параметров конфигурации, специфичных для jail.
Если
.Va local_startup
содержит
.Pa /usr/local/etc/rc.d
и
.Pa /opt/conf ,
.Pa /usr/local/etc/rc.conf.d/jail
и
.Pa /opt/conf/rc.conf.d/jail
будут загружены.
Если
.Ao Ar dir Ac Ns Pa /rc.conf.d/ Ns Ao Ar name Ac
является каталогом,
будут загружены все файлы из этого каталога.
Также см.
.Va rc_conf_files
переменную ниже.
.Pp
Параметры задаются с помощью
.Dq Ar name Ns Li = Ns Ar value
задания, использующее
.Xr sh 1
синтаксис.
В следующем списке приведены имена и краткое описание каждой
переменной, которая может быть задана в 
.Nm
файле:
.Bl -tag -width indent-two
.It Va rc_debug
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
разрешить вывод отладочных сообщений из rc-скриптов.
Эта переменная может быть полезна для диагностики ошибок при
редактировании или интеграции новых скриптов.
Следует иметь в виду, что это приводит к обильному выводу сообщений в терминал и
.Xr syslog 3 .
.It Va rc_info
.Pq Vt bool
Если установлено значение
.Dq Li NO ,
отключает информационные сообщения от rc-скриптов.
Информационные сообщения отображаются, когда
возникает состояние, недостаточно серьезное для предупреждения или
ошибки.
.It Va rc_startmsgs
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
показать
.Dq Starting foo:
если используется быстрый запуск (например, во время загрузки).
.It Va early_late_divider
.Pq Vt str
Имя скрипта, которое должно использоваться в качестве
разделителя между
.Dq early
и
.Dq late
этапами процесса загрузки.
Ранняя стадия должна содержать все службы, необходимые для
получения дисков (локальных или удаленных), чтобы на поздней стадии
этап может включать сценарии, содержащиеся в каталогах
перечисленных в
.Va local_startup
переменной (см. ниже).
Таким образом, двумя вероятными кандидатами на это значение являются
.Pa mountcritlocal
для типичной системы, и
.Pa mountcritremote
если системе нужны удаленные файловые
системы, чтобы получить доступ к
.Va local_startup
каталогов; например, когда
.Pa /usr/local
установлена по NFS.
Для
.Pa rc.conf
в
.Xr jail 8
.Pa NETWORKING
скорее всего, будет подходящим значением.
При изменении этого значения следует соблюдать особую осторожность,
перед изменением этого значения необходимо убедиться, что есть
подходящие меры по восстановлению после неудачной загрузки
(например, физический контакт с машиной,
или удаленный доступ к консоли).
.It Va always_force_depends
.Pq Vt bool
Различные
.Pa rc.d
сценарии используют функцию force_depend для проверки того, запущены ли уже необходимые
службы, и при необходимости запустить их.
По умолчанию во время загрузки эта проверка обходится, если
необходимая служба включена в
.Pa /etc/rc.conf[.local] .
Установка этого параметра позволит обойти эту проверку во время загрузки и
всегда проверять, запущена служба или нет.	
Включение этого параметра, вероятно, увеличит время загрузки, если
включены службы, использующие проверку force_depend.
.It Ao Ar name Ac Ns Va _chroot
.Pq Vt str
.Xr chroot 8
в этот каталог перед запуском службы.
.It Ao Ar name Ac Ns Va _cpuset
.Pq Vt str
Список процессоров, на которых будет запущена служба.
Передается в
.Xr cpuset 1
с помощью
.Fl l
флага.
.It Ao Ar name Ac Ns Va _fib
.Pq Vt int
Значение
.Xr setfib 1
для запуска службы.
.It Ao Ar name Ac Ns Va _group
.Pq Vt str
Запуск службы chrooted под этой системной группой.
В отличие от
.Ao Ar name Ac Ns Va _user
этот параметр не влияет, если служба не является chrooted.
.It Ao Ar name Ac Ns Va _limits
.Pq Vt str
Ограничения ресурсов, которые необходимо применить к службе
.Xr limits 1 .
По умолчанию ограничения ресурсов основаны на классе входа, определенном в
.Ao Ar name Ac Ns Va _login_class .
.It Ao Ar name Ac Ns Va _login_class
.Pq Vt str
Класс логина, который будет использоваться с
.Ao Ar name Ac Ns Va _limits .
По умолчанию
.Dq Li daemon .
.It Ao Ar имя Ac Ns Va _nice
.Pq Vt int
Значение
.Xr nice 1
для запуска службы.
.It Ao Ar name Ac Ns Va _oomprotect
.Pq Vt str
Используйте
.Xr protect 1
чтобы предотвратить завершение работы службы при исчерпании пространства подкачки.
Используйте
.Dq Li YES
чтобы защитить только саму службу, и
.Dq Li ALL
для защиты службы и всех ее дочерних процессов.
.Pp
Обратите внимание, что rc-сценарии, переопределяющие
.Dl ${аргумент}_cmd
.Pq см. Xr rc.subr 8
такие как PostgreSQL, не наследуют защиту OOM killer.
.Pp
Эта переменная не влияет на службы, запущенные внутри
.Xr jail 8 .
.It Ao Ar name Ac Ns Va _umask
.Pq Vt int
Запустите службу, используя 
.Xr umask 1
переменную.
.It Ao Ar name Ac Ns Va _user
.Pq Vt str
Запустите службы под этой учетной записью пользователя.
.It Va apm_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
включается поддержка автоматического управления питанием с
.Xr apm 8
командой.
.It Va apmd_enable
.Pq Vt bool
Запустите
.Xr apmd 8
для обработки событий APM из пользовательской среды.
Это также включает поддержку APM.
.It Va apmd_flags
.Pq Vt str
Если
.Va apmd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr apmd 8  
демон.
.It Va devd_enable
.Pq Vt bool
Запустите
.Xr devd 8
для обработки событий добавления, удаления или неизвестности устройства из ядра.
.It Va ddb_enable
.Pq Vt bool
Запустите
.Xr ddb 8
для установки
.Xr ddb 4
скриптов во время загрузки.
.It Va ddb_config
.Pq Vt str
Файл конфигурации для
.Xr ddb 8 .
По умолчанию
.Pa /etc/ddb.conf .
.It Va devmatch_enable
.Pq Vt bool
Если установлено значение
.Dq Li NO ,
отключите автоматическую загрузку модулей ядра с
.Xr devmatch 8 .
.It Va devmatch_blocklist
.Pq Vt str
Список модулей ядра, разделенных пробелами, который должен игнорироваться программой
.Xr devmatch 8 .
В дополнение к этому
.Xr kenv 1
.Va devmatch_blocklist
добавляется к этой переменной, чтобы отключить
.Xr devmatch 8
загруженные модулей из загрузчика.
.It Va devmatch_blacklist
.Pq Vt str
Эта переменная является устаревшей.
Используйте
.Va devmatch_blocklist
вместо нее.
Список модулей ядра, разделенных пробелами, который должен игнорироваться
.Xr devmatch 8 .
.It Va kld_list
.Pq Vt str
Список модулей ядра, разделенных пробелами, который нужно загрузить сразу после
монтирования локальных дисков, без каких-либо
.Pa .ko
расширений или путей.
Загрузка модулей на этом этапе процесса загрузки происходит
гораздо быстрее, чем при загрузке через
.Pa /boot/loader.conf
для тех модулей, которые не нужны для установки локальных дисков.
.It Va kldxref_enable
.Pq Vt bool
Установите в
.Dq Li NO
по умолчанию.
Установите значение
.Dq Li YES
чтобы автоматически перестроить
.Pa linker.hints
файлы с
.Xr kldxref 8
во время загрузки.
.It Va kldxref_clobber
.Pq Vt bool
Установите в
.Dq Li NO
по умолчанию.
Если
.Va kldxref_enable
истина,
установка на
.Dq Li YES
перезапишет существующие
.Pa linker.hints
во время загрузки.
Иначе,	
только отсутствующие
.Pa linker.hints
будут сгенерированы.
.It Va kldxref_module_path
.Pq Vt str
По умолчанию пустой.
Точка с запятой
.Pq Ql \&;
разграниченный список путей, содержащих
.Xr kld 4
модули.
Если пустой,
содержимое
.Va kern.module_path
.Xr sysctl 8
используется.
.It Va powerd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
включите функцию управления питанием системы с помощью параметра демона
.Xr powerd 8
.It Va powerd_flags
.Pq Vt str
Если
.Va powerd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr powerd 8
демон.
.It Va tmpmfs
Управляет созданием
.Pa /tmp
файловой системы памяти.
Всегда происходит, если установлено значение
.Dq Li YES
и никогда не происходит, если установлено значение
.Dq Li NO .
Если установлено любое другое значение, файловая система памяти будет создана, если
.Pa /tmp	
не является доступной для записи.
.It Va tmpsize
Определяет размер создаваемой
.Pa /tmp
файловой системы памяти.
.It Va tmpmfs_flags
Дополнительные параметры, передаваемые программе
.Xr mdmfs 8
когда память для файловой системы
.Pa /tmp
создается.
По умолчанию
.Dq Li "-S" ,	
что запрещает использование программных обновлений на
.Pa /tmp
чтобы место в файловой системе освобождалось без задержки
после усечения или удаления файлов.
См.
.Xr mdmfs 8
о других параметрах, которые можно использовать в
.Va tmpmfs_flags .
.It Va varmfs
Управляет созданием
.Pa /var
файловой системы памяти.
Всегда происходит, если установлено значение
.Dq Li YES
и никогда не происходит, если установлено значение
.Dq Li NO .
Если установлено любое другое значение, файловая система памяти будет создана, если
.Pa /var
не является доступной для записи.
.It Va varsize
Управляет размером создаваемой
.Pa /var
файловой системы памяти.
.It Va varmfs_flags
Дополнительные параметры, передаваемые в программу
.Xr mdmfs 8
когда файловая система памяти для
.Pa /var
создается.
По умолчанию
.Dq Li "-S" ,	
что запрещает использование программных обновлений на
.Pa /var
чтобы место в файловой системе освобождалось без задержки
после усечения или удаления файла.
См.
.Xr mdmfs 8
о других параметрах, которые можно использовать в
.Va varmfs_flags .
.It Va populate_var
Управляет автоматическим заполнением
.Pa /var
файловой системы.
Всегда происходит, если установлено значение
.Dq Li YES
и никогда не происходит, если установлено значение
.Dq Li NO .
Если установлено любое другое значение, файловая система памяти будет создана, если
.Pa /var
недоступна для записи.
Обратите внимание, что этот процесс требует доступа к определенным командам в
.Pa /usr
прежде чем
.Pa /usr
устанавливается на обычных системах.
.It Va cleanvar_enable
.Pq Vt bool
Очищает
.Pa /var
каталог.
.It Va var_run_enable
.Pq Vt bool
Установите значение "YES", чтобы разрешить сохранение каталога
.Pa /var/run
в файл mtree при выключении и повторной загрузки каталога
.Pa /var/run
при загрузке.
.It Va var_run_autosave
.Pq Vt bool
В некоторых случаях может быть нежелательно сохранять
.Pa /var/run
при выключении.
Если установлено значение "NO"
.Pa /var/run
загружается при перезагрузке, но не сохраняется при выключении.
Обычно в этом сценарии
.Ql service var_run save
выполняется для сохранения копии
.Pa /var/run
для однократного сохранения копии структуры каталога,
которая будет перезагружаться при всех последующих перезагрузках.
.It Va var_run_mtree
.Pq Vt str
Куда сохранить
.Pa /var/run
mtree.
По умолчанию используется следующее расположение
.Pa /var/db/mtree/BSD.var-run.mtree .
.It Va local_startup
.Pq Vt str
Список каталогов для поиска файлов сценариев запуска.
.It Va имя_скрипта_sep
.Pq Vt str
Разделитель полей, используемый для разбиения списка файлов сценариев запуска
на отдельные имена файлов.
Нет необходимости изменять это значение, если в списке нет сценариев запуска, имена которых
содержат пробелы.
.It Va hostapd_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для запуска
.Xr hostapd 8
при загрузке системы.
.It Va hostname
.Pq Vt str
Полное доменное имя (FQDN) этого хоста в сети.
Это имя почти наверняка должно быть установлено на что-то значимое, даже если
нет сетевого подключения.
Если
.Xr dhclient 8
используется для установки имени хоста через DHCP,
эта переменная должна быть установлена в пустую строку.
В пределах
.Xr jail 8
имя хоста обычно уже установлено, и эта переменная может отсутствовать.
Если после загрузки системы это значение не будет установлено
при входе в консоль будет отображаться имя хоста по умолчанию
.Dq Amnesiac .
.It Va nisdomainname
.Pq Vt str
Доменное имя NIS этого хоста, или
.Dq Li NO
если NIS не используется.
.It Va hostid_enable
.Pq Vt bool
Если установлено значение
.Dq Li NO ,
отключите генерацию или сохранение
.Pa hostid
и
.Pa machine-id
при загрузке и выключении системы.
.It Va hostid_file
.Pq Vt str
Путь к	
.Pa hostid
файлу, по умолчанию
.Pa /etc/hostid .
.It Va hostid_uuidgen_flags
.Pq Vt str
Флаги, передаваемые в
.Xr uuidgen 1
при генерации UUID программного хоста.
Это используется только если система не может определить UUID оборудования.
Установлено в
.Dq Li -r
по умолчанию.
.It Va machine_id_file
.Pq Vt str
Путь к	
.Pa machine-id
файлу, по умолчанию
.Pa /etc/machine-id .
.It Va dhclient_program
.Pq Vt str
Путь к программе клиента DHCP, по умолчанию
.Pa /sbin/dhclient .
.It Va dhclient_flags
.Pq Vt str
Дополнительные флаги для передачи программе DHCP-клиента.
См.
.Xr dhclient 8
описание доступных опций командной строки.
.It Va dhclient_flags_ Ns Aq Ar iface
Дополнительные флаги для передачи программе DHCP-клиента, запущенной только на
.Ar iface .
При указании эта переменная переопределяет
.Va dhclient_flags .
.It Va background_dhclient
.Pq Vt bool
Установите в
.Dq Li YES
чтобы запустить DHCP-клиент в фоновом режиме.
Это может вызвать проблемы с приложениями, зависящими от
работающей сети, но это обеспечит более быстрый запуск
во многих случаях.
.It Va background_dhclient_ Ns Aq Ar iface
При указании эта переменная отменяет значение
.Va background_dhclient
переменной только для
.Ar iface
интерфейса.
.It Va synchronous_dhclient
.Pq Vt bool
Установите в
.Dq Li YES
для запуска
.Xr dhclient 8
синхронно при запуске.
Это поведение можно переопределить для каждого интерфейса, заменив
параметр
.Dq Li DHCP
ключевого слова в
.Va ifconfig_ Ns Aq Ar interface
переменной на
.Dq Li SYNCDHCP
или
.Dq Li NOSYNCDHCP .
.It Va defaultroute_delay
.Pq Vt int
Если установлено положительное значение, подождите после конфигурирования
DHCP-интерфейсов при запуске, чтобы дать интерфейсам время на получение данных.
.It Va firewall_enable
.Pq Vt bool
Установите в
.Dq Li YES
для загрузки правил брандмауэра при запуске.
Если ядро не было собрано с
.Cd "options IPFIREWALL" ,
на	
.Pa ipfw.ko
будет загружен модуль ядра.
См. также
.Va ipfilter_enable .
.It Va firewall_script
.Pq Vt str
Эта переменная указывает полный путь к запускаемому сценарию брандмауэра.
По умолчанию
.Pa /etc/rc.firewall .
.It Va firewall_type
.Pq Vt str
Указывает тип брандмауэра из списка в
.Pa /etc/rc.firewall ,
или файла, содержащего локальный набор правил брандмауэра
Допустимыми вариантами выбора из
.Pa /etc/rc.firewall
являются:
.Pp
.Bl -tag -width ".Li workstation" -compact
.It Li open
неограниченный IP-доступ
.It Li client
все IP-службы отключены, кроме как через
.Dq Li lo0
.It Li client
базовая защита рабочей станции
.It Li workstation
базовая защита рабочей станции с помощью межсетевого брандмауэра
.It Li simple
базовая защита для локальной сети.
.El
.Pp
Если указано имя файла, необходимо указать полный путь
.Pp
Большинство предопределенных наборов правил определяют дополнительные переменные конфигурации.
Они документированы в
.Pa /etc/rc.firewall .
.It Va firewall_quiet
.Pq Vt bool
Установите в
.Dq Li YES
чтобы отключить отображение правил брандмауэра на консоли во время загрузки.
.It Va firewall_logging
.Pq Vt bool
Установите значение
.Dq Li YES
чтобы включить регистрацию событий брандмауэра.
Это эквивалентно параметру
.Dv IPFIREWALL_VERBOSE
опции ядра.
.It Va firewall_logif
.Pq Vt bool
Установите на
.Dq Li YES
для создания псевдоинтерфейса
.Li ipfw0
для записи.
Для получения более подробной информации см.
.Xr ipfw 8
страницу руководства.
.It Va firewall_flags
.Pq Vt str
Флаги, передаваемые в
.Xr ipfw 8
если
.Va firewall_type
указывает имя файла.
.It Va firewall_coscripts
.Pq Vt str
Список исполняемых файлов и/или rc-скриптов для запуска после запуска/остановки брандмауэра.
По умолчанию пустой.
.\" ----- настройка firewall_nat_enable --------------------------------
.It Va firewall_nat_enable
.Pq Vt bool
эквивалент
.Va natd_enable .
Установка этого значения на
.Dq Li YES
автоматически загрузит
.Xr ipfw 8
модуль ядра NAT, если
.Va firewall_enable
также установлено значение
.Dq Li YES .
.It Va firewall_nat_interface
.Pq Vt str
.Xr ipfw 8
equivalent of
.Va natd_interface .
Это имя публичного интерфейса или IP-адреса, на котором
ядро NAT должно работать.
.It Va firewall_nat_flags
.Pq Vt str
Здесь должны быть размещены дополнительные параметры конфигурации для ядра NAT.
.It Va firewall_nat64_enable
.Pq Vt bool
Установка этого значения в
.Dq Li YES
автоматически загрузит
.Xr ipfw 8
модуль ядра NAT64, если
.Va firewall_enable
также установлен в
.Dq Li YES .
.It Va firewall_nptv6_enable
.Pq Vt bool
Установка этого значения в
.Dq Li YES
автоматически загрузит
.Xr ipfw 8
модуль ядра NPTv6, если
.Va firewall_enable
также установлено значение
.Dq Li YES .
.It Va firewall_pmod_enable
.Pq Vt bool
Установка этого значения в
.Dq Li YES
автоматически загрузит
.Xr ipfw 8
pmod модуль ядра, если
.Va firewall_enable
также установлен в
.Dq Li YES .
.It Va dummynet_enable
.Pq Vt bool
Установка этого значения в
.Dq Li YES
автоматически загрузит
.Xr dummynet 4
модуль, если
.Va firewall_enable
также установлен в
.Dq Li YES .
.\" -------------------------------------------------------------------
.It Va ipfw_netflow_enable
.Pq Vt bool
Установка этого значения в
.Dq Li YES
включит протоколирование netflow через
.Xr ng_netflow 4 .
.Pp
По умолчанию вводится правило ipfw, все пакеты дублируются с помощью команды
ngtee, а пакеты netflow отправляются на 127.0.0.1 на порт netflow
порт, используя протокол версии 5.
.It Va ipfw_netflow_hook
.Pq Vt int
имя крючка netflow должно быть числовым
(по умолчанию
.Pa 9995 ) .
.It Va ipfw_netflow_rule
.Pq Vt int
номер правила ipfw
(по умолчанию
.Pa 1000 ) .
.It Va ipfw_netflow_ip
.Pq Vt str
IP-адрес сервера назначения для получения данных netflow
(по умолчанию
.Pa 127.0.0.1 ) .
.It Va ipfw_netflow_port
.Pq Vt int
Порт сервера назначения для получения данных netflow
(по умолчанию
.Pa 9995 ) .
.It Va ipfw_netflow_version
.Pq Vt int
Не задавайте для использования версии 5 протокола netflow, задайте значение 9 для использования
версии 9.
.It Va ipfw_netflow_fib
.Pq Vt int
Совпадение только с пакетами в FIB
.Pa ipfw_netflow_fib
(по умолчанию неопределено, означает все FIB).
.It Va natd_program
.Pq Vt str
Путь к
.Xr natd 8 .
.It Va natd_enable
.Pq Vt bool
Установите в
.Dq Li YES
чтобы разрешить
.Xr natd 8 .
.Va firewall_enable
также должен быть установлен на
.Dq Li YES ,
и
.Xr divert 4
сокеты должны быть включены в ядре.
Если ядро не было собрано с
.Cd "options IPDIVERT" ,
то
.Pa ipdivert.ko
будет загружен модуль ядра.
.It Va natd_interface
.Pq Vt str
Это имя общедоступного интерфейса, на котором
.Xr natd 8
должен быть запущен.
Интерфейс может быть указан как имя интерфейса или как IP-адрес.
.It Va natd_flags
.Pq Vt str
Дополнительные
.Xr natd 8
флаги должны быть размещены здесь.
Адрес
.Fl n
или
.Fl a
автоматически добавляется с вышеуказанным флагом
.Va natd_interface
в качестве аргумента.
.\" ----- настройка ipfilter_enable  --------------------------------
.It Va ipfilter_enable
.Pq Vt bool
Установлено на
.Dq Li NO
по умолчанию.
Установка этого значения на
.Dq Li YES
включает
.Xr ipf 8
фильтрацию пакетов.
.Pp
При типичном использовании необходимо поставить
.Bd -literal
ipfilter_enable="YES"
ipnat_enable="YES"
ipmon_enable="YES"
ipfs_enable="YES"
.Ed
.Pp
в
.Pa /etc/rc.conf
и редактирование
.Pa /etc/ipf.rules
и
.Pa /etc/ipnat.rules
соответствующим образом.
.Pp
Обратите внимание, что
.Va ipfilter_enable
и
.Va ipnat_enable
могут быть включены независимо друг от друга.
.Va ipmon_enable
и
.Va ipfs_enable
требуют наличия хотя бы одной из опций
.Va ipfilter_enable
и
.Va ipnat_enable
быть включенным.
.Pp
Наличие
.Bd -literal
options IPFILTER
options IPFILTER_LOG
options IPFILTER_DEFAULT_BLOCK
.Ed
.Pp
в конфигурационном файле ядра - тоже хорошая идея.
.\" ----- настройка ipfilter_program ------------------------------
.It Va ipfilter_program
.Pq Vt str
Путь к
.Xr ipf 8
(по умолчанию
.Pa /sbin/ipf ) .
.\" ----- настройка ipfilter_rules --------------------------------
.It Va ipfilter_rules
.Pq Vt str
Установите в
.Pa /etc/ipf.rules
по умолчанию.
Эта переменная содержит имя файла определения правил фильтрации.
Ожидается, что этот файл будет доступен для чтения в программе
.Xr ipf 8
для выполнения команды.
.\" ----- ipfilter_flags setting --------------------------------
.It Va ipfilter_flags
.Pq Vt str
По умолчанию пустая.
Эта переменная содержит флаги, передаваемые в
.Xr ipf 8
программе.
.\" ----- настройка ipnat_enable ----------------------------------
.It Va ipnat_enable
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установите значение
.Dq Li YES
чтобы включить
.Xr ipnat 8
трансляцию сетевых адресов.
См.
.Va ipfilter_enable
для подробного описания.
.\" ----- настройка ipnat_program ---------------------------------
.It Va ipnat_program
.Pq Vt str
.Pq Vt str
Путь к
.Xr ipnat 8
(по умолчанию
.Pa /sbin/ipnat ) .
.\" ----- настройка ipnat_rules -----------------------------------
.It Va ipnat_rules
.Pq Vt str
Установлена в
.Pa /etc/ipnat.rules
по умолчанию.
Эта переменная содержит имя файла
содержащего определение трансляции сетевых адресов.
Ожидается, что этот файл будет доступен для чтения для
.Xr ipnat 8
для выполнения команды.
.\" ----- установка ipnat_flags -----------------------------------
.It Va ipnat_flags
.Pq Vt str
По умолчанию пустая.
Эта переменная содержит флаги, передаваемые программе
.Xr ipnat 8 .
.\" ----- установка ipmon_enable ----------------------------------
.It Va ipmon_enable
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установите значение
.Dq Li YES
чтобы включить
.Xr ipmon 8
мониторинг (ведение журнала
.Xr ipf 8
и
.Xr ipnat 8
событий).
Установка этой переменной требует установки
.Va ipfilter_enable
или
.Va ipnat_enable
тоже.
См.
.Va ipfilter_enable
для подробного описания.
.\" ----- установка ipmon_program ---------------------------------
.It Va ipmon_program
.Pq Vt str
Путь к
.Xr ipmon 8
(по умолчанию
.Pa /sbin/ipmon ) .
.\" ----- настройка ipmon_flags -----------------------------------
.It Va ipmon_flags
.Pq Vt str
Установлена на
.Dq Li -Ds
по умолчанию.
Эта переменная содержит флаги, передаваемые в программу
.Xr ipmon 8 .
Другим типичным примером может быть
.Dq Fl D Pa /var/log/ipflog
чтобы
.Xr ipmon 8
записывать журнал непосредственно в файл, минуя
.Xr syslogd 8 .
Обязательно настройте
.Pa /etc/newsyslog.conf
в этом случае следующим образом:
.Bd -literal
/var/log/ipflog  640  10  100  *  Z  /var/run/ipmon.pid
.Ed
.\" ----- настройка ipfs_enable -----------------------------------
.It Va ipfs_enable
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установите значение
.Dq Li YES	
чтобы включить
.Xr ipfs 8
сохранение таблиц состояния фильтров и NAT во время выключения
и повторно загружать их при запуске.
Установка этой переменной требует установки
.Va ipfilter_enable
или
.Va ipnat_enable
на
.Dq Li YES
тоже.
См.
.Va ipfilter_enable
для подробного описания.
Обратите внимание, что если
.Va kern_securelevel
установлено значение 3,
.Va ipfs_enable
не может быть использован
поскольку повышенный уровень безопасности не позволит
.Xr ipfs 8
сохранить таблицы состояний во время выключения.
.\" ----- установка ipfs_program ----------------------------------
.It Va ipfs_program
.Pq Vt str
Путь к
.Xr ipfs 8
(по умолчанию
.Pa /sbin/ipfs ) .
.\" ----- настройка ipfs_flags ------------------------------------
.It Va ipfs_flags
.Pq Vt str
По умолчанию пустая.
Эта переменная содержит флаги, передаваемые
.Xr ipfs 8
программе.
.\" ----- конец добавленного ipf-хука ---------------------------------
.It Va pf_enable
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установка этого значения на
.Dq Li YES
включает
.Xr pf 4
фильтрацию пакетов.
.Pp
При типичном использовании необходимо установить
.Pp
.Dl pf_enable="YES"
.Pp
в
.Pa /etc/rc.conf
и отредактировать
.Pa /etc/pf.conf
надлежащим образом.
Добавление
.Pp
.Dl "устройство pf"
.Pp
обеспечивает поддержку
.Xr pf 4
в ядро, иначе будет загружен
будет загружен модуль ядра.
.It Va pf_rules
.Pq Vt str
Путь к	
.Xr pf 4
файл конфигурации набора правил
(по умолчанию
.Pa /etc/pf.conf ) .
.It Va pf_program
.Pq Vt str
Путь к
.Xr pfctl 8
(по умолчанию
.Pa /sbin/pfctl ) .
.It Va pf_flags
.Pq Vt str
Если
.Va pf_enable
установлен в
.Dq Li YES ,
эти флаги передаются в программу
.Xr pfctl 8
при загрузке набора правил.
.It Va pf_fallback_rules_enable
.Pq Vt bool
Установлена в
.Dq Li NO
по умолчанию.
Установка этого значения на
.Dq Li YES
разрешает загрузку
.Va pf_fallback_rules_file
или
.Va pf_fallback_rules
в случае возникновения проблем при загрузке набора правил в
.Va pf_rules .
.It Va pf_fallback_rules_file
.Pq Vt str
Путь к набору правил pf для загрузки в случае сбоя при загрузке набора правил
набора правил в
.Va pf_rules
(по умолчанию
.Pa /etc/pf-fallback.conf ) .
.It Va pf_fallback_rules
.Pq Vt str
Набор правил pf для загрузки в случае сбоя при загрузке набора правил в
.Va pf_rules
и
.Va pf_fallback_rules_file
не найден.
Несколько правил могут быть заданы следующим образом:
.Bd -literal
pf_fallback_rules="\\
	block drop log all\\
	pass in quick on em0"
.Pp
.Ed
По умолчанию используется следующее правило
.Dq block drop log all
.It Va pflog_enable
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установка этого значения на
.Dq Li YES
включает
.Xr pflogd 8
который регистрирует пакеты из
.Xr pf 4
пакетного фильтра.
.It Va pflog_logfile
.Pq Vt str
Если
.Va pflog_enable
установлено значение
.Dq Li YES
это контролирует, где
.Xr pflogd 8
хранит файл журнала
(по умолчанию
.Pa /var/log/pflog ) .
Посмотрите
.Pa /etc/newsyslog.conf
чтобы настроить ротацию лог-файла.
.It Va pflog_program
.Pq Vt str
Путь к
.Xr pflogd 8
(по умолчанию
.Pa /sbin/pflogd ) .
.It Va pflog_flags
.Pq Vt str
По умолчанию пустая.
Эта переменная содержит дополнительные флаги, передаваемые программе
.Xr pflogd 8 .
.It Va pflog_instances
.Pq Vt str
Если вы регистрируетесь более чем в одном
.Xr pflog 4
необходимо вести логи на нескольких интерфейсах,
.Va pflog_instances
устанавливается в список
.Xr pflogd 8
которые должны запускаться при загрузке системы.
Если
.Va pflog_instances
установлен, то для каждого разделенного пробелами
.Ar element
в списке,
.Ao Ar элемент Ac Ns Va _dev
и
.Ao Ar элемент Ac Ns Va _logfile
предполагаются существующими.
.Ao Ar element Ac Ns Va _dev
должен содержать
.Xr pflog 4
интерфейс, за которым будет следить именованный
.Xr pflogd 8
объект.
.It Va ftpproxy_enable
.Pq Vt bool
Установлено значение
.Dq Li NO
по умолчанию.
Установка этого значения на
.Dq Li YES
включает
.Xr ftp-proxy 8
который поддерживает
.Xr pf 4
фильтр пакетов при переводе ftp-соединений.
.It Va ftpproxy_flags
.Pq Vt str
По умолчанию пустая.
Эта переменная содержит дополнительные флаги, передаваемые программе
.Xr ftp-proxy 8 .
.It Va ftpproxy_instances
.Pq Vt str
По умолчанию пустая.
Если несколько объектов
.Xr ftp-proxy 8
требуется во время загрузки,
.Va ftpproxy_instances
должен содержать список имен экземпляров, разделенных пробелами.
Для каждого
.Ar element
в списке, переменная с именем
.Ao Ar element Ac Ns Va _flags
должна быть определена переменная, содержащая флаги командной строки, которые будут переданы 
.Xr ftp-proxy 8
объекту.
.It Va pfsync_enable
.Pq Vt bool
Установлена в
.Dq Li NO
по умолчанию.
Установка этого значения на
.Dq Li YES
позволяет экспонировать
.Xr pf 4
изменения состояния другим узлам по сети с помощью
.Xr pfsync 4 .
.Va pfsync_syncdev
переменная
также должна быть установлена.
.It Va pfsync_syncdev
.Pq Vt str
По умолчанию пустая.
Эта переменная задает имя сетевого интерфейса
.Xr pfsync 4
через который он должен работать.
Она должна быть установлена соответствующим образом, если
.Va pfsync_enable
установлено значение
.Dq Li YES .
.It Va pfsync_syncpeer
.Pq Vt str
По умолчанию пустая.
Эта переменная является необязательной.
По умолчанию сообщения об изменении состояния рассылаются на интерфейс синхронизации
с помощью многоадресных пакетов IP.
Протокол - IP-протокол 240, PFSYNC, а используемая группа многоадресной рассылки -
224.0.0.240.
Если адрес пира указан с помощью параметра
.Va pfsync_syncpeer
этот адрес используется в качестве адреса назначения для трафика pfsync
и трафик может быть защищен с помощью опции
.Xr ipsec 4 .
См.
.Xr pfsync 4
дополнительную информацию об использовании
.Xr ipsec 4
с
.Xr pfsync 4
интерфейсами.
.It Va pfsync_ifconfig
.Pq Vt str
По умолчанию пустая.
Эта переменная может содержать дополнительные опции, которые будут переданы программе
.Xr ifconfig 8
команде, используемой для настройки
.Xr pfsync 4 .
.It Va tcp_extensions
.Pq Vt bool
Установлена на
.Dq Li YES
по умолчанию.
Установлена на
.Dq Li YES
по умолчанию.
Установка этого значения на
.Dq Li NO
отключает некоторые опции TCP, как описано в
.Rs
.%T "RFC 1323"
.Re
Установка этого значения на
.Dq Li NO
может помочь устранить такие проблемы с соединениями, как случайное зависание
или другое странное поведение.
Известно, что некоторые сетевые устройства
не работают с этими параметрами.
.It Va log_in_vain
.Pq Vt int
По умолчанию имеет значение 0.
.Xr sysctl 8
переменные,
.Va net.inet.tcp.log_in_vain
и
.Va net.inet.udp.log_in_vain ,
как описано в
.Xr tcp 4
и
.Xr udp 4 ,
устанавливаются в заданное значение.
.It Va tcp_keepalive
.Pq Vt bool
Устанавливается в
.Dq Li YES
по умолчанию.
Установка в
.Dq Li NO
отключит проверку простаивающих TCP-соединений, чтобы убедиться, что
что пир все еще работает и доступен.
.It Va tcp_drop_synfin
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установка значения
.Dq Li YES
приведет к тому, что ядро будет игнорировать TCP-кадры, в которых установлены оба флага
установлены флаги SYN и FIN.
Это предотвращает фингерпринт ОС, но может
нарушить работу некоторых легитимных приложений.
.It Va icmp_drop_redirect
.Pq Vt bool
Устанавливается в
.Dq Li AUTO
по умолчанию.
Эта настройка будет идентична
.Dq Li YES ,
если включен демон динамической маршрутизации, поскольку обработка перенаправлений может
вызывать проблемы с производительностью для больших таблиц маршрутизации.
Если такая служба не включена, этот параметр ведет себя как
.Dq Li NO .
Установка значения
.Dq Li YES
приведет к тому, что ядро будет игнорировать пакеты ICMP REDIRECT.
Установка значения
.Dq Li NO
приведет к тому, что ядро будет обрабатывать пакеты ICMP REDIRECT.
См.
.Xr icmp 4
для получения дополнительной информации.
.It Va icmp_log_redirect
.Pq Vt bool
Установлена на
.Dq Li NO
по умолчанию.
Установка значения на	
.Dq Li YES
приведет к тому, что ядро будет регистрировать пакеты ICMP REDIRECT.
Обратите внимание, что
сообщения журнала не ограничены по скорости, поэтому эту опцию следует использовать только
для поиска и устранения неисправностей в сетях.
См.
.Xr icmp 4
для получения дополнительной информации.
.It Va icmp_bmcastecho
.Pq Vt bool
Установите на
.Dq Li YES
для ответа на широковещательные или многоадресные пакеты ICMP ping.
См.	
.Xr icmp 4
для получения дополнительной информации.
.It Va ip_portrange_first
.Pq Vt int
Если не установлено значение
.Dq Li NO ,
это первый порт в диапазоне портов по умолчанию.
См.	
.Xr ip 4
для получения дополнительной информации.
.It Va ip_portrange_last
.Pq Vt int
Если не установлено значение	
.Dq Li NO ,
это последний порт в диапазоне портов по умолчанию.
См.
.Xr ip 4
для получения дополнительной информации.
.It Va network_interfaces
.Pq Vt str
Устанавливается в список сетевых интерфейсов для настройки на этом хосте или
.Dq Li AUTO
(по умолчанию) для всех текущих интерфейсов.
Установка
.Va network_interfaces
в любое значение, отличное от значения по умолчанию, будет являться устаревшим.
Интерфейсы, для которых администратор хочет сохранить конфигурацию,
но не запускать при загрузке, должны быть настроены с помощью переменной
.Dq Li NOAUTO
в ключевом слове
.Va ifconfig_ Ns Aq Ar interface
как описано ниже.
.Pp
Переменная
.Va ifconfig_ Ns Aq Ar interface
также предполагается для каждого значения переменной
.Ar interface .
Если имя интерфейса содержит любой из символов
.Dq Li .-/+
они переводятся в
.Dq Li _
перед поиском.
Переменная может содержать аргументы для
.Xr ifconfig 8 ,
а также специальные ключевые слова, нечувствительные к регистру, описанные ниже.
Такие ключевые слова удаляются перед передачей значения в
.Xr ifconfig 8
при этом порядок остальных аргументов сохраняется.
.Pp
Можно добавить записи IP-псевдонимов, используя
.Xr ifconfig 8
синтаксис с ключевым словом семейства адресов, например
.Li inet .
Предположим, что рассматриваемый интерфейс был
.Li em0 ,
это может выглядеть примерно так:
.Bd -literal
ifconfig_em0_alias0="inet 127.0.0.253 netmask 0xffffffff"
ifconfig_em0_alias1="inet 127.0.0.254 netmask 0xffffffff"
.Ed
.Pp
Также можно настроить несколько IP-адресов в бесклассовой маршрутизации
Междоменной маршрутизации
.Pq CIDR
нотация адресов,
в которой каждый компонент адреса может быть диапазоном, например
.Li inet 192.0.2.5-23/24
или
.Li inet6 2001:db8:1-f::1/64 .
Эта нотация допускает только адрес и часть длины префикса,
но не другие модификаторы адреса.
Обратите внимание, что максимальное количество сгенерированных адресов из диапазона
ограничено целым числом, указанным в
.Va netif_ipexpand_max
в
.Nm
поскольку небольшая опечатка может неожиданно сгенерировать большое количество адресов.
По умолчанию используется значение
.Li 2048 .	
Его можно увеличить, добавив следующую строку в
.Nm :
.Bd -literal
netif_ipexpand_max="4096"
.Ed
.Pp
В случае
.Li 192.0.2.5-23/24 ,
адрес 192.0.2.5 будет сконфигурирован с
маской /24, а адреса с 192.0.2.6 по 192.0.2.23 с
неконфликтной сетевой маской /32, как объясняется в
.Xr ifconfig 8
псевдонима.
Обратите внимание, что эта специальная обработка сетевых масок применяется только для
.Li inet ,
а не для других семейств адресов, таких как
.Li inet6 .
.Pp
Поскольку рассматриваемый интерфейс
.Li em0 ,
пример может выглядеть следующим образом:
.Bd -literal
ifconfig_em0_alias2="inet 192.0.2.129/27"
ifconfig_em0_alias3="inet 192.0.2.1-5/28"
.Ed
.Pp
и так далее.
.Pp
Обратите внимание, что устаревшие
.Va ipv4_addrs_ Ns Aq Ar interface
поддерживалась для обозначения адресов IPv4 CIDR.
Переменная
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
заменяет эту переменную, хотя
.Va ipv4_addrs_ Ns Aq Ar interface
по-прежнему поддерживается для обратной совместимости.
.Pp
Для каждого
.Va ifconfig_ Ns Ao Ar интерфейса Ac Ns Va _alias Ns Aq Ar n
запись с ключевым словом семейства адресов,
его содержимое передается в
.Xr ifconfig 8 .
Выполнение останавливается при первом неудачном обращении, поэтому если
присутствует что-то вроде этого:
.Bd -literal
ifconfig_em0_alias0="inet 127.0.0.251 netmask 0xffffffff"
ifconfig_em0_alias1="inet 127.0.0.252 netmask 0xffffffff"
ifconfig_em0_alias2="inet 127.0.0.253 netmask 0xffffffff"
ifconfig_em0_alias4="inet 127.0.0.254 netmask 0xffffffff"
.Ed
.Pp
Затем обратите внимание, что alias4 
.Em не будет
добавлен, поскольку поиск
остановится на отсутствующем
.Dq Li alias3
записи.
Из-за такого трудноуправляемого поведения
существует
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _aliases
переменная, которая обладает той же функциональностью, что и
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
и может содержать все записи в переменной, как показано ниже:
.Bd -literal
ifconfig_em0_aliases="\\
	inet 127.0.0.251 netmask 0xffffffff \\
	inet 127.0.0.252 netmask 0xffffffff \\
	inet 127.0.0.253 netmask 0xffffffff \\
	inet 127.0.0.254 netmask 0xffffffff"
.Ed
.Pp
Также поддерживает нотацию CIDR.
.Pp
Если
.Pa /etc/start_if . Ns Aq Ar interface
присутствует, он считывается и выполняется программой
.Xr sh 1
интерпретатором
перед конфигурированием интерфейса, как указано в файле
.Va ifconfig_ Ns Aq Ar interface
и
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
переменные.
.Pp
Если переменная
.Va vlans_ Ns Aq Ar interface
установлена,
a
.Xr vlan 4
интерфейс будет создан для каждого элемента списка с параметром
.Ar vlandev
аргумент установлен на
.Ar interface .
Если имя vlan-интерфейса - это число,
то этот номер используется в качестве метки vlan, а новый интерфейс vlan называется
называется
.Ar interface . Ns Ar tag .
В противном случае,
метка vlan должна быть указана через
.Va vlan
в параметре
.Va create_args_ Ns Aq Ar interface
переменной.
.Pp
Чтобы создать устройство vlan с именем
.Li em0.101
на
.Li em0
с меткой vlan 101 и дополнительным IPv4-адресом 192.0.2.1/24:
.Bd -literal
vlans_em0="101"
ifconfig_em0_101="inet 192.0.2.1/24"
.Ed
.Pp
Чтобы создать устройство vlan с именем
.Li myvlan
на
.Li em0
с меткой vlan 102:
.Bd -literal
vlans_em0="myvlan"
create_args_myvlan="vlan 102"
.Ed
.Pp
Если переменная
.Va wlans_ Ns Aq Ar interface
установлена,
интерфейс
.Xr wlan 4
для каждого элемента списка будет создан интерфейс с параметром
.Ar wlandev
аргумент установлен в значение
.Ar interface .
Дополнительные аргументы клонирования wlan могут быть переданы в команду
.Xr ifconfig 8
.Cm create
установив параметр
.Va create_args_ Ns Aq Ar interface
переменную.
Одно или несколько
.Xr wlan 4
устройств должно быть создано для каждого беспроводного устройства по состоянию на
.Fx 8.0 .
Флаги отладки для
.Xr wlan 4
устройств, установленные
.Xr wlandebug 8
могут быть указаны с помощью
.Va wlandebug_ Ns Aq Ar interface
переменной.
Содержимое этой переменной будет передано непосредственно в
.Xr wlandebug 8 .
.Pp
Если в переменной
.Va ifconfig_ Ns Aq Ar interface
содержится ключевое слово
.Dq Li NOAUTO
то интерфейс не будет сконфигурирован
при загрузке или с помощью
.Pa /etc/pccard_ether
когда
.Va network_interfaces
установлен в
.Dq Li AUTO .
.Pp
Можно поднять интерфейс с DHCP, добавив
.Dq Li DHCP
к переменной
.Va ifconfig_ Ns Aq Ar interface .
Например, чтобы инициализировать
.Li em0
устройство  по протоколу DHCP,
можно использовать что-то вроде:
.Bd -literal
ifconfig_em0="DHCP"
.Ed
.Pp
Если вы хотите настроить беспроводной интерфейс с помощью
.Xr wpa_supplicant 8
для использования с WPA, EAP/LEAP или WEP, вам необходимо добавить
.Dq Li WPA
к
.Va ifconfig_ Ns Aq Ar interface
переменной.
.Pp
С другой стороны, если вы хотите настроить свой беспроводной интерфейс с помощью
.Xr hostapd 8 ,
вам нужно добавить
.Dq Li HOSTAP
к
.Va ifconfig_ Ns Aq Ar interface
переменной.
.Xr hostapd 8
будет использовать настройки из
.Pa /etc/hostapd- Ns Ao Ar interface Ac Ns .conf
.Pp
Наконец, вы можете добавить
.Xr ifconfig 8
в эту переменную, в дополнение к параметрам
.Pa /etc/start_if . Ns Aq Ar interface
файла.
Например, чтобы сконфигурировать
.Xr ath 4
беспроводное устройство в режиме станции с адресом, полученным
через DHCP, используя аутентификацию WPA и режим 802.11b, можно
можно использовать что-то вроде:
.Bd -literal
wlans_ath0="wlan0"
ifconfig_wlan0="DHCP WPA mode 11b"
.Ed
.Pp
В дополнение к
.Va ifconfig_ Ns Aq Ar interface
может быть сконфигурирована
переменная резервного копирования
.Va ifconfig_DEFAULT .
Она будет использоваться для всех интерфейсов, не имеющих
.Va ifconfig_ Ns Aq Ar interface
переменной.
.Pp
Также можно переименовать интерфейс, выполнив команду:
.Bd -literal
ifconfig_em0_name="net0"
ifconfig_net0="inet 192.0.2.1 netmask 0xffffff00"
.Ed
.It Va ipv6_enable
.Pq Vt bool
Эта переменная является устаревшей.
Используйте
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
и
.Va ipv6_activate_all_interfaces
если это необходимо.
.Pp
Если переменная имеет значение
.Dq Li YES ,
.Dq Li inet6 accept_rtadv
добавляется ко всем
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
и
.Va ipv6_activate_all_interfaces
определяется как
.Dq Li YES .
.It Va ipv6_prefer
.Pq Vt bool
Эта переменная является устаревшей.
Используйте
.Va ip6addrctl_policy
вместо нее.
.Pp
Если переменная имеет значение
.Dq Li YES ,
таблица выбора адресов по умолчанию, установленная
.Xr ip6addrctl 8
будет предпочтительным для IPv6.
.Pp
Если переменная имеет значение
.Dq Li NO ,
таблица выбора адресов по умолчанию, установленная
.Xr ip6addrctl 8
будет предпочтительным IPv4.
.It Va ipv6_activate_all_interfaces
.Pq Vt bool
Управляет начальной конфигурацией на IPv6-совместимых
интерфейсов, не имеющих соответствующей конфигурации
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
переменной.
Обратите внимание, что не всегда необходимо устанавливать эту переменную в значение
.Dq YES
для использования функциональности IPv6 на
.Fx .
В большинстве случаев достаточно настроить переменную
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6 .
.Pp
Если переменная
.Dq Li NO ,
все интерфейсы, не имеющие соответствующей переменной
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
переменная будет помечена как
.Dq Li IFDISABLED
при создании.
Это означает, что все функции IPv6 на этом интерфейсе
полностью отключена для обеспечения соблюдения политики безопасности.
Если для переменной установлено значение
.Dq YES ,
флаг будет снят на всех интерфейсах.
.Pp
В большинстве случаев достаточно определить
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
для интерфейса с поддержкой IPv6 будет достаточно.
Однако если интерфейс добавляется динамически
.Pq некоторыми туннельными протоколами, такими как PPP, например,
часто бывает трудно определить переменную заранее.
В этом случае необходимо настроить
.Dq Li IFDISABLED ,
можно отключить, установив для этой переменной значение
.Dq YES .
.Pp
Для получения более подробной информации о
.Dq Li IFDISABLED
флагах и ключевых словах
.Dq Li inet6 ifdisabled ,
см.
.Xr ifconfig 8 .
.Pp
По умолчанию
.Dq Li NO .
.It Va ipv6_privacy
.Pq Vt bool
Если переменная имеет значение
.Dq Li YES
адреса конфиденциальности будут генерироваться для каждого интерфейса IPv6,
как описано в RFC 4941.
.It Va ipv6_network_interfaces
.Pq Vt str
This is the IPv6 equivalent of
.Va network_interfaces .
Обычно ручная настройка этой переменной не требуется.
.It Va ipv6_cpe_wanif
.Pq Vt str
Если переменная имеет значение имени интерфейса,
.Xr ifconfig 8
опции
.Dq inet6 -no_radr accept_rtadv
будут автоматически добавлены к указанному интерфейсу перед оценкой
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6 ,
и две
.Xr sysctl 8
переменные
.Va net.inet6.ip6.rfc6204w3
и
.Va net.inet6.ip6.no_radr
будут установлены на 1.
.Pp
Это означает, что указанный интерфейс будет принимать Router Advertisement ICMPv6  
сообщения на этом канале и добавлять обнаруженные
маршрутизаторы в список маршрутизаторов по умолчанию.
Другие интерфейсы могут принимать RA-сообщения, если указана опция
.Dq inet6 accept_rtadv ,
добавление маршрутов в список маршрутизаторов по умолчанию будет отключено
.Dq inet6 no_radr
по умолчанию.
См.
.Xr ifconfig 8
для более подробной информации.
.Pp
Обратите внимание, что сообщения ICMPv6 Router Advertisement будут приниматься даже в том случае, если
.Va net.inet6.ip6.forwarding
равен 1
.Pq пересылка пакетов включена
когда в
.Va net.inet6.ip6.rfc6204w3
установлено значение 1.
.Pp
По умолчанию
.Dq Li NO .
.It Va ifconfig_ Ns Ao Ar interface Ac Ns _descr
.Pq Vt str
Назначает интерфейсу произвольное описание.
Переменная
.Xr sysctl 8
.Va net.ifdescr_maxlen
ограничивает его длину.
Эта статическая настройка может быть отменена командами
запущенными с помощью утилит динамической настройки интерфейса
, например:
.Xr dhclient 8
крючки.
Описание можно посмотреть с помощью команды
.Xr ifconfig 8
и его можно экспортировать с помощью 
.Xr bsnmpd 1
демона, используя его модуль MIB-2.
.It Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
.Pq Vt str
Функциональность IPv6 на интерфейсе должна быть настроена с помощью
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6 ,
вместо установки параметров ifconfig в
.Va ifconfig_ Ns Aq Ar interface .
Если эта переменная пуста, все конфигурации IPv6 на указанном интерфейсе
другими переменными, такими как
.Va ipv6_prefix_ Ns Ao Ar interface Ac
будут проигнорированы.
.Pp
Псевдонимы должны быть установлены с помощью
.Va ifconfig_ Ns Ao Ar interface Ac Ns Va _alias Ns Aq Ar n
с помощью ключевого слова 
.Dq Li inet6 .
Например:
.Bd -literal
ifconfig_em0_ipv6="inet6 2001:db8:1::1 prefixlen 64"
ifconfig_em0_alias0="inet6 2001:db8:2::1 prefixlen 64"
.Ed
.Pp
Интерфейсы, которые имеют
.Dq Li inet6 accept_rtadv
ключевое слово в
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
будут автоматически настроены SLAAC
.Pq StateLess Address AutoConfiguration
описано в
.Rs
.%T "RFC 4862"
.Re
.Pp
Обратите внимание, что адрес link-local будет автоматически сконфигурирован в
в дополнение к настроенным адресам глобального масштаба, поскольку спецификации IPv6
поскольку спецификации IPv6 требуют его наличия на каждом канале.
Адрес вычисляется из MAC-адреса с помощью алгоритма
определенного в
.Rs
.%T "RFC 4862"
.%O "Section 5.3"
.Re
.Pp
Если на интерфейсе требуется только локальный адрес соединения,
можно использовать следующую конфигурацию:
.Bd -literal
ifconfig_em0_ipv6="inet6 auto_linklocal"
.Ed
.Pp
Локальный адрес соединения также можно настроить вручную.
Это полезно для адреса маршрутизатора по умолчанию IPv6-маршрутизатора
чтобы он не менялся при замене карты сетевого интерфейса.
Например:
.Bd -literal
ifconfig_em0_ipv6="inet6 fe80::1 prefixlen 64"
.Ed
.It Va ipv6_prefix_ Ns Aq Ar interface
.Pq Vt str
Если один или несколько префиксов определены в
.Va ipv6_prefix_ Ns Aq Ar interface
адреса, основанные на каждом префиксе и индексе интерфейса EUI-64, будут
сконфигурированы на этом интерфейсе.
Обратите внимание, что эта переменная будет игнорироваться, если
.Va ifconfig_ Ns Ao Ar interface Ac Ns _ipv6
пуста. 
.Pp
Например, следующая конфигурация
.Bd -literal
ipv6_prefix_em0="2001:db8:1:0 2001:db8:2:0"
.Ed
.Pp
эквивалентна следующему:
.Bd -literal
ifconfig_em0_alias0="inet6 2001:db8:1:: eui64 prefixlen 64"
ifconfig_em0_alias1="inet6 2001:db8:1:: prefixlen 64 anycast"
ifconfig_em0_alias2="inet6 2001:db8:2:: eui64 prefixlen 64"
ifconfig_em0_alias3="inet6 2001:db8:2:: prefixlen 64 anycast"
.Ed
.Pp
Эти адреса Subnet-Router будут добавлены только тогда, когда
.Va ipv6_gateway_enable
имеет значение YES.
.It Va ipv6_default_interface
.Pq Vt str
Если не установлено значение
.Dq Li NO ,
это выходной интерфейс по умолчанию для скопированных адресов.
Это работает только при ipv6_gateway_enable="NO".
.It Va ip6addrctl_enable
.Pq Vt bool
Эта переменная позволяет настроить таблицу выбора адресов по умолчанию.
.Pq RFC 3484 .
Таблица может быть указана в другой переменной
.Va ip6addrctl_policy .
Для
.Va ip6addrctl_policy
могут быть указаны следующие ключевые слова:
.Dq Li ipv4_prefer ,
.Dq Li ipv6_prefer ,
или
.Dq Li AUTO .
.Pp
Если
.Dq Li ipv4_prefer
или
.Dq Li ipv6_prefer
указаны,
.Xr ip6addrctl 8
устанавливает предварительно определенную таблицу политик, описанную в разделе 10.3
.Pq IPv4-preferred
или 2.1
.Pq IPv6-preferred
из RFC 3484.
.Pp
Если
.Dq Li AUTO
указана, то выполняется попытка чтения файла
.Pa /etc/ip6addrctl.conf
первым.
Если этот файл найден,
.Xr ip6addrctl 8
считывает и устанавливает его.
Если он не найден, автоматически устанавливается настройка
в соответствии с
.Va ipv6_activate_all_interfaces
переменной; если переменная имеет значение
.Dq Li YES
используется предпочтительная IPv6-настройка.
В противном случае используется предпочтительный IPv4.
.Pp
Значение по умолчанию для
.Va ip6addrctl_enable
и
.Va ip6addrctl_policy
являются
.Dq Li YES
и
.Dq Li AUTO ,
соответственно.
.It Va cloned_interfaces
.Pq Vt str
Устанавливается в список клонируемых сетевых интерфейсов, которые необходимо создать на данном хосте.
Дополнительные аргументы клонирования могут быть переданы в команду
.Xr ifconfig 8
.Cm create
для каждого интерфейса, установив параметр
.Va create_args_ Ns Aq Ar interface
переменной.
Если имя интерфейса указано с помощью
.Dq :sticky
ключевого слова,
интерфейс не будет уничтожен, даже если в
.Pa rc.d/netif
будет вызван сценарий с
.Dq stop
аргументом.
Это полезно при изменении конфигурации интерфейса без его уничтожения.
Записи в
.Va cloned_interfaces
автоматически добавляются к
.Va network_interfaces
для конфигурирования.
.It Va cloned_interfaces_sticky
.Pq Vt bool
Эта переменная предназначена для глобального включения функциональности
.Dq :sticky
ключевого слова в
.Va cloned_interfaces
для всех интерфейсов.
Значение по умолчанию
.Dq NO .
Даже если для этой переменной указано значение
.Dq YES ,
.Dq :nosticky
может быть использовано для переопределения этого значения для каждого интерфейса.
.It Va gif_interfaces
Установите в список
.Xr gif 4
туннельных интерфейсов для настройки на этом узле.
Значение
.Va gifconfig_ Ns Aq Ar interface
предполагается для каждого значения переменной
.Ar interface .
Значение этой переменной используется для настройки канального уровня туннеля
туннеля с помощью параметра
.Cm tunnel
в
.Xr ifconfig 8 .
Кроме того, эта опция гарантирует, что каждый указанный интерфейс будет создан
с помощью опции
.Cm create
в
.Xr ifconfig 8
перед попыткой его конфигурирования..
.Pp
Например, сконфигурируйте два
.Xr gif 4
интерфейса:
.Bd -literal
gif_interfaces="gif0 gif1"
gifconfig_gif0="100.64.0.1 100.64.0.2"
ifconfig_gif0="inet 10.0.0.1 10.0.0.2 netmask 255.255.255.252"
gifconfig_gif1="inet6 2a00::1 2a01::1"
ifconfig_gif1="inet 10.1.0.1 10.1.0.2 netmask 255.255.255.252"
.Ed
.It Va ppp_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ppp 8
демона.
.It Va ppp_profile
.Pq Vt str
Имя профиля, который следует использовать из
.Pa /etc/ppp/ppp.conf .
Также используется для переопределения для каждого профиля
.Va ppp_mode
и
.Va ppp_nat ,
и
.Va ppp_ Ns Ao Ar profile Ac Ns _unit .
Если имя профиля содержит любой из символов
.Dq Li .-/+
они переводятся в
.Dq Li _
для предложений имен переопределяемых переменных.
.It Va ppp_mode
.Pq Vt str
Режим, в котором будет выполняться
.Xr ppp 8
демон.
.It Va ppp_ Ns Ao Ar profile Ac Ns _mode
.Pq Vt str
Переопределяет глобальный
.Va ppp_mode
для
.Ar profile.
Принимаются следующие режимы
.Dq Li auto ,
.Dq Li ddial ,
.Dq Li direct
и
.Dq Li dedicated .
Полное описание см. в руководстве.
.It Va ppp_nat
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
включается трансляция сетевых адресов.
Используя в сочетании с
.Va gateway_enable
позволяет узлам с частными сетевыми адресами получать доступ к Интернету, используя
этот хост в качестве маршрутизатора для трансляции сетевых адресов.
По умолчанию
.Dq Li YES .
.It Va ppp_ Ns Ao Ar profile Ac Ns _nat
.Pq Vt str
Переопределяет глобальный
.Va ppp_nat
для
.Ar profile .
.It Va ppp_ Ns Ao Ar profile Ac Ns _unit
.Pq Vt int
Установка номера единицы измерения, используемой для данного профиля.
См. описание в руководстве
.Fl unit Ns Ar N
для получения подробной информации.
.It Va ppp_user
.Pq Vt str
Имя пользователя, под которым
.Xr ppp 8
должен быть запущен.
По умолчанию,
.Xr ppp 8
запускается как
.Dq Li root .
.It Va rc_conf_files
.Pq Vt str
Эта опция используется для указания списка файлов, которые будут переопределять
настройки в
.Pa /etc/defaults/rc.conf .
Файлы будут прочитаны в том порядке, в котором они указаны, и должны
включать полный путь к файлу.
По умолчанию указываются следующие файлы
.Pa /etc/rc.conf
и
.Pa /etc/rc.conf.local .
.It Va zfs_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
.Pa /etc/rc.d/zfs
будет пытаться автоматически монтировать файловые системы ZFS и инициализировать тома ZFS
(ZVOLs).
.It Va zpool_reguid
.Pq Vt str
Разделенный пробелами список имен пулов ZFS, для которых должны быть назначены новые GUID пулов
должны быть назначены при первой загрузке.
Это полезно при использовании пула ZFS, скопированного из шаблона, например образа виртуальной машины.
.It Va zpool_upgrade
.Pq Vt str
Разделенный пробелами список имен пулов ZFS, для которых следует обновить версию
при первой загрузке.
Это полезно при использовании пула ZFS, созданного
.Xr makefs 8
утилитой.
.It Va gptboot_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
.Pa /etc/rc.d/gptboot
будет записано, успешно (или нет) ли система загрузилась с GPT-раздела,
на котором был установлен
.Ar bootonce
атрибут с помощью
.Xr gpart 8
утилиты.
.It Va gbde_autoattach_all
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
.Pa /etc/rc.d/gbde
попытается автоматически инициализировать устройства .bde, указанные в
.Pa /etc/fstab .
.It Va gbde_devices
.Pq Vt str
Список устройств, которые сценарий должен попытаться подключить,
или
.Dq Li AUTO .
.It Va gbde_lockdir
.Pq Vt str
Каталог, в котором находятся
.Xr gbde 4
файлы блокировки.
По умолчанию каталог файлов блокировки
.Pa /etc .
.Pp
Локфайл для каждого отдельного
.Xr gbde 4
можно переопределить, установив переменную
.Va gbde_lock_ Ns Aq Ar device ,
где
.Ar device
это зашифрованное устройство без
.Dq Pa /dev/
и
.Dq Pa .bde
частей.
.It Va gbde_attach_attempts
.Pq Vt int
Количество попыток прикрепления к устройству
.Xr gbde 4
т.е. сколько раз пользователя попросят ввести парольную фразу.
По умолчанию 3.
.It Va geli_devices
.Pq Vt str
Список устройств для автоматического подключения при загрузке.
Обратите внимание, что устройства .eli из
.Pa /etc/fstab
автоматически добавляются в этот список.
.It Va geli_groups
.Pq Vt str
Список групп, содержащих устройства для автоматического подключения при загрузке с теми же
ключевыми файлами и парольной фразой.
Этот список должен сопровождаться соответствующей
.Va geli_ Ns Ao Ar group Ac Ns Va _devices
переменной.
.It Va geli_tries
.Pq Vt int
Количество раз, когда у пользователя запрашивается парольная фраза.
Если пусто, она будет взята из
.Va kern.geom.eli.tries
переменной sysctl.
.It Va geli_default_flags
.Pq Vt str
Флаги по умолчанию, используемые
.Xr geli 8
при настройке шифрования диска.
Флаги можно настроить для каждого устройства отдельно, определив параметр
.Va geli_ Ns Ao Ar device Ac Ns Va _flags
и для каждой группы отдельно, определив переменную
.Va geli_ Ns Ao Ar group Ac Ns Va _flags .
.It Va geli_autodetach
.Pq Vt str
Указывает, должны ли устройства GELI помечаться для отсоединения при последнем закрытии после
установки файловых систем.
По умолчанию
.Dq Li YES .
Это можно изменить для каждого устройства отдельно, определив параметр
.Va geli_ Ns Ao Ar device Ac Ns Va _autodetach .
.It Va root_rw_mount
.Pq Vt bool
Установлено значение
.Dq Li YES
по умолчанию.
После проверки файловых систем во время загрузки корневая файловая система
перемонтируется в режим чтения-записи, если установлено значение
.Dq Li YES .
В бездисковых системах, монтирующих свою корневую файловую систему с удаленного ресурса NFS, доступного только для чтения
NFS, следует установить значение
.Dq Li NO
в их
.Pa rc.conf .
.It Va fsck_y_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,	
.Xr fsck 8
будет выполняться с
.Fl y
если первоначальная проверка
файловых систем не удастся.
.It Va background_fsck
.Pq Vt bool
Если установлено значение
.Dq Li NO ,
система не будет пытаться выполнить
.Xr fsck 8
в фоновом режиме, где это возможно.
.It Va background_fsck_delay
.Pq Vt int
Количество времени в секундах для сна перед запуском фонового режима
.Xr fsck 8 .
По умолчанию установлено значение шестьдесят секунд, чтобы позволить крупным приложениям, таким как
X-сервер, запуститься до того, как пропускная способность дискового ввода-вывода будет монополизирована
.Xr fsck 8 .
Если установить отрицательное число, фоновая проверка файловой системы будет
отложена на неопределенный срок, чтобы администратор мог запустить ее в более удобное
удобное время.
Например, ее можно запускать из
.Xr cron 8
добавив строку типа
.Pp
.Dl "0 4 * * * * root /etc/rc.d/bgfsck forcestart"
.Pp
в
.Pa /etc/crontab .
.It Va netfs_types
.Pq Vt str
Этот список, как правило, не должен изменяться конечными пользователями.
Используйте
.Va extra_netfs_types
вместо этого.
.It Va extra_netfs_types
.Pq Vt str
Если установлено значение, отличное от
.Dq Li NO
(по умолчанию),
эта переменная расширяет список типов файловых систем
для которых предусмотрено автоматическое монтирование при запуске
.Xr rc 8
должно быть отложено до инициализации сети.
Она должна содержать
разделенный пробелами список пар дескрипторов сетевых файловых систем,
каждая из которых состоит из типа файловой системы, переданного в
.Xr mount 8
и понятного человеку односложного описания,
соединенного двоеточием
.Pq Ql \&: .
Расширение списка по умолчанию таким образом необходимо только в том случае.
когда используются типы файловых систем сторонних производителей.
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запускается
.Xr syslogd 8
демон.
.It Va syslogd_program
.Pq Vt str
Путь к
.Xr syslogd 8
(по умолчанию
.Pa /usr/sbin/syslogd ) .
.It Va syslogd_flags
.Pq Vt str
Если для
.Va syslogd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr syslogd 8 .
.It Va inetd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустится
.Xr inetd 8
демон.
.It Va inetd_program
.Pq Vt str
Путь к
.Xr inetd 8
(по умолчанию
.Pa /usr/sbin/inetd ) .
.It Va inetd_flags
.Pq Vt str
Если для 
.Va inetd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr inetd 8 .
.It Va hastd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустится
.Xr hastd 8
демон.
.It Va hastd_program
.Pq Vt str
Путь к
.Xr hastd 8
(по умолчанию
.Pa /sbin/hastd ) .
.It Va hastd_flags
.Pq Vt str
Если
.Va hastd_enable
установлен в
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr hastd 8 .
.It Va local_unbound_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустить
.Xr unbound 8
демона в качестве локального кэширующего DNS-резольвера.
.It Va nscd_enable
.Pq Vt bool
Установите значение
.Dq Li YES
чтобы запустить
.Xr nscd 8
демон кэширования для
.Nm nsswitch
подсистемы.
.It Va nscd_flags
.Pq Vt str
Если в
.Va nscd_enable
установлено значение
.Dq Li YES ,
эти флаги передаются в
.Xr nscd 8 .
.It Va kdc_enable
.Pq Vt bool
Устанавливается в
.Dq Li YES	
для запуска сервера аутентификации Kerberos 5
во время загрузки.
.It Va kdc_program
.Pq Vt str
Если в
.Va kdc_enable
установлено значение
.Dq Li YES
это путь к серверу аутентификации Kerberos 5.
.It Va kdc_flags
.Pq Vt str
По умолчанию пустая.
Эта переменная содержит дополнительные флаги, которые будут передаваться серверу аутентификации Kerberos 5.
.It Va kadmind_enable
.Pq Vt bool
Установите 
.Dq Li YES
для запуска
.Xr kadmind 8 ,
демон администрирования Kerberos 5; установите значение
.Dq Li NO
на подчиненном сервере.
.It Va kadmind_program
.Pq Vt str
Если
.Va kadmind_enable
установлен на
.Dq Li YES
это путь к демону администрирования Kerberos 5.
.It Va kpasswdd_enable
.Pq Vt bool
Установите 
.Dq Li YES
для запуска
.Xr kpasswdd 8 ,
демона смены паролей Kerberos 5; установите значение
.Dq Li NO
на подчиненном сервере.
.It Va kpasswdd_program
.Pq Vt str
Если в
.Va kpasswdd_enable
установлено значение
.Dq Li YES
это путь к демону Kerberos 5 Password-Changing Daemon.
.It Va kfd_enable
.Pq Vt bool
Установите в
.Dq Li YES
для запуска
.Xr kfd 8 ,
демона пересылки билетов Kerberos 5, во время загрузки.
.It Va kfd_program
.Pq Vt str
Путь к
.Xr kfd 8
(по умолчанию
.Pa /usr/libexec/kfd ) .
.It Va rwhod_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rwhod 8
демон во время загрузки.
.It Va rwhod_flags
.Pq Vt str
Если в
.Va rwhod_enable
установлено значение
.Dq Li YES ,
вот флаги, которые нужно передать ему.
.It Va update_motd
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
.Pa /var/run/motd
будет обновляться во время загрузки, чтобы отражать версию ядра
запускаемого ядра.
Если установлено значение
.Dq Li NO ,
.Pa /var/run/motd
не будет обновляться.
.It Va nfs_client_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите демон клиента NFS во время загрузки.
.It Va nfs_access_cache
.Pq Vt int
Если для
.Va nfs_client_enable
установлено значение
.Dq Li YES ,
это значение может быть установлено в
.Dq Li 0
чтобы отключить кэширование NFS ACCESS RPC, или на количество секунд, в течение которых
результаты NFS ACCESS
должны кэшироваться.
Значение 2-10 секунд существенно снизит сетевой
трафик для многих операций NFS.
.It Va nfs_server_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите демонов сервера NFS во время загрузки.
.It Va nfs_server_flags
.Pq Vt str
Если в
.Va nfs_server_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr nfsd 8
демону.
.It Va nfsv4_server_enable
.Pq Vt bool
Если
.Va nfs_server_enable
установлено значение
.Dq Li YES
и
.Va nfsv4_server_enable
установлен в
.Dq Li YES ,
включите сервер для NFSv4, а также NFSv2 и NFSv3.
.It Va nfsv4_server_only
.Pq Vt bool
Если для 
.Va nfs_server_enable
установлено значение
.Dq Li YES
и
.Va nfsv4_server_only
установлен на
.Dq Li YES ,
включите сервер NFS только для NFSv4.
.It Va nfs_server_maxio
.Pq Vt int
значение для установки vfs.nfsd.srvmaxio, которым является
максимальный размер ввода-вывода для сервера NFS.
.It Va tlsclntd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rpc.tlsclntd 8
демона, который необходим для монтирования NFS-over-TLS NFS.
.It Va tlsservd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rpc.tlsservd 8
демона, который необходим для
.Xr nfsd 8
для поддержки NFS-over-TLS NFS монтирования.
.It Va nfsuserd_enable
.Pq Vt bool
Если для 
.Va nfsuserd_enable
установлено значение
.Dq Li YES ,
запустите демона nfsuserd, который необходим для NFSv4, чтобы
сопоставлять имена пользователей/групп с номерами uid/gid.
Если
.Va nfsv4_server_enable
установлено значение
.Dq Li YES ,
эта функция будет включена принудительно.
.It Va nfsuserd_flags
.Pq Vt str
Если для
.Va nfsuserd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr nfsuserd 8
демону.
.It Va nfscbd_enable
.Pq Vt bool
Если для
.Va nfscbd_enable
установлено значение
.Dq Li YES ,
запустите демон nfscbd, который включает обратные вызовы/делегирование для клиента NFSv4.
.It Va nfscbd_flags
.Pq Vt str
Если для
.Va nfscbd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr nfscbd 8
демону.
.It Va mountd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
а
.Va nfs_server_enable
Не установлен, запустите
.Xr mountd 8 ,
но не
.Xr nfsd 8
демон.
Он обычно необходим для запуска CFS без использования реальной NFS.
.It Va mountd_flags
.Pq Vt str
Если для
.Va mountd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать
.Xr mountd 8
демону.
.It Va weak_mountd_authentication
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
разрешить службам, таким как PCNFSD, выполнять непривилегированные запросы на монтирование
запросов.
.It Va nfs_reserved_port_only
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
предоставлять услуги NFS только на защищенном порту.
.It Va nfs_bufpackets
.Pq Vt int
Если задано число, указывает количество пакетов в
буферном пространстве сокета для резервирования на клиенте NFS.
По умолчанию в ядре обычно используется значение 4.
Использование большего числа может быть
полезным в гигабитных сетях для повышения производительности.
Минимальное значение
2, а максимальное - 64.
.It Va rpc_lockd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES
а также сервер или клиент NFS, выполните команду
.Xr rpc.lockd 8
во время загрузки.
.It Va rpc_lockd_flags
.Pq Vt str
Если для
.Va rpc_lockd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать
.Xr rpc.lockd 8
демону.
.It Va rpc_statd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES
а также сервер или клиент NFS, выполните команду
.Xr rpc.statd 8
во время загрузки.
.It Va rpc_statd_flags
.Pq Vt str
Если для
.Va rpc_statd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr rpc.statd 8
демону.
.It Va rpcbind_program
.Pq Vt str
Путь к
.Xr rpcbind 8
(по умолчанию
.Pa /usr/sbin/rpcbind ) .
.It Va rpcbind_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rpcbind 8
во время загрузки.
.It Va rpcbind_flags
.Pq Vt str
Если для
.Va rpcbind_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr rpcbind 8
демону.
.It Va keyserv_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr keyserv 8
демон при загрузке для запуска Secure RPC.
.It Va keyserv_flags
.Pq Vt str
Если для
.Va keyserv_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr keyserv 8
демону.
.It Va pppoed_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr pppoed 8
во время загрузки для предоставления услуг PPP через Ethernet.
.It Va pppoed_ Ns Aq Ar provider
.Pq Vt str
.Xr pppoed 8
прослушивает запросы к этому
.Ar provider
и в конечном итоге запускает
.Xr ppp 8
с
.Ar system 
аргументом
с одноименным аргументом.
.It Va pppoed_flags
.Pq Vt str
Дополнительные флаги для передачи в
.Xr pppoed 8 .
.It Va pppoed_interface
.Pq Vt str
Сетевой интерфейс для запуска
.Xr pppoed 8 .
Это обязательное условие, когда для
.Va pppoed_enable
установлено значение
.Dq Li YES .
.It Va ntpdate_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ntpdate 8
при запуске системы.
Эта команда предназначена для
синхронизации системных часов только
.Em один раз
от некоторого стандартного эталона.
.Pp
Обратите внимание, что использование команды
.Va ntpd_sync_on_start
является предпочтительной альтернативой переменной
.Xr ntpdate 8
поскольку
.Xr ntpdate 8
будет исключена из дистрибутива NTP.
.It Va ntpdate_config
.Pq Vt str
Файл конфигурации для
.Xr ntpdate 8 .
По умолчанию
.Pa /etc/ntp.conf .
.It Va ntpdate_hosts
.Pq Vt str
Разделенный пробелами список серверов NTP для синхронизации при запуске.
По умолчанию используются серверы, перечисленные в
.Va ntpdate_config ,
если этот файл существует.
.It Va ntpdate_program
.Pq Vt str
Путь к
.Xr ntpdate 8
(по умолчанию
.Pa /usr/sbin/ntpdate ) .
.It Va ntpdate_flags
.Pq Vt str
Если для
.Va ntpdate_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в программу
.Xr ntpdate 8
(обычно это имя хоста).
.It Va ntpd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ntpd 8
во время загрузки.
.It Va ntpd_program
.Pq Vt str
Путь к
.Xr ntpd 8
(по умолчанию
.Pa /usr/sbin/ntpd ) .
.It Va ntpd_config
.Pq Vt str
Путь к
.Xr ntpd 8
конфигурационному файлу.
По умолчанию
.Pa /etc/ntp.conf .
.It Va ntpd_flags
.Pq Vt str
Если
.Va ntpd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr ntpd 8
демону.
.It Va ntpd_sync_on_start
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
.Xr ntpd 8
будет запущен с
.Fl g
флагом, который синхронизирует часы системы при запуске.
См.
.Xr ntpd 8
для получения дополнительной информации об
.Fl g
параметре.
Это более предпочтительная альтернатива использованию
.Xr ntpdate 8
или указанию параметра
.Va ntpdate_enable
переменной.
.It Va nis_client_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ypbind 8
во время загрузки системы.
.It Va nis_client_flags
.Pq Vt str
Если
.Va nis_client_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr ypbind 8
службе.
.It Va nis_ypldap_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ypldap 8
демона при загрузке системы.
.It Va nis_ypldap_flags
.Pq Vt str
Если для
.Va nis.ypldap_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr ypldap 8
демону.
.It Va nis_ypset_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ypset 8
демона при загрузке системы.
.It Va nis_ypset_flags
.Pq Vt str
Если для
.Va nis_ypset_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr ypset 8
демону.
.It Va nis_server_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr ypserv 8
демона при загрузке системы.
.It Va nis_server_flags
.Pq Vt str
Если для
.Va nis_server_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr ypserv 8
демону.
.It Va nis_ypxfrd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rpc.ypxfrd 8
демона при загрузке системы.
.It Va nis_ypxfrd_flags
.Pq Vt str
Если для
.Va nis_ypxfrd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr rpc.ypxfrd 8
демону.
.It Va nis_yppasswdd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rpc.yppasswdd 8
при загрузке системы.
.It Va nis_yppasswdd_flags
.Pq Vt str
Если для
.Va nis_yppasswdd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать
.Xr rpc.yppasswdd 8
демону.
.It Va rpc_ypupdated_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Nm rpc.ypupdated
во время загрузки системы.
.It Va bsnmpd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr bsnmpd 1
при загрузке системы.
Убедитесь в том, что вы понимаете последствия запуска демона SNMP для безопасности
на вашем хосте.
.It Va bsnmpd_flags
.Pq Vt str
Если для
.Va bsnmpd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr bsnmpd 1
демону.
.It Va defaultrouter
.Pq Vt str
Если не установлено значение
.Dq Li NO ,
создайте маршрут по умолчанию к этому имени хоста или IP-адресу
(используйте IP-адрес, если этот маршрутизатор также необходим для доступа к
серверу имен!).
.It Va defaultrouter_fibN
.Pq Vt str
Если не установлено значение
.Dq Li NO ,
создайте маршрут по умолчанию в FIB N к этому имени хоста или IP-адресу.
.It Va ipv6_defaultrouter
.Pq Vt str
Эквивалент IPv6 для
.Va defaultrouter .
.It Va ipv6_defaultrouter_fibN
.Pq Vt str
IPv6-эквивалент для
.Va defaultrouter_fibN .
.It Va static_arp_pairs
.Pq Vt str
Устанавливается в список статических ARP-пар, которые должны быть добавлены при загрузке системы.
Для каждого разделенного пробелами
.Ar элемента
в значении, добавляется
.Va static_arp_ Ns Aq Ar element
предполагается наличие переменной, содержимое которой впоследствии будет передано в
.Dq Nm arp Cm –S
операцию.
Например
.Bd -literal
static_arp_pairs="gw"
static_arp_gw="192.168.1.1 00:01:02:03:04:05"
.Ed
.It Va static_ndp_pairs
.Pq Vt str
Устанавливает список статических пар NDP, которые должны быть добавлены при загрузке системы.
Для каждого разделенного пробелами
.Ar элемента
в значении
.Va static_ndp_ Ns Aq Ar element
предполагается наличие переменной, содержимое которой впоследствии будет передано 
.Dq Nm ndp Cm -s
операцию.
Например
.Bd -literal
static_ndp_pairs="gw"
static_ndp_gw="2001:db8:3::1 00:01:02:03:04:05"
.Ed
.It Va static_routes
.Pq Vt str
Устанавливается в список статических маршрутов, которые должны быть добавлены при
загрузке системы.
Если не установлено значение
.Dq Li NO
то для каждого разделенного пробелами
.Ar элемента
в значении, предполагается, что существует переменная
.Va route_ Ns Aq Ar element ,
содержимое которой впоследствии будет передано в
.Dq Nm route Cm add
операцию.
Например:
.Bd -literal
static_routes="ext mcast:gif0 gif0local:gif0"
route_ext="-net 10.0.0.0/24 -gateway 192.168.0.1"
route_mcast="-net 224.0.0.0/4 -iface gif0"
route_gif0local="-host 169.254.1.1 -iface lo0"
.Ed
.Pp
Когда
.Ar элемент
имеет форму
.Li имя:ifname ,
маршрут специфичен для интерфейса
.Li ifname .
.It Va ipv6_static_routes
.Pq Vt str
IPv6-эквивалент
.Va static_routes .
Если не установлено значение
.Dq Li NO
то для каждого разделенного пробелами
.Ar элемента
в значении, будет добавлен
.Va ipv6_route_ Ns Aq Ar element
предполагается наличие переменной
содержимое которой впоследствии будет передано в 
.Dq Nm route Cm add Fl inet6
операцию.
.It Va gateway_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
настройте хост на работу в качестве IP-маршрутизатора, например \& на пересылку пакетов
между интерфейсами.
.It Va ipv6_gateway_enable
.Pq Vt bool
IPv6-эквивалент
.Va gateway_enable .
.It Va routed_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите демон маршрутизации, основанный на
настройке
.Va routed_program
и
.Va routed_flags .
.It Va route6d_enable
.Pq Vt bool
IPv6-эквивалент
.Va routed_enable .
Если установлено значение
.Dq Li YES ,
запустите демон маршрутизации, основанный на
настройке
.Va route6d_program
и
.Va route6d_flags .
.It Va routed_program
.Pq Vt str
Если
.Va routed_enable
установлен в
.Dq Li YES ,
это имя используемого демона маршрутизации.
По умолчанию
.Xr routed 8 .
.It Va route6d_program
.Pq Vt str
IPv6-эквивалент
.Va routed_program .
По умолчанию
.Xr route6d 8 .
.It Va routed_flags
.Pq Vt str
Если
.Va routed_enable
установлен на
.Dq Li YES ,
это флаги, которые нужно передать демону маршрутизации.
.It Va route6d_flags
.Pq Vt str
IPv6-эквивалент
.Va routed_flags .
.It Va rtadvd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rtadvd 8
во время загрузки.
Утилита
.Xr rtadvd 8
отправляет сообщения ICMPv6 Router Advertisement на
интерфейсы, указанные в
.Va rtadvd_interfaces .
Включать ее следует только с большой осторожностью.
Возможно, вам потребуется точная настройка
.Xr rtadvd.conf 5 .
.It Va rtadvd_interfaces
.Pq Vt str
Если
.Va rtadvd_enable
установлено значение
.Dq Li YES
это список используемых интерфейсов.
.It Va arpproxy_all
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
включите глобальный прокси ARP.
.It Va forward_sourceroute
.Pq Vt bool
Если установлено значение
.Dq Li YES
и
.Va gateway_enable
также установлен в
.Dq Li YES ,
пакеты с маршрутизацией от источника пересылаются.
.It Va accept_sourceroute
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
система будет принимать направленные на нее пакеты с маршрутизацией от источника.
.It Va rarpd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr rarpd 8
при загрузке системы.
.It Va rarpd_flags
.Pq Vt str
Если
.Va rarpd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr rarpd 8
демону.
.It Va bootparamd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr bootparamd 8
во время загрузки системы.
.It Va bootparamd_flags
.Pq Vt str
Если
.Va bootparamd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr bootparamd 8
демону.
.It Va stf_interface_ipv4addr
.Pq Vt str
Если не установлено значение
.Dq Li NO ,
это локальный IPv4-адрес для 6to4 (туннелирование IPv6 поверх IPv4).
Укажите эту запись, чтобы включить интерфейс 6to4.
.It Va stf_interface_ipv4plen
.Pq Vt int
Длина префикса для IPv4-адресов 6to4, чтобы ограничить диапазон адресов пиров.
Эффективное значение - 0-31.
.It Va stf_interface_ipv6_ifid
.Pq Vt str
Идентификатор интерфейса IPv6 для
.Xr stf 4 .
Это значение может быть установлено на
.Dq Li AUTO .
.It Va stf_interface_ipv6_slaid
.Pq Vt str
Агрегатор уровня сайта IPv6 для
.Xr stf 4 .
.It Va ipv6_ipv4mapping
.Pq Vt bool
Если установлено значение
.Dq Li YES
это позволяет передавать IPv4 сопоставленные IPv6 адреса (например
.Li ::ffff:a.b.c.d ) .
.It Va rtsold_enable
.Pq Vt bool
Установите на
.Dq Li YES
чтобы позволить
.Xr rtsold 8
демону отправлять сообщения ICMPv6 Router Solicitation.
.It Va rtsold_flags
.Pq Vt str
Если для
.Va rtsold_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr rtsold 8 .
.It Va rtsol_flags
.Pq Vt str
Для интерфейсов, сконфигурированных с параметром
.Dq Li inet6 accept_rtadv
это флаги, которые нужно передать в
.Xr rtsol 8 .
.Pp
Обратите внимание, что
.Va rtsold_enable
является взаимоисключающим для
.Va rtsol_flags ;
.Va rtsold_enable
имеет приоритет.
.It Va keybell
.Pq Vt str
Звук звонка клавиатуры.
Установите значение
.Dq Li normal ,
.Dq Li visual ,
.Dq Li off ,
или
.Dq Li NO
если требуется поведение по умолчанию.
Для получения подробной информации см.
.Xr kbdcontrol 1
руководство.
.It Va keyboard
.Pq Vt str
Если задана не нулевая строка, клавиатурный ввод виртуальной консоли
устанавливается на это устройство.
.It Va keymap
.Pq Vt str
Если установлено значение
.Dq Li NO ,
никакая  раскладка не устанавливается, в противном случае значение используется для установки
файл keymap, найденный в
.Pa /usr/share/syscons/keymaps/ Ns Ao Ar value Ac Ns Pa .kbd
(при использовании
.Xr syscons 4 ) или
.Pa /usr/share/vt/keymaps/ Ns Ao Ar value Ac Ns Pa .kbd
(если используется
.Xr vt 4 ) .
.It Va keyrate
.Pq Vt str
Скорость повтора клавиатуры.
Установите значение
.Dq Li slow ,
.Dq Li normal ,
.Dq Li fast ,
или
.Dq Li NO
если требуется поведение по умолчанию.
.It Va keychange
.Pq Vt str
Если не установлено значение
.Dq Li NO ,
попытайтесь запрограммировать функциональные клавиши на это значение.
Значение должно
быть одной строкой вида:
.Dq Ar funkey_number new_value Op Ar funkey_number new_value ... .
.It Va cursor
.Pq Vt str
Может быть установлено значение
.Dq Li normal ,
.Dq Li blink ,
.Dq Li destructive ,
или
.Dq Li NO
чтобы задать поведение курсора в явном виде или выбрать поведение по умолчанию.
.It Va scrnmap
.Pq Vt str
Если установлено значение
.Dq Li NO ,
карта экрана не устанавливается, в противном случае значение используется для установки
файл карты экрана в
.Pa /usr/share/syscons/scrnmaps/ Ns Aq Ar value .
Этот параметр игнорируется при использовании
.Xr vt 4
в качестве драйвера консоли.
.It Va font8x16
.Pq Vt str
Если установлено значение
.Dq Li NO ,
для запросов размера экрана используется значение шрифта по умолчанию 8x16, в противном случае
используется  значение 
.Pa /usr/share/syscons/fonts/ Ns Aq Ar value
или
.Pa /usr/share/vt/fonts/ Ns Aq Ar value
(в зависимости от используемого драйвера консоли).
.It Va font8x14
.Pq Vt str
Если установлено значение
.Dq Li NO ,
для запросов размера экрана используется значение шрифта по умолчанию 8x14, в противном случае
используется  значение 
.Pa /usr/share/syscons/fonts/ Ns Aq Ar value
или
.Pa /usr/share/vt/fonts/ Ns Aq Ar value
(в зависимости от используемого консольного драйвера).
.It Va font8x8
.Pq Vt str
Если установлено значение
.Dq Li NO ,
для запросов размера экрана используется значение шрифта по умолчанию 8x8, в противном случае
используется значение 
.Pa /usr/share/syscons/fonts/ Ns Aq Ar value
или
.Pa /usr/share/vt/fonts/ Ns Aq Ar value
(в зависимости от используемого драйвера консоли).
.It Va blanktime
.Pq Vt int
Если установлено значение
.Dq Li NO ,
используется интервал отключения экрана по умолчанию, в противном случае устанавливается
на
.Ar значение
секунд.
.It Va saver
.Pq Vt str
Если не установлено значение
.Dq Li NO ,
это фактическая заставка, которую следует использовать
.Li (пустой, змея, демон,
и т.д.).
.It Va moused_nondefault_enable
.Pq Vt str
Если установлено значение
.Dq Li NO ,
устройство мыши, указанное в
командной строке, не будет автоматически рассматриваться как включенное с помощью скрипта
.Pa /etc/rc.d/moused .
Если для этой переменной установлено значение
.Dq Li YES ,
это позволяет мыши
.Xr usb 4
например,
быть включенной, как только она будет подключена.
.It Va moused_enable
.Pq Vt str
Если установлено значение
.Dq Li YES ,
то
.Xr moused 8
запускается демон для выполнения вырезания/вставки на консоли.
.It Va moused_type
.Pq Vt str
Это тип протокола мыши, подключенной к данному хосту.
Эта переменная должна быть установлена, если для
.Va moused_enable
установлено значение
.Dq Li YES ,
но по умолчанию установлено значение
.Dq Li auto
т.к.
.Xr moused 8
демон
во многих случаях способен автоматически определить подходящий тип мыши.
Установите для этой переменной значение
одно из следующих значений, если автоматическое определение не удается.
.Pp
Если мышь подключена к порту PS/2, выберите
.Dq Li auto
или
.Dq Li ps/2 ,
независимо от марки и модели мыши.
Аналогичным образом, если
мышь подключена к порту мыши, выберите
.Dq Li auto
или
.Dq Li busmouse .
Все остальные протоколы предназначены для последовательных мышей и не будут работать с
PS/2 и шинными мышами.
Если это мышь USB,
.Dq Li auto
это единственный тип протокола, который будет работать.
.Pp
.Bl -tag -width ".Li x10mouseremote" -compact
.It Li microsoft
Мышь Microsoft (последовательная)
.It Li intellimouse
Microsoft IntelliMouse (серийная)
.It Li mousesystems
Mouse systems Corp.\& mouse (серийная)
.It Li mmseries
Мышь серии MM (серийная)
.It Li logitech
Мышь Logitech (серийная)
.It Li busmouse
 Шариковая мышь
.It Li mouseman
Logitech MouseMan и TrackMan (серийная)
.It Li glidepoint
ALPS GlidePoint (серийная)
.It Li thinkingmouse
Kensington ThinkingMouse (серийная)
.It Li ps/2
Мышь PS/2
.It Li mmhittab
MM HitTablet (серийная)
.It Li x10mouseremote
X10 MouseRemote (последовательная)
.It Li versapad
Interlink VersaPad (серийная)
.El
.Pp
Даже если мыши нет в приведенном выше списке, она может быть совместима
с одной из них.
Обратитесь к странице руководства для
.Xr moused 8
для получения информации о совместимости.
.Pp
Следует также отметить, что, пока эта функция включена, любой другой
другой клиент мыши (например, X-сервер) должен получать доступ
к мыши через виртуальное устройство мыши,
.Pa /dev/sysmouse ,
и настроить его как
.Dq Li sysmouse
поскольку все
данные мыши преобразуются в этот единый канонический формат при
использовании
.Xr moused 8 .
Если клиентская программа не поддерживает
.Dq Li sysmouse
тип,
укажите
.Dq Li mousesystems
тип.
Это второй предпочтительный тип.
.It Va moused_port
.Pq Vt str
Если
.Va moused_enable
установлено значение
.Dq Li YES ,
это фактический порт, на котором находится мышь.
Это может быть
.Pa /dev/cuau0
для мыши с последовательным портом COM1, или
.Pa /dev/psm0
для мыши PS/2, например.
.It Va moused_flags
.Pq Vt str
Если
.Va moused_flags
установлена, ее значение используется в качестве дополнительного набора флагов для передачи функции
.Xr moused 8
демону.
.It Va "moused_" Ns Ar XXX Ns Va "_flags"
Если
.Va moused_nondefault_enable
включен, и
.Xr moused 8
запускает демона для порта, не используемого по умолчанию, в поле
.Va "moused_" Ns Ar XXX Ns Va "_flags"
набор опций имеет приоритет и заменяет стандартный
.Va moused_flags
(где
.Ar XXX
это имя порта не по умолчанию, т.е. \&
.Ar ums0 ) .
Установив
.Va "moused_" Ns Ar XXX Ns Va "_flags"
можно установить различный набор флагов по умолчанию для каждого порта
.Xr moused 8
экземпляра.
Например, вы можете использовать
.Dq Li "-3"
для флагов по умолчанию
.Va moused_flags
чтобы сделать тачпад вашего ноутбука более удобным в использовании,
но пустой набор опций для
.Va moused_ums0_flags
когда ваша
.Xr usb 4
мышь имеет три или более кнопок.
.It Va mousechar_start
.Pq Vt int
Если установлено значение
.Dq Li NO ,
Используется диапазон символов курсора мыши по умолчанию
.Li 0xd0 Ns - Ns Li 0xd3 ,
в противном случае начало диапазона устанавливается
на
.Ar значение
символов, см.
.Xr vidcontrol 1 .
Используется, если диапазон по умолчанию занят в таблице кодов языка.
.It Va allscreens_flags
.Pq Vt str
Если установлен,
.Xr vidcontrol 1
запускается с этими параметрами для каждого из виртуальных терминалов
.Pq Pa /dev/ttyv* .
Например,
.Dq Fl m Cm on
включит указатель мыши на всех виртуальных терминалах
если для
.Va moused_enable
установлено значение
.Dq Li YES .
.It Va allscreens_kbdflags
.Pq Vt str
Если установлено,
.Xr kbdcontrol 1
запускается с этими параметрами для каждого из виртуальных терминалов
.Pq Pa /dev/ttyv* .
Например,
.Dq Fl h Li 200
установит
.Xr syscons 4
или
.Xr vt 4
буфер прокрутки (истории) на 200 строк.
.It Va cron_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr cron 8
при загрузке системы.
.It Va cron_program
.Pq Vt str
Путь к
.Xr cron 8
(по умолчанию
.Pa /usr/sbin/cron ) .
.It Va cron_flags
.Pq Vt str
Если для
.Va cron_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr cron 8 .
.It Va cron_dst
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
включите специальную обработку перехода на летнее время и обратно
в
.Xr cron 8
(эквивалентно использованию флага
.Fl s ) .
.It Va lpd_program
.Pq Vt str
Путь к
.Xr lpd 8
(по умолчанию
.Pa /usr/sbin/lpd ) .
.It Va lpd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr lpd 8
во время загрузки системы.
.It Va lpd_flags
.Pq Vt str
Если для
.Va lpd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr lpd 8
демону.
.It Va chkprintcap_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr chkprintcap 8
перед запуском команды
.Xr lpd 8
демона.
.It Va chkprintcap_flags
.Pq Vt str
Если
.Va lpd_enable
и
.Va chkprintcap_enable
установлены в
.Dq Li YES ,
это флаги, которые нужно передать программе
.Xr chkprintcap 8 .
По умолчанию
.Dq Li -d ,
что приводит к созданию отсутствующих каталогов.
.It Va dumpdev
.Pq Vt str
Указывает устройство (обычно раздел обмена), на которое должна быть записана резервная копия, в случае сбоя системы.
Если значение этой переменной равно
.Dq Li AUTO ,
то первым подходящим устройством подкачки, указанным в
.Pa /etc/fstab
будет использоваться в качестве устройства дампа.
В противном случае значение этой переменной передается в качестве аргумента команде
.Xr dumpon 8
и
.Xr savecore 8 .
Чтобы отключить дампы, установите для этой переменной значение
.Dq Li NO .
.It Va dumpon_flags
.Pq Vt str
Флаги для передачи в
.Xr dumpon 8
при настройке
.Va dumpdev
в качестве устройства дампа системы.
.It Va dumpdir
.Pq Vt str
Когда система перезагружается после сбоя и дамп аварии найден на
устройстве, указанном переменной
.Va dumpdev ,
.Xr savecore 8
сохранит этот аварийный дамп и копию ядра в каталог
указанный переменной
.Va dumpdir .
По умолчанию это значение
.Pa /var/crash .
Установите значение
.Dq Li NO
чтобы не запускать
.Xr savecore 8
во время загрузки, когда
.Va dumpdir
установлен.
.It Va savecore_enable
.Pq Vt bool
Если установлено значение
.Dq Li NO ,
отключите автоматическое извлечение дампа аварийного состояния из
.Va dumpdev .
.It Va savecore_flags
.Pq Vt str
Если дампы аварийных ситуаций включены, эти флаги нужно передать в утилиту
.Xr savecore 8 .
.It Va quota_enable
.Pq Vt bool
Установите
.Dq Li YES
чтобы включить дисковые квоты для пользователей и групп при запуске системы с помощью команды
.Xr quotaon 8
для всех файловых систем, помеченных как имеющие включенные квоты в
.Pa /etc/fstab .
Ядро должно быть собрано с
.Cd "options QUOTA"
для функционирования дисковых квот.
.It Va check_quotas
.Pq Vt bool
Установите в
.Dq Li YES
чтобы включить проверку дисковых квот пользователей и групп с помощью команды
.Xr quotacheck 8 .
.It Va quotacheck_flags
.Pq Vt str
Если для
.Va quota_enable
установлено значение
.Dq Li YES ,
и
.Va check_quotas
установлен на
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr quotacheck 8
утилиту.
По умолчанию
.Dq Li "-a" ,
которая проверяет квоты для всех файловых систем с разрешенными квотами в
.Pa /etc/fstab .
.It Va quotaon_flags
.Pq Vt str
Если для
.Va quota_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr quotaon 8
утилиту.
По умолчанию значение
.Dq Li "-a" ,
которое включает квоты для всех файловых систем с разрешенными квотами в
.Pa /etc/fstab .
.It Va quotaoff_flags
.Pq Vt str
Если для
.Va quota_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать в
.Xr quotaoff 8
утилиту при завершении работы системы квот.
По умолчанию
.Dq Li "-a" ,
который отключает квоты для всех файловых систем с разрешенными квотами в
.Pa /etc/fstab .
.It Va accounting_enable
.Pq Vt bool
Установите на
.Dq Li YES
чтобы включить системный учет через
.Xr accton 8
средство.
.It Va firstboot_sentinel
.Pq Vt str
Эта переменная указывает полный путь к
.Dq first boot
файлу метке.
Если файл с таким путем существует,
.Pa rc.d
скрипты с
.Dq firstboot
будут запущены при загрузке, а файл метка будет удален
после завершения процесса загрузки.
Файл метка должен быть расположен на файловой системе, доступной для записи, которая устанавливается не позднее
.Va early_late_divider
для правильной работы.
По умолчанию это
.Pa /firstboot .
.It Va linux_enable
.Pq Vt bool
Установите значение
.Dq Li YES
чтобы включить эмуляцию двоичных файлов Linux/ELF при начальной загрузке системы.
.It Va sysvipc_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
загрузите примитивы System V IPC во время загрузки.
.It Va clear_tmp_enable
.Pq Vt bool
Установите в
.Dq Li YES
чтобы
.Pa /tmp
очищалась при запуске.
.It Va clear_tmp_X
.Pq Vt bool
Установить на
.Dq Li NO
чтобы запретить удаление файлов блокировки X11,
а также удаление и (безопасное) восстановление
различных каталогов сокетов для X11
связанных с программами.
.It Va ldconfig_paths
.Pq Vt str
Устанавливается в список путей к общим библиотекам для использования с
.Xr ldconfig 8 .
ПРИМЕЧАНИЕ:
.Pa /lib
и
.Pa /usr/lib
всегда будут добавляться первыми, поэтому в этом списке они не нужны.
.It Va ldconfig32_paths
.Pq Vt str
Устанавливается в список путей к общим библиотекам 32-битной совместимости для
использования с
.Xr ldconfig 8 .
.It Va ldconfig_insecure
.Pq Vt bool
Утилита
.Xr ldconfig 8
обычно отказывается использовать каталоги
которые могут быть записаны кем-либо, кроме администратора.
Установите эту переменную в значение
.Dq Li YES
чтобы отключить эту проверку безопасности при запуске системы.
.It Va ldconfig_local_dirs
.Pq Vt str
Устанавливается в список локальных
.Xr ldconfig 8
каталогов.
Имена всех файлов в перечисленных каталогах будут
переданы в качестве аргументов в
.Xr ldconfig 8 .
.It Va ldconfig_local32_dirs
.Pq Vt str
Устанавливается в список локальной 32-битной совместимости
.Xr ldconfig 8
каталогов.
Имена всех файлов в перечисленных каталогах будут
переданы в качестве аргументов в
.Dq Nm ldconfig Fl 32 .
.It Va kern_securelevel_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для установки уровня безопасности ядра при запуске системы.
.It Va kern_securelevel
.Pq Vt int
Уровень безопасности ядра, устанавливаемый при запуске.
Допустимый диапазон
.Ar значения
варьируется от \-1 (значение по умолчанию при компиляции) до 3 (самый
самый безопасный).
См.
.Xr security 7 
список возможных уровней безопасности и их влияние
на работу системы.
.It Va sshd_program
.Pq Vt str
Путь к программе сервера SSH
.Pa ( /usr/sbin/sshd
по умолчанию).
.It Va sshd_enable
.Pq Vt bool
Установить значение
.Dq Li YES
для запуска
.Xr sshd 8
во время загрузки системы.
.It Va sshd_flags
.Pq Vt str
Если
.Va sshd_enable
установлено значение
.Dq Li YES ,
это флаги, которые нужно передать 
.Xr sshd 8
демону.
.It Va ftpd_program
.Pq Vt str
Путь к программе FTP-сервера
.Pa ( /usr/libexec/ftpd
по умолчанию).
.It Va ftpd_enable
.Pq Vt bool
Установите значение
.Dq Li YES
для запуска
.Xr ftpd 8
как автономного демона во время загрузки системы.
.It Va ftpd_flags
.Pq Vt str
Если для
.Va ftpd_enable
установлено значение
.Dq Li YES ,
это дополнительные флаги, которые нужно передать 
.Xr ftpd 8
демону.
.It Va watchdogd_enable
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
запустите
.Xr watchdogd 8
во время загрузки.
Для этого необходимо, чтобы ядро было скомпилировано с
.Xr watchdog 4
совместимым устройством.
.It Va watchdogd_flags
.Pq Vt str
Если для
.Va watchdogd_enable
установлено значение
.Dq Li YES ,
это флаги, передаваемые 
.Xr watchdogd 8
демону.
.It Va watchdogd_timeout
.Pq Vt int
Если для
.Va watchdogd_enable
установлено значение
.Dq Li YES ,
это таймаут, который будет использоваться 
.Xr watchdogd 8
демоном.
Если этот параметр установлен, он отменяет
.Fl t
в
.Va watchdogd_flags .
.It Va watchdogd_shutdown_timeout
.Pq Vt int
Если
.Va watchdogd_enable
установлен в
.Dq Li YES ,
это таймаут, который будет установлен программой
.Xr watchdogd 8
демоном при выходе из системы во время ее выключения.
Этот таймаут не будет установлен при возврате в однопользовательский режим
или при индивидуальной остановке службы watchdogd с помощью команды
.Xr service 8
или сценария rc.d.
Обратите внимание, что таймаут будет применяться, если
.Xr watchdogd 8
будет остановлен вне
.Xr rc 8
фреймворка.
Если этот параметр установлен, он отменяет
.Fl x
в
.Va watchdogd_flags .
.It Va devfs_rulesets
.Pq Vt str
Список файлов, содержащих наборы правил для
.Xr devfs 8 .
.It Va devfs_system_ruleset
.Pq Vt str
Имя правила, применяемого к системе
.Pa /dev
самостоятельно.
.It Va devfs_set_rulesets
.Pq Vt str
PПары уже установленных
.Pa dev
каталогов и наборов правил, которые должны быть применены к ним.
Например: /mount/dev=ruleset_name
.It Va devfs_load_rulesets
.Pq Vt bool
Если установлено, всегда загружать наборы правил по умолчанию, перечисленные в
.Va devfs_rulesets .
.It Va performance_cx_lowest
.Pq Vt str
Состояние простоя процессора, используемое при питании от сети переменного тока.
Строка
.Dq Li LOW
указывает на то, что
.Xr acpi 4
должен использовать самое низкое доступное состояние питания, в то время как
.Dq Li HIGH
указывает, что следует использовать состояние с наименьшей задержкой (меньшая экономия энергии).
.It Va performance_cpu_freq
.Pq Vt str
Тактовая частота процессора, которую следует использовать при питании от сети переменного тока.
Строка
.Dq Li LOW
указывает на то, что
.Xr cpufreq 4
должна использовать самую низкую доступную частоту, в то время как
.Dq Li HIGH
указывает, что следует использовать самую высокую частоту (меньшая экономия энергии).
.It Va economy_cx_lowest
.Pq Vt str
Состояние простоя процессора при отключении питания от сети переменного тока.
Строка
.Dq Li LOW
указывает на то, что
.Xr acpi 4
должен использовать самое низкое доступное состояние питания, в то время как
.Dq Li HIGH
указывает, что следует использовать состояние с наименьшей задержкой (меньшая экономия энергии).
.It Va economy_cpu_freq
.Pq Vt str
Тактовая частота процессора, которую следует использовать при отключении питания от сети переменного тока.
Строка
.Dq Li LOW
указывает на то, что
.Xr cpufreq 4
должна использовать самую низкую доступную частоту, в то время как
.Dq Li HIGH
указывает, что следует использовать самую высокую частоту (меньшая экономия энергии).
.It Va jail_enable
.Pq Vt bool
Если установлено значение
.Dq Li NO ,
все настроенные джейлы не будут запускаться.
.It Va jail_conf
.Pq Vt str
Имя файла конфигурации, используемое
.Xr jail 8
утилитой.
По умолчанию используется значение
.Pa /etc/jail.conf .
.Pa /etc/jail. Ns Ao Va jname Ac Ns Pa .conf
и
.Pa /etc/jail.conf.d/ Ns Ao Va jname Ac Ns Pa .conf
также будет использоваться, если
.Ao Va jname Ac
установлен в
.Va jail_list .
.It Va jail_parallel_start
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
все настроенные джейлы будут запускаться в фоновом режиме (параллельно).
.It Va jail_flags
.Pq Vt str
По умолчанию не установлена.
Если установлена, используйте как значение по умолчанию для
.Va jail_ Ns Ao Ar jname Ac Ns Va _flags
для каждого джейла в
.Va jail_list .
.It Va jail_list
.Pq Vt str
Список имен джейлов, ограниченный пробелами.
Если оставить его пустым, то все
.Xr jail 8
определенные в конфигурационном файле, будут запущены все экземпляры .
Имена, указанные в этом списке, определяют порядок запуска джейлов.
.Xr jail 8
экземпляры, отсутствующие в
.Va jail_list
должны быть запущены вручную.
Обратите внимание, что зависимость джейла
.Va depend
в конфигурационном файле может переопределять этот список.
.It Va jail_reverse_stop
.Pq Vt bool
Если установлено значение
.Dq Li YES ,
все настроенные джейлы в
.Va jail_list
останавливаются в обратном порядке.
.It Va jail_ Ns * variables
Обратите внимание, что в старых версиях поддерживалась настройка каждого джейла через
.Nm
переменные.
Например,
имя хоста джейла с именем
.Li vjail
можно было установить с помощью
.Li jail_vjail_hostname .
Эти конфигурационные переменные для каждого джейла теперь устарели в пользу
.Xr jail 8
конфигурационного файла.
Для обеспечения обратной совместимости,
когда определяются переменные конфигурации для каждого джейла,
.Xr jail 8
файлы конфигурации создаются как
.Pa /var/run/jail . Ns Ao Ar jname Ac Ns Pa .conf
и используются.
.Pp
Для обеспечения обратной совместимости,
когда определяются переменные конфигурации для каждого джейла,
.Xr jail 8
файлы конфигурации создаются как
.Pa /var/run/jail . Ns Ao Ar jname Ac Ns Pa .conf
и используются.
В дополнение к ним, параметры в
.Va jail_ Ns Ao Ar jname Ac Ns Va _parameters
будут добавлены в конфигурационный файл.
Они должны быть с запятой
.Pq Ql \&;
ограниченный список
.Dq key=value .















For more details,
see
.Xr jail 8
manual page.
.Bl  -tag -width "host.hostname" -offset indent
.It Li path
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _rootdir
.It Li host.hostname
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _hostname
.It Li exec.consolelog
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _consolelog .
The default value is
.Pa /var/log/jail_ Ns Ao Ar jname Ac Ns Pa _console.log .
.It Li interface
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _interface .
.It Li vnet.interface
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _vnet_interface .
This implies
.Li vnet
parameter will be enabled and cannot be specified with
.Va jail_ Ns Ao Ar jname Ac Ns Va _interface ,
.Va jail_ Ns Ao Ar jname Ac Ns Va _ip
and/or
.Va jail_ Ns Ao Ar jname Ac Ns Va _ip_multi Ns Aq Ar n
at the same time.
.It Li fstab
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _fstab
.It Li mount
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _procfs_enable .
.It Li exec.fib
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _fib
.It Li exec.start
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _exec_start .
The parameter name was
.Li command
in some older releases.
.It Li exec.prestart
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _exec_prestart
.It Li exec.poststart
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _exec_poststart
.It Li exec.stop
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _exec_stop
.It Li exec.prestop
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _exec_prestop
.It Li exec.poststop
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _exec_poststop
.It Li ip4.addr
set if
.Va jail_ Ns Ao Ar jname Ac Ns Va _ip
or
.Va jail_ Ns Ao Ar jname Ac Ns Va _ip_multi Ns Aq Ar n
contain IPv4 addresses
.It Li ip6.addr
set if
.Va jail_ Ns Ao Ar jname Ac Ns Va _ip
or
.Va jail_ Ns Ao Ar jname Ac Ns Va _ip_multi Ns Aq Ar n
contain IPv6 addresses
.It Li allow.mount
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _mount_enable
.It Li mount.devfs
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _devfs_enable
.It Li devfs_ruleset
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _devfs_ruleset .
This must be an integer,
not a string.
.It Li mount.fdescfs
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _fdescfs_enable
.It Li allow.set_hostname
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _set_hostname_allow
.It Li allow.rawsocket
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _socket_unixiproute_only
.It Li allow.sysvipc
set from
.Va jail_ Ns Ao Ar jname Ac Ns Va _sysvipc_allow
.El
.\" -----------------------------------------------------
.It Va harvest_mask
.Pq Vt int
Set to a bit-mask
representing the entropy sources
you wish to harvest.
Refer to
.Xr random 4
for more information.
.It Va entropy_dir
.Pq Vt str
Set to
.Dq Li NO
to disable caching entropy via
.Xr cron 8 .
Otherwise set to the directory
in which the entropy files are stored.
To be useful,
there must be
a system cron job
that regularly writes and rotates
files here.
All files found
will be used at boot time.
The default is
.Pa /var/db/entropy .
.It Va entropy_file
.Pq Vt str
Set to
.Dq Li NO
to disable caching entropy through reboots.
Otherwise set to the name
of a file used to store cached entropy.
This file should be located
on a file system that is readable
before all the volumes specified in
.Xr fstab 5
are mounted.
By default,
.Pa /entropy
is used,
but if
.Pa /var/db/entropy-file
is found it will also be used.
This will be of some use to
.Xr bsdinstall 8 .
.It Va entropy_boot_file
.Pq Vt str
Set to
.Dq Li NO
to disable
very early caching entropy
through reboots.
Otherwise set to the filename
used to read
very early reboot cached entropy.
This file should be located where
.Xr loader 8
can read it.
See also
.Xr loader.conf 5 .
The default location is
.Pa /boot/entropy .
.It Va entropy_save_sz
.Pq Vt int
Size of the entropy cache files saved by
.Nm save-entropy
periodically.
.It Va entropy_save_num
.Pq Vt int
Number of entropy cache files to save by
.Nm save-entropy
periodically.
.It Va ipsec_enable
.Pq Vt bool
Set to
.Dq Li YES
to run
.Xr setkey 8
on
.Va ipsec_file
at boot time.
.It Va ipsec_file
.Pq Vt str
Configuration file for
.Xr setkey 8 .
.It Va dmesg_enable
.Pq Vt bool
Set to
.Dq Li YES
to save
.Xr dmesg 8
to
.Pa /var/run/dmesg.boot
on boot.
.It Va rcshutdown_timeout
.Pq Vt int
If set, start a watchdog timer in the background which will terminate
.Pa rc.shutdown
if
.Xr shutdown 8
has not completed within the specified time (in seconds).
Notice that in addition to this soft timeout,
.Xr init 8
also applies a hard timeout for the execution of
.Pa rc.shutdown .
This is configured via
.Xr sysctl 8
variable
.Va kern.init_shutdown_timeout
and defaults to 120 seconds.
Setting the value of
.Va rcshutdown_timeout
to more than 120 seconds will have no effect until the
.Xr sysctl 8
variable
.Va kern.init_shutdown_timeout
is also increased.
.It Va virecover_enable
.Pq Vt bool
Set to
.Dq Li NO
to prevent the system from trying to
recover prematurely terminated
.Xr vi 1
sessions.
.It Va ugidfw_enable
.Pq Vt bool
Set to
.Dq Li YES
to load the
.Xr mac_bsdextended 4
module upon system initialization and load a default
ruleset file.
.It Va bsdextended_script
.Pq Vt str
The default
.Xr mac_bsdextended 4
ruleset file to load.
The default value of this variable is
.Pa /etc/rc.bsdextended .
.It Va newsyslog_enable
.Pq Vt bool
If set to
.Dq Li YES ,
run
.Xr newsyslog 8
command at startup.
.It Va newsyslog_flags
.Pq Vt str
If
.Va newsyslog_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr newsyslog 8
program.
The default is
.Dq Li -CN ,
which causes log files flagged with a
.Cm C
to be created.
.It Va mdconfig_md Ns Aq Ar X
.Pq Vt str
Arguments to
.Xr mdconfig 8
for
.Xr md 4
device
.Ar X .
At minimum a
.Fl t Ar type
must be specified and either a
.Fl s Ar size
for malloc or swap backed
.Xr md 4
devices or a
.Fl f Ar file
for vnode backed
.Xr md 4
devices.
Note that
.Va mdconfig_md Ns Aq Ar X
variables are evaluated until one variable is unset or null.
.It Va mdconfig_md Ns Ao Ar X Ac Ns Va _newfs
.Pq Vt str
Optional arguments passed to
.Xr newfs 8
to initialize
.Xr md 4
device
.Ar X .
.It Va mdconfig_md Ns Ao Ar X Ac Ns Va _owner
.Pq Vt str
An ownership specification passed to
.Xr chown 8
after the specified
.Xr md 4
device
.Ar X
has been mounted.
Both the
.Xr md 4
device and the mount point will be changed.
.It Va mdconfig_md Ns Ao Ar X Ac Ns Va _perms
.Pq Vt str
A mode string passed to
.Xr chmod 1
after the specified
.Xr md 4
device
.Ar X
has been mounted.
Both the
.Xr md 4
device and the mount point will be changed.
.It Va mdconfig_md Ns Ao Ar X Ac Ns Va _files
.Pq Vt str
Files to be copied to the mount point of the
.Xr md 4
device
.Ar X
after it has been mounted.
.It Va mdconfig_md Ns Ao Ar X Ac Ns Va _cmd
.Pq Vt str
Command to execute after the specified
.Xr md 4
device
.Ar X
has been mounted.
Note that the command is passed to
.Ic eval
and that both
.Va _dev
and
.Va _mp
variables can be used to reference respectively the
.Xr md 4
device and the mount point.
Assuming that the
.Xr md 4
device is
.Li md0 ,
one could set the following:
.Bd -literal
mdconfig_md0_cmd="tar xfzC /var/file.tgz \e${_mp}"
.Ed
.It Va autobridge_interfaces
.Pq Vt str
Set to the list of bridge interfaces that will have newly arriving interfaces
checked against to be automatically added.
If not set to
.Dq Li NO
then for each whitespace separated
.Ar element
in the value, a
.Va autobridge_ Ns Aq Ar element
variable is assumed to exist which has a whitespace separated list of interface
names to match, these names can use wildcards.
For example:
.Bd -literal
autobridge_interfaces="bridge0"
autobridge_bridge0="tap* dc0 vlan[345]"
.Ed
.It Va mixer_enable
.Pq Vt bool
If set to
.Dq Li YES ,
enable support for sound mixer.
.It Va hcsecd_enable
.Pq Vt bool
If set to
.Dq Li YES ,
enable Bluetooth security daemon.
.It Va hcsecd_config
.Pq Vt str
Configuration file for
.Xr hcsecd 8 .
Default
.Pa /etc/bluetooth/hcsecd.conf .
.It Va sdpd_enable
.Pq Vt bool
If set to
.Dq Li YES ,
enable Bluetooth Service Discovery Protocol daemon.
.It Va sdpd_control
.Pq Vt str
Path to
.Xr sdpd 8
control socket.
Default
.Pa /var/run/sdp .
.It Va sdpd_groupname
.Pq Vt str
Sets
.Xr sdpd 8
group to run as after it initializes.
Default
.Dq Li nobody .
.It Va sdpd_username
.Pq Vt str
Sets
.Xr sdpd 8
user to run as after it initializes.
Default
.Dq Li nobody .
.It Va bthidd_enable
.Pq Vt bool
If set to
.Dq Li YES ,
enable Bluetooth Human Interface Device daemon.
.It Va bthidd_config
.Pq Vt str
Configuration file for
.Xr bthidd 8 .
Default
.Pa /etc/bluetooth/bthidd.conf .
.It Va bthidd_hids
.Pq Vt str
Path to a file, where
.Xr bthidd 8
will store information about known HID devices.
Default
.Pa /var/db/bthidd.hids .
.It Va rfcomm_pppd_server_enable
.Pq Vt bool
If set to
.Dq Li YES ,
enable Bluetooth RFCOMM PPP wrapper daemon.
.It Va rfcomm_pppd_server_profile
.Pq Vt str
The name of the profile to use from
.Pa /etc/ppp/ppp.conf .
Multiple profiles can be specified here.
Also used to specify per-profile overrides.
When the profile name contains any of the characters
.Dq Li .-/+
they are translated to
.Dq Li _
for the proposes of the override variable names.
.It Va rfcomm_pppd_server_ Ns Ao Ar profile Ac Ns _bdaddr
.Pq Vt str
Overrides local address to listen on.
By default
.Xr rfcomm_pppd 8
will listen on
.Dq Li ANY
address.
The address can be specified as BD_ADDR or name.
.It Va rfcomm_pppd_server_ Ns Ao Ar profile Ac Ns _channel
.Pq Vt str
Overrides local RFCOMM channel to listen on.
By default
.Xr rfcomm_pppd 8
will listen on RFCOMM channel 1.
Must set properly if multiple profiles used in the same time.
.It Va rfcomm_pppd_server_ Ns Ao Ar profile Ac Ns _register_sp
.Pq Vt bool
Tells
.Xr rfcomm_pppd 8
if it should register Serial Port service on the specified RFCOMM channel.
Default
.Dq Li NO .
.It Va rfcomm_pppd_server_ Ns Ao Ar profile Ac Ns _register_dun
.Pq Vt bool
Tells
.Xr rfcomm_pppd 8
if it should register Dial-Up Networking service on the specified
RFCOMM channel.
Default
.Dq Li NO .
.It Va ubthidhci_enable
.Pq Vt bool
If set to
.Dq Li YES ,
change the USB Bluetooth controller from HID mode to HCI mode.
You also need to specify the location of USB Bluetooth controller with the
.Va ubthidhci_busnum
and
.Va ubthidhci_addr
variables.
.It Va ubthidhci_busnum
Bus number where the USB Bluetooth controller is located.
Check the output of
.Xr usbconfig 8
on your system to find this information.
.It Va ubthidhci_addr
Bus address of the USB Bluetooth controller.
Check the output of
.Xr usbconfig 8
on your system to find this information.
.It Va utx_enable
.Pq Vt bool
Set to
.Dq Li YES
to enable user accounting through the
.Xr utx 8
facility.
.It Va netwait_enable
.Pq Vt bool
If set to
.Dq Li YES ,
delays the start of network-reliant services until
.Va netwait_if
is up and ICMP packets to a destination defined in
.Va netwait_ip
are flowing.
Link state is examined first, followed by
.Dq Li pinging
an IP address to verify network usability.
If no destination can be reached or timeouts are exceeded,
network services are started anyway with no guarantee that
the network is usable.
Use of this variable requires both
.Va netwait_ip
and
.Va netwait_if
to be set.
.It Va netwait_ip
.Pq Vt str
Empty by default.
This variable contains a space-delimited list of IP addresses to
.Xr ping 8 .
DNS hostnames should not be used as resolution is not guaranteed
to be functional at this point.
If multiple IP addresses are specified,
each will be tried until one is successful or the list is exhausted.
.It Va netwait_timeout
.Pq Vt int
Indicates the total number of seconds to perform a
.Dq Li ping
against each IP address in
.Va netwait_ip ,
at a rate of one ping per second.
If any of the pings are successful,
full network connectivity is considered reliable.
The default is 60.
.It Va netwait_if
.Pq Vt str
Empty by default.
Defines the name of the network interface on which watch for link.
.Xr ifconfig 8
is used to monitor the interface, looking for
.Dq Li status: no carrier .
Once gone, the link is considered up.
This can be a
.Xr vlan 4
interface if desired.
.It Va netwait_if_timeout
.Pq Vt int
Defines the total number of seconds to wait for link to become usable,
polled at a 1-second interval.
The default is 30.
.It Va rctl_enable
.Pq Vt bool
If set to
.Dq Li YES ,
load
.Xr rctl 8
rules from the defined ruleset.
The kernel must be built with
.Cd "options RACCT"
and
.Cd "options RCTL" .
.It Va rctl_rules
.Pq Vt str
Set to
.Pa /etc/rctl.conf
by default.
This variables contains the
.Xr rctl.conf 5
ruleset to load for
.Xr rctl 8 .
.It Va iovctl_files
.Pq Vt str
A space-separated list of configuration files used by
.Xr iovctl 8 .
The default value is an empty string.
.It Va autofs_enable
.Pq Vt bool
If set to
.Dq Li YES ,
start the
.Xr automount 8
utility and the
.Xr automountd 8
and
.Xr autounmountd 8
daemons at boot time.
.It Va automount_flags
.Pq Vt str
If
.Va autofs_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr automount 8
program.
By default no flags are passed.
.It Va automountd_flags
.Pq Vt str
If
.Va autofs_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr automountd 8
daemon.
By default no flags are passed.
.It Va autounmountd_flags
.Pq Vt str
If
.Va autofs_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr autounmountd 8
daemon.
By default no flags are passed.
.It Va ctld_enable
.Pq Vt bool
If set to
.Dq Li YES ,
start the
.Xr ctld 8
daemon at boot time.
.It Va iscsid_enable
.Pq Vt bool
If set to
.Dq Li YES ,
start the
.Xr iscsid 8
daemon at boot time.
.It Va iscsictl_enable
.Pq Vt bool
If set to
.Dq Li YES ,
start the
.Xr iscsictl 8
utility at boot time.
.It Va iscsictl_flags
.Pq Vt str
If
.Va iscsictl_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr iscsictl 8
program.
The default is
.Dq Li -Aa ,
which configures sessions based on the
.Pa /etc/iscsi.conf
configuration file.
.It Va cfumass_enable
.Pq Vt bool
If set to
.Dq Li YES ,
create and export an USB LUN using
.Xr cfumass 4
at boot time.
.It Va cfumass_dir
.Pq Vt str
The directory where the files exported by USB LUN are located.
The default directory is
.Pa /var/cfumass .
.It Va service_delete_empty
.Pq Vt bool
If set to
.Dq Li YES ,
.Ql Li service delete
removes empty
.Dq Li rc.conf.d
files.
.It Va zfs_bootonce_activate
.Pq Vt bool
If set to
.Dq Li YES ,
and a boot environment marked bootonce is successfully booted,
it will be made permanently active.
.It Va zfskeys_enable
.Pq Vt bool
If set to
.Dq Li YES ,
enable auto-loading of encryption keys for encrypted ZFS datasets.
For every dataset the script will first load the appropriate encryption key
and then attempt to unlock the dataset.
.Pp
The script operates only on datasets which are encrypted with
ZFS native encryption
and have a ZFS
.Dq Li keylocation
dataset property beginning with
.Dq Li file:// .
.It Va zfskeys_datasets
.Pq Vt str
A whitespace-separated list of ZFS datasets to unlock.
The list is empty by default,
which means that the script will attempt to unlock all datasets.
.It Va zfskeys_timeout
.Pq Vt int
Define the total number of seconds to wait for the zfskeys script
to unlock an encrypted dataset.
The default is 10.
.It Va sendmail_enable
.Pq Vt str
If set to
.Dq Li YES ,
run the
.Xr sendmail 8
daemon at system boot time.
If set to
.Dq Li NO ,
do not run a
.Xr sendmail 8
daemon to listen for incoming network mail.
This does not preclude a
.Xr sendmail 8
daemon listening on the SMTP port of the loopback interface.
The
.Dq Li NONE
option sets each
.Va sendmail_enable ,
.Va sendmail_submit_enable ,
.Va sendmail_outbound_enable ,
.Va sendmail_msp_queue_enable
to
.Dq Li NO .
.It Va sendmail_cert_create
.Pq Vt str
If
.Va sendmail_enable
is set to
.Dq Li YES ,
create a signed certificate
.Pa /etc/mail/certs/host.cert
representing
.Pa /etc/mail/certs/host.key
by the CA certificate in
.Pa /etc/mail/certs/cacert.pem .
This will enable connecting hosts to negotiate STARTTLS allowing incoming
email to be encrypted in transit.
.Xr sendmail 8
needs to be configured to use these generated files.
The default configuration in
.Pa /etc/mail/freebsd.mc
has the required options in it.
.It Va sendmail_cert_cn
.Pq Vt str
If
.Va sendmail_enable
is set to
.Dq Li YES
and
.Va sendmail_cert_create
is set to
.Dq Li YES ,
this is the Common Name (CN) of the certificate that will be created.
If
.Va sendmail_cert_cn
is not set, the system's hostname will be used.
If there is no hostname set,
.Dq Li amnesiac
will be used.
.It Va sendmail_flags
.Pq Vt str
If
.Va sendmail_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr sendmail 8
daemon.
.It Va sendmail_submit_enable
.Pq Vt bool
If set to
.Dq Li YES
and
.Va sendmail_enable
is set to
.Dq Li NO ,
run
.Xr sendmail 8
using
.Va sendmail_submit_flags
instead of
.Va sendmail_flags .
This is intended to allow local mail submission via
a localhost-only listening SMTP service required for running
.Xr sendmail 8
as a non-set-user-ID binary.
Note that this does not work inside
.Xr jail 2
systems, as jails do not allow binding to just the localhost interface.
.It Va sendmail_submit_flags
.Pq Vt str
If
.Va sendmail_enable
is set to
.Dq Li NO
and
.Va sendmail_submit_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr sendmail 8
daemon.
.It Va sendmail_outbound_enable
.Pq Vt bool
If set to
.Dq Li YES
and both
.Va sendmail_enable
and
.Va sendmail_submit_enable
are set to
.Dq Li NO ,
run
.Xr sendmail 8
using
.Va sendmail_outbound_flags
instead of
.Va sendmail_flags .
This is intended to allow local mail queue management
for systems that do not offer a listening SMTP service.
.It Va sendmail_outbound_flags
.Pq Vt str
If both
.Va sendmail_enable
and
.Va sendmail_submit_enable
are set to
.Dq Li NO
and
.Va sendmail_outbound_enable
is set to
.Dq Li YES ,
these are the flags to pass to the
.Xr sendmail 8
daemon.
.It Va sendmail_msp_queue_enable
.Pq Vt bool
If set to
.Dq Li YES ,
start a client (MSP) queue runner
.Xr sendmail 8
daemon at system boot time.
As of sendmail 8.12, a separate queue is used for command line
submissions.
The client queue runner ensures that nothing is
left behind in the submission queue.
.It Va sendmail_msp_queue_flags
.Pq Vt str
If
.Va sendmail_msp_queue_enable
is set to
daemon.
.Dq Li YES ,
these are the flags to pass to the
.Xr sendmail 8
.El
.Sh FILES
.Bl -tag -width "/etc/defaults/rc.conf" -compact
.It Pa /etc/defaults/rc.conf
.It Pa /etc/defaults/vendor.conf
.It Pa /etc/rc.conf
.It Pa /etc/rc.conf.local
.It Pa /etc/rc.conf.d/
.El
.Sh SEE ALSO
.Xr chmod 1 ,
.Xr cpuset 1 ,
.Xr gdb 1 Pq Pa ports/devel/gdb ,
.Xr kbdcontrol 1 ,
.Xr limits 1 ,
.Xr protect 1 ,
.Xr sh 1 ,
.Xr umask 1 ,
.Xr uuidgen 1 ,
.Xr vi 1 ,
.Xr vidcontrol 1 ,
.Xr bridge 4 ,
.Xr dummynet 4 ,
.Xr ip 4 ,
.Xr ipf 4 ,
.Xr ipfw 4 ,
.Xr ipnat 4 ,
.Xr kld 4 ,
.Xr pf 4 ,
.Xr pflog 4 ,
.Xr pfsync 4 ,
.Xr tcp 4 ,
.Xr udp 4 ,
.Xr exports 5 ,
.Xr fstab 5 ,
.Xr ipf 5 ,
.Xr ipnat 5 ,
.Xr jail.conf 5 ,
.Xr loader.conf 5 ,
.Xr login.conf 5 ,
.Xr motd 5 ,
.Xr newsyslog.conf 5 ,
.Xr pf.conf 5 ,
.Xr firewall 7 ,
.Xr growfs 7 ,
.Xr security 7 ,
.Xr tuning 7 ,
.Xr accton 8 ,
.Xr apm 8 ,
.Xr bsdinstall 8 ,
.Xr bthidd 8 ,
.Xr chkprintcap 8 ,
.Xr chown 8 ,
.Xr cron 8 ,
.Xr devfs 8 ,
.Xr dhclient 8 ,
.Xr ftpd 8 ,
.Xr geli 8 ,
.Xr hcsecd 8 ,
.Xr ifconfig 8 ,
.Xr inetd 8 ,
.Xr iovctl 8 ,
.Xr ipf 8 ,
.Xr ipfw 8 ,
.Xr ipnat 8 ,
.Xr jail 8 ,
.Xr kldxref 8 ,
.Xr loader 8 ,
.Xr lpd 8 ,
.Xr makewhatis 8 ,
.Xr mdconfig 8 ,
.Xr mdmfs 8 ,
.Xr mixer 8 ,
.Xr mountd 8 ,
.Xr moused 8 ,
.Xr newfs 8 ,
.Xr newsyslog 8 ,
.Xr nfsd 8 ,
.Xr ntpd 8 ,
.Xr ntpdate 8 ,
.Xr pfctl 8 ,
.Xr pflogd 8 ,
.Xr ping 8 ,
.Xr powerd 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8 ,
.Xr rc 8 ,
.Xr rc.subr 8 ,
.Xr rcorder 8 ,
.Xr rfcomm_pppd 8 ,
.Xr route 8 ,
.Xr route6d 8 ,
.Xr routed 8 ,
.Xr rpc.lockd 8 ,
.Xr rpc.statd 8 ,
.Xr rpc.tlsclntd 8 ,
.Xr rpc.tlsservd 8 ,
.Xr rpcbind 8 ,
.Xr rwhod 8 ,
.Xr savecore 8 ,
.Xr sdpd 8 ,
.Xr sendmail 8 ,
.Xr service 8 ,
.Xr sshd 8 ,
.Xr swapon 8 ,
.Xr sysctl 8 ,
.Xr syslogd 8 ,
.Xr sysrc 8 ,
.Xr unbound 8 ,
.Xr usbconfig 8 ,
.Xr utx 8 ,
.Xr wlandebug 8 ,
.Xr yp 8 ,
.Xr ypbind 8 ,
.Xr ypserv 8 ,
.Xr ypset 8
.Sh HISTORY
The
.Nm
file appeared in
.Fx 2.2.2 .
.Sh AUTHORS
.An Jordan K. Hubbard .
