melkorbsd/ru-freebsd-man/man5/rctl.conf (1).5
.\" Copyright (c) 2011 Edward Tomasz Napierala
.\" Copyright (c) 1999 Chris Costello <chris@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 14, 2011
.Dt RCTL.CONF 5
.Os
.Sh имя
.Nm rctl.conf
.Nd ограничения ресурсов базы данных по умолчанию
.Sh описание

.Pa /etc/rctl.conf
файл считывается, когда система переходит в многопользовательский режим, 
чтобы установить содержимое базы данных RCTL по умолчанию.
.Pa /etc/rctl.conf
находится в формате
.Xr rctl 8
команды, т.е.\&
.Bd -literal -offset indent
тема:идентификатор темы:ресурс:действие=сумма/за
.Ed
.Pp
Комментарии обозначаются символом
.Dq #
в начале строки.
Комментарии также могут располагаться в конце строки, 
как показано на рисунке
.Sx примеры
раздел, приведенный ниже.
.Sh FILES
.Bl -tag -width /etc/rctl.conf -compact
.It Pa /etc/rctl.conf
Начальные настройки для
.Xr rctl 8 .
.El
.Sh примеры
Чтобы ограничить количество процессов для пользователей в классе входа в систему "тестирование", 
используйте правило типа
.Bd -literal -offset indent
# Resource limits for the "testing" class.
класс входа:тестирование:nproc:запретить=100/пользователь # At most 100 processes per user
.Ed
.Sh смотрите также
.Xr rctl 8
.Sh история

.Nm
файл появился в
.Fx 9.0 .
