melkorbsd/ru-freebsd-man/man5/regdomain (1).5
.\" Copyright (c) 2008 Sam Leffler, Errno Consulting
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd April 13, 2008
.Dt REGDOMAIN 5
.Os
.Sh имя
.Nm regdomain.xml
.Nd "Нормативные определения беспроводной связи стандарта 802.11"
.Sh описание

.Nm
в файле описываются правила эксплуатации беспроводных радиостанций стандарта IEEE 802.11.
.Pp
Эта информация используется компанией
.Xr ifconfig 8
программа для построения нормативного состояния для загрузки в систему.
Этот файл следует изменять только для отражения изменений в нормативных актах.
.Sh файлы
.Bl -tag -width /etc/regdomain.xml -compact
.It Pa /etc/regdomain.xml
XML-база данных нормативных ограничений стандарта 802.11
.El
.Sh смотрите также
.Xr wlan 4 ,
.Xr ifconfig 8
