melkorbsd/ru-freebsd-man/man5/remote.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)remote.5	8.1 (Berkeley) 6/5/93
.\"
.Dd October 20, 2003
.Dt REMOTE 5
.Os
.Sh ИМЯ
.Nm удаленный
.Nd файл описания удаленного хоста
.Sh ОПИСАНИЕ
Системы, известные по
.Xr tip 1
и их атрибуты хранятся в
.Tn ASCII
файл, 
структура которого чем-то напоминает структуру
.Xr 5
файла.
Каждая строка в файле содержит описание одной
.Em системы .
Поля разделяются двоеточием (``:'').
Строки, заканчивающиеся символом \e и следующей за ним новой строкой, 
продолжаются на следующей строке.
.Pp
Первая запись - это имя хост-системы. Если для системы существует более одного имени, 
имена разделяются вертикальными 
полосами.
После названия системы идут поля описания.
Имя поля, за которым следует знак`=' указывает на строковое значение.
Имя поля, за которым следует знак `#'  указывает на числовое значение.
.Pp
Записи с именами  ``tip*'' and ``cu*'' используются в качестве записей по умолчанию
.Xr tip 1 ,
и
.Xr cu 1
интерфейс к
.Nm совет ,
следующим образом.
Когда
.Nm совет
вызывается только с помощью номера телефона, он ищет запись
в форме ``tip300'', где 300 - это скорость передачи данных, с
которой должно быть установлено соединение.
Когда
.Nm cu
используется интерфейс, используются записи формы ``cu300'' 
.Sh возможности
Возможностями являются либо строки, либо числа, либо логические
флаги.
Строковая возможность задается с помощью
.Em возможность Ns Ar = Ns Em value ;
например, ``dv=/dev/harris''.
Числовая возможность задается с помощью
.Em возможность Ns Ar # Ns Em value ;
например, ``xa#99''.
Логическая возможность задается простым перечислением этой возможности.
.Bl -tag -width indent
.It Cm \&at
(строка)
Тип устройства автоматического вызова.
.It Cm \&br
(число)
Скорость передачи данных (бит в секунду), 
используемая для передачи данных по последовательному порту.
При использовании модема скорость передачи данных, используемая для связи с удаленным модемом, 
может отличаться от этой скорости.
Это десятичное число.
Скорость передачи данных по умолчанию составляет 115200 бит в секунду.
.It Cm \&cm
(строка)
Первоначальное сообщение о подключении, которое должно быть отправлено на удаленный хост.
Например, если доступ к хосту осуществляется через селектор портов, 
для этого может быть установлена соответствующая последовательность, необходимая для переключения на хост.
.It Cm \&cu
(строка)
Вызывная единица при выполнении телефонного звонка.
Значение по умолчанию такое же, как и в поле `dv".
.It Cm \&di
(строка)
Сообщение об отключении, отправляемое на хост, когда пользователь 
запрашивает отключение.
.It Cm \&du
(флаг )
Этот хост находится на коммутируемой линии.
.It Cm \&dv
(строка)
.Ux
устройство необходимо открыть для установления соединения.
Если этот файл ссылается на конечную строку,
.Xr tip 1
пытается выполнить эксклюзивное открытие устройства, чтобы гарантировать, 
что только один пользователь одновременно имеет доступ к порту.
.It Cm \&el
(строка)
символы, обозначающие конец строки.
Значение по умолчанию равно
.Dv НУЛЮ .
`~' побеги 
распознаются только
.Nm tip
после одного из символов `el', или после возврата каретки.
.It Cm \&fs
(строка)
Размер кадра для передачи данных.
Размер кадра по умолчанию равен
.Dv BUFSIZ .
.It Cm \&hd
(флаг)
Хост использует полудуплексную связь, должно быть выполнено локальное эхо-сообщение.
.It Cm \&ie
(строка)
Введите метки конца файла.
Значение по умолчанию равно
.Dv НУЛЮ .
.It Cm \&oe
(строка)
Выведите строку конца файла.
Значение по умолчанию равно
.Dv НУЛЮ .
Когда
.Nm совет
заключается в передаче файла, эта 
строка отправляется в конце файла.
.It Cm \&pa
(строка)
Тип контроля четности, используемый 
при отправке данных на хост.
Это может быть одним из ``even'',
``odd'', ``none'', ``zero'' (всегда устанавливайте бит 8 равным нулю),
``one'' (всегда устанавливайте значение бита с 8 на 1).
По умолчанию используется четный паритет.
.It Cm \&pn
(строка)
Телефонный номер этого хоста.
Если поле номера телефона содержит @ знак,
.Nm подсказка
выполняет поиск по файлу
.Pa /и т.д./телефоны
файл со списком телефонных номеров (см.
.Xr раздел телефоны 5 ).
.It Cm \&tc
(строка)
Указывает, что список возможностей продолжается в именованном
описании.
Это используется в первую очередь для обмена информацией об общих возможностях.
.El
.Sh ФАЙЛЫ
.Bl -tag -width /etc/remote -compact
.It Pa /etc/remote

.Nm
файл описания хоста находится в
.Pa /etc .
.El
.Sh ПРИМЕРЫ
Вот краткий пример, демонстрирующий использование функции продолжения работы.
Он определяет модемное соединение 56000 на первом последовательном порту в 115200
бит в секунду, без четности, используя набор команд Hayes со стандартным
редактированием строк и символами конца файла.
Запись arpavax включает в себя все, что содержится в записи UNIX-57600, а также
номер телефона для arpavax (в данном случае символ @, чтобы он
был получен из среды).
.Bd -literal
UNIX-57600:\e
:dv=/dev/cuau0:el=^D^U^C^S^Q^O@:oe=^D:du:at=hayes:br#115200:pa=none:
arpavax|ax:\e
:pn=\e@:tc=UNIX-57600
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr cu 1 ,
.Xr tip 1 ,
.Xr phones 5
.Sh ИСТОРИЯ

.Nm
формат файла появился в
.Bx 4.2 .
.Sh ОШИБКИ

.Xr tip 1
утилита использует свое собственное представление о скорости передачи данных по последовательным портам, а не
системное значение по умолчанию для последовательного порта.
