melkorbsd/ru-freebsd-man/man5/resolv.conf.5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)resolver.5	8.1 (Berkeley) 6/5/93
.\"
.Dd 23 Ноября, 2022
.Dt РАСПОЗНАВАТЕЛЬ 5
.Os
.Sh ИМЯ
.Nm распознаватель
.Nd файл конфигурации распознавателя
.Sh КРАТКИЙ ОБЗОР
.Nm resolv.conf
.Sh ОПИСАНИЕ
Параметр
.Xr распознаватель 3
является набором подпрограмм в библиотеке C, 
которые предоставляют доступ к системе доменных имен Интернета.
Файл конфигурации распознавателя содержит информацию, которая считывается
подпрограммами распознавателя при первом их вызове процессом.
Файл предназначен для чтения человеком и содержит список
ключевых слов со значениями, которые предоставляют различные типы информации о распознавателе.
.Pp
В нормально настроенной системе установка этого файла вручную не должна
быть необходимой.
Единственный сервер(серверы) имен, к которому(которым) будет выполнен запрос, будет находиться на локальном компьютере
или автоматически настроен с использованием DHCP или аналогичного механизма,
доменное имя определяется по имени хоста,
а путь поиска домена строится по имени домена.
.Pp
Существуют различные варианты конфигурации:
.Bl -tag -width nameserver
.It Sy nameserver
IPv4 or IPv6 адрес сервера имен, 
который должен запросить распознаватель.
Вплоть до
.Dv MAXNS
(3 в настоящее время) могут быть указаны серверы имен,
по одному для каждого ключевого слова.
Если серверов несколько,
библиотека распознавателя запрашивает их в указанном порядке.
Если нет
.Sy nameserver
записи присутствуют,
по умолчанию используется сервер имен на локальном компьютере.
(Используемый алгоритм заключается в том, чтобы попробовать сервер имен, и если время выполнения запроса истекло,
попробуйте следующий, пока не закончатся серверы имен,
затем повторите попытку на всех серверах имен, 
пока не будет сделано максимальное количество повторных попыток).
.It Sy domain
Имя локального домена.
В большинстве запросов на имена в этом домене могут использоваться короткие имена, 
относящиеся к локальному домену.
Если нет, то
.Sy domain
запись присутствует, домен определяется
по имени локального хоста, возвращаемому к
.Xr gethostname 3 ;
доменной частью считается все, что находится после первой
.Ql \&. .
Наконец, если имя хоста не содержит доменной части, предполагается, что это корневой
домен.
.It Sy search
Список поиска для поиска по имени хоста.
Список поиска обычно определяется по имени локального домена;
по умолчанию он содержит только имя локального домена.
Это можно изменить, указав желаемый путь поиска по домену, 
следующий за ключевым словом
.Sy search
с пробелами или символами табуляции, разделяющими
имена.
Большинство запросов распознавателя будут выполняться с использованием каждого компонента
пути поиска по очереди, пока не будет найдено совпадение.
Обратите внимание, что этот процесс может быть медленным и приведет к возникновению большого сетевого
трафика, если серверы для перечисленных доменов не являются локальными,
и что время ожидания запросов будет ограничено, если сервер
для одного из доменов недоступен.
.Pp
В настоящее время список поиска ограничен шестью доменами
общей длиной 256 символов.
.It Sy sortlist
Список сортировки позволяет сортировать адреса, возвращаемые с помощью gethostbyname.
Список сортировки определяется по парам сетевых масок IP-адресов.
Если маска сети не указана,
по умолчанию используется историческая маска сети класса A/B/C.;
это использование устарело.
Пары IP-адресов
и сетей разделяются косой чертой.
Можно указать до 10 пар.
.
E.g.,
.Pp
.Dl "sortlist 10.9.1.0/255.255.240.0 10.9.0.0/255.255.0.0"
.It Sy options
параметр Options позволяет изменять некоторые внутренние переменные распознавателя.
Синтаксис следующий
.Pp
\fBoptions\fP \fIoption\fP \fI...\fP
.Pp
где параметр
.Sy option
является одним из следующих:
.Bl -tag -width no_tld_query
.It Sy debug
комплекты
.Dv RES_DEBUG
in _res.options.
.It Sy usevc
комплекты
.Dv RES_USEVC
используется TCP вместо UDP для запросов.
.It Sy ndots : Ns Ar n
устанавливает пороговое значение для количества точек, которые должны присутствовать в имени, присвоенном
.Fn res_query
(см. раздел
.Xr resolver 3 )
прежде чем
.Em 
будет выполнен первоначальный абсолютный запрос.
Значение по умолчанию для
.Em n
будет
.Dq 1 ,
это означает, что если в имени есть какие-либо точки, то это имя
будет опробовано сначала как абсолютное имя, а затем как любое другое.
.Em к нему добавляются 
элементы списка поиска.
.It Sy timeout : Ns Ar n
устанавливает начальное время, в течение которого распознаватель будет ожидать
ответа от удаленного
сервера имен, прежде чем повторить запрос через другой сервер имен.
Распознаватель может ожидать дольше при последующих попытках
выполнения текущего запроса, поскольку к значению тайм-аута применяется экспоненциальное
замедление.
Значение по умолчанию измеряется в секундах.
.Dv RES_TIMEOUT ,
допустимый максимум составляет
.Dv RES_MAXRETRANS
(см. раздел
.In resolv.h ) .
.It Sy attempts : Ns Ar n
задает количество раз, когда распознаватель отправит запрос на каждый из
своих серверов имен, 
прежде чем прекратить работу и вернуть сообщение об ошибке вызывающему приложению.
По умолчанию используется
.Dv RES_DFLRETRY ,
допустимый максимум составляет
.Dv RES_MAXRETRY
(см. раздел
.In resolv.h ) .
.It Sy no_tld_query
указывает программе распознавания не пытаться разрешить доменное имя верхнего уровня, то есть имя, 
не содержащее точек.
Использование этого параметра не мешает
программе распознавания выполнять стандартные
парметр
.Sy domain
и параметр
.Sy search
руководит с данным именем.
.It Sy reload-period : Ns Ar n
Распознаватель проверяет время изменения
.Pa /etc/resolv.conf
каждую
.Ar n
секунду.
Если путь
.Pa /etc/resolv.conf
если что-то изменилось, оно автоматически перезагружается.
Значение по умолчанию для
.Ar n
это займет две секунды.
Установка значения на ноль отключает проверку файла.
.El
.Pp
Параметры также могут быть указаны в виде списка, разделенного пробелом или табуляцией, с помощью
.Dv RES_OPTIONS
переменная среды.
.El
.Pp
Ключевые слова
.Sy domain
и 
.Sy search
являются взаимоисключающими.
Если присутствует более одного экземпляра этих ключевых слов,
последний экземпляр будет переопределять.
.Pp
Ключевое слово и значение должны располагаться в одной строке, а ключевое слово
.Pq например, Sy nameserver
должно начинать строку.
Значение следует за ключевым словом, разделенным пробелом.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/resolv.conf -compact
.It Pa /etc/resolv.conf
Файл
.Nm resolv.conf
находится в
.Pa /etc .
.El
.Sh ПРИМЕРЫ
Базовый файл resolv.conf может иметь следующий вид
.Bd -literal -offset indent
# Директива domain необходима только в том случае, если ваш локальный
# маршрутизатор рекламирует что-то вроде localdomain, и у вас есть
# настройте свои имена хостов через внешний домен.
домен localdomain.tld

# В случае, если у вас запущен локальный dns-сервер или кэширующий сервер имен
# таким образом как local-unbound(8), например.
nameserver 127.0.0.1

# IP-адрес локальной службы имен или интернет-провайдера
nameserver 192.168.2.1

# Резервные серверы имен, в данном случае от Google.
nameserver 8.8.8.8
nameserver 4.4.4.4

# Прикрепите псевдо-RR OPT для расширения EDNS0,
# как указано в RFC 2671.
options edns0
.Ed
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr gethostbyname 3 ,
.Xr resolver 3 ,
.Xr hostname 7 ,
.Xr resolvconf 8
.Sh ИСТОРИЯ
Формат файла
.Nm resolv.conf
появился в
.Bx 4.3 .
