melkorbsd/ru-freebsd-man/man5/resolver (2).5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)resolver.5	8.1 (Berkeley) 6/5/93
.\"
.Dd November 23, 2022
.Dt RESOLVER 5
.Os
.Sh имя
.Nm распознаватель
.Nd файл конфигурации распознавателя
.Sh краткий обзор
.Nm resolv.conf
.Sh описание

.Xr распознаватель 3
is a set of routines in the C library
представляет собой набор подпрограмм в библиотеке C, которые предоставляют доступ к системе доменных имен Интернета.
Файл конфигурации распознавателя содержит информацию, 
которая считывается подпрограммами распознавателя при первом их вызове процессом.
Файл предназначен для чтения человеком и содержит список ключевых слов со значениями, 
которые предоставляют различные типы информации о распознавателе.
.Pp
В нормально настроенной системе установка этого файла вручную не должна быть необходимой.
Единственный сервер (серверы) имен, 
к которому(которым) будет выполнен запрос, 
будет находиться на локальном компьютере 
или автоматически настроен с использованием DHCP или аналогичного механизма, 
доменное имя определяется по имени хоста, а путь поиска домена строится по имени домена.
.Pp
Существуют различные варианты конфигурации:
.Bl -tag -width nameserver
.It Sy сервер имен
IPv4 или IPv6-адрес сервера имен
который должен запросить распознаватель.
Вплоть до
.Dv MAXNS
(в настоящее время может быть указано 3) сервера имен,
по одному для каждого ключевого слова.
Если серверов несколько,
библиотека распознавателя запрашивает их в указанном порядке.
Если нет
.Sy сервер имен
записи присутствуют, 
по умолчанию используется сервер имен на локальном компьютере.
(Используемый алгоритм заключается в том, 
чтобы попробовать сервер имен, и если время выполнения запроса истекло, 
попробуйте следующий, пока не закончатся серверы имен, затем повторите попытку на всех серверах имен, 
ока не будет сделано максимальное количество повторных попыток).
.It Sy домен
Имя локального домена.
В большинстве запросов на имена в этом домене могут использоваться короткие имена,
относящиеся к локальному домену.
Если нет
.Sy домена
то запись присутствует, домен определяется
по имени локального хоста, возвращаемому
.Xr gethostname 3 ;
доменной частью считается все, что находится после первой
.Ql \&. .
Наконец, если имя хоста не содержит доменной части, предполагается, что это корневой
домен.
.It Sy поиск
Список поиска для поиска по имени хоста.
Список поиска обычно определяется по имени локального домена;
по умолчанию он содержит только имя локального домена.
Это можно изменить, указав желаемый путь поиска по домену
следующий 
.Sy поиск
ключевое слово с пробелами или символами табуляции, разделяющими
имена.
Большинство запросов распознавателя будут выполняться с использованием каждого компонента
пути поиска по очереди, пока не будет найдено совпадение.
Обратите внимание, что этот процесс может быть медленным и приведет к возникновению большого сетевого
трафика, если серверы для перечисленных доменов не являются локальными,
и что время ожидания запросов будет ограничено, если сервер
для одного из доменов недоступен.
.Pp
В настоящее время список поиска ограничен шестью доменами
общей длиной 256 символов.
.It Sy список сортировки
Список сортировки позволяет сортировать адреса, возвращаемые gethostbyname.
Список сортировки определяется по парам сетевых масок IP-адресов.
Если маска сети не указана,
по умолчанию используется историческая маска сети класса A/B/C.;
этот способ использования устарел.
Пары IP-адресов
и сетей разделены 
косой чертой.
Можно указать до 10 пар.
E.g.,
.Pp
.Dl "sortlist 10.9.1.0/255.255.240.0 10.9.0.0/255.255.0.0"
.It Sy опции
Options позволяет изменять некоторые внутренние переменные распознавателя.
Синтаксис следующий
.Pp
\fBoptions\fP \fIoption\fP \fI...\fP
.Pp
где
.Sy вариант
является одним из следующих:
.Bl -tag -width no_tld_query
.It Sy отладочные 
наборы
.Dv RES_DEBUG
in _res.options.
.It Sy используйте
наборы vc
.Dv RES_USEVC
использовать TCP вместо UDP для запросов.
.It Sy ndots : Ns Ar n
устанавливает пороговое значение для количества точек, которые должны присутствовать в имени, заданном для
.Fn повторного запроса
(смотрите 
.Xr разделитель 3 )
перед запуском
.Em будет выполнен первоначальный
абсолютный запрос.
Значение по умолчанию для
.Em n
означает,
.Dq 1 ,
что если в имени есть какие-либо точки,
то сначала оно будет опробовано как абсолютное имя, прежде
.Em к нему добавляются 
элементы списка поиска.
.It Sy время ожидания : Ns Ar n
устанавливает начальное время, в течение которого распознаватель будет ожидать
ответа от удаленного
сервера имен, прежде чем повторить запрос через другой сервер имен.
Распознаватель может ждать дольше при последующих попытках
выполнения текущего запроса, поскольку к значению тайм-аута применяется экспоненциальное
замедление.
Измеряется в секундах, по умолчанию используется
.Dv время ожидания RES ,
максимально допустимое
.Dv значение - RES MAX для повторной передачи
(см.
.In  раздел разрешение h ) .
.It Sy attempts : Ns Ar n
устанавливает количество раз, когда распознаватель отправит запрос на каждый из
своих серверов имен,
прежде чем прекратить работу и вернуть сообщение об ошибке вызывающему приложению.
Значение по умолчанию -
.Dv RES_DFLRETRY ,
допустимый максимум -
.Dv RES_MAXRETRY
(см.
.In разрешение h ) .
.It Sy no_tld_query
указывает распознавателю не пытаться разрешить доменное имя верхнего уровня, то
есть имя, которое не содержит точек.
Использование этой опции не мешает
распознавателю соблюдать стандартные
.Sy правила домена
и
.Sy поиска
по заданному имени.
.It Sy период перезарядки : Ns Ar n
Распознаватель проверяет время изменения
файла
.Pa /etc/resolv.conf
каждый раз
.Ar n
секунд.
Если
файл
.Pa /etc/resolv.conf
изменился, он автоматически перезагружается.
Значение по умолчанию для
.Ar n
равно двум секундам.
Установка этого значения на ноль отключает проверку файла.
.El
.Pp
Параметры также могут быть указаны в виде списка, разделенного пробелом или табуляцией, с помощью
.Dv RES_OPTIONS
переменной окружения
.El
.Pp

.Sy Домен
и ключевые слова для 
.Sy  поиска
являются взаимоисключающими.
Если присутствует более одного экземпляра этих ключевых слов,
то последний экземпляр будет переопределен.
.Pp
Ключевое слово и значение должны располагаться в одной строке, а ключевое слово,
.Pq for  например, Sy  сервер имен
должно начинаться со строки.
Значение следует за ключевым словом, разделенным пробелом.
.Sh файлы
.Bl -tag -width /etc/resolv.conf -compact
.It Pa /etc/resolv.conf
Файл
.Nm resolv.conf
находится в файле
.Pa /etc .
.El
.Sh примеры
Базовый файл resolv.conf может иметь следующий вид.
.Bd -literal -offset indent
# Директива domain необходима только в том случае,
# если ваш локальный маршрутизатор рекламирует что-то вроде localdomain и вы
# настроили свое имя хоста через внешний домен.
domain localdomain.tld

# В случае, если у вас запущен локальный dns-сервер или кэширующий сервер имен
# например, local-unbound(8).
доменных имен интернет-провайдера 127.0.0.1

# IP-адрес локального сервера имен или сервера имен службы
доменных имен интернет-провайдера 192.168.2.1

# Резервные серверы имен, в данном случае от Google.
доменных имен интернет-провайдера 8.8.8.8
доменных имен интернет-провайдера 4.4.4.4

# Добавьте псевдорекламу OPT для расширения EDNS0,
# как указано в RFC 2671.
options edns0
.Ed
.Sh смотрите также
.Xr gethostbyname 3 ,
.Xr resolver 3 ,
.Xr hostname 7 ,
.Xr resolvconf 8
.Sh история

.Nm resolv.conf
формат файла появился в
.Bx 4.3 .
