melkorbsd/ru-freebsd-man/man5/resolvconf.conf.5
.\" Copyright (c) 2009-2016 Roy Marples
.\" All rights reserved
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 8, 2019
.Dt RESOLVCONF.CONF 5
.Os
.Sh ИМЯ
.Nm resolvconf.conf
.Nd resolvconf файл конфигурации
.Sh ОПИСАНИЕ
.Nm
это конфигурационный файл для
.Xr resolvconf 8 .
Файл
.Nm
представляет собой сценарий оболочки, исходящий из
.Xr resolvconf 8 ,
что означает, что
файл .
.Nm
должен содержать допустимые команды оболочки.
Ниже перечислены стандартные переменные 
.Nm
которые могут быть установлены.
Если значения содержат пробелы, подстановочные знаки или другие специальные символы оболочки,
убедитесь, что они заключены в кавычки и экранированы правильно.
Смотрите
.Sy replace
переменные для примера при цитировании.
.\"?
.Pp
После обновления этого файла вы, возможно, захотите запустить
.Nm resolvconf -u
чтобы применить новую конфигурацию.
.Pp
При добавлении динамически сгенерированного списка в качестве предисловия к нему весь
список становится уникальным, где выигрывает тот, который остался крайним.
.Sh ОПЦИИ RESOLVCONF
.Bl -tag -width indent
.It Sy resolvconf
Установите значение NO, чтобы отключить
.Nm resolvconf
от запуска любых подписчиков.
По умолчанию установлено значение "YES".
.It Sy interface_order
Эти интерфейсы всегда будут обрабатываться в первую очередь.
Если параметр не установлен, по умолчанию используется следующее значение:-
.Bd -compact -literal -offset indent
lo lo[0-9]*
.Ed
.It Sy dynamic_order
Эти интерфейсы будут обработаны следующими, если только у них нет метрики.
Если параметр не задан, по умолчанию используется следующее:-
.Bd -compact -literal -offset indent
tap[0-9]* tun[0-9]* ng[0-9]* vpn vpn[0-9]* ppp[0-9]* ippp[0-9]*
.Ed
.It Sy inclusive_interfaces
Игнорируйте любую эксклюзивную маркировку для этих интерфейсов.
Это удобно, когда сторонние интеграции принудительно используют параметр
.Nm resolvconf -x
и вы хотите легко отключить его..
.It Sy local_nameservers
Если параметр не установлен, по умолчанию используется следующее значение:-
.Bd -compact -literal -offset indent
127.* 0.0.0.0 255.255.255.255 ::1
.Ed
.It Sy search_domains
Предварительное добавление поисковых доменов в динамически генерируемый список.
.It Sy search_domains_append
Добавление поисковых доменов в динамически генерируемый список.
.It Sy domain_blacklist
Список доменов, которые необходимо исключить из рассмотрения.
Чтобы удалить домен, вы можете использовать команду foo.*
Чтобы удалить поддомен, вы можете использовать *.bar
.It Sy name_servers
Предварительное добавление серверов имен в динамически создаваемый список.
Если вы используете локальный сервер имен, отличный от libc, вам следует установить значение 127.0.0.1
.
.It Sy name_servers_append
Добавьте серверы имен в динамически генерируемый список.
.It Sy name_server_blacklist
Список серверов имен, которые необходимо исключить из рассмотрения.
Значение по умолчанию равно 0.0.0.0, поскольку некоторые неисправные маршрутизаторы отправляют его через DHCP.
Чтобы удалить блокировку, вы можете использовать 192.168.*
.It Sy private_interfaces
Эти серверы имен интерфейсов будут запрашиваться только для доменов, перечисленных
в их разрешении.conf.
Полезно для доменов VPN.
Установка
.Sy private_interfaces Ns ="*"
остановит переадресацию корневой зоны и позволит локальному распознавателю
рекурсивно запрашивать корневые серверы напрямую.
Требуется локальный сервер имен, отличный от libc.
Это эквивалентно параметру
.Nm resolvconf -p .
.It Sy public_interfaces
Сделайте эти интерфейсы общедоступными, переопределив приватную маркировку.
Это удобно, когда сторонние интеграции принудительно используют параметр
.Nm resolvconf -p
и вы хотите легко отключить его.
.It Sy replace
Представляет собой разделенный пробелом список ключевых слов-заменителей.
Синтаксис такой:
.Va $keyword Ns / Ns Va $match Ns / Ns Va $replacement
.Pp
Например, учитывая этот файл resolv.conf:
.Bd -compact -literal -offset indent
domain foo.org
search foo.org dead.beef
nameserver 1.2.3.4
nameserver 2.3.4.5
.Ed
и эту конфигурацию:
.Bd -compact -literal -offset indent
replace="search/foo*/bar.com"
replace="$replace nameserver/1.2.3.4/5.6.7.8"
replace="$replace nameserver/2.3.4.5/"
.Ed
вместо этого вы бы получили этот файл resolv.conf:
.Bd -compact -literal -offset indent
domain foo.org
search bar.com
nameserver 5.6.7.8
.Ed
.It Sy replace_sub
Работает так же, как и
.Sy replace
за исключением того, что он работает с каждым значением, разделенным пробелом, а не со всей строкой, поэтому он полезен для замены одного домена в директиве поиска.
Используя тот же пример resolv.conf и изменив
.Sy replace
на 
.Sy replace_sub ,
вместо этого вы бы получили этот файл resolv.conf:
.Bd -compact -literal -offset indent
domain foo.org
search bar.com dead.beef
nameserver 5.6.7.8
.Ed
.It Sy state_dir
Переопределить каталог состояний по умолчанию для
.Pa /var/run/resolvconf .
Это не должно изменяться после использования
.Nm resolvconf
если только старый каталог не будет скопирован в новый.
.El
.Sh LIBC OPTIONS
Следующие переменные напрямую влияют
на:-
.Xr resolv.conf 5
.Bl -tag -width indent
.It Sy resolv_conf
По умолчанию используется значение
.Pa /etc/resolv.conf
если такое не установлено.
.It Sy resolv_conf_options
Список параметров распознавателя libc, как указано в
.Xr resolv.conf 5 .
.It Sy resolv_conf_passthrough
При установке значения YES последний файл resolv.conf записывается в файл
.Sy resolv_conf
без каких-либо изменений.
Если установлено значение /dev/null или NULL,
.Sy resolv_conf_local_only
по умолчанию принимается значение NO,
.Sy local_nameservers
не задается, если не переопределена, и только информация, заданная в
.Nm
записывается в
.Sy resolv_conf .
.It Sy resolv_conf_sortlist
Сортировочный список libc-резольвера, как указано в файле
.Xr resolv.conf 5 .
.It Sy resolv_conf_local_only
Если настроен локальный сервер имен, то по умолчанию нужно указать только его
и игнорировать все остальные записи, поскольку они будут настроены для локального
сервера имен.
Установите значение NO, чтобы также перечислить нелокальные серверы имен.
Это обеспечит работоспособность DNS, даже если локальный сервер имен перестанет функционировать
за счет дублирования запросов к серверу.
.It Sy append_nameservers
Добавляет серверы имен в динамически создаваемый список.
.It Sy prepend_nameservers
Предварительно добавляет серверы имен в динамически формируемый список.
.It Sy append_search
Добавляет поисковые домены в динамически формируемый список.
.It Sy prepend_search
Добавляет поисковые домены в динамически формируемый список.
.El
.Sh ОПЦИИ АБОНЕНТА
openresolv поставляется с подписчиками для серверов имен
.Xr dnsmasq 8 ,
.Xr named 8 ,
.Xr pdnsd 8 ,
.Xr pdns_recursor 8 ,
и
.Xr unbound 8 .
Каждый абонент может создавать конфигурационные файлы, которые должны быть включены в
в основной конфигурационный файл абонента.
.Pp
Чтобы отключить абонента, просто установите для его имени значение NO.
Например, чтобы отключить абонента libc, нужно установить:
.Bd -compact -literal -offset indent
libc=NO
.Ed
.Bl -tag -width indent
.It Sy dnsmasq_conf
Этот файл указывает dnsmasq, какие серверы имен использовать для определенных доменов.
.It Sy dnsmasq_resolv
Этот файл указывает dnsmasq, какие серверы имен использовать для глобального поиска.
.Pp
Пример resolvconf.conf для dnsmasq:
.Bd -compact -literal -offset indent
name_servers=127.0.0.1
dnsmasq_conf=/etc/dnsmasq-conf.conf
dnsmasq_resolv=/etc/dnsmasq-resolv.conf
.Ed
.Pp
Пример dnsmasq.conf:
.Bd -compact -literal -offset indent
listen-address=127.0.0.1
# Если dnsmasq скомпилирован для DBus, то мы можем воспользоваться
# реимуществом отсутствия необходимости перезапускать dnsmasq.
enable-dbus
conf-file=/etc/dnsmasq-conf.conf
resolv-file=/etc/dnsmasq-resolv.conf
.Ed
.It Sy named_options
Включите этот файл в блок опций named.
Этот файл указывает named, какие серверы имен использовать для глобального поиска.
.It Sy named_zones
Включите этот файл в глобальную область видимости named после блока options.
Этот файл указывает named, какие серверы имен использовать для определенных доменов.
.Pp
Пример resolvconf.conf для named:
.Bd -compact -literal -offset indent
name_servers=127.0.0.1
named_options=/etc/named-options.conf
named_zones=/etc/named-zones.conf
.Ed
.Pp
Example named.conf:
.Bd -compact -literal -offset indent
options {
	listen-on { 127.0.0.1; };
	include "/etc/named-options.conf";
};

include "/etc/named-zones.conf";
.Ed
.It Sy pdnsd_conf
Это основной файл конфигурации pdnsd, который мы изменяем, чтобы добавить наши
пересылаемые домены.
Если эта переменная не установлена, то мы полагаемся на файл конфигурации pdnsd
чтобы прочитать
.Pa pdnsd_resolv
как указано ниже.
.It Sy pdnsd_resolv
Этот файл сообщает pdnsd о глобальных серверах имен.
Если эта переменная не установлена, то информация записывается в
.Pa pdnsd_conf .
.Pp
Пример resolvconf.conf для pdnsd:
.Bd -compact -literal -offset indent
name_servers=127.0.0.1
pdnsd_conf=/etc/pdnsd.conf
# pdnsd_resolv=/etc/pdnsd-resolv.conf
.Ed
.Pp
Пример pdnsd.conf:
.Bd -compact -literal -offset indent
global {
	server_ip = 127.0.0.1;
	status_ctl = on;
}
server {
	# A server definition is required, even if empty.
	label="empty";
	proxy_only=on;
	# file="/etc/pdnsd-resolv.conf";
}
.Ed
.It Sy pdns_zones
Этот файл сообщает pdns_recursor о конкретных и глобальных серверах имен.
.Pp
Пример resolvconf.conf для pdns_recursor:
.Bd -compact -literal -offset indent
name_servers=127.0.0.1
pdns_zones=/etc/pdns/recursor-zones.conf
.Ed
.Pp
Пример recursor.conf:
.Bd -compact -literal -offset indent
allow-from=127.0.0.0/8, ::1/128
forward-zones-file=/etc/pdns/recursor-zones.conf
.Ed
.It Sy unbound_conf
Этот файл сообщает unbound о специфических и глобальных серверах имен.
.It Sy unbound_insecure
Если установлено значение YES, unbound помечает домены как небезопасные, игнорируя DNSSEC.
.Pp
Пример resolvconf.conf для unbound:
.Bd -compact -literal -offset indent
name_servers=127.0.0.1
unbound_conf=/etc/unbound-resolvconf.conf
.Ed
.Pp
Пример unbound.conf:
.Bd -compact -literal -offset indent
include: /etc/unbound-resolvconf.conf
.Ed
.El
.Sh ИНТЕГРАЦИЯ АБОНЕНТОВ
Не все дистрибутивы хранят нужные подписчикам файлы в одних и тех же
местах.
Например, сценарии именованных служб называются named, bind и rc.bind
и они могут находиться в каталоге /etc/rc.d, /etc/init.d или
аналогичном.
Каждый подписчик пытается автоматически настроить себя, но не каждый
но не каждый дистрибутив имеет такую возможность.
Кроме того, пользователи могут захотеть использовать версию, отличную от той.
установленной по умолчанию, например bind8 и bind9.
Чтобы учесть это, подписчики содержат эти файлы в настраиваемых
переменные, которые описаны ниже.
.Bl -tag -width indent
.It Sy dnsmasq_service
Имя службы dnsmasq.
.It Sy dnsmasq_restart
Команда для перезапуска службы dnsmasq.
.It Sy dnsmasq_pid
Расположение файла dnsmasq pid.
.It Sy libc_service
Имя службы libc.
.It Sy libc_restart
Команда для перезапуска службы libc.
.It Sy named_service
Имя именованной службы.
.It Sy named_restart
Команда для перезапуска названной службы.
.It Sy pdnsd_restart
Команда для перезапуска службы pdnsd.
.It Sy pdns_service
Команда для перезапуска службы pdns_recursor.
.It Sy pdns_restart
Команда для перезапуска службы pdns_recursor.
.It Sy unbound_service
Имя несвязанной службы..
.It Sy unbound_restart
Команда для перезапуска несвязанной службы.
.It Sy unbound_pid
Расположение несвязанного pid-файла.
.El
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr sh 1 ,
.Xr resolv.conf 5 ,
.Xr resolvconf 8
.Sh АВТОРЫ
.An Roy Marples Aq Mt roy@marples.name
.Sh ОШИБКИ
Каждый дистрибутив - особая снежинка и любит называть одну и ту же вещь
по-разному, а именно именованный служебный скрипт.
.Pp
Пожалуйста, сообщите о них по адресу
.Lk http://roy.marples.name/projects/openresolv
