melkorbsd/ru-freebsd-man/man5/rhosts.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 25 декабря, 2013
.Dt HOSTS.EQUIV 5
.Os
.Sh ИМЯ
.Nm hosts.equiv ,
.Nm .rhosts
.Nd база данных доверенного удаленного хоста и имени пользователя
.Sh ОПИСАНИЕ
The
.Nm
and
.Nm .rhosts
файлы содержат информацию о
доверенных хостах и пользователях в сети.
Для каждого хоста должна быть выделена отдельная строка
со следующей информацией:
.Pp
простое
.Bd -unfilled -offset indent
имя хоста [username]
.Ed
.Pp
или более многословное имя хоста
.Bd -unfilled -offset indent
[+-][hostname|@netgroup] [[+-][username|@netgroup]]
.Ed
.Pp
A
.Dq @
указывает хост по сетевой группе или пользователя 
по сетевой группе.
Единица соответствует 
.Dq +
всем хостам или пользователям.
Имя хоста, начинающееся с 
.Dq -
будет отклонять
все подходящие хосты и всех их пользователей.
Имя пользователя с ведущим параметром
.Dq -
будет отклонять всех подходящих пользователей с подходящих хостов..
.Pp
Элементы разделяются любым количеством пробелов и/или
символов табуляции.
Параметр
.Dq #
указывает начало
комментария; символы до конца строки
не интерпретируются подпрограммами, выполняющими поиск в файле.
.Pp
Имена хостов указываются в обычных интернет-DNS
доменах с точечным отображением
.Dq .\&
(dot) обозначение с использованием порядка
.Xr inet_addr 3
из библиотеки манипулирования интернет-адресами,
.Xr inet 3 .
Имена хостов могут содержать любой печатаемый
символ, отличный от разделителя полей,
символа новой строки или комментария.
.Pp
В целях безопасности пользовательский файл
.Nm .rhosts
будет проигнорирован, если он не является обычным файлом, или если он
не принадлежит пользователю, или
если он доступен для записи кем-либо, кроме пользователя.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/hosts.equivxxx -compact
.It Pa /etc/hosts.equiv
Файл
.Nm
находится в
.Pa /etc .
.It Pa $HOME/.rhosts
файл
.Nm .rhosts
находится в
.Pa $HOME .
.El
.Sh ПРИМЕРЫ
.Dl bar.com foo
.Pp
Доверенный пользователь
.Dq foo
с хоста
.Dq bar.com .
.Pp
.Dl +@allclient
.Pp
Доверяется всем хостам из netgroup
.Dq allclient .
.Pp
.Dl +@allclient -@dau
.Pp
Доверяется всем хостам из netgroup
.Dq allclient
и их пользователям, 
за исключением пользователей из netgroup
.Dq dau .
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr rcp 1 ,
.Xr gethostbyname 3 ,
.Xr inet 3 ,
.Xr innetgr 3 ,
.Xr ruserok 3 ,
.Xr netgroup 5 ,
.Xr ifconfig 8 ,
.Xr yp 8
.Sh ОШИБКИ
Эта страница руководства является неполной.
Для получения дополнительной информации ознакомьтесь
с источником по
.Pa src/lib/libc/net/rcmd.c
или на странице руководства SunOS.
