melkorbsd/ru-freebsd-man/man5/rpc (1).5
.\" $NetBSD: rpc.5,v 1.3 2000/06/15 20:05:54 fvdl Exp $
.\" @(#)rpc.4 1.17 93/08/30 SMI; from SVr4
.\" Copyright 1989 AT&T
.Dd December 10, 1991
.Dt RPC 5
.Os
.Sh ИМЯ
.Nm rpc
.Nd база данных номеров программ rpc
.Sh краткий обзор
.Pa /etc/rpc
.Sh описание
.Nm
Файл содержит читаемые пользователем имена, которые
может использоваться вместо номеров программ RPC.
Для каждой программы RPC должна присутствовать одна строка
со следующей информацией:
.Pp
.Bl -enum -compact
.It
название программы RPC
.It
Номер программы RPC
.It
псевдонимы
.El
.Pp
Элементы разделяются любым количеством пробелов и/или
символы табуляции.
Хэш
.Pq Dq Li #
указывает на начало комментария; персонажи до конца
строка не интерпретируется процедурами, выполняющими поиск в файле.
.Sh FILES
.Bl -tag -width /etc/nsswitch.conf -compact
.It Pa /etc/nsswitch.conf
.El
.Sh EXAMPLES
Ниже приведен пример базы данных RPC:
.Bd -literal
#
#	rpc
#
rpcbind		100000	portmap	sunrpc portmapper
rusersd		100002	rusers
nfs		100003	nfsprog
mountd		100005	mount	showmount
walld		100008	rwall	shutdown
sprayd		100012	spray
llockmgr	100020
nlockmgr	100021
status		100024
bootparam	100026
keyserv		100029	keyserver
.Ed
.Sh SEE ALSO
.Xr getrpcent 3
