melkorbsd/ru-freebsd-man/man5/rrenumd_conf.5
.\"	$KAME: rrenumd.conf.5,v 1.8 2001/02/06 02:17:23 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 5, 1998
.Dt RRENUMD.CONF 5
.Os
.Sh ИМЯ
.\"
.Nm rrenumd.conf
.Nd файл конфигурации для демона перенумерации маршрутизатора
.\"
.Sh ОПИСАНИЕ
Конфигурационный файл rrenumd описывает, как пакет перенумерации маршрутизатора
должен быть построен и в какие пункты назначения его следует отправить.
Этот файл состоит из последовательности операторов, заканчивающейся точкой с запятой («;»).
Заявления состоят из токенов
разделены пробелом, который может представлять собой любую комбинацию пробелов и табуляции
и новые строки.
Такая структура упрощает идентификацию
части конфигурации, связанные друг с другом.
Строки, начинающиеся с
.Ql #
являются комментариями.
.\"
.Sh Meta Syntax
Ключевые слова и специальные символы, которые точно ожидает синтаксический анализатор,
отображается с помощью
.Ic bold
шрифта.
Параметры указываются с
.Ar underline .
Параметры, показанные в
квадратные скобки (`[' и `]') используются для отображения необязательных
ключевые слова и параметры.
Вертикальная черта (`|') используется для обозначения
между выбором необязательных параметров.
Фигурные скобки (`{' и
`}') используются для группировки ключевых слов и параметров, когда это необходимо.
.\"
.Sh Спецификация интерфейса
Есть некоторые операторы, которые могут или должны указывать интерфейс.
Интерфейсы указываются в форме «единицы имени», например
.Ar lo0
и
.Ar ep1 .
.\"
.Sh Заявления о конфигурации
.Bl -tag -width Ds
.\"
.It Ic debug on|off ;
Включает отладку анализатора файла конфигурации.
Если
.Ic on
указано,
тогда отладка включена,
Если установлен флажок 
.Ic выкл.
отладка 
отключена.
По умолчанию он отключен.
.\"
.It Ic dest Ar dest-list Op Ar retrycmd ;
Указывает места назначения, по которым должны отправляться сообщения о перенумерации маршрутизатора.
отправил.
.Ar dest-list
может быть любой комбинацией одного или нескольких числовых адресов IPv6,
или полные квалифицированные доменные имена.
.Ar retrycmd
имеет следующий синтаксис.
.\"
.Bl -tag -width Ds
.It Ic повторите попытку 
.Ar повтора-кол-во повторов-число
указывает, сколько сообщений о перенумерации маршрутизатора отправляется повторно.
.El
.It Op Ic add|change|setglobal
.Cm match-prefix Ar match-prefix-val
.Bk -words
.Op /match-prefix-len
.Ek
.Bk -words
.Op Cm maxlen Ar maxlen-val
.Ek
.Bk -words
.Op Cm minlen Ar minlen-val
.Ek
.Bk -words
.Op Cm use-prefix Ar use-prefix-val
.Ek
.Bk -words
.Op /use-prefix-len
.Ek
.Bk -words
.Op Cm keeplen Ar keeplen-val
.Ek
.Bk -words
.Op Ar use-prefix-values ;
.Ek
.Pp
Указывает содержимое отправляемого сообщения о перенумерации маршрутизатора с порядковым номером 0.
Если
.Cm add|change|setglobal
не указано, то
.Cm add
предполагается.
.Ar use-prefix-values
имеет следующий синтаксис.
.Pp
{
.Op Cm vltime Ar vltime-val
.Bk -words
.Op Cm pltime Ar pltime-val
.Ek
.Bk -words
.Op Cm raf_onlink Cm on|off
.Ek
.Bk -words
.Op Cm raf_auto Cm on|off
.Ek
.Bk -words
.Op Cm rrf_decrprefd Cm on|off
.Ek
.Bk -words
.Op Cm rrf_decrvalid Cm on|off
.Ek
}
.Pp
Каждое значение имеет следующее значение.
.Pp
.Bl -tag -width Ds -compact
.It Cm match-prefix Ar match-prefix-val Op /match-prefix-len
Укажите
.Ar match-prefix-val
который используется для сопоставления с заранее назначенными префиксами, к которым
.Cm add|change|setglobal
должна быть применена команда.
.Ar /match-prefix-len
Укажите начальную часть
.Ar match-prefix-val
будет использоваться для сопоставления с заранее назначенными префиксами в виде десятичного битового номера.
.It Cm maxlen Ar maxlen-val
Укажите максимальную длину префиксов, которую разрешено использовать,
соответствующую 
.Ar match-prefix-val ,
как десятичное битовое число.
.It Cm minlen Ar minlen-val
Укажите минимальную длину префиксов, которая может соответствовать
.Ar match-prefix-val ,
десятичному битовому числу.
.It Cm use-prefix Ar use-prefix-val Op /usr-prefix-len
Укажите
.Ar use-prefix-val
который используется для добавления префиксов
.Cm add|change|setglobal
по команде.
.Ar /use-prefix-len
Укажите начальную часть 
.Ar use-prefix-val
скопированных в начальную часть префиксов, добавляемых по
.Cm add|change|setglobal
команде, в виде десятичного битового номера..
.It Cm keeplen Ar keeplen-val
Укажите среднюю часть
.Ar use-prefix-val
рядом с начальной частью, указанной в виде 
.Ar use-prefix-len ,
десятичного битового номера.
Непрерывные биты располагаются в одной битовой позиции существующего префикса.
сочетается с
.Ar match-prefix-val
Сопоставленный с копируется в ту же битовую позицию добавляемых префиксов копируется в ту же битовую позицию добавляемых префиксов.
.It Cm vltime Ar vmtime-val
Назначьте 
.Ar time
в качестве префикса допустимое время жизни добавляемого префикса.
Допустимое значение для
.Ar time
десятичное число секунд или специальный формат, например «d00h00m00s00»,
где 00 может принимать любое десятичное число, а «d» означает дни, «h» означает часы,
«м» означает минуты, «с» означает секунды.
И альтернативно, специальное ключевое слово
Также можно указать «бесконечность».
.It Cm pltime Ar pltime-val
Назначьте 
.Ar time
в качестве префикса предпочтительное время жизни добавляемого префикса.
Допустимое значение для
.Ar time
то же самое, что и для
.Ar vltime-val .
.It Cm raf_onlink Cm on|off
Пусть добавляемый префикс будет иметь характер on-link или off-link.
для назначенного интерфейса.
Если
.Cm on
указан, префикс имеет внутриканальный характер
(например, \& префикс
принадлежат ссылке).
Если
.Cm off
указан, префикс имеет внеканальную природу
(например,\&
префикс не принадлежит ссылке).
.It Cm raf_auto Cm on|off
Включить или отключить автоконфигурацию автономного адреса.
для добавления префикса.
Если
.Cm on
указан, автоконфигурация автономного адреса включена
включено.
Если
.Cm off
указан, он отключен.
.It Cm rrf_decrprefd Cm on|off
Включите или отключите уменьшение pltime.
Если
.Cm on
указан, уменьшение pltime включено.
Если
.Cm off
указано, уменьшение pltime отключено.
.It Cm rrf_decrvalid Cm on|off
Включите или отключите уменьшение vltime.
Если
.Cm on
указан, уменьшение vltime включено.
Если
.Cm off
указано, уменьшение vltime отключено.
.El
.\"
.It seqnum Ar seqnum-val { Ar rrenum-cmd } ;
Указывает содержимое отправляемого сообщения о перенумерации маршрутизатора с некоторыми
конкретный порядковый номер.
Можно указать несколько таких операторов, если они
.Ar seqnum-val
отличаются друг от друга.
.Ar rrenum-cmd
имеет тот же синтаксис, что и приведенный выше оператор add|change|setglobal.
.El
.\"
.Sh EXAMPLES
Для каждого примера файла конфигурации, показанного ниже, мы предполагаем, что
каждая подсеть IPv6 имеет свой префикс, начинающийся с
fec0:0:0::/48 и со своим номером подсети.
(в этом случае,
номер подсети — это значение 7-го и 8-го октета префикса).
.Pp
Если вы хотите назначить префиксы, начинающиеся с 3ffe:501:ffff::/48
в каждую подсеть, то следующей конфигурации будет достаточно:
если каждый из ваших маршрутизаторов поддерживает многоадресную пересылку IPv6.
Номер подсети существующего префикса fec0:0:0::/48 и
вновь назначенный префикс 3ffe:501:ffff::/48 будет таким же.
.\"
.Bd -literal -offset indent
dest ff05::2;

add match-prefix fec0:0:0:: /48 use-prefix 3ffe:501:ffff:: /48 keeplen 16;
.Ed
.Pp
.\"
Если ваши маршрутизаторы не поддерживают многоадресную пересылку IPv6,
вам нужно будет указать каждый пункт назначения в
.Cm dest
по команде.
.\"
.Bd -literal -offset indent
dest fec0:0:0:1:260:8ff:fe24:fb3a fec0:0:0:2:200:eff:fe2e:dfe1 fec0:0:0:3:5254:ff:fedc:5217;

add match-prefix fec0:0:0:: /48 use-prefix 3ffe:501:ffff:: /48 keeplen 16;
.Ed
.Pp
.\"
If you are going to do renumbering, then following procedure will be natural.
.Bl -enum -offset indent
.It
Назначьте новый префикс.
.It
Установите время жизни старых префиксов для какого-либо подходящего перехода
период.
В следующем примере мы используем 1 неделю для действительных
время жизни и 0 для предпочтительного времени жизни.
Также включите истечение срока действия старого префикса.
(По умолчанию он статический и не имеет срока действия).
.It
После переходного периода старые префиксы должны стать
недействителен и, возможно, был удален.
Чтобы убедиться, что они удалены, отправьте новый маршрутизатор
сообщение о перенумерации, в котором старые префиксы указаны как соответствующие
префикс и неиспользуемый префикс.
.El
.Pp
.\"
Следующий файл конфигурации будет выполнять действия 1 и 2.
.\"
.Bd -literal -offset indent
dest ff05::2;

seqnum 0 {
	add match-prefix fec0:0:0:: /48 use-prefix 3ffe:501:fffe:: /48 keeplen 16;
	};

seqnum 1 {
	change match-prefix 3ffe:501:ffff:: /48 use-prefix 3ffe:501:ffff:: /48 keeplen 16 vltime d7 pltime 0 rrf_decrvalid on rrf_decrprefd on;
	};
.Ed
.Pp
.\"
И следующий файл конфигурации сделает 3
(должно быть
используется для отправки сообщения о перенумерации маршрутизатора через 1 неделю
позже).
.\"
.Bd -literal -offset indent
dest ff05::2;

change match-prefix 3ffe:501:ffff:: /48;
.Ed
.Pp
.\"
В приведенном выше примере только
.Cm add
и
.Cm change
используются команды, и нет примера для
.Cm setglobal
команды.
.Cm setglobal
команда почти такая же, как и
.Cm измените
команду, за исключением того, что она удаляет все предварительно определенные глобальные адреса IPv6.
.Sh SEE ALSO
.Xr prefix 8 ,
.Xr rrenumd 8
.Sh ИСТОРИЯ
.Nm
Файл конфигурации впервые появился в комплекте стека протоколов KAME IPv6.
.\" .Sh BUGS
.\" (to be written)
