melkorbsd/ru-freebsd-man/man5/rtadvd.conf.5
.\"	$KAME: rtadvd.conf.5,v 1.50 2005/01/14 05:30:59 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 4, 2011
.Dt RTADVD.CONF 5
.Os
.Sh ИМЯ
.Nm rtadvd.conf
.Nd конфигурационный файл для рекламного демона маршрутизатора
.Sh ОПИСАНИЕ
Этот файл описывает, как должны быть созданы рекламные пакеты маршрутизатора.
для каждого из интерфейсов.
.Pp
Как описано в
.Xr rtadvd 8 ,
вам вообще не нужно настраивать этот файл конфигурации,
если вам не нужны какие-то специальные конфигурации.
Вы можете даже опустить файл целиком.
В таких случаях
.Nm rtadvd
демон автоматически настроит себя, используя значения по умолчанию
указан в спецификации.
.Pp
Он подчиняется знаменитому
.Xr termcap 5
формату файла.
Каждая строка в файле описывает сетевой интерфейс.
Поля разделяются двоеточием
.Pq Sq \&: ,
и каждое поле содержит одно описание возможности.
Строки могут быть объединены
.Sq \e
символом.
Маркер комментария – это
.Sq \&#
символ.
.Sh ВОЗМОЖНОСТИ
Возможности описывают значение, которое необходимо ввести в маршрутизатор ICMPv6.
рекламные сообщения и для контроля
.Xr rtadvd 8
поведения.
Поэтому вам рекомендуется прочитать документы IETF по обнаружению соседей.
если вы хотите изменить пример файла конфигурации.
.Pp
Обратите внимание, что почти все элементы имеют значения по умолчанию.
Если вы опустите какой-либо элемент, будет использовано значение этого элемента по умолчанию.
.Pp
Есть два пункта, которые контролируют интервал отправки рекламных объявлений маршрутизатора.
Эти элементы можно опустить, тогда
.Nm rtadvd
будут использоваться значения по умолчанию.
.Bl -tag -width indent
.It Cm \&maxinterval
(num) Максимально допустимое время между отправкой нежелательных
многоадресная реклама маршрутизатора
.Pq единица измерения: секунды .
Значение по умолчанию — 600.
Его значение должно быть не менее 4 секунд.
и не более 1800 секунд.
.It Cm \&mininterval
(num) Минимальное время, допустимое между отправкой нежелательной многоадресной рассылки
реклама маршрутизатора
.Pq единица измерения: секунды .
Значение по умолчанию составляет одну треть значения
.Cm максимальный интервал .
Его значение должно быть не менее 3 секунд и не более 0,75*.
значение
.Cm максимальный интервал .
.El
.Pp
Следующие элементы предназначены для рекламного сообщения маршрутизатора ICMPv6.
заголовок.
Эти элементы можно опустить,
.Nm Демон объявления маршрутизатора
тогда будут использоваться значения по умолчанию.
.Bl -tag -width indent
.It Cm \&chlim
(num) Значение поля Cur Hop Limit.
Значение по умолчанию — 64.
.It Cm \&raflags
(str или num) 8-битное поле флагов в заголовке рекламного сообщения маршрутизатора.
Это поле можно указать либо как строку с учетом регистра, либо как
целое число.
Строка состоит из символов, каждый из которых соответствует
конкретный бит(ы) флага
Целое число должно быть логическим ИЛИ всех разрешенных битов.
Бит 7
.Po
.Li 'm' or 0x80
.Pc
означает бит флага конфигурации управляемого адреса,
и бит 6
.Po
.Li 'o' or 0x40
.Pc
означает другой бит флага конфигурации с отслеживанием состояния.
Бит 4
.Po
.Li 0x10
.Pc
и бит 3
.Po
.Li 0x08
.Pc
используются для кодирования предпочтений маршрутизатора.
Биты 01
.Po
or 'h'
.Pc
означает высокий, 00 означает средний, а 11
.Po
or 'l'
.Pc
значит низкий.
Биты 10 зарезервированы и не должны указываться.
Не существует символа, позволяющего явно указать предпочтение среды.
Значение по умолчанию всего флага — 0
.Po
или пустая строка,
.Pc
что означает отсутствие дополнительных
методы настройки и предпочтения среднего маршрутизатора.
.It Cm \&rltime
(num) Поле срока службы маршрутизатора
.Pq единица измерения: секунды .
Значение должно быть либо нулевым, либо находиться в пределах
значение
.Cm максимальный интервал
и 9000.
Когда
.Nm Демон объявления маршрутизатора
работает на хосте, это значение должно явно устанавливать 0 на всех
рекламные интерфейсы, как описано в
.Xr rtadvd 8 .
Значение по умолчанию — 1800.
.It Cm \&rtime
(num) Поле времени доступности
.Pq единица измерения: миллисекунды .
Значение по умолчанию — 0, что означает, что этот маршрутизатор не указан.
.It Cm \&retrans
(num) Поле таймера ретрансляции
.Pq единица измерения: миллисекунды .
Значение по умолчанию — 0, что означает, что этот маршрутизатор не указан.
.El
.Pp
Следующие элементы предназначены для опции информации о префиксе ICMPv6:
который будет прикреплен к заголовку объявления маршрутизатора.
Эти элементы можно опустить, тогда
.Nm Демон объявления маршрутизатора
автоматически получит соответствующие префиксы из таблицы маршрутизации ядра,
и объявите префиксы с параметрами по умолчанию.
Ключевые слова кроме
.Cm clockskew
и
.Cm noifprefix
может быть дополнен числом, например,
.Dq Li prefix2 ,
для указания нескольких префиксов.
.Bl -tag -width indent
.It Cm \&noifprefix
(bool) Указывает, что префикс сетевых интерфейсов не будет объявлен.
По умолчанию
.Nm Демон объявления маршрутизатора
автоматически собирает префиксы каналов со всех сетевых интерфейсов
и рекламируйте их.
.Cm noifprefix
отключает это поведение.
Если это указано и
.Cm addr
и ключевое слово не указано, опция информации о префиксе не будет включена в
сообщение.
.It Cm \&clockskew
(num) Сдвиг времени для регулировки задержек распространения канала и сдвига тактового сигнала.
между маршрутизаторами по каналу
.Pq единица измерения: секунды .
Это значение используется при проверке согласованности для локально настроенных и
объявленное время жизни префикса и имеет свое значение, когда локальный маршрутизатор
настраивает префикс для ссылки со временем жизни, которое уменьшается в
реальное время.
Если значение равно 0, это означает, что проверка согласованности будет пропущена
для таких префиксов.
Значение по умолчанию — 0.
.It Cm \&prefixlen
(num) Поле длины префикса.
Значение по умолчанию — 64.
.It Cm \&pinfoflags
(str или num) 8-битное поле флагов в опции информации о префиксе.
Это поле можно указать либо как строку с учетом регистра, либо как
целое число.
Строка состоит из символов, каждый из которых соответствует
конкретный бит(ы) флага.
Целое число должно быть логическим ИЛИ всех разрешенных битов.
Бит 7
.Po
.Li 'l' or 0x80
.Pc
означает бит флага подключения,
и бит 6
.Po
.Li 'a' or 0x40
.Pc
означает бит флага автономной конфигурации адреса.
Значение по умолчанию — «la» или 0xc0, т. е. установлены оба бита.
.It Cm \&addr
(str) Адрес, заполняемый в поле Префикс.
Поскольку
.Dq \&:
используется для
.Xr максимальный срок действия 5
для формата файла, а также числового адреса IPv6, поле ДОЛЖНО быть заключено в кавычки
символ двойной кавычки.
.It Cm \&vltime
(num) Допустимое поле срока действия
.Pq unit: seconds .
Значение по умолчанию — 2592000 (30 дней).
.It Cm \&vltimedecr
(bool) Этот элемент означает, что заявленное действительное время жизни будет уменьшаться.
в режиме реального времени, который по умолчанию отключен.
.It Cm \&pltime
(num) Поле предпочтительного срока действия
.Pq unit: seconds .
Значение по умолчанию — 604800 (7 дней).
.It Cm \&pltimedecr
(bool) Этот элемент означает, что объявленный предпочтительный срок службы будет уменьшаться.
в режиме реального времени, который по умолчанию отключен.
.El
.Pp
Следующий пункт предназначен для опции ICMPv6 MTU:
который будет прикреплен к заголовку объявления маршрутизатора.
Этот элемент можно опустить, тогда
.Nm rtadvd
будет использоваться значение по умолчанию.
.Bl -tag -width indent
.It Cm \&mtu
(num or str) Поле MTU (максимальная единица передачи).
Если указан 0, это означает, что опция не будет включена.
Значение по умолчанию — 0.
Если специальная строка
.Dq auto
указана для этого элемента, будет включена опция MTU и ее значение
будет автоматически установлено значение MTU интерфейса.
.El
.Pp
Следующий элемент управляет параметром адреса исходного канального уровня ICMPv6:
который будет прикреплен к заголовку объявления маршрутизатора.
Как отмечалось выше, вы можете просто опустить этот пункт, а затем
.Nm rtadvd
использовать значение по умолчанию.
.Bl -tag -width indent
.It Cm \&nolladdr
(bool) По умолчанию
.Po
if
.Cm \&nolladdr
не указано
.Pc ,
.Xr rtadvd 8
попытается получить адрес канального уровня для интерфейса из ядра,
и прикрепите его к опции исходного адреса канального уровня.
Если такая возможность существует,
.Xr rtadvd 8
опция адреса канального уровня источника не будет прикрепляться к
рекламные пакеты маршрутизатора.
.El
.Pp
Следующий элемент управляет опцией информации о домашнем агенте ICMPv6:
который был определен с поддержкой мобильного IPv6.
Он будет прикреплен к заголовку объявления маршрутизатора, как и другие параметры.
.Bl -tag -width indent
.It Cm \&hapref
Указывает предпочтение домашнего агента.
Если установлено ненулевое значение,
.Cm \&hatime
оно также должно присутствовать.
.It Cm \&hatime
(num) Указывает срок службы домашнего агента.
.El
.Pp
Когда включена поддержка мобильного IPv6,
.Xr rtadvd 8 ,
опция интервала объявления будет прикреплена к объявлению маршрутизатора.
пакет, настроив
.Cm \&maxinterval
явно.
.Pp
Следующие элементы предназначены для опции информации о маршруте ICMPv6:
который будет прикреплен к заголовку объявления маршрутизатора.
Эти элементы являются необязательными.
Каждый элемент может быть дополнен номером, например
.Dq Li rtplen2 ,
для указания нескольких маршрутов.
.Bl -tag -width indent
.It Cm \&rtprefix
(str) Префикс, заполняемый в поле «Префикс» опции информации о маршруте.
Поскольку
.Dq \&:
используется для
.Xr максимального срока действия 5
формата файла, а также числового адреса IPv6, поле ДОЛЖНО быть заключено в кавычки
символ двойной кавычки.
.It Cm \&rtplen
(num) Поле длины префикса в опции информации о маршруте.
Значение по умолчанию — 64.
.It Cm \&rtflags
(str or num) 8-битное поле флагов в опции информации о маршруте.
В настоящее время определены только значения предпочтений.
Обозначения те же, что и для поля raflags.
Бит 4
.Po
.Li 0x10
.Pc
и
Бит 3
.Po
.Li 0x08
.Pc
используются для кодирования предпочтений маршрута.
Значение по умолчанию — 0x00, т. е. средний уровень предпочтения.
.It Cm \&rtltime
(num) Поле срока действия маршрута в опции информации о маршруте.
.Pq единица измерения: секунды .
Поскольку спецификация не определяет значение по умолчанию для этого
элемент, значение этого элемента следует указать вручную.
Однако,
.Nm rtadvd
позволяет не указывать этот элемент и использует время жизни маршрутизатора
в качестве значения по умолчанию в таком случае, просто для совместимости с
старая версия программы.
.El
.Pp
В приведенном выше списке каждое ключевое слово, начинающееся с
.Dq Li rt
можно заменить на тот, который начинается с
.Dq Li rtr
по причине обратной совместимости.
Например,
.Cm rtrplen
принимается вместо
.Cm rtplen .
Однако ключевые слова, начинающиеся с
.Dq Li rtr
по сути устарели и больше не должны использоваться.
.Pp
Следующие элементы предназначены для опции рекурсивного DNS-сервера ICMPv6 и
Опция списка поиска DNS
.Pq RFC 6106 ,
который будет прикреплен к заголовку объявления маршрутизатора.
Эти элементы являются необязательными.
.Bl -tag -width indent
.It Cm \&rdnss
(str) IPv6-адрес одного или нескольких рекурсивных DNS-серверов.
Аргумент должен быть заключен в двойные кавычки.
Несколько DNS-серверов можно указать в строке, разделенной запятыми.
Если для разных серверов требуются разные времена жизни,
отдельные записи могут быть заданы с помощью
.Cm rdnss ,
.Cm rdnss0 ,
.Cm rdnss1 ,
.Cm rdnss2 ...
варианты с соответствующими
.Cm rdnssltime ,
.Cm rdnssltime0 ,
.Cm rdnssltime1 ,
.Cm rdnssltime2 ...
записями.
Обратите внимание, что максимальное количество серверов зависит от стороны получателя.
Смотрите также
.Xr resolver 5
страницу руководства по реализации преобразователя в
.Fx .
.It Cm \&rdnssltime
Время жизни
.Cm rdnss
записей DNS-сервера.
Значение по умолчанию — 3/2 времени интервала.
.It Cm \&dnssl
(str) Одно или несколько доменных имен в строке, разделенной запятыми.
Эти доменные имена будут использоваться при выполнении DNS-запросов на
неполное доменное имя.
Если для разных доменов требуются разные сроки существования, используйте отдельные записи.
можно дать с помощью
.Cm dnssl ,
.Cm dnssl0 ,
.Cm dnssl1 ,
.Cm dnssl2 ...
варианты с соответствующими
.Cm dnsslltime ,
.Cm dnsslltime0 ,
.Cm dnsslltime1 ,
.Cm dnsslltime2 ...
записями.
Обратите внимание, что максимальное количество имен зависит от стороны получателя.
Смотрите также
.Xr resolver 5
страница руководства по реализации преобразователя в
.Fx .
.It Cm \&dnsslltime
Время жизни
.Cm dnssl
Записи списка поиска DNS.
Значение по умолчанию — 3/2 интервала времени.
.El
.Pp
Вы также можете ссылаться на одну строку из другой, используя
.Cm tc
возможность.
Смотрите
.Xr termcap 5
для получения подробной информации о возможностях.
.Sh ПРИМЕРЫ
Как показано выше, все объявленные параметры имеют значения по умолчанию.
определены в спецификациях, и, следовательно, вам обычно не нужно их устанавливать.
вручную, если вам не нужны специальные значения, отличные от значений по умолчанию.
Это может вызвать проблемы совместимости, если вы используете плохо настроенный
параметр.
.Pp
Чтобы переопределить параметр конфигурации, вы можете указать только этот параметр.
При следующей конфигурации
.Xr rtadvd 8
переопределяет параметр срока службы маршрутизатора для
.Li ne0
интерфейса.
.Bd -literal -offset indent
ne0:\\
	:rltime#0:
.Ed
.Pp
В следующем примере вручную настраиваются префиксы, объявляемые из
.Li ef0
интерфейса.
Конфигурацию необходимо использовать с
.Fl s
с возможностью
.Xr rtadvd 8 .
.Bd -literal -offset indent
ef0:\\
	:addr="2001:db8:ffff:1000::":prefixlen#64:
.Ed
.Pp
В следующем примере настраивается
.Li wlan0
интерфейс и добавляет два DNS-сервера и параметры поиска домена DNS.
используя значения времени жизни опции по умолчанию.
.Bd -literal -offset indent
wlan0:\\
	:addr="2001:db8:ffff:1000::":prefixlen#64:\\
	:rdnss="2001:db8:ffff::10,2001:db8:ffff::2:43":\\
	:dnssl="example.com":
.Ed
.Pp
В следующем примере явно представлены значения по умолчанию.
Конфигурация предоставлена ​​только для справочных целей;
ВАМ ЭТО ВООБЩЕ НЕ НУЖНО.
.Bd -literal -offset indent
default:\\
	:chlim#64:raflags#0:rltime#1800:rtime#0:retrans#0:\\
	:pinfoflags="la":vltime#2592000:pltime#604800:mtu#0:
ef0:\\
	:addr="2001:db8:ffff:1000::":prefixlen#64:tc=default:
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr resolver 5 ,
.Xr termcap 5 ,
.Xr rtadvd 8 ,
.Xr rtsol 8
.Rs
.%A Thomas Narten
.%A Erik Nordmark
.%A W. A. Simpson
.%A Hesham Soliman
.%T Neighbor Discovery for IP version 6 (IPv6)
.%R RFC 4861
.Re
.Rs
.%A Thomas Narten
.%A Erik Nordmark
.%A W. A. Simpson
.%T Neighbor Discovery for IP version 6 (IPv6)
.%R RFC 2461 (obsoleted by RFC 4861)
.Re
.Rs
.%A Richard Draves
.%T Default Router Preferences and More-Specific Routes
.%R draft-ietf-ipngwg-router-selection-xx.txt
.Re
.Rs
.%A J. Jeong
.%A S. Park
.%A L. Beloeil
.%A S. Madanapalli
.%T IPv6 Router Advertisement Options for DNS Configuration
.%R RFC 6106
.Re
.Sh ИСТОРИЯ
.Xr rtadvd 8
И файл конфигурации
.Nm
впервые появился в наборе стека протоколов WIDE Hydrangea IPv6.
.\" .Sh ОШИБКИ
.\" (to be written)
