melkorbsd/ru-freebsd-man/man5/services.5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)services.5	8.1 (Berkeley) 6/5/93
.\"
.Dd April 4, 2010
.Dt SERVICES 5
.Os
.Sh NAME
.Nm services
.Nd база данных имен служб
.Sh DESCRIPTION
Файл
.Nm
содержит информацию об
известных службах в
Интернете.
Для каждой службы должна присутствовать одна строка,
содержащая следующую информацию:
.Bd -unfilled -offset indent
официальное имя службы
номер порта
имя протокола
псевдонимы
.Ed
.Pp
Элементы разделены любым количеством пробелов и/или символов табуляции.
Номер порта и протокола представлены как единый
.Em элемент ;
символ ``/'' используется для
разделения имени порта и протокола (например \& ``512/tcp'').
Символ ``#'' обозначает начало
комментария;  последующие символы до конца линии
не интерпретируются процедурами, выполняющими поиск файла.
.Pp
Имена служб могут содержать любые печатные
символы, отличные от резделителя полей, сивола новой строки
или символа комментария.
.Pp
Если
.Dq db
указан в качестве источника в файле
.Xr nsswitch.conf 5 ,
ищется файл
.Pa /var/db/services.db .
Базу данных в файле
.Pa /var/db/services.db
необходимо обновлять с помощью
.Xr services_mkdb 8
послю любых изменений в файле служб.
.Sh ВЗАИМОДЕЙСТВИЕ С NIS
Доступ к картам NIS через
.Pa services.byname
может быть включен добавлением одиночного символа ``+'' в отдельную строку
файла
.Pa /etc/services .
Это приведет к тому, что содержимое карт служб NIS будет вставлено
в то месть, где использован символ ``+''.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/services -compact
.It Pa /etc/services
Файл
.Nm
находится в
.Pa /etc .
.El
.Sh СМОТРИ ТАКЖЕ
.Xr getservent 3 ,
.Xr nsswitch.conf 5 ,
.Xr services_mkdb 8
.Sh ИСТОРИЯ
Формат файла
.Nm
появился в
.Bx 4.2 .
.Sh ПРОБЛЕМЫ
Рекомендуется использовать DNS-сервер вместо статического файла.
