melkorbsd/ru-freebsd-man/man5/smbfs (1).5
.\" Copyright (c) 2020 Gordon Bergling
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 6, 2022
.Dt SMBFS 5
.Os
.Sh ИМЯ
.Nm smbfs
.Nd "SMB FS"
.Sh краткий обзор
Чтобы скомпилировать этот драйвер в ядро,
поместите следующие строки в свой
файл конфигурации ядра:
.Bd -ragged -offset indent
.Cd "option NETSMB"
.Ed
.Pp
Альтернативно, можно загрузить драйвер как
модуль во время загрузки, поместите следующую строку в
.Xr loader.conf 5 :
.Bd -literal -offset indent
smbfs_load="YES"
.Ed
.Sh описание
Драйвер SMB является реализацией CIFS (Common Internet Filesystem).
сетевой протокол.
.Pp
.Bf -symbolic
.Nm
Драйвер файловой системы поддерживает только устаревший протокол SMBv1.
.Nm
имеющий известные ошибки и, вероятно, имеет уязвимости безопасности
.Nm
и аналоги в пользовательском пространстве
.Xr smbutil 1
и
.Xr mount_smbfs 8
может быть удален из будущей версии
.Fx .
Вместо этого пользователям рекомендуется оценить
.Pa sysutils/fusefs-smbnetfs
порт.
.Ef
.Sh смотрите также
.Xr smbutil 1 ,
.Xr mount_smbfs 8
.Sh STANDARDS
.Rs
.%U https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-cifs/
.%T Common Internet File System (CIFS) Protocol
.%R MS-CIFS
.%D December 2018
.Re
.Pp
.Rs
.%U https://tools.ietf.org/html/draft-heizer-cifs-v1-spec-00
.%T Общий протокол файловой системы Интернета (CIFS/1.0)
.%D 13 июня 1996 года
.%A I. Heizer
.%A P. Leach
.%A D. Perry
.Re
.Sh история
.Nm
драйвер устройства впервые появился в
.Fx 4.4 .
.Sh авторы
.An -nosplit
.Nm
драйвер устройства был написан
.An Борис Попов, известный как Mt bp@FreeBSD.org .
Страница руководства была предоставлена ​​пользователем
.An Гордон Берглинг, он же Mt gbe@FreeBSD.org .
