melkorbsd/ru-freebsd-man/man5/spwd.db.5
.\"	$NetBSD: passwd.5,v 1.12.2.2 1999/12/17 23:14:50 he Exp $
.\"
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\" Portions Copyright (c) 1994, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)passwd.5	8.1 (Berkeley) 6/5/93
.\"
.Dd 16 мая, 2023
.Dt PASSWD 5
.Os
.Sh ИМЯ
.Nm passwd ,
.Nm master.passwd ,
.Nm pwd.db ,
.Nm spwd.db
.Nd формат файла с паролем
.Sh ОПИСАНИЕ
Файлы
.Nm
являются локальным источником информации о паролях.
Их можно использовать совместно с Hesiod доменами
.Sq Li passwd
и
.Sq Li uid ,
и с
NIS
maps
.Sq Li passwd.byname ,
.Sq Li passwd.byuid ,
.Sq Li master.passwd.byname ,
и
.Sq Li master.passwd.byuid ,
как контролируемый
.Xr nsswitch.conf 5 .
.Pp
Для обеспечения согласованности ни один из этих файлов никогда не должен изменяться
вручную.
.Pp
Файл
.Nm master.passwd
файл доступен для чтения только пользователю root и состоит из
записей, разделенных новой строкой, по одной на пользователя, содержащих десять двоеточий
.Pq Ql \&:
разделенные
поля.
Эти поля следуют:
.Bl -tag -width ".Ar password" -offset indent
.It Ar name
Имя пользователя для входа в систему.
.It Ar password
Пароль
.Em encrypted
пользователя.
.It Ar uid
Пользовательский id.
.It Ar gid
Группа входа пользователя в систему id.
.It Ar class
Класс входа пользователя в систему.
.It Ar change
Время смены пароля.
.It Ar expire
Время истечения срока действия учетной записи.
.It Ar gecos
Общая информация о пользователе.
.It Ar home_dir
Домашний каталог пользователя.
.It Ar shell
Оболочка входа пользователя в систему.
.El
.Pp
Файл
.Nm
сгенерирован из файла
.Nm master.passwd
с помощью
.Xr pwd_mkdb 8 ,
имеет параметры
.Ar class ,
.Ar change ,
и
.Ar expire
поля удалены, и
.Ar password
поле заменено на параметр
.Ql *
.
.Pp
Поле
.Ar name
является логином, используемый для доступа к учетной записи компьютера, а также
.Ar uid
поле - это связанный с ним номер.
Они оба должны быть уникальными
в системе (а часто и в группе систем), поскольку они
управляют доступом к файлам.
.Pp
Пусть и возможно иметь несколько записей с одинаковыми именами входа
и/или идентичными идентификаторами пользователя, обычно это является ошибкой.
Процедуры, 
которые манипулируют этими файлами, часто возвращают только одну из нескольких
записей, и то путем случайного выбора.
.Pp
Имя пользователя не должно начинаться с дефиса
.Pq Ql \&- ,
и не может содержать 8-разрядных символов, табуляции, пробелов или любого из этих
символов:
.Ql \&,:+&#%^\&(\&)!@~*?<>=|\e\\&/"\&; .
Символ доллара
.Pq Ql \&$
допускается только в качестве последнего символа для использования в Samba.
Ни одно поле не может содержать
двоеточие
.Pq Ql \&:
поскольку исторически это использовалось для разделения полей
в пользовательской базе данных.
.Pp
Регистр имеет значение.
Имена для входа
.Ql Lrrr
и
.Ql lrrr
представлять интересы разных пользователей.
Помните об этом при взаимодействии с системами, в которых имена для входа не учитывают
регистр.
.Pp
В файле
.Nm master.passwd
поле
.Ar password
является
.Em encrypted
форму пароля см. в разделе
.Xr crypt 3 .
Если поле
.Ar password
если поле пустое, пароль для доступа к
компьютеру не потребуется.
Это почти всегда ошибка, поэтому компоненты аутентификации, 
такие как PAM, могут принудительно запретить удаленный доступ к учетным записям без пароля.
Поскольку этот файл содержит зашифрованные пароли пользователей, он
не должен быть доступен для чтения никому без соответствующих привилегий.
.Pp
Пароль от
.Ql *
указывает, что
проверка подлинности по паролю отключена для этой учетной
записи (вход в систему с помощью других способов
проверки подлинности, например, с помощью ключей
.Xr ssh 1
все равно будут работать).
Поле содержит только зашифрованные пароли, а
.Ql *
это никогда не может быть результатом шифрования пароля.
.Pp
Зашифрованный пароль с префиксом
.Ql *LOCKED*
означает, что учетная запись временно заблокирована
и никто не может войти в нее с помощью какой-либо аутентификации.
Удобный интерфейс командной строки для блокировки учетной записи приведен в разделе
.Xr pw 8 .
.Pp
Поле
.Ar group
поле - это группа, в которую пользователь будет включен при входе в систему.
Поскольку эта система поддерживает несколько групп (см.
.Xr groups 1 )
в настоящее время это поле не имеет особого значения.
.Pp
Поле
.Ar class
поле является ключом для класса входа пользователя.
Классы входа
определены в
.Xr login.conf 5 ,
что является 
.Xr termcap 5
базой данных стилей, содержащая пользовательские атрибуты, настройки учета, ресурсов
и среды.
.Pp
Поле
.Ar change
это количество секунд с начала эпохи,
.Dv UTC ,
до тех
пор, пока пароль для учетной записи не будет изменен.
Это поле можно оставить пустым, чтобы отключить функцию устаревания пароля.;
нулевое значение эквивалентно тому, что поле остается пустым.
.Pp
Поле
.Ar expire
это количество секунд с начала эпохи,
.Dv UTC ,
пока
не истечет срок действия учетной записи.
Это поле можно оставить пустым, чтобы отключить функцию устаревания учетной записи;
нулевое значение эквивалентно тому, что поле остается пустым.
.Pp
Поле
.Ar gecos
обычно содержит запятую
.Pq Ql \&,
разделенные подполя следующим образом:
.Pp
.Bl -tag -width ".Ar office" -offset indent -compact
.It Ar name
полное имя пользователя
.It Ar office
рабочий номер пользователя
.It Ar wphone
номер рабочего телефона пользователя
.It Ar hphone
номер домашнего телефона пользователя
.El
.Pp
Полное
.Ar name
может содержать амперсанд
.Pq Ql &
который будет заменен на
логин с заглавной буквы
.Ar name
когда поле
.Ar gecos
отображается или используется
различными программами, такими как
.Xr finger 1 ,
.Xr sendmail 8 ,
etc.
.Pp
Параметр
.Ar office
подполя и номер телефона используются пользователем.
.Xr finger 1
программа и, возможно, другие приложения.
.Pp
Домашний каталог пользователя,
.Ar home_dir ,
является полным именем
.Ux
пути, по которому пользователь
будет помещен при входе в систему.
.Pp
Поле
.Ar shell
поле - это интерпретатор команд, который предпочитает пользователь.
Если в поле ничего нет
.Ar shell
оболочка Bourne
.Pq Pa /bin/sh
предполагается.
Обычный способ отключить вход в учетную запись раз и навсегда,
как это делается для системных учетных записей,
заключается в установке
.Ar shell
к
.Pa /sbin/nologin
.Pq see Xr nologin 8 .
.Sh HESIOD SUPPORT
Если
.Sq Li dns
укзан для
.Sq Li passwd
базы данных в
.Xr nsswitch.conf 5 ,
то
.Nm
поиск происходит с помощью
.Sq Li passwd
Hesiod домен.
.Sh NIS ПОДДЕРЖКА
Если
.Sq Li nis
указывается для базы данных
.Sq Li passwd
в
.Xr nsswitch.conf 5 ,
то
.Nm
поиск происходит с помощью
.Sq Li passwd.byname ,
.Sq Li passwd.byuid ,
.Sq Li master.passwd.byname ,
и
.Sq Li master.passwd.byuid
NIS
maps.
.Sh ПОДДЕРЖКА СОВМЕСТИМОСТИ
If
.Sq Li compat
указывается для базы данных
.Sq Li passwd
база данных, и либо
.Sq Li dns
или
.Sq Li nis
указывается для базы данных
.Sq Li passwd_compat
в
.Xr nsswitch.conf 5 ,
затем файл
.Nm
также поддерживает стандарты
.Sq Li + Ns / Ns Li -
исключения и включения, основанные на именах пользователей и сетевых группах.
.Pp
Строки начинаются с
.Ql -
(minus sign) отмечены ли записи как исключенные
из любых следующих включений, которые помечены знаком
.Ql +
(plus sign).
.Pp
Если второй символ строки является символом
.Ql @
(at sign), в этой операции
задействованы пользовательские поля всех записей в сетевой группе, указанные
оставшимися символами поле
.Ar name
.
В противном случае оставшаяся часть поля
.Ar name
предполагается, что поле представляет собой конкретное имя пользователя.
.Pp
Токен
.Ql +
также может быть один в поле
.Ar name
которое вызывает всех пользователей из любого домена Hesiod.Nm
(с
.Sq Li passwd_compat: dns )
или
.Sq Li passwd.byname
и
.Sq Li passwd.byuid
NIS
maps (with
.Sq Li passwd_compat: nis )
будут включенными.
.Pp
Если запись содержит непустое поле
.Ar uid
или поля
.Ar gid
, указанные номера будут заменять информацию, полученную
из домена Hesiod или из
NIS
maps.
Likewise, if the
.Ar gecos ,
.Ar dir
или
.Ar shell
записи содержат текст, он будет заменять информацию, включенную через
Hesiod или
NIS .
В некоторых системах поле
.Ar passwd
может быть переопределено.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/master.passwd" -compact
.It Pa /etc/passwd
ASCII
файл паролей с удаленными паролями
.It Pa /etc/pwd.db
.Xr db 3 Ns -format
база данных паролей с удаленными паролями
.It Pa /etc/master.passwd
ASCII
файл паролей с сохраненными паролями
.It Pa /etc/spwd.db
.Xr db 3 Ns -format
база данных паролей с сохраненными паролями
.El
.Sh СОВМЕСТИМОСТЬ
С тех пор формат файла паролей изменился
.Bx 4.3 .
Следующий awk-скрипт можно использовать для преобразования вашего файла паролей старого образца
в файл паролей нового образца.
Дополнительные поля
.Ar class ,
.Ar change
и
.Ar expire
добавляются, но по умолчанию отключены
.Pq установка для этих полей нулевого значения равносильна оставлению их пустыми.
Класс в настоящее время не реализован, но change и expire реализованы; чтобы установить их,
используйте текущий день в секундах от эпохи + любое количество секунд
смещения, которое вы хотите.
.Bd -literal -offset indent
BEGIN { FS = ":"}
{ print $1 ":" $2 ":" $3 ":" $4 "::0:0:" $5 ":" $6 ":" $7 }
.Ed
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr chpass 1 ,
.Xr login 1 ,
.Xr passwd 1 ,
.Xr crypt 3 ,
.Xr getpwent 3 ,
.Xr login.conf 5 ,
.Xr netgroup 5 ,
.Xr nsswitch.conf 5 ,
.Xr adduser 8 ,
.Xr nologin 8 ,
.Xr pw 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8 ,
.Xr yp 8
.Pp
.%T "Managing NFS and NIS"
(O'Reilly & Associates)
.Sh HISTORY

.Nm
формат файла впервые появился в
.At v1 .
.Pp
The
NIS
.Nm
формат файла впервые появился в SunOS.
.Pp
Поддержка Hesiod впервые появилась в
.Fx 4.1 .
был импортирован из
.Nx
Проект, где он впервые появился в
.Nx 1.4 .
.Sh ОШИБКИ
Пользовательская информация должна храниться (и в конечном итоге будет храниться) в другом месте..Pp
Placing
.Sq Li compat
исключения из файла после любых включений приведут
к неожиданным результатам.
