melkorbsd/ru-freebsd-man/man5/src_conf (2).5
.\" DO NOT EDIT-- this file is @generated by tools/build/options/makeman.
.Dd September 4, 2023
.Dt SRC.CONF 5
.Os
.Sh ИМЯ
.Nm src.conf
.Nd "параметры сборки исходного кода"
.Sh описание
.Nm
файл содержит переменные, которые управляют тем, какие компоненты будут созданы во время
процесс сборки
.Fx
исходного дерева; 
.Xr build 7 .
.Pp
.Nm
файл использует стандартный синтаксис make-файла.
Однако,
.Nm
не следует указывать какие-либо зависимости для
.Xr make 1 .
Вместо этого,
.Nm
нужно установить
.Xr make 1
переменные, которые управляют аспектами построения системы.
.Pp
Местоположение по умолчанию
.Nm
это
.Pa /etc/src.conf ,
хотя альтернативное местоположение может быть указано в
.Xr make 1
переменной
.Va SRCCONF .
Переопределение местоположения
.Nm
может потребоваться, если общесистемные настройки не подходят.
для конкретной сборки.
Например, установка
.Va SRCCONF
для
.Pa /dev/null
эффективно сбрасывает все элементы управления сборкой к значениям по умолчанию.
.Pp
Единственная цель
.Nm
заключается в контроле за составлением
.Fx
исходного кода, который обычно находится в
.Pa /usr/src .
Как правило, системный администратор создает
.Nm
когда необходимо изменить значения тех или иных переменных управления
по сравнению со значениями по умолчанию.
.Pp
Кроме того, можно указать управляющие переменные.
для конкретной сборки с помощью 
.Fl D
опции
.Xr make 1
или в ее среде; 
.Xr environ 7 .
.Pp
Средой сборки 
.Xr make 1
можно управлять с помощью
.Va SRC_ENV_CONF
переменной, которая по умолчанию равна
.Pa /etc/src-env.conf .
Некоторые примеры, которые можно установить только в этом файле:
.Va WITH_DIRDEPS_BUILD ,
и
.Va WITH_META_MODE ,
и
.Va MAKEOBJDIRPREFIX
являются переменными только среды.
.Pp
Значения переменных игнорируются независимо от их установки;
даже если они будут установлены на
.Dq Li ЛОЖНЫЙ
или
.Dq Li отсутствует .
Наличие выбора приводит к
тому, что его следует уважать
.Xr make 1 .
.Pp
В этом списке указаны имена и краткое описание переменных.
который можно использовать для сборок исходного кода.
.Bl -tag -width indent
.It Va БЕЗ УЧЕТА
Не создавайте инструменты учета процессов, такие как
.Xr действие 8
и
.Xr sa 8 .
.It Va WITHOUT_ACPI
Не стройте 
.Xr acpiconf 8 ,
.Xr acpidump 8
и сопутствующие программы.
.It Va WITHOUT_APM
Не стройте 
.Xr apm 8 ,
.Xr apmd 8
и сопутствующие программы.
.It Va WITH_ASAN
Создайте базовую систему с помощью Address Sanitizer (ASan) для обнаружения
ошибки повреждения памяти, такие как переполнение буфера или использование после освобождения.
Требуется, чтобы Clang использовался в качестве компилятора базовой системы.
и что доступна библиотека поддержки среды выполнения.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITH_LLVM_BINUTILS
.It
.Va WITH_LLVM_CXXFILT
.El
.It Va WITHOUT_ASSERT_DEBUG
Компилируйте программы и библиотеки без
.Xr assert 3
проверок.
.It Va WITHOUT_AT
Не стройте 
.Xr at 1
и сопутствующие утилиты.
.It Va WITHOUT_AUDIT
Не встраивайте поддержку аудита в системные программы.
.It Va WITHOUT_AUTHPF
Не стройте 
.Xr authpf 8 .
.It Va WITHOUT_AUTOFS
Не стройте 
.Xr autofs 5
связанные программы, библиотеки и модули ядра.
.It Va WITHOUT_AUTO_OBJ
Отключите автоматическое создание objdirs.
Это включено по умолчанию, если текущий пользователь может записать нужный OBJDIR.
.Pp
Это должно быть установлено в среде, командной строке make или
.Pa /etc/src-env.conf ,
не
.Pa /etc/src.conf .
.It Va WITH_BEARSSL
Создайте библиотеку BearSSL.
.Pp
BearSSL — это крошечная библиотека SSL, подходящая для встроенных сред.
Подробности см.
.Lk https://www.BearSSL.org/
.Pp
Эта библиотека в настоящее время используется только для выполнения
проверка подписи и сопутствующие операции
для проверенных руководителей и
.Xr loader 8 .
Когда установлено, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITH_LOADER_EFI_SECUREBOOT
(пока не
.Va WITHOUT_LOADER_EFI_SECUREBOOT
is set explicitly)
.It Va WITH_LOADER_VERIEXEC
(пока не
.Va WITHOUT_LOADER_VERIEXEC
is set explicitly)
.It Va WITH_LOADER_VERIEXEC_VECTX
(пока не
.Va WITHOUT_LOADER_VERIEXEC_VECTX
is set explicitly)
.It Va WITH_VERIEXEC
(пока не
.Va WITHOUT_VERIEXEC
указано явно)
.El
.It Va WITHOUT_BHYVE
Не создавайте и не устанавливайте
.Xr bhyve 8 ,
связанные утилиты и примеры.
.Pp
Эта опция влияет только на amd64/amd64.
.It Va WITH_BHYVE_SNAPSHOT
Включите поддержку сохранения и восстановления (снимков) в
.Xr bhyve 8
и
.Xr bhyvectl 8 .
.Pp
Эта опция влияет только на amd64/amd64.
.It Va WITH_BIND_NOW
Создайте все двоичные файлы с установленным
.Dv DF_BIND_NOW
флагом, указывающим, что загрузчик во время выполнения должен выполнять все перемещения.
обработка при запуске процесса, а не по требованию.
Сочетание
.Va BIND_NOW
и
.Va RELRO
Опции обеспечивают «полную» поддержку перемещения только для чтения (RELRO).
При полном RELRO весь GOT становится доступным только для чтения после выполнения перемещения в
запуска, избегая атак перезаписи GOT.
.It Va WITHOUT_BLACKLIST
Установите это, если вы не хотите строить
.Xr blacklistd 8
и
.Xr blacklistctl 8 .
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_BLACKLIST_SUPPORT
(пока не
.Va WITH_BLACKLIST_SUPPORT
устанавливается)
.El
.It Va WITHOUT_BLACKLIST_SUPPORT
Создайте небольшую программу
.Xr libblacklist 3
с поддержкой
.Xr fingerd 8 ,
.Xr ftpd 8 ,
и
.Xr sshd 8 .
.It Va WITHOUT_BLUETOOTH
Не создавайте модули ядра, программы и библиотеки, связанные с Bluetooth.
.It Va WITHOUT_BOOT
Не создавайте загрузочные блоки и загрузчик.
.It Va WITHOUT_BOOTPARAMD
Не создавайте и не устанавливайте
.Xr bootparamd 8 .
.It Va WITHOUT_BOOTPD
Не создавайте и не устанавливайте
.Xr bootpd 8 .
.It Va WITHOUT_BSDINSTALL
Не создавайте
.Xr bsdinstall 8 ,
.Xr sade 8 ,
и связанные с ними программы.
.It Va WITHOUT_BSD_CPIO
Не создавайте лицензионную версию cpio для BSD на основе
.Xr libarchive 3 .
.It Va WITHOUT_BSNMP
Не создавайте и не устанавливайте
.Xr bsnmpd 1
связанные с ними библиотеки и файлы данных.
.It Va WITHOUT_BZIP2
Не создавайте добавленное программное обеспечение bzip2 как часть базовой системы.
.Bf -symbolic
Эта опция пока не вступила в силу.
.Ef
Если эти параметры установлены, они также вступают в силу:
.Pp
.Bl -inset -compact
.It Va WITHOUT_BZIP2_SUPPORT
(если только
.Va WITH_BZIP2_SUPPORT
задается явно)
.El
.It Va WITHOUT_BZIP2_SUPPORT
Создавайте некоторые программы без дополнительной поддержки bzip2.
.It Va WITHOUT_CALENDAR
Не стройте
.Xr calendar 1 .
.It Va WITHOUT_CAPSICUM
Этот параметр не действует.
.It Va WITHOUT_CAROOT
Не добавляйте доверенные сертификаты из пакета Mozilla NSS в
базу данных.
.It Va WITHOUT_CASPER
Этот параметр не действует.
.It Va WITH_CCACHE_BUILD
Воспользуйся
.Xr ccache 1
для сборки.
Никакой настройки не требуется, за исключением установки
.Sy devel/ccache
пакета.
При использовании с
.Xr distcc 1 ,
набора
.Sy CCACHE_PREFIX=/usr/local/bin/distcc .
Будет использоваться каталог кэша по умолчанию для,
.Pa $HOME/.ccache
который можно переопределить, установив 
.Sy CCACHE_DIR .

.Sy CCACHE_COMPILERCHECK
значение параметра по умолчанию
.Sy content
при использовании встроенного загрузочного компилятора,
и
.Sy mtime
при использовании внешнего компилятора.

.Sy CCACHE_CPP2
параметр используется для Clang, но не для GCC.
.Pp
Совместное использование кэша между несколькими рабочими каталогами требует использования макета
, аналогично
.Pa /some/prefix/src
.Pa /some/prefix/obj
и такая среда, как:
.Bd -literal -offset indent
CCACHE_BASEDIR='${SRCTOP:H}' MAKEOBJDIRPREFIX='${SRCTOP:H}/obj'
.Ed
.Pp
дополнительные
.Xr ccache 1
параметры конфигурации приведены в разделе.
.It Va WITHOUT_CCD
Не стройте
.Xr geom_ccd 4
 и не подключайте к ним инженерные сети.
.It Va WITHOUT_CDDL
Не создавайте код, лицензированный на основе CDDL от Sun.
Если этот параметр установлен, он обеспечивает соблюдение следующих параметров:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CTF
.It
.Va WITHOUT_DTRACE
.It
.Va WITHOUT_LOADER_ZFS
.It
.Va WITHOUT_ZFS
.El
.It Va WITHOUT_CLANG
Не создавайте компилятор Clang C/C++ во время обычной фазы сборки.
Если он установлен, он применяет эти параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FORMAT
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_LLVM_COV
.El
.Pp
Если эти параметры установлены, они также вступают в силу:
.Pp
.Bl -inset -compact
.It Va WITHOUT_LLVM_TARGET_AARCH64
(если
.Va WITH_LLVM_TARGET_AARCH64
не задано явно)
.It Va WITHOUT_LLVM_TARGET_ALL
(если
.Va WITH_LLVM_TARGET_ALL
не задано явно)
.It Va WITHOUT_LLVM_TARGET_ARM
(если
.Va WITH_LLVM_TARGET_ARM
не задано явно)
.It Va WITHOUT_LLVM_TARGET_POWERPC
(если
.Va WITH_LLVM_TARGET_POWERPC
не задано явно)
.It Va WITHOUT_LLVM_TARGET_RISCV
(если
.Va WITH_LLVM_TARGET_RISCV
не задано явно)
.El
.It Va WITHOUT_CLANG_BOOTSTRAP
Не создавайте компилятор Clang C/C++ на этапе начальной
загрузки.
Для возможности сборки системы необходимо включить либо gcc, либо clang bootstrap
, если только альтернативный компилятор не предоставляется через XCC.
.It Va WITH_CLANG_EXTRAS
Создайте дополнительные инструменты clang и llvm, такие как bigpoint и
clang-format.
.It Va WITH_CLANG_FORMAT
Создайте clang-формат.
.It Va WITHOUT_CLANG_FULL
Избегайте создания компонентов ARCMigrate, Rewriter и
StaticAnalyzer в компиляторе Clang C/C++.
.It Va WITHOUT_CLEAN
Не выполняйте очистку перед сборкой world и/или kernel.
.It Va WITHOUT_CPP
Не создавайт
.Xr cpp 1 .
.It Va WITHOUT_CROSS_COMPILER
Не создавайте кросс-компилятор на этапе кросс-инструментария build world.
При компиляции другой версии
.Fx
чем тот, который установлен в системе, используйте альтернативный
компилятор с CC для обеспечения успеха.
При компиляции с идентичной версией
.Fx
для хоста эта опция может быть безопасной.
Эта опция также может быть безопасной, если версия хоста
.Fx
близка к создаваемым исходным текстам, но все шансы на то
, что в цепочке инструментов между версиями произошли какие-либо изменения, аннулируются.
Когда он установлен, он реализует эти параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG_BOOTSTRAP
.It
.Va WITHOUT_ELFTOOLCHAIN_BOOTSTRAP
.It
.Va WITHOUT_LLD_BOOTSTRAP
.El
.It Va WITHOUT_CRYPT
Не создавайте никакого криптографического кода.
Если этот параметр установлен, он обеспечивает соблюдение следующих параметров:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DMAGENT
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_LDNS
.It
.Va WITHOUT_LDNS_UTILS
.It
.Va WITHOUT_LOADER_ZFS
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL
.It
.Va WITHOUT_OPENSSL_KTLS
.It
.Va WITHOUT_PKGBOOTSTRAP
.It
.Va WITHOUT_UNBOUND
.It
.Va WITHOUT_ZFS
.El
.Pp
Если эти параметры установлены, они также вступают в силу:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(если только
.Va WITH_GSSAPI
задается явно)
.El
.It Va WITH_CTF
Компилируйте с использованием данных CTF (Compact C Type Format).
Данные CTF содержат сокращенную форму отладочной информации
, аналогичную DWARF и venerable stabs, и необходимы для трассировки.
.It Va WITHOUT_CUSE
Не создавайте программы и библиотеки, связанные с CUSE.
.It Va WITHOUT_CXGBETOOL
Не создавайте
.Xr cxgbetool 8
.Pp
Это настройка по умолчанию в 
arm/armv7, powerpc/powerpc and riscv/riscv64.
.It Va WITH_CXGBETOOL
создать
.Xr cxgbetool 8
.Pp
Это настройка по умолчанию на
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc64 and powerpc/powerpc64le.
.It Va WITHOUT_DEBUG_FILES
Избегайте создания или установки отдельных отладочных файлов для каждого
исполняемого двоичного файла и общей библиотеки.
.It Va WITH_DETECT_TZ_CHANGES
Сделайте так, чтобы код обработки времени обнаруживал изменения в файлах часовых поясов.
.It Va WITHOUT_DIALOG
не создавать
.Xr dialog 1 ,
.Xr dialog 3 ,
.Xr dpv 1 ,
и
Когда он установлен, он применяет эти параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BSDINSTALL
.El
.It Va WITHOUT_DICT
Не создавайте файлы словаря Webster.
.It Va WITH_DIRDEPS_BUILD
Это альтернативная система сборки.
Подробности смотрите в разделе
https://www.crufty.net/sjg/docs/freebsd-meta-mode.htm.
Команды сборки можно увидеть на верхнем уровне с помощью:
.Dl make show-valid-targets
Построение осуществляется с помощью dirdeps.mk с использованием
.Va DIRDEPS
храния в файлах
Makefile.depend, которые находятся в каждом каталоге.
.Pp
Сборка может быть запущена из любого места и ведет себя одинаково.
Исходный экземпляр
.Xr make 1
рекурсивно считывает
.Va DIRDEPS
от
.Pa Makefile.depend ,
вычисления графики древовидных зависимостей от текущего источника.
Установка
.Va NO_DIRDEPS
пропускает проверку зависимостей dir dep и выполняет сборку только в текущем
и дочернем каталогах.
.Va NO_DIRDEPS_BELOW
пропускает создание любых dirdeps и создает только текущий каталог.
.Pp
При этом также используется
.Va WITH_META_MODE
логика для инкрементных сборок.
.Pp
Сборка скрывает команды, выполняемые до тех пор, 
.Va NO_SILENT
 пока это не определено.
.Pp
Обратите внимание, что в настоящее время для этого нет функции массовой установки.
Эта сборка предназначена для создания пакетов, которые затем могут быть установлены
в целевой системе.
.Pp
Реализация 
.Fx
является неполной.
Для завершения работы потребуются конечные каталоги для сборки каждого ядра
и пакета, чтобы можно было отслеживать их зависимости.
Если этот параметр установлен, он обеспечивает соблюдение следующих параметров:
.Pp
.Bl -item -compact
.It
.Va WITH_INSTALL_AS_USER
.El
.Pp
Если эти параметры установлены, они также вступают в силу:
.Pp
.Bl -inset -compact
.It Va WITH_META_ERROR_TARGET
(если только
.Va WITHOUT_META_ERROR_TARGET
задается явно)
.It Va WITH_META_MODE
(если только
.Va WITHOUT_META_MODE
задается явно)
.It Va WITH_STAGING
(если только
.Va WITHOUT_STAGING
задается явно)
.It Va WITH_STAGING_MAN
(если только
.Va WITHOUT_STAGING_MAN
задается явно)
.It Va WITH_STAGING_PROG
(если только
.Va WITHOUT_STAGING_PROG
задается явно)
.It Va WITH_SYSROOT
(если только
.Va WITHOUT_SYSROOT
задается явно)
.El
.Pp
Это должно быть установлено в среде, в командной строке make, или
.Pa /etc/src-env.conf ,
нет
.Pa /etc/src.conf .
.It Va WITH_DIRDEPS_CACHE
Кэшируйте результат dirdeps.mk, что может значительно сэкономить время
для последующих сборок.
Зависит от
.Va WITH_DIRDEPS_BUILD .
.Pp
Это должно быть установлено в среде, в командной строке make или
.Pa /etc/src-env.conf ,
нет
.Pa /etc/src.conf .
.It Va WITH_DISK_IMAGE_TOOLS_BOOTSTRAP
создавать
.Xr etdump 1 ,
.Xr makefs 8
и
.Xr mkimg 1
как инструменты начальной загрузки.
.It Va WITHOUT_DMAGENT
Не создавайте почтовый транспортный агент dma.
.It Va WITHOUT_DOCCOMPRESS
Не устанавливайте сжатую системную документацию.
Будет установлена только несжатая версия.
.It Va WITHOUT_DTRACE
Не создавайте модули ядра, библиотеки и пользовательские команды DTrace framework.
Если параметр установлен, он реализует эти параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CTF
.El
.It Va WITH_DTRACE_ASAN
Скомпилируйте код DTrace в пользовательском пространстве (libdtrace, dtrace(1), lockstat(1), plockstat(1))
с исправлением адреса и неопределенного поведения.
Требуется, чтобы Clang использовался в качестве базового системного компилятора
и чтобы была доступна библиотека поддержки среды выполнения.
.It Va WITH_DTRACE_TESTS
Создайте и установите набор тестов DTrace в
.Pa /usr/tests/cddl/usr.sbin/dtrace .
Этот набор тестов считается экспериментальным для архитектур, отличных от
amd64/amd642, и его запуск может привести к нестабильности системы.
.It Va WITHOUT_DYNAMICROOT
Установите это значение, если вы не хотите связывать
.Pa /bin
и
.Pa /sbin
динамично.
.It Va WITHOUT_EE
Не создавайте и не устанавливайте
.Xr edit 1 ,
.Xr ee 1 ,
и связанные с ними программы.
.It Va WITHOUT_EFI
Установлен не для создания
.Xr efivar 3
и
.Xr efivar 8 .
.Pp
Это настройка по умолчанию на
i386/i386, powerpc/powerpc, powerpc/powerpc64, powerpc/powerpc64le and riscv/riscv64.
.It Va WITH_EFI
создавать
.Xr efivar 3
и
.Xr efivar 8 .
.Pp
Это настройка по умолчанию на
amd64/amd64, arm/armv7 and arm64/aarch64.
.It Va WITHOUT_ELFTOOLCHAIN_BOOTSTRAP
Не создавайте встроенные модули ELF
(addr2line, nm, size, strings and strip)
как часть процесса начальной загрузки.
.Bf -symbolic
Должна быть предусмотрена альтернативная цепочка инструментов bootstrap.
.Ef
.It Va WITHOUT_EXAMPLES
Избегайте установки примеров для
.Pa /usr/share/examples/ .
.It Va WITH_EXPERIMENTAL
Включите в сборку экспериментальные функции.
.It Va WITH_EXTRA_TCP_STACKS
Создайте дополнительные модули стека TCP.
.It Va WITHOUT_FDT
Не создавайте поддержку сглаженного дерева устройств как часть базовой системы.
Это включает в себя компилятор дерева устройств (dtc) и библиотеку поддержки libfdt.
.Pp
Это настройка по умолчанию на
amd64/amd64 and i386/i386.
.It Va WITH_FDT
Создайте поддержку сглаженного дерева устройств как часть базовой системы.
Это включает в себя компилятор дерева устройств (dtc) и библиотеку поддержки libfdt.
.Pp
Это настройка по умолчанию на
arm/armv7, arm64/aarch64, powerpc/powerpc, powerpc/powerpc64, powerpc/powerpc64le and riscv/riscv64.
.It Va WITHOUT_FILE
Это настройка по умолчанию для
.Xr file 1
и сопутствующих программ.
.It Va WITHOUT_FINGER
Не создавайте и не устанавливайте
.Xr finger 1
и
.Xr fingerd 8 .
.It Va WITHOUT_FLOPPY
Не создавайте и не устанавливайте программы
для работы с драйвером гибких дисков.
.It Va WITHOUT_FORMAT_EXTENSIONS
Не включайте
.Fl fformat-extensions
при компиляции ядра.
Также отключайте всю проверку формата.
.It Va WITHOUT_FORTH
Создайте загрузчики без поддержки Forth.
.It Va WITHOUT_FP_LIBC
Постойте
.Nm libc
без поддержки плавающей запятой.
.It Va WITHOUT_FREEBSD_UPDATE
Не стойте
.Xr freebsd-update 8 .
.It Va WITHOUT_FTP
Не создавайте и не устанавливайте
.Xr ftp 1
и
.Xr ftpd 8 .
.It Va WITHOUT_GAMES
Не создавайте игры.
.It Va WITHOUT_GH_BC
Установите традиционную FreeBSD.
.Xr bc 1
и
.Xr dc 1
программы вместо расширенных версий.
.It Va WITHOUT_GNU_DIFF
Не создавайте GNU
.Xr diff3 1 .
.It Va WITHOUT_GOOGLETEST
Не стойте и не устанавливайте
.Lb libgmock ,
.Lb libgtest ,
и зависимые тесты.
.It Va WITHOUT_GPIO
Не стройте
.Xr gpioctl 8
как часть базовой системы.
.It Va WITHOUT_GSSAPI
Не собирайте libgssapi.
.It Va WITHOUT_HAST
Не стройте
.Xr hastd 8
и сопутствующие утилиты.
.It Va WITH_HESIOD
Создайте поддержку Гесиода.
.It Va WITHOUT_HTML
Не создавайте HTML-документы.
.It Va WITHOUT_HYPERV
Не создавайте и не устанавливайте утилиты HyperV.
.Pp
Это настройка по умолчанию для
Arm/armv7, powerpc/powerpc, powerpc/powerpc64, powerpc/powerpc64le и riscv/riscv64.
.It Va WITH_HYPERV
Создайте или установите утилиты HyperV.
.Pp
Это настройка по умолчанию для
amd64/amd64, Arm64/aarch64 и i386/i386.
.It Va WITHOUT_ICONV
Не создавайте iconv как часть libc.
.It Va WITHOUT_INCLUDES
Не устанавливайте заголовочные файлы.
Раньше этот вариант писался
.Va NO_INCS .
.Bf -symbolic
Эта опция не работает для целей сборки.
.Ef
.It Va WITHOUT_INET
Не создавайте программы и библиотеки, связанные с сетями IPv4.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET_SUPPORT
.El
.It Va WITHOUT_INET6
Не стройте
программы и библиотеки, связанные с сетями IPv6.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET6_SUPPORT
.El
.It Va WITHOUT_INET6_SUPPORT
Создавайте библиотеки, программы и модули ядра без поддержки IPv6.
.It Va WITHOUT_INETD
Не стройте
.Xr inetd 8 .
.It Va WITHOUT_INET_SUPPORT
Создавайте библиотеки, программы и модули ядра без поддержки IPv4.
.It Va WITH_INIT_ALL_PATTERN
Создайте базовую систему или ядро ​​с переменными стека, инициализированными
.Pq compiler defined
для шаблонов отладки при входе в функцию.
Для этой опции требуется компилятор clang.
.It Va WITH_INIT_ALL_ZERO
Создайте базовую систему или ядро ​​с инициализированными переменными стека
обнуляется при входе в функцию.
Эта опция требует использования компилятора clang.
.It Va WITHOUT_INSTALLLIB
Установите этот параметр, чтобы не устанавливать дополнительные библиотеки.
Например, при создании
.Xr nanobsd 8
изображения.
.Bf -symbolic
Эта опция не работает для целей сборки.
.Ef
.It Va WITH_INSTALL_AS_USER
Обеспечьте успешную установку для пользователей без полномочий root, установив
файлы с атрибутами владельца и группы, установленными для пользователя, выполняющего
.Xr make 1
команды.
Пользователь по-прежнему должен установить
.Va DESTDIR
переменную так, чтобы она указывала на каталог, в котором у пользователя есть права на запись.
.It Va WITHOUT_IPFILTER
Не создавайте пакет IP-фильтра.
.It Va WITHOUT_IPFW
Не создавайте инструменты IPFW.
.It Va WITHOUT_IPSEC_SUPPORT
Не собирайте ядро ​​с
.Xr ipsec 4
поддержкой.
Эта опция нужна для
.Xr ipsec 4
и
.Xr tcpmd5 4 .
.It Va WITHOUT_ISCSI
Не стройте 
.Xr iscsid 8
и сопутствующие утилиты.
.It Va WITHOUT_JAIL
Не создавайте инструменты для поддержки тюрем; например.,
.Xr jail 8 .
.It Va WITHOUT_KDUMP
Не стройте 
.Xr kdump 1
и
.Xr truss 1 .
.It Va WITHOUT_KERBEROS
Установите этот параметр, чтобы не создавать Kerberos 5 (KTH Heimdal).
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(пока не
.Va WITH_GSSAPI
is set explicitly)
.It Va WITHOUT_KERBEROS_SUPPORT
(пока не
.Va WITH_KERBEROS_SUPPORT
устанавливается явно)
.El
.It Va WITHOUT_KERBEROS_SUPPORT
Создайте некоторые программы без поддержки Kerberos, например
.Xr ssh 1 ,
.Xr telnet 1 ,
и
.Xr sshd 8 .
.It Va WITH_KERNEL_RETPOLINE
Включите защиту «retpoline» для CVE-2017-5715 в ядре.
строить.
.It Va WITHOUT_KERNEL_SYMBOLS
Не устанавливайте отдельные файлы символов отладки ядра.
Эта опция не имеет эффекта во время сборки.
.It Va WITHOUT_KVM
Не стройте 
.Nm libkvm
библиотеку как часть базовой системы.
.Bf -symbolic
Опция пока не действует.
.Ef
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_KVM_SUPPORT
(пока не 
.Va WITH_KVM_SUPPORT
устанавливается явно)
.El
.It Va WITHOUT_KVM_SUPPORT
Создайте несколько программ без дополнительной
.Nm libkvm
поддержки.
.It Va WITHOUT_LDNS
Установка этой переменной предотвратит сборку библиотеки LDNS.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LDNS_UTILS
.It
.Va WITHOUT_UNBOUND
.El
.It Va WITHOUT_LDNS_UTILS
Установка этой переменной предотвратит создание утилит LDNS.
.Xr drill 1
и
.Xr host 1 .
.It Va WITHOUT_LEGACY_CONSOLE
Не создавайте программы, поддерживающие устаревшие консоли ПК; например.,
.Xr kbdcontrol 1
и
.Xr vidcontrol 1 .
.It Va WITHOUT_LIB32
На 64-битных платформах не создавайте набор 32-битных библиотек и
.Nm ld-elf32.so.1
компоновщик среды выполнения.
.Pp
Это настройка по умолчанию для
arm/armv7, i386/i386, powerpc/powerpc, powerpc/powerpc64le and riscv/riscv64.
.It Va WITH_LIB32
На 64-битных платформах соберите набор 32-битных библиотек и
.Nm ld-elf32.so.1
компоновщик времени выполнения.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64 and powerpc/powerpc64.
.It Va WITHOUT_LLD
Не создавайте компоновщик lld LLVM.
.It Va WITHOUT_LLDB
Не создавайте отладчик LLDB. 
.Pp
Это настройка по умолчанию для
arm/armv7 and riscv/riscv64.
.It Va WITH_LLDB
Build the LLDB debugger.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc, powerpc/powerpc64 and powerpc/powerpc64le.
.It Va WITHOUT_LLD_BOOTSTRAP
Не создавайте компоновщик LLD на этапе начальной загрузки.
сборка.
Чтобы иметь возможность построить систему, необходимо предоставить альтернативный компоновщик через XLD.
.It Va WITHOUT_LLD_IS_LD
Не устанавливайте
.Pa /usr/bin/ld symlink
для
.Pa ld.lld .
В системе не будет полезной цепочки инструментов, если не будет предоставлен компоновщик.
каким-то другим способом.
.It Va WITH_LLVM_ASSERTIONS
Включите утверждения отладки в LLVM.
.It Va WITH_LLVM_BINUTILS
Установите binutils LLVM (без префикса llvm-),
вместо инструментов ELF Tool Chain.
Это включает
.Xr addr2line 1 ,
.Xr ar 1 ,
.Xr nm 1 ,
.Xr objcopy 1 ,
.Xr ranlib 1 ,
.Xr readelf 1 ,
.Xr size 1 ,
и
.Xr strip 1 .
Regardless of this setting, LLVM tools are used for
.Xr c++filt 1
и
.Xr objdump 1 .
.Xr strings 1
всегда предоставляется ELF Tool Chain.
.It Va WITHOUT_LLVM_COV
Не стройте
.Xr llvm-cov 1
инструмент.
.It Va WITHOUT_LLVM_CXXFILT
Установите cxxfilt ELF Tool Chain как c++filt вместо llvm-cxxfilt LLVM.
.It Va WITHOUT_LLVM_TARGET_AARCH64
Не создавайте целевую поддержку LLVM для AArch64.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITHOUT_LLVM_TARGET_ALL
Создайте только необходимую целевую поддержку LLVM.
Этот вариант предпочтительнее конкретных вариантов целевой поддержки.
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_LLVM_TARGET_AARCH64
(пока не
.Va WITH_LLVM_TARGET_AARCH64
устанавливается явно)
.It Va WITHOUT_LLVM_TARGET_ARM
(пока не
.Va WITH_LLVM_TARGET_ARM
устанавливается явно)
.It Va WITHOUT_LLVM_TARGET_POWERPC
(пока не
.Va WITH_LLVM_TARGET_POWERPC
устанавливается явно)
.It Va WITHOUT_LLVM_TARGET_RISCV
(пока не
.Va WITH_LLVM_TARGET_RISCV
устанавливается явно)
.El
.It Va WITHOUT_LLVM_TARGET_ARM
Не создавайте целевую поддержку LLVM для ARM.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITH_LLVM_TARGET_BPF
Создайте целевую поддержку LLVM для BPF.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITH_LLVM_TARGET_MIPS
Создайте целевую поддержку LLVM для MIPS.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITHOUT_LLVM_TARGET_POWERPC
Do not build LLVM target support for PowerPC.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITHOUT_LLVM_TARGET_RISCV
Не создавайте целевую поддержку LLVM для RISC-V.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITHOUT_LLVM_TARGET_X86
Не создавайте целевую поддержку LLVM для X86.
.Va LLVM_TARGET_ALL
В большинстве случаев следует использовать этот вариант, а не этот.
.It Va WITH_LOADER_EFI_SECUREBOOT
Включите строительство
.Xr loader 8
с поддержкой проверки на основе сертификатов, полученных от UEFI.
.It Va WITHOUT_LOADER_GELI
Отключите включение поддержки шифрования GELI в двоичные файлы цепочки загрузки.
.Pp
Это настройка по умолчанию для
powerpc/powerpc, powerpc/powerpc64 and powerpc/powerpc64le.
.It Va WITH_LOADER_GELI
Создайте поддержку загрузчика GELI.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm/armv7, arm64/aarch64, i386/i386 and riscv/riscv64.
.It Va WITHOUT_LOADER_KBOOT
Не создавайте kboot, загрузчик среды Linuxboot.
.Pp
Это настройка по умолчанию для
arm/armv7, i386/i386, powerpc/powerpc, powerpc/powerpc64le and riscv/riscv64.
.It Va WITH_LOADER_KBOOT
Создайте kboot, загрузчик среды Linuxboot.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64 and powerpc/powerpc64.
.It Va WITHOUT_LOADER_LUA
Не создавайте привязки LUA для загрузчика.
.Pp
Это настройка по умолчанию для
powerpc/powerpc, powerpc/powerpc64 и powerpc/powerpc64le.
.It Va WITH_LOADER_LUA
Создайте привязки LUA для загрузчика.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm/armv7, arm64/aarch64, i386/i386 and riscv/riscv64.
.It Va WITHOUT_LOADER_OFW
Отключите сборку компонентов загрузчика открытой прошивки.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm/armv7, arm64/aarch64, i386/i386 and riscv/riscv64.
.It Va WITH_LOADER_OFW
Создайте компонент загрузчика открытой прошивки.
.Pps
Это настройка по умолчанию для
powerpc/powerpc, powerpc/powerpc64 и powerpc/powerpc64le.
.It Va WITHOUT_LOADER_UBOOT
Отключите строительство ул.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc64le and riscv/riscv64.
.It Va WITH_LOADER_UBOOT
Постройте ubldr.
.Pp
Это настройка по умолчанию для
arm/armv7, powerpc/powerpc and powerpc/powerpc64.
.It Va WITH_LOADER_VERBOSE
Сборка с дополнительной подробной отладкой в ​​загрузчике.
Может взорваться и без того слишком большой погрузчик, превышающий лимит.
Используйте с осторожностью.
.It Va WITH_LOADER_VERIEXEC
Включите строительство
.Xr loader 8
с поддержкой проверки, аналогичной Verified Exec.
.Pp
Зависит от
.Va WITH_BEARSSL .
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITH_LOADER_EFI_SECUREBOOT
(пока не
.Va WITHOUT_LOADER_EFI_SECUREBOOT
устанавливается явно)
.It Va WITH_LOADER_VERIEXEC_VECTX
(пока не
.Va WITHOUT_LOADER_VERIEXEC_VECTX
устанавливается явно)
.El
.It Va WITH_LOADER_VERIEXEC_PASS_MANIFEST
Включить строительство
.Xr loader 8
с поддержкой передачи проверенного манифеста ядру.
Ядро должно быть построено с модулем для анализа манифеста.
.Pp
Зависит от
.Va WITH_LOADER_VERIEXEC .
.It Va WITH_LOADER_VERIEXEC_VECTX
Включите строительство
.Xr loader 8
с поддержкой хеширования и проверки ядра и модулей в качестве побочного эффекта
загрузки.
.Pp
Зависит от
.Va WITH_LOADER_VERIEXEC .
.It Va WITHOUT_LOADER_ZFS
Не создавайте поддержку загрузчика файловой системы ZFS.
.It Va WITHOUT_LOCALES
Не стройте файлы локализации; 
.Xr locale 1 .
.It Va WITHOUT_LOCATE
Не стройте
.Xr locate 1
и сопутствующие программы.
.It Va WITHOUT_LPR
Не стройте 
.Xr lpr 1
и сопутствующие программы.
.It Va WITHOUT_LS_COLORS
Стройте
.Xr ls 1
без поддержки цветов для различения типов файлов.
.It Va WITHOUT_MACHDEP_OPTIMIZATIONS
Предпочитайте машинно-независимый неассемблерный код в libc и libm.
.It Va WITHOUT_MAIL
Не создавайте никакой поддержки почты (MUA или MTA).
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DMAGENT
.It
.Va WITHOUT_MAILWRAPPER
.It
.Va WITHOUT_SENDMAIL
.El
.It Va WITHOUT_MAILWRAPPER
Не стройте 
.Xr mailwrapper 8
Селектор МТА.
.It Va WITHOUT_MAKE
Не устанавливайте
.Xr make 1
и соответствующие файлы поддержки.
.It Va WITHOUT_MAKE_CHECK_USE_SANDBOX
Не выполняйте 
.Dq Li "make check"
в ограниченном режиме песочницы.
Эту опцию следует сочетать с
.Va WITH_INSTALL_AS_USER
если выполняется от имени непривилегированного пользователя.
Смотрите
.Xr tests 7
больше подробностей.
.It Va WITH_MALLOC_PRODUCTION
Отключить утверждения и сбор статистики в
.Xr malloc 3 .
По умолчанию параметры времени выполнения A и J отключены.
.It Va WITHOUT_MAN
Не создавайте страницы руководства.
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_MAN_UTILS
(пока не 
.Va WITH_MAN_UTILS
устанавливается явно)
.El
.It Va WITHOUT_MANCOMPRESS
Не устанавливайте сжатые страницы руководства.
Будут установлены только несжатые версии.
.It Va WITH_MANSPLITPKG
Разделите страницы руководства на отдельные пакеты во время сборки пакета.
.It Va WITHOUT_MAN_UTILS
Не создавайте утилиты для страниц руководства,
.Xr apropos 1 ,
.Xr makewhatis 1 ,
.Xr man 1 ,
.Xr whatis 1 ,
.Xr manctl 8 ,
и соответствующие файлы поддержки.
.It Va WITH_META_ERROR_TARGET
Включите цель META_MODE .ERROR.
.Pp
Эта цель скопирует метафайл неудачной цели.
для 
.Va ERROR_LOGDIR
(по умолчанию
.Ql ${SRCTOP:H}/error )
помочь с анализом отказов.
Зависит от
.Va WITH_META_MODE .
Это значение по умолчанию, когда
.Va WITH_DIRDEPS_BUILD
установлено.
.Pp
Это должно быть установлено в среде, командной строке make или
.Pa /etc/src-env.conf ,
не 
.Pa /etc/src.conf .
.It Va WITH_META_MODE
Создайте 
.Xr make 1
мета-файлы при сборке, что может обеспечить надежную инкрементальную сборку при
с использованием
.Xr filemon 4 .
Метафайл создается в OBJDIR как
.Pa target.meta .
Эти метафайлы отслеживают выполненную команду, ее вывод и
Текущий каталог.
.Xr filemon 4
модуль необходим, если только
.Va NO_FILEMON
определено.
Когда модуль загружается, все файлы, используемые выполняемыми командами,
отслеживаются как зависимости для цели в ее метафайле.
Цель считается устаревшей и перестраивается, если есть что-либо из этого.
условия верны по сравнению с последней сборкой:
.Bl -bullet -compact
.It
Команда выполнения изменяется.
.It
Текущий рабочий каталог изменится.
.It
Метафайл цели отсутствует.
.It
В метафайле цели отсутствуют данные filemon при загрузке filemon.
и при предыдущем запуске он не был загружен.
.It
[требует
.Xr filemon 4 ]
Файлы, прочитанные, выполненные или связанные с ними, новее целевых.
.It
[требует
.Xr filemon 4 ]
Файлы, прочитанные, записанные, выполненные или связанные, отсутствуют.
.El
Метафайлы также могут быть полезны для отладки.
.Pp
Сборка скрывает команды, которые выполняются
.Va NO_SILENT
если они не определены
Ошибки вызывают
.Xr make 1
чтобы показать часть своего окружения для дальнейшей отладки.
.Pp
В противном случае сборка работает как обычно.
Изначально эта опция вызывала другую систему сборки, но она была переименована.
для 
.Va WITH_DIRDEPS_BUILD .
.Pp
Это должно быть установлено в среде, командной строке make или
.Pa /etc/src-env.conf ,
не 
.Pa /etc/src.conf .
.It Va WITHOUT_MLX5TOOL
Не стройте
.Xr mlx5tool 8
.Pp
Это настройка по умолчанию для
arm/armv7, powerpc/powerpc and riscv/riscv64.
.It Va WITH_MLX5TOOL
Стройте 
.Xr mlx5tool 8
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc64 and powerpc/powerpc64le.
.It Va WITHOUT_NETCAT
Не стройте 
.Xr nc 1
утилиты.
.It Va WITHOUT_NETGRAPH
Не создавайте приложения для поддержки
.Xr netgraph 4 .
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BLUETOOTH
.El
.Pp
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_NETGRAPH_SUPPORT
(пока не 
.Va WITH_NETGRAPH_SUPPORT
устанавливается явно)
.El
.It Va WITHOUT_NETGRAPH_SUPPORT
Создавайте библиотеки, программы и модули ядра без поддержки netgraph.
.It Va WITHOUT_NETLINK
Не стройте 
.Xr genl 1
утилиты.
.It Va WITHOUT_NETLINK_SUPPORT
Заставьте библиотеки и программы использовать rtsock и
.Xr sysctl 3
интерфейсы вместо
.Xr snl 3 .
.It Va WITHOUT_NIS
Не стройте 
.Xr NIS 8
поддержку и сопутствующие программы.
Если установлено, возможно, вам придется принять
.Xr nsswitch.conf 5
и удалить
.Sq nis
записи.
.It Va WITHOUT_NLS
Не создавайте каталоги NLS.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_NLS_CATALOGS
.El
.It Va WITHOUT_NLS_CATALOGS
Не создавайте поддержку каталога NLS для
.Xr csh 1 .
.It Va WITHOUT_NS_CACHING
Отключите кэширование имен в
.Pa nsswitch
подсистеме.
Общий демон кэширования,
.Xr nscd 8 ,
также не будет создан, если эта опция установлена.
.It Va WITHOUT_NTP
Не стройте 
.Xr ntpd 8
и сопутствующие программы.
.It Va WITHOUT_NVME
Не создавайте инструменты и модули ядра, связанные с nvme.
.Pp
Это настройка по умолчанию для
arm/armv7, powerpc/powerpc and riscv/riscv64.
.It Va WITH_NVME
Создавайте инструменты, связанные с nvme, и модули ядра.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc64 and powerpc/powerpc64le.
.It Va WITHOUT_OFED
Не стройте 
.Dq "OpenFabrics Enterprise Distribution"
Программный стек InfiniBand, включая модули ядра и библиотеки пользовательского пространства.
.Pp
Это настройка по умолчанию для
arm/armv7.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_OFED_EXTRA
.El
.It Va WITH_OFED
Стройте 
.Dq "OpenFabrics Enterprise Distribution"
Программный стек InfiniBand, включая модули ядра и библиотеки пользовательского пространства.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc, powerpc/powerpc64, powerpc/powerpc64le and riscv/riscv64.
.It Va WITH_OFED_EXTRA
Создайте несущественные компоненты
.Dq "OpenFabrics Enterprise Distribution"
Программный стек Infiniband, в основном примеры.
.It Va WITH_OPENLDAP
Включите поддержку LDAP для Kerberos с помощью клиента openldap из портов.
.It Va WITHOUT_OPENMP
Не создавайте среду выполнения OpenMP LLVM.
.Pp
Это настройка по умолчанию для
arm/armv7 and powerpc/powerpc.
.It Va WITH_OPENMP
Создайте среду выполнения OpenMP LLVM.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, i386/i386, powerpc/powerpc64, powerpc/powerpc64le and riscv/riscv64.
.It Va WITHOUT_OPENSSH
Не создавайте OpenSSH.
.It Va WITHOUT_OPENSSL
Не создавайте OpenSSL.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DMAGENT
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_LDNS
.It
.Va WITHOUT_LDNS_UTILS
.It
.Va WITHOUT_LOADER_ZFS
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL_KTLS
.It
.Va WITHOUT_PKGBOOTSTRAP
.It
.Va WITHOUT_UNBOUND
.It
.Va WITHOUT_ZFS
.El
.Pp
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(пока не 
.Va WITH_GSSAPI
устанавливается явно)
.El
.It Va WITHOUT_OPENSSL_KTLS
Не включайте поддержку TLS ядра в OpenSSL.
.Pp
Это настройка по умолчанию для
arm/armv7, i386/i386, powerpc/powerpc and riscv/riscv64.
.It Va WITH_OPENSSL_KTLS
Включите поддержку TLS ядра в OpenSSL.
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, powerpc/powerpc64 and powerpc/powerpc64le.
.It Va WITHOUT_PAM
Не создавайте библиотеку и модули PAM.
.Bf -symbolic
Эта опция устарела и ничего не делает.
.Ef
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_PAM_SUPPORT
(пока не 
.Va WITH_PAM_SUPPORT
устанавливается явно)
.El
.It Va WITHOUT_PAM_SUPPORT
Создайте некоторые программы без поддержки PAM, в частности
.Xr ftpd 8
и 
.Xr ppp 8 .
.It Va WITHOUT_PF
Не создавайте пакет брандмауэра PF.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_AUTHPF
.El
.It Va WITHOUT_PIE
Не создавайте динамически связанные двоичные файлы, поскольку
Независимый от позиции исполняемый файл (PIE).
.Pp
Это настройка по умолчанию для
arm/armv7, i386/i386 and powerpc/powerpc.
.It Va WITH_PIE
Создавайте динамически связанные двоичные файлы как
Независимый от позиции исполняемый файл (PIE).
.Pp
Это настройка по умолчанию для
amd64/amd64, arm64/aarch64, powerpc/powerpc64, powerpc/powerpc64le and riscv/riscv64.
.It Va WITHOUT_PKGBOOTSTRAP
Не стройте 
.Xr pkg 7
инструмент начальной загрузки.
.It Va WITHOUT_PMC
Не стройте 
.Xr pmccontrol 8
и сопутствующие программы.
.It Va WITHOUT_PPP
Не стройте 
.Xr ppp 8
и сопутствующие программы.
.It Va WITH_PROFILE
Создавайте профилированные библиотеки для использования с
.Xr gprof 8 .
Эта опция устарела и может отсутствовать в будущих версиях.
.Fx .
.It Va WITHOUT_PTHREADS_ASSERTIONS
Отключите утверждения отладки в библиотеке pthreads.
.It Va WITHOUT_QUOTAS
Не стройте 
.Xr quota 1
и сопутствующие программы.
.It Va WITHOUT_RADIUS_SUPPORT
Не встраивайте поддержку радиуса в различные приложения, например
.Xr pam_radius 8
и 
.Xr ppp 8 .
.It Va WITH_RATELIMIT
Создайте систему с поддержкой ограничения скорости.
.Pp
Это делает
.Dv SO_MAX_PACING_RATE
эффективным в
.Xr getsockopt 2 ,
и 
.Ar txrlimit
поддерживает в
.Xr ifconfig 8 ,
по доверенности.
.It Va WITHOUT_RBOOTD
Не создавайте и не устанавливайте
.Xr rbootd 8 .
.It Va WITHOUT_RELRO
Не применяйте средство устранения уязвимости Relocation Read-Only (RELRO).
См. также
.Va BIND_NOW
опции.
.It Va WITH_REPRODUCIBLE_BUILD
Исключить метаданные сборки (например, время сборки, пользователя или хост)
из ядра, загрузчиков и вывода uname, так что сборки производят
побитовый идентичный вывод.
.It Va WITHOUT_RESCUE
Не стройте 
.Xr rescue 8 .
.It Va WITH_RETPOLINE
Постройте базовую систему с помощью спекулятивного выполнения retpoline.
устранение уязвимости для CVE-2017-5715.
.It Va WITHOUT_ROUTED
Не стройте 
.Xr routed 8
утилиты.
.It Va WITH_RPCBIND_WARMSTART_SUPPORT
Постройте 
.Xr rpcbind 8
с поддержкой горячего старта.
.It Va WITHOUT_SCTP_SUPPORT
Отключите поддержку ядра для
.Xr sctp 4
Протокола передачи управления потоком
загружаемый модуль ядра.
.It Va WITHOUT_SENDMAIL
Не стройте 
.Xr sendmail 8
и сопутствующие программы.
.It Va WITHOUT_SERVICESDB
Не устанавливайте
.Pa /var/db/services.db .
.It Va WITHOUT_SETUID_LOGIN
Установите этот параметр, чтобы отключить установку
.Xr login 1
чтобы отключить установку корневой программы с установленным идентификатором пользователя.
.It Va WITHOUT_SHAREDOCS
Не стройте 
.Bx 4.4
устаревшие документы.
.It Va WITH_SORT_THREADS
Включите потоки в
.Xr sort 1 .
.It Va WITHOUT_SOURCELESS
Не создавайте модули ядра, содержащие код без исходного кода (микрокод или собственный код для центрального процессора).
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_SOURCELESS_HOST
.It
.Va WITHOUT_SOURCELESS_UCODE
.El
.It Va WITHOUT_SOURCELESS_HOST
Не создавайте модули ядра, содержащие собственный код без исходного кода для ЦП хоста.
.It Va WITHOUT_SOURCELESS_UCODE
Не создавайте модули ядра, содержащие микрокод без исходного кода.
.It Va WITHOUT_SPLIT_KERNEL_DEBUG
Не создавайте отдельные файлы отладки ядра.
Данные отладки (если это разрешено файлом конфигурации ядра)
будет включен в ядро ​​и модули.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERNEL_SYMBOLS
.El
.It Va WITHOUT_SSP
Не создавайте мир с защитой от разрушения стека прополиса.
.It Va WITH_STAGING
Включите размещение файлов в дереве этапов.
Лучше всего это можно рассматривать как автоматическую установку
.Va DESTDIR
с некоторыми дополнительными метаданными, обеспечивающими возможность отслеживания зависимостей.
Зависит от
.Va WITH_DIRDEPS_BUILD .
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITH_STAGING_MAN
(пока не
.Va WITHOUT_STAGING_MAN
устанавливается явно)
.It Va WITH_STAGING_PROG
(пока не
.Va WITHOUT_STAGING_PROG
устанавливается явно)
.El
.Pp
Это должно быть установлено в среде, командной строке make или
.Pa /etc/src-env.conf ,
не 
.Pa /etc/src.conf .
.It Va WITH_STAGING_MAN
Включайте размещение страниц руководства в дереве создания.
.It Va WITH_STAGING_PROG
Включите промежуточное размещение PROG в дереве промежуточного состояния.
.It Va WITH_STALE_STAGED
Убедитесь, что подготовленные файлы не устарели.
.It Va WITHOUT_STATS
Ни построить, ни установить
.Lb libstats
и зависимые двоичные файлы.
.It Va WITHOUT_SYSCONS
Не стройте 
.Xr syscons 4
файлы поддержки, такие как раскладки клавиатуры, шрифты и схемы вывода на экран.
.It Va WITH_SYSROOT
Включить использование sysroot во время сборки.
Зависит от 
.Va WITH_DIRDEPS_BUILD .
.Pp
Это должно быть установлено в среде, командной строке make или
.Pa /etc/src-env.conf ,
не 
.Pa /etc/src.conf .
.It Va WITHOUT_SYSTEM_COMPILER
Не пропускайте по желанию сборку кросс-компилятора во время
этап начальной загрузки сборки.
Обычно, если текущий установленный компилятор соответствует запланированной начальной загрузке
тип и ревизию компилятора, то он не будет собран.
Однако это не мешает сборке компилятора для установки
только для сборки одного для самой сборки.
.Va WITHOUT_CLANG
Опция контролирует это.
.It Va WITHOUT_SYSTEM_LINKER
Не упускайте возможность случайно пропустить создание сшивающего агента во время
этап начальной загрузки сборки.
Обычно, если текущий установленный компоновщик соответствует запланированному бутстрапу
тип и ревизию компоновщика, то он не будет собран.
Однако это не мешает сборке компоновщика для установки.
только для сборки одного для самой сборки.
.Va WITHOUT_LLD
Опция контролирует это.
.Pp
Этот параметр актуален только тогда, когда
.Va WITH_LLD_BOOTSTRAP
она установлена.
.It Va WITHOUT_TALK
Не создавайте и не устанавливайте
.Xr talk 1
и 
.Xr talkd 8 .
.It Va WITHOUT_TCP_WRAPPERS
Не создавайте и не устанавливайте
.Xr tcpd 8 ,
и сопутствующие утилиты.
.It Va WITHOUT_TCSH
Не создавайте и не устанавливайте
.Pa /bin/csh
(который
.Xr tcsh 1 ) .
.It Va WITHOUT_TELNET
Не стройте 
.Xr telnet 1
и сопутствующие программы.
.It Va WITHOUT_TESTS
Не создавайте и не устанавливайте
.Fx
Тестовый набор в
.Pa /usr/tests/ .
Смотрите 
.Xr tests 7
больше подробностей.
Это также отключает сборку всех зависимостей, связанных с тестированием, включая ATF.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DTRACE_TESTS
.El
.Pp
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GOOGLETEST
(пока не 
.Va WITH_GOOGLETEST
устанавливается явно)
.It Va WITHOUT_TESTS_SUPPORT
(пока не 
.Va WITH_TESTS_SUPPORT
устанавливается явно)
.El
.It Va WITHOUT_TESTS_SUPPORT
Отключите сборку всех зависимостей, связанных с тестированием, включая ATF.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GOOGLETEST
.El
.It Va WITHOUT_TEXTPROC
Не стройте 
программы, используемые для обработки текста.
.It Va WITHOUT_TFTP
Не создавайте и не устанавливайте
.Xr tftp 1
и 
.Xr tftpd 8 .
.It Va WITHOUT_TOOLCHAIN
Не устанавливайте
программы, используемые для разработки программ,
компиляторы, отладчики и т. д.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FORMAT
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_LLD
.It
.Va WITHOUT_LLDB
.It
.Va WITHOUT_LLVM_COV
.El
.It Va WITH_UBSAN
Создайте базовую систему с помощью Undefine Behavior Sanitizer (UBSan) для обнаружения
различные виды неопределенного поведения во время выполнения.
Требуется, чтобы Clang использовался в качестве компилятора базовой системы.
и что библиотека поддержки времени выполнения доступна
.It Va WITHOUT_UNBOUND
Не стройте 
.Xr unbound 8
и сопутствующие программы.
.It Va WITHOUT_UNIFIED_OBJDIR
Используйте формат каталога исторических объектов для
.Xr build 7
целей.
Для собственных сборок и сборок, выполненных непосредственно в подкаталогах, формат
.Pa ${MAKEOBJDIRPREFIX}/${.CURDIR}
используется формат:
а для перекрестных сборок
.Pa ${MAKEOBJDIRPREFIX}/${TARGET}.${TARGET_ARCH}/${.CURDIR}
используется.
.Pp
Эта опция является переходной и будет удалена в будущей версии.
.Fx ,
в какое время
.Va WITH_UNIFIED_OBJDIR
будет включен постоянно.
.Pp
Это должно быть установлено в среде, командной строке make или
.Pa /etc/src-env.conf ,
не 
.Pa /etc/src.conf .
.It Va WITHOUT_USB
Не создавайте программы и библиотеки, связанные с USB.
.It Va WITHOUT_USB_GADGET_EXAMPLES
Не создавайте модули ядра USB-гаджета.
.It Va WITHOUT_UTMPX
Не создавайте инструменты учета пользователей, такие как
.Xr last 1 ,
.Xr users 1 ,
.Xr who 1 ,
.Xr ac 8 ,
.Xr lastlogin 8
и 
.Xr utx 8 .
.It Va WITH_VERIEXEC
Включите строительство
.Xr veriexec 8
которое загружает содержимое проверенных манифестов в ядро
для использования
.Xr mac_veriexec 4
.Pp
Зависит от
.Va WITH_BEARSSL .
.It Va WITHOUT_VI
Do not build and install vi, view, ex and related programs.
.It Va WITHOUT_VT
Не стройте 
.Xr vt 4
файлы поддержки (шрифты и раскладки клавиатуры).
.It Va WITHOUT_WARNS
Установите этот параметр, чтобы не добавлять флаги предупреждений к вызовам компилятора.
Полезно в качестве временного обходного пути, когда код попадает в дерево.
который вызывает предупреждения в средах, отличающихся от
оригинальный разработчик.
.It Va WITHOUT_WERROR
Set this to not treat compiler warnings as errors.
Useful as a temporary workaround when working on fixing compiler warnings.
When set, warnings are still printed in the build log but do not fail the build.
.It Va WITHOUT_WIRELESS
Не создавайте программы, используемые для беспроводных сетей 802.11; особенно
.Xr wpa_supplicant 8
и 
.Xr hostapd 8 .
Если они установлены, эти параметры также действуют:
.Pp
.Bl -inset -compact
.It Va WITHOUT_WIRELESS_SUPPORT
(пока не 
.Va WITH_WIRELESS_SUPPORT
устанавливается явно)
.El
.It Va WITHOUT_WIRELESS_SUPPORT
Создавайте библиотеки, программы и модули ядра без
Поддержка беспроводной сети 802.11.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
Постройте 
.Xr wpa_supplicant 8
без поддержки протокола IEEE 802.1X и без
поддержка EAP-PEAP, EAP-TLS, EAP-LEAP и EAP-TTLS
протоколы (можно использовать только через 802.1X).
.It Va WITHOUT_ZFS
Не стройте модуль ядра файловой системы ZFS, такие библиотеки, как
.Xr libbe 3 ,
и пользовательские команды, такие как
.Xr zpool 8
или 
.Xr zfs 8 .
Также отключите поддержку ZFS в утилитах и ​​библиотеках, реализующих
Функциональность, специфичная для ZFS.
.It Va WITHOUT_ZONEINFO
Не создавайте базу данных часовых поясов.
Если установлено, применяются следующие параметры:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_ZONEINFO_LEAPSECONDS_SUPPORT
.El
.It Va WITH_ZONEINFO_LEAPSECONDS_SUPPORT
Внесите информацию о секундах координации в базу данных часовых поясов.
.El
.Sh файлы
.Bl -tag -compact -width Pa
.It Pa /etc/src.conf
.It Pa /etc/src-env.conf
.It Pa /usr/share/mk/bsd.own.mk
.El
.Sh смотрите также
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7
.Sh ИСТОРИЯ
.Nm
Файл появился в
.Fx 7.0 .
.Sh авторы
Эта страница руководства была автоматически создана пользователем
.An tools/build/options/makeman .
