melkorbsd/ru-freebsd-man/man5/stablerestart.5
.\" Copyright (c) 2009 Rick Macklem, University of Guelph
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 10, 2011
.Dt STABLERESTART 5
.Os
.Sh ИМЯ
.Nm nfs-стабильный старт
.Nd информация о перезапуске для
.Tn NFSv4
сервер
.Sh КРАТКИЙ ОБЗОР
.Nm nfs-стабильный старт
.Sh ОПИСАНИЕ
.Nm
файл содержит информацию, которая позволяет
.Tn NFSv4
серверу перезапуститься, не возвращая всегда ошибку NFSERR_NOGRACE, как описано в 
.Tn NFSv4
спецификации сервера;
.%T "Network File System (NFS) Version 4 Protocol RFC 3530, Section 8.6.3" .
.Pp
Первая запись в файле, определенная структурой nfsf_rec в
/usr/include/fs/nfs/nfsrvstate.h содержит продолжительность аренды
последняя версия сервера и количество последующих загрузок.
После этого указывается количество предыдущих загрузок, перечисленных в
первая запись.
Продолжительность аренды используется для установки льготного периода.
Время загрузки
используется, чтобы избежать маловероятного повторного использования времени загрузки,
из-за того, что часы TOD идут в обратном направлении.
Эта запись и предыдущее время загрузки с этим временем загрузки
добавленный перезаписывается в конце льготного периода.
.Pp
Остальная часть файла представляет собой добавленные записи, как определено
struct nfst_rec в /usr/include/fs/nfs/nfsrvstate.h и используются для обозначения одной из двух вещей.
Имеются записи, свидетельствующие о том, что
клиент успешно получил состояние и записи, указывающие на то, что состояние клиента было аннулировано.
Записи об отзыве штата указывают на то, что информация о состоянии
поскольку клиент был исключен из-за истечения срока аренды или иных причин
конфликтующий запрос на открытие или блокировку, сделанный другим клиентом.
Эти записи можно использовать для определения того, могли ли клиенты совершить какое-либо из
краевые условия.
.Pp
Если клиент мог выполнить либо краевое условие, либо этот файл
пуст или поврежден, сервер возвращает NFSERR_NOGRACE при любом возврате
запрос от клиента.
.Pp
Для корректной работы сервера необходимо убедиться, что файл
записывается в стабильное хранилище к моменту возврата операции записи с указанным IO_SYNC.
Для этого может потребоваться отключить кэширование на аппаратном уровне.
локальный диск, на котором хранится файл, или что-то подобное.
.Sh файлы
.Bl -tag -width /var/db/nfs-stablerestart.bak -compact
.It Pa /var/db/nfs-stablerestart
NFSv4 стабильный файл перезапуска
.It Pa /var/db/nfs-stablerestart.bak
резервная копия файла
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr nfsv4 4 ,
.Xr nfsd 8
.Sh ОШИБКИ
Если файл пуст, серверу NFSv4 не остается иного выбора, кроме как вернуть
NFSERR_NOGRACE для всех запросов на возврат.
Хоть это и правильно, но это крайне нежелательное явление, поэтому файл не должен потеряться, если
вообще возможно.
Резервная копия файла сохраняется и используется
.Xr nfsd 8
для минимизации риска возникновения подобных ситуаций.
Чтобы переместить файл, необходимо отредактировать исходники nfsd и перекомпилировать его.
Это было сделано для предотвращения случайного перемещения файла.
