melkorbsd/ru-freebsd-man/man5/style.mdoc.5
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2018-2022 Mateusz Piotrowski <0mp@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd 29 января 2022 г.
.Dt STYLE.MDOC 5
.Os
.Sh ИМЯ
.Nm style.mdoc
.Nd
.Fx
.Xr mdoc 7
руководство по стилю файла
.Sh ОПИСАНИЕ
Этот файл определяет предпочтительный стиль страниц руководства в
.Fx
исходное дерево.
.Ss Примеры кода
.Bl -dash -width ""
.It
Используйте буквальное форматирование для примеров и буквальных команд оболочки, например:
.Bd -literal -offset indent
Затем запустите
\&.Ql чистую устаноку .
.Ed
.Pp
которая отображается как:
.Bd -filled -offset indent
Затем 
.Ql сделайте установку чистой .
.Ed
.Pp
Неправильным способом было бы использовать макросы типа
.Sy \&Nm
чтобы стилизовать вызов команды:
.Bd -literal -offset indent
Затем запустите
\&.Ql Nm make Cm install Cm clean .
.Ed
.Pp
который отображается как:
.Bd -filled -offset indent
Затем запустите
.Ql Nm make Cm install Cm clean .
.Ed
.It
.Sy \&Ql
Макрос является предпочтительным макросом для форматирования литеральных встроенных фрагментов.
Исторически,
.Sy \&Dq \&Li
был предпочтительным способом до прекращения поддержки
.Sy \&Li .
.El
.Ss Раздел ПРИМЕРОВ
.Bl -dash -width ""
.It
Отформатируйте
.Sx ПРИМЕРЫ
раздел следующим образом:
.Bd -literal -offset indent
\&.Bl -tag -width 0n
\&.It Sy Example 1\\&: No Doing Something
\&.Pp
Следующая команда что-то делает.
\&.Bd -literal -offset 2n
\&.Li # Ic make -VLEGAL
\&.Ed
\&.It Sy Example 2\\&: No Doing Something Different
\&.Pp
Следующая команда делает что-то другое.
\&.Bd -literal -offset 2n
\&.Li # Ic bectl list
\&.Ed
\&.Pp
Полезно знать эту команду.
\&.El
.Ed
.Pp
который отображается как:
.Bd -filled -offset indent
.Bl -tag -width 0n
.It Sy Example 1\&: No Doing Something
.Pp
Следующая команда что-то делает.
.Bd -literal -offset 2n
.Li # Ic make -VLEGAL
.Ed
.It Sy Example 2\&: No Doing Something Different
.Pp
Следующая команда делает что-то другое.
.Bd -literal -offset 2n
.Li # Ic bectl list
.Ed
.Pp
Полезно знать эту команду.
.El
.Ed
.El
.Ss Lists
.Bl -dash -width ""
.It
аргумент
.Fl width
 в пользу
.Sy \&.Bl
Макрос должен соответствовать длине самого длинного элемента в списке, например:
.Bd -literal -offset indent
\&.Bl -tag -width "-a address"
\&.It Fl a Ar address
Установите адрес.
\&.It Fl v
Распечатайте версию.
\&.El
.Ed
.Pp
Если самый длинный элемент слишком длинный и ухудшает читабельность,
рекомендуется установить
.Fl width
аргумент
к
.Ql indent ,
например:
.Bd -literal -offset indent
\&.Bl -tag -width "indent"
\&.It Cm build
Постройте порт.
\&.It Cm install
Установите порт.
\&.It Fl install-missing-packages
Установите недостающие пакеты.
\&.El
.Ed
.El
.Ss Synopsis Formatting
.Bl -dash -width ""
.It
Не помещайте пробелы между альтернативными параметрами, разделенными вертикальной чертой.
.Pq Dq | ,
например.:
.Bd -literal -offset indent
\&.Cm compression Cm on Ns | Ns Cm off
\&.Cm install Fl -all Ns | Ns Ar portname Ar ...
.Ed
.Pp
который в разделе СИНТАКСИС отображается как:
.Bd -unfilled -offset indent
.Cm compression Cm on Ns | Ns Cm off
.Cm install Fl -all Ns | Ns Ar portname Ar ...
.Ed
.It
Используйте
.Sy \&Cm
для стилизации символов, которые являются модификаторами команд
.Po e.g.,
.Dq \&, ,
.Dq @
или
.Dq "="
.Pc .
Например:
.Bd -literal -offset indent
\&.Sm off
\&.Fl -meet Cm = Ar who Oo Cm \&, Ar who " " Ar "..." Oc Cm @ Ar where
\&.Sm on
.Ed
.Pp
который отображается как:
.Bd -filled -offset indent
.Sm off
.Fl -meet Cm = Ar who Oo Cm \&, Ar who " " Ar "..." Oc Cm @ Ar where
.Sm on
.Ed
.Pp
вместо:
.Bd -literal -offset indent
\&.Sm off
\&.Fl -meet No = Ar who Oo , Ar who " " Ar "..." Oc @ Ar where
\&.Sm on
.Ed
.Pp
который будет отображаться как:
.Bd -filled -offset indent
.Sm off
.Fl -meet No = Ar who Oo , Ar who " " Ar "..." Oc @ Ar where
.Sm on
.Ed
.Pp
Важно понимать, что в правильном примере
.Dq \&, ,
.Dq @
и
.Dq =
стилизованные под
.Sy \&Cm .
При этом квадратные скобки
.Pq Dq "[]"
не стилизованы, поскольку не принадлежат к синтаксису
.Fl -meet
флага.
.El
.Ss Quoting
.Bl -dash -width ""
.It
Используйте
.Sy \&Dq
.Pq Do Dc
макрос
for quoting.
Используйте
.Sy \&Sq
.Pq So Sc
макрос для цитирования внутри кавычек.
Использование
.Sy \&Qq
.Pq Qo Qc
макроса обычно не нужно.
.El
.Ss Variables
.Bl -dash -width ""
.It
Используйте
.Sy \&Va
вместо
.Sy \&Dv
для
.Xr sysctl 8
переменные, такие как
.Va kdb.enter.panic .
.It
Используйте угловые скобки
.Sy \&Aq
.Pq Dq "<>"
макрос
для аргументов
.Pq Sy \&Ar
когда они смешаны с аналогичными стилизованными макросами, такими как
.Sy \&Pa
или
.Sy \&Va ,
например.:
.Bd -literal -offset indent
\&.Va critical_filesystems_ Ns Aq Ar type
.Ed
.Pp
который отображается как:
.Bd -filled -offset indent
.Va critical_filesystems_ Ns Aq Ar type
.Ed
.Pp
вместо:
.Bd -literal -offset indent
\&.Va critical_filesystems_ Ns Ar type
.Ed
.Pp
это будет отображаться как:
.Bd -filled -offset indent
.Va critical_filesystems_ Ns Ar type
.Ed
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr man 1 ,
.Xr mandoc 1 ,
.Xr mdoc 7 ,
.Xr style 9
.Sh ИСТОРИЯ
Эта страница руководства впервые появилась в
.Fx 13.0 .
.Sh АВТОРЫ
.An Mateusz Piotrowski Aq Mt 0mp@FreeBSD.org
