melkorbsd/ru-freebsd-man/man5/sysctl.conf.5
.\" Copyright (c) 1999 Chris Costello <chris@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 30, 2022
.Dt SYSCTL.CONF 5
.Os
.Sh ИМЯ
.Nm sysctl.conf
.Nd kernel state defaults
.Sh ОПИСАНИЕ
Файл
.Pa /etc/sysctl.conf
считывается, когда система переходит в многопользовательский режим, чтобы установить
настройки ядра по умолчанию.
Файл
.Pa /etc/sysctl.conf
находится в формате
.Xr sysctl 8
command, i.e.,
.Bd -literal -offset indent
sysctl_mib=value
.Ed
.Pp
Комментарии обозначаютс
.Dq #
в начале строки.
Комментарии также могут находиться в конце строки,
как показано в
.Sx ПРИМЕРЫ
ниже.
.Pp
Для модулей ядра, загружаемых через
.Xr rc.subr 8
система,
можно применить дополнительные настройки, специфичные для модуля
добавив файл в том же формате с именем
.Pf /etc/sysctl.kld.d/<module name>.conf .
.Sh ФАЙЛЫ
.Bl -tag -width /etc/rc.d/sysctl_lastload -compact
.It Pa /etc/rc.d/sysctl
.Xr rc 8
script which processes
.Nm
early on in the process of transitioning to multi-user mode.
.It Pa /etc/rc.d/sysctl_lastload
.Xr rc 8
script which processes
.Nm
shortly before the system reaches the multi-user mode.
.It Pa /etc/sysctl.conf
Initial settings for
.Xr sysctl 8 .
.It Pa /etc/sysctl.conf.local
Machine-specific settings for sites with a common
.Pa /etc/sysctl.conf .
.It Pa /etc/sysctl.kld.d
Module specific settings for kernel modules loaded via
.Xr rc.subr 8 .
.El
.Sh ПРИМЕРЫ
Чтобы отключить протоколирование программ, завершающихся из-за фатальных сигналов, вы можете использовать
такую конфигурацию, как
.Bd -literal -offset indent
# Конфигурация логов
kern.logsigexit=0	# Do not log fatal signal exits (e.g., sig 11)
.Ed
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr rc.conf 5 ,
.Xr rc 8 ,
.Xr sysctl 8
.Sh ИСТОРИЯ
Файл
.Nm
появился в
.Fx 4.0 .
.Sh ОШИБКИ
Если загружаемые модули ядра используются для внедрения дополнительной функциональности ядра
функциональность и sysctls для управления этой функциональностью,
.Nm
может быть обработан слишком рано в процессе загрузки, чтобы установить эти sysctls.
Пожалуйста, проконсультируйтесь
.Xr rcorder 8
чтобы узнать больше об упорядочивании скриптов
.Xr rc 8 .
