melkorbsd/ru-freebsd-man/man5/tacplus_conf.5
.\" Copyright 1998 Juniper Networks, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 13, 2023
.Dt TACPLUS.CONF 5
.Os
.Sh ИМЯ
.Nm tacplus.conf
.Nd Файл конфигурации клиента TACACS+
.Sh краткий обзор
.Pa /etc/tacplus.conf
.Sh описание
.Nm
содержит информацию, необходимую для настройки клиента TACACS+
библиотека.
Он анализируется
.Fn tac_config
(see
.Xr libtacplus 3 ) .
Файл содержит одну или несколько строк текста, каждая из которых описывает
один сервер TACACS+, который будет использоваться библиотекой.
Ведущий
пробелы игнорируются, как и пустые строки и строки, содержащие
только комментарии.
.Pp
Сервер TACACS+ описывается минимум двумя полями в строке.
Поля разделяются пробелами и подчиняются тем же правилам, что и
комментарии, цитирование, экранирование и продолжение строки как в оболочке POSIX.
.Pp
В первом поле указывается
хост сервера либо как полное доменное имя, либо как
IP-адрес из четырех точек.
За хостом может дополнительно следовать
.Ql \&:
и цифровой номер порта без пробелов.
Если
спецификация порта опущена, по умолчанию установлено значение 49, стандарт TACACS+.
порт.
.Pp
Второе поле содержит общий секрет, который должен быть известен.
только для клиентских и серверных хостов.
Это произвольная строка
символов, хотя они должны быть заключены в двойные кавычки, если они
содержит пробелы или пусто.
Пустой секрет отключает
обычный механизм шифрования, благодаря которому все данные передаются по сети в
открытый текст.
.Pp
Необязательное третье поле может содержать десятичное целое число, указывающее
таймаут в секундах для связи с сервером.
Тайм-аут применяется
отдельно для каждой операции подключения, записи и чтения.
Если это поле опущено, по умолчанию оно составляет 3 секунды.
.Pp
Необязательное четвертое поле может содержать строку
.Ql single-connection .
Если эта опция включена, библиотека попытается согласовать
с сервером, чтобы TCP-соединение оставалось открытым для нескольких
сеансы.
Некоторые старые серверы TACACS+ могут запутаться, если эта опция
указано.
.Pp
Любые последующие поля должны иметь форму
.Ar attribute Ns = Ns Ar value
и будет добавлен к ответам на авторизацию, как если бы они были
отправлено сервером.
.Pp
Можно указать до 10 серверов TACACS+.
Серверы опробованы в
порядок, пока не будет получен действительный ответ или пока список не будет исчерпан.
.Pp
Стандартное расположение этого файла:
.Pa /etc/tacplus.conf .
Альтернативный путь может быть указан при вызове
.Fn tac_config
(see
.Xr libtacplus 3 ) .
Поскольку файл содержит конфиденциальную информацию в виде
общие секреты, они не должны быть доступны для чтения, кроме как root.
.Sh файлы
.Bl -tag -width Pa
.It Pa /etc/tacplus.conf
.El
.Sh примеры
.Bd -literal
# A simple entry using all the defaults:
tacserver.domain.com	OurLittleSecret

# A server using a non-standard port, with an increased timeout and
# the "single-connection" option, and overrides for the for uid, gid
# and shell attributes.
auth.domain.com:4333	"Don't tell!!"	15	single-connection \e
    uid=1001 gid=20 shell="/usr/local/bin/zsh"

# A server specified by its IP address:
192.168.27.81		$X*#..38947ax-+=	shell="/sbin/nologin"
.Ed
.Sh SEE ALSO
.Xr libtacplus 3
.Sh AUTHORS
Эта документация была написана
.An John Polstra ,
и пожертвована в пользу
.Fx
проекта Juniper Networks, Inc.
