melkorbsd/ru-freebsd-man/man5/tarfs (2).5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2022 Klara, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 14, 2023
.Dt TARFS 5
.Os
.Sh ИМЯ
.Nm tarfs
.Nd архивная файловая система
.Sh краткий обзор
Чтобы скомпилировать этот драйвер в ядро, поместите следующую строку в
файл конфигурации вашего ядра:
.Bd -ragged -offset indent
.Cd "параметры TARFS"
.Ed
.Pp
Альтернативно, чтобы загрузить драйвер как модуль во время загрузки, поместите
следующую строку в
.Xr loader.conf 5 :
.Bd -literal -offset indent
tarfs_load="YES"
.Ed
.Sh описание
.Nm
драйвер реализует файловую систему только для чтения, поддерживаемую
.Xr tar 5
файл.
В настоящее время доступны только POSIX-архивы, опционально поддерживается сжатие с помощью
.Xr индикатора знака 1,

.Pp
Предпочтительный размер ввода-вывода для
.Nm
файловой системы можно настроить с помощью
.Va vfs.tarfs.ioshift
sysctl и настройки.
Установка значения 0 вернет его к значению по умолчанию.
Обратите внимание, что изменения этого параметра применяются только к смонтированным файловым системам.
после изменения.
.Sh ДИАГНОСТИКА
Если включена
.Dv TARFS_DEBUG
опция ядра,
.Va vfs.tarfs.debug
Параметр sysctl можно использовать для управления выводом отладки из
.Nm
драйвера.
Можно включить отладочный вывод для отдельных разделов драйвера
путем сложения соответствующих значений из таблицы ниже.
.Bl -column Value Description
.It 0x01 Ta Memory allocations
.It 0x02 Ta Checksum calculations
.It 0x04 Ta Filesystem operations (vfsops)
.It 0x08 Ta Path lookups
.It 0x10 Ta File operations (vnops)
.It 0x20 Ta General I/O
.It 0x40 Ta Decompression
.It 0x80 Ta Decompression index
.It 0x100 Ta Sparse file mapping
.It 0x200 Ta Bounce buffer usage
.El
.Sh SEE ALSO
.Xr tar 1 ,
.Xr zstd 1 ,
.Xr fstab 5 ,
.Xr tar 5 ,
.Xr mount 8 ,
.Xr sysctl 8
.Sh HISTORY
.An -nosplit
.Nm
драйвер был разработан
.An Stephen J. Kiernan Aq Mt stevek@FreeBSD.org
и
.An Dag-Erling Smørgrav Aq Mt des@FreeBSD.org
для Juniper Networks и Klara Systems.
Эта страница руководства была написана
.An Dag-Erling Smørgrav Aq Mt des@FreeBSD.org
для Juniper Networks и Klara Systems.
