melkorbsd/ru-freebsd-man/man5/tmpfs.5
.\"-
.\" Copyright (c) 2007 Xin LI
.\" Copyright (c) 2017 The FreeBSD Foundation, Inc.
.\"
.\" Part of this documentation was written by
.\" Konstantin Belousov <kib@FreeBSD.org> under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS DOCUMENTATION IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"-
.\" Copyright (c) 2005, 2006 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 21, 2022
.Dt TMPFS 5
.Os
.Sh ИМЯ
.Nm tmpfs
.Nd "файловая система в оперативной памяти"
.Sh КРАТКИЙ ОБЗОР
Чтобы скомпилировать этот драйвер в ядро,
поместите следующую строку в свой
файл конфигурации ядра:
.Bd -неровный отступ со смещением
.Cd "параметры TMPFS"
.Ed
.Pp
Альтернативно, можно загрузить драйвер как
модуль во время загрузки, поместите следующую строку в
.Xr loader.conf 5 :
.Bd -буквальный отступ со смещением
tmpfs_load="YES"
.Ed
.Sh ОПИСАНИЕ 
.Nm
драйвер реализует в памяти или
.Nm
файловая система.
Файловая система хранит как метаданные файла, так и данные в основной памяти.
Это обеспечивает очень быстрый доступ к данным с низкой задержкой.
Данные нестабильны.
Размонтирование или перезагрузка системы делают его недействительным.
Эти свойства делают монтирование файловой системы подходящим для быстрого
скретч-хранилище, например
.Pa /tmp .
.Pp
Если в системе недостаточно памяти и настроен раздел подкачки
.Po смотреть
.Xr swapon 8 Pc ,
система может переносить данные файла в пространство подкачки, освобождая память
для других нужд.
Метаданные, включая содержимое каталога, никогда не заменяются пользователем
текущей реализации.
Имейте это в виду при планировании ограничений монтирования, особенно при ожидании
разместите множество небольших файлов при монтировании tmpfs.
.Pp
Когда
.Xr mmap 2
используется для файла из монтирования tmpfs, объект подкачки виртуальной машины, управляющий
страницы файлов используются для реализации сопоставления и предотвращения двойного копирования
данных файла.
Эта особенность приводит к тому, что инструменты проверки процесса, такие как
.Xr прокстат 1 ,
сообщают об анонимных сопоставлениях памяти вместо сопоставлений файлов.
.Sh ОПЦИИ
Следующие параметры доступны, когда
монтаж
.Nm
файловые системы:
.Bl -ширина тега "It Cm maxfilesize"
.It Cm gid
Указывает идентификатор группы корневого индекса файловой системы.
По умолчанию используется GID точки монтирования.
.It Cm uid
Указывает идентификатор пользователя корневого индекса файловой системы.
По умолчанию используется UID точки монтирования.
.It Cm mode
Указывает режим (в восьмеричной записи) корневого индексного дескриптора файловой системы.
По умолчанию используется режим точки монтирования.
.It Cm nonc
Не используйте кэш имен для разрешения имен файлов для созданного монтирования.
Это экономит память, но в настоящее время может ухудшить масштабируемость для высокопроизводительных систем
б/у крепления на больших машинах.
.It Cm inodes
Указывает максимальное количество узлов, доступных для файловой системы.
Если не указано, файловая система выбирает разумный максимум на основе
размера файловой системы, который можно ограничить с помощью параметра
.Cm  "Размер".

.It Cm  Размер
Указывает общий размер файловой системы в байтах, если не указан суффикс
с одним из k, m, g, t или p, которые обозначают байт, килобайт,
мегабайт, гигабайт, терабайт и петабайт соответственно.
Если ноль (по умолчанию) или значение больше SIZE_MAX — PAGE_SIZE.
указан доступный объем памяти (включая
будет использоваться основная память и пространство подкачки).
.It Cm максимальный размер файла
Указывает максимальный размер файла в байтах.
По умолчанию установлено максимально возможное значение.
.It Cm размер
Указывает максимальный размер памяти, используемый расширенными атрибутами в байтах.
По умолчанию 16 мегабайт.
.El
.Sh ПРИМЕРЫ
Установите
.Nm
файловую система памяти:
.Pp
.Dl "mount -t tmpfs tmpfs /tmp"
.Pp
Настройте
.Nm
монтировать через
.Xr fstab 5 :
.Bd -literal -offset indent
tmpfs /tmp tmpfs rw 0 0
.Ed
.Sh смотрите также
.Xr procstat 1 ,
.Xr mmap 2 ,
.Xr nmount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mdmfs 8 ,
.Xr mount 8 ,
.Xr swapinfo 8 ,
.Xr swapon 8
.Sh HISTORY
.Nm
драйвер впервые появился в
.Fx 7.0 .
.Sh АВТОРЫ
.An -nosplit
.Nm
реализацию ядра написал
.An Julio M. Merino Vidal Aq Mt jmmv@NetBSD.org
as a Google Summer of Code project.
.Pp
.An Rohit Jalan
и другие портировали его из
.Nx
к
.Fx .
.Pp
Эта страница руководства была написана
.An Xin LI Aq Mt delphij@FreeBSD.org .
