melkorbsd/ru-freebsd-man/man5/tzfile.5
.\" This file is in the public domain, so clarified as of
.\" 1996-06-05 by Arthur David Olson.
.Dd December 15, 2022
.Dt TZFILE 5
.Os
.Sh ИМЯ
.Nm Файл  tzfile 
.Информация о часовом поясе Nd
.Sh ОПИСАНИЕ
Файлы с информацией о часовом поясе, используемые 
.Xr tzset 3 
, находятся в разделе 
.Pa /usr/share/zoneinfo .
Эти файлы используют формат, описанный в Internet RFC 8536.
Каждый файл представляет собой последовательность из 8-битных байтов.
В файле, двоичное число представляет собой последовательность из одного или
больше байтов в сетевой порядок (сохранены, или старший байт первый),
все биты значимые,
знаковое двоичное целое число представлен используя два дополнения,
и логическое представлена однобайтовым целым числом, которое является
либо 0 (false) или 1 (true).
Формат начинается с 44-байтового заголовка, содержащего следующие поля:
.Pp 
.Bl -bullet
.It 
Волшебная четырехбайтовая последовательность ASCII 
.Dq "TZif" 
идентифицирует файл как файл с информацией о часовом поясе.
.It 
Байт, идентифицирующий версию формата файла 
(по состоянию на 2021 год, либо ASCII NUL, 
.Dq "2" , 
.Dq "3", 
или 
.Dq "4 " ) .
.It 
Пятнадцать байт, содержащих нули, зарезервированы для использования в будущем.
.It 
Шесть четырехбайтовых целых значений в следующем порядке:
.Pp 
.Bl -tag -compat -width tzh_ttisstdcn
.It Va tzh_ttisutcnt
Количество UT/локальных индикаторов, сохраненных в файле.
(UT - всемирное время.)
.It Va tzh_ttisstdcnt
Количество стандартных / настенных индикаторов, сохраненных в файле.
.It Va tzh_leapcnt
Количество високосных секунд, за которые записи данных хранятся в файле.
.It Va tzh_timecnt
Количество переходов, для которых хранятся записи данных 
в файле.
.It Va tzh_typecnt
Количество типов местного времени, для которых хранятся записи данных 
в файле (не должно быть нулевым).
.It Va tzh_charcnt
Количество байт строк сокращений часовых поясов 
сохраненных в файле.
.El 
.El 
.Pp 
За приведенным выше заголовком следуют следующие поля, длина которых 
зависит от содержимого заголовка:
.Bl -tag -compat -width tzh_timecnt 
.It tzh_timecnt 
четырехбайтовые целые числа со знаком, отсортированные в порядке возрастания.
Эти значения записываются в сетевом порядке байтов.
Каждое используется как время перехода (возвращаемое параметром 
.Xt time 2 ) 
при котором меняются правила вычисления местного времени.
.Он содержит tzh_timecnt 
однобайтовые целочисленные значения без знака;
каждое из них, кроме последнего, указывает, какой из различных типов местного времени 
описанный в файле связан с периодом времени
начиная с того же индексированного времени перехода 
и продолжая до следующего времени перехода, но не включая его.
(Последний тип времени присутствует только для проверки согласованности с помощью 
Строки TZ в стиле POSIX, описанной ниже.)
Эти значения служат индексами в следующем поле.
.It Va tzh_typecnt 
.Vt ttinfo 
записи, каждая из которых определяется следующим образом:
.Pp 
.Bd -literal -offset indent 
struct ttinfo {
 int32_t tt_utoff; 
 символ без знака tt_isdst;
 неподписанный символ tt_desigidx;
}; 
.Ed 
.Pp 
Каждая структура записывается как четырехбайтовое целое число со знаком для 
.Va tt_utoff , 
в сетевом порядке байтов, за которым следует однобайтовое логическое значение для 
.Va tt_isdst 
и однобайтовое значение для 
.Va tt_desigidx .
В каждой структуре, 
.Va tt_utoff 
указывает количество секунд, которое должно быть добавлено к UT, 
.Va tt_isdst 
указывает, следует ли устанавливать 
.Va tm_isdst 
с помощью
.Xr localtime 3 
и 
.Va tt_desigidx 
служит индексом в массиве байтов с сокращениями часовых поясов 
которые следуют за 
.Vt ttinfo 
записи в файле; если обозначенной строкой является "\*-00", то запись 
.Vt ttinfo 
является заполнителем, указывающим, что местное время не указано.
Значение 
.Va tt_utoff 
никогда не равно \-2**31, чтобы позволить 32-разрядным клиентам отменять его без 
переполнения.
Кроме того, в реальных приложениях
.Значение tt_utoff 
находится в диапазоне [\-89999, 93599] (т. е. Более \-25 часов и менее 
26 часов); это позволяет упростить поддержку реализациями, которые 
уже поддерживается диапазон, необходимый для POSIX [\-24:59:59, 25:59:59].
.It использует tzh_charcnt 
байты, представляющие обозначения часовых поясов, 
которые являются байтовыми строками с нулевым завершением, каждая из которых индексируется с помощью 
.Va tt_desigidx 
значения, упомянутые выше.
Строки байтов могут перекрываться, если одна является суффиксом другой.
Кодировка этих строк не указана.
.It Va tzh_leapcnt 
пары четырехбайтовых значений, записанных в сетевом порядке байтов;
первое значение каждой пары дает неотрицательное время 
(возвращаемое параметром 
.Время Xr 3 )
в которое наступает високосная секунда или в которое истекает таблица високосных секунд.;
второе - целое число со знаком, определяющее коррекцию, которая равна 
.Em итогу 
количеству високосных секунд, которые будут применены в течение периода времени 
начиная с заданного времени.
Пары значений отсортированы в строго возрастающем порядке по времени.
Каждая пара обозначает одну високосную секунду, положительную или отрицательную, 
за исключением того, что если последняя пара имеет ту же коррекцию, что и предыдущая, 
последняя пара обозначает время истечения таблицы високосных секунд.
Каждая високосная секунда приходится на конец календарного месяца UTC.
Первая високосная секунда имеет неотрицательное время наступления, 
и является положительной високосной секундой тогда и только тогда, когда ее коррекция положительна;
поправка для каждой високосной секунды после первой отличается 
от предыдущей високосной секунды либо на 1 для положительной високосной секунды, 
либо на \-1 для отрицательной високосной секунды.
Если таблица високосных секунд пуста, поправка на високосную секунду равна нулю 
для всех временных меток;
в противном случае, для временных меток до времени первого появления, 
поправка на високосную секунду равна нулю, если поправка для первой пары равна 1 или \-1, 
и не указана в противном случае (что может происходить только в файлах 
усеченный в начале).
.It Va tzh_ttissstdcnt 
стандартные / настенные индикаторы, каждый из которых хранится в виде однобайтового логического значения;
они сообщают, было ли указано время перехода, связанное с типами местного времени 
стандартное время или местное (настенные часы).
.It Va tzh_ttisutcnt
Индикаторы UT / local, каждый из которых хранится в виде однобайтового логического значения;
они сообщают, было ли указано время перехода, связанное с типами местного времени 
, как UT или местное время.
Если установлен UT / локальный индикатор, также должен быть установлен соответствующий стандартный / настенный индикатор 
.
.El 
.Pp
Индикаторы standard / wall и UT / local были разработаны для 
преобразования времени перехода файла TZif в соответствующие переходы 
для другого часового пояса, указанного с помощью строки TZ в стиле POSIX, в которой отсутствуют правила.
Например, когда TZ="EET\*-2EEST" и нет файла TZif "EET\*-2EEST", 
идея заключалась в том, чтобы адаптировать время перехода из файла TZif с 
хорошо известным именем "posixrules", который присутствует только для этой цели, и 
является копией файла "Europe/Brussels", файла с другим смещением UT.
В POSIX не указано, это устаревшие трансформационного поведения,
правила по умолчанию установка-зависимая, а не реализации
известно, что поддержка этой функции для дат в прошлом 2037,
поэтому люди желают (мол) греческий время вместо этого следует указать
TZ="Европа / Афины" для лучшего исторического освещения, возвращаясь к
TZ ="EET \ *-2EEST, M3.5.0/3, M10.5.0/4", если требуется соответствие POSIX 
и более старые временные метки необязательно обрабатывать точно.
.Pp 
Функция 
.Xr localtime 3 

обычно использует первый параметр 
.Vt ttinfo 
структура в файле 
если либо 
.Va tzh_timecnt 
равно нулю, либо параметр time меньше времени первого перехода, записанного 
в файле.
.Ss Формат версии 2
Для файлов часового пояса в формате версии 2 
за приведенным выше заголовком и данными следуют второй заголовок и данные, 
идентичные по формату, за исключением того, что 
восемь байт используются для каждого времени перехода или второго скачка.
(Количество високосных секунд остается равным четырем байтам.)
После второго заголовка и данных с новой строки-закрытый,
В POSIX-ТЗ-среду-переменная типа String для использования в обработке мгновения
после последнего перевода времени, хранящегося в файле
или для всех моментов, если файл не имеет переходов.
Строка TZ в стиле POSIX пуста (т.Е. Между символами перевода строк ничего нет)
если для таких моментов нет представления в стиле POSIX.
Если значение непустое, строка TZ в стиле POSIX должна соответствовать местному времени 
введите после последнего времени перехода, если оно присутствует в восьмибайтовых данных;
например, учитывая строку 
.Dq "WET0WEST,М3.5.0/1, М10.5.0"
затем, если время последнего перехода приходится на июль, указывается местное время перехода. 
в типе перехода должно быть указано сокращенное летнее время 
.Dq "WEST"
это на один час восточнее UT.
Кроме того, если имеется хотя бы один переход, тип времени 0 ассоциируется с 
периодом времени от неопределенного прошлого до, но не включая 
самое раннее время перехода.
.Ss Формат версии 3
Для файлов часовых поясов формата версии 3 строка в стиле POSIX-TZ может 
использовать два второстепенных расширения формата POSIX TZ, как описано в 
.Xr newtzset 3 .
Во-первых, часовая часть времени перехода может быть подписана и находиться в диапазоне от
\-167 до 167 вместо значений без знака, требуемых POSIX 
от 0 до 24.
Во-вторых, летнее время действует круглый год, если оно начинается
1 января в 00:00 и заканчивается 31 декабря в 24:00 плюс разница 
между переходом на летнее и стандартное время.
.Формат Ss версии 4
Для версии-4-формат файлов TZif,
первый скачок вторая запись может иметь коррекцию, которая является ни
+1 и \1, чтобы представить усечение файла TZif на старте.
Кроме того, если присутствуют два или более переходов в високосную секунду и коррекция последней записи 
равна предыдущей, последняя запись 
обозначает истечение срока действия таблицы високосных секунд вместо високосной секунды;
временные метки после истечения этого срока ненадежны в будущем. 
В выпусках, вероятно, будут добавлены записи о високосных секундах после истечения срока действия, и 
добавленные високосные секунды изменят способ обработки временных меток после истечения срока действия.
.Соображения совместимости Ss
При будущих изменениях формата может быть добавлено больше данных.
.Pp
Файлы версии 1 считаются устаревшим форматом и 
не должны создаваться, поскольку они не поддерживают переход 
после 2038 года.
Читатели, которые понимают только версию 1, должны игнорировать 
любые данные, которые выходят за пределы расчетного конца версии
блок данных 1.
.Pp 
Кроме версии 1, разработчики должны сгенерировать 
наименьший номер версии, необходимый для данных файла.
Например, автор должен сгенерировать файл версии 4 
только в том случае, если срок действия его таблицы leap second либо истек, либо она была усечена в начале.
Кроме того, писатель не генерируя версии 4 файла
следует создавать версия файла 3, только если
Расширения ТЗ строки нужно точно
модель переходного периода.
.PP
Последовательность временных изменений, определенная версией 1 
заголовок и блок данных должны быть непрерывной подпоследовательностью 
временных изменений, определенных версией 2 + заголовок и блок данных 
, и нижним колонтитулом.
Это руководство помогает читателям устаревшей версии 1 
согласовать с текущими читателями временные метки в пределах 
непрерывной подпоследовательности.
Это также позволяет авторам, не поддерживающим 
устаревшие устройства чтения, использовать a 
.Va tzh_timecnt 
равный нулю 
в блоке данных версии 1 для экономии места.
.Pp
Когда файл TZif содержит срок действия таблицы leap second
время читателей TZif следует либо отказаться от процесса
после истечения срока действия временных меток или обрабатывать их, как если бы срок действия
времени не существовало (возможно, с индикацией ошибки).
.PP
Обозначения часовых поясов должны состоять как минимум из трех (3) 
и не более шести (6) символов ASCII из набора 
буквенно-цифровых символов, 
.Dq "\*-", 
и 
.Dq "+" .
Это сделано для совместимости с требованиями POSIX для 
сокращений часовых поясов.
.Pp
При чтении файла версии 2 или выше читателям 
следует игнорировать заголовок версии 1 и блок данных, за исключением 
цели их пропуска.
.Pp 
Читатели должны рассчитать общую длину 
заголовков и блоков данных и убедиться, что все они соответствуют 
фактическому размеру файла, как часть проверки достоверности файла.
.Pp
Когда выпадает положительная високосная секунда, считывателям следует добавить дополнительную 
секунду к местной минуте, содержащей секунду непосредственно перед високосной 
секундой.
Если это происходит, когда смещение UTC не кратно 60 
секундам, високосная секунда наступает раньше последней секунды 
местной минуты, и оставшиеся локальные секунды минуты нумеруются 
через 60 вместо обычных 59; смещение UTC не изменяется.
.Общие проблемы функциональной совместимости Ss
В данном разделе описываются типичные проблемы при чтении или записи TZif файлов.
Большинство из этих проблем в создании TZif файлов для использования
читатели постарше.
Целей настоящего раздела:
.Bl -bullet
.It 
чтобы помочь авторам TZif выводить файлы, которые избегают распространенных 
ошибок в старых или глючных программах чтения TZif, 
.It 
чтобы помочь авторам TZif избежать распространенных ошибок при чтении 
файлы, созданные будущими авторами TZif, и 
.It 
чтобы помочь любым будущим авторам спецификаций увидеть, какие 
проблемы возникают при изменении формата TZif.
.El 
.Pp
Когда были определены новые версии формата TZif, 
целью разработки было то, чтобы читатель мог успешно использовать TZif 
файл, даже если файл имеет более позднюю версию TZif, чем та, что используется в 
ридер был разработан для.
Когда полная совместимость не была достигнута, была предпринята попытка 
ограничить сбои редко используемыми временными метками и разрешить 
простые частичные обходные пути в программах записи, предназначенных для создания 
данных новой версии, полезных даже для читателей старой версии.
В этом разделе предпринята попытка задокументировать эти проблемы совместимости и 
обходные пути, а также задокументировать другие распространенные проблемы в 
readers.
.Pp 
Проблемы взаимодействия с TZif включают следующее:
.Bl -bullet
.It
Некоторые читатели просматривают только данные версии 1.
В качестве частичного решения автор может вывести как можно больше данных версии 1 
.
Однако считыватель должен игнорировать данные версии 1 и должен использовать 
данные версии 2 +, даже если собственные временные метки считывателя содержат только
32 бита.
.It 
Некоторые программы чтения, предназначенные для версии 2, могут неправильно обрабатывать 
временные метки после последнего перехода файла версии 3 или выше, потому что 
они не могут анализировать расширения POSIX в строке, подобной TZ.
Как частичное решение, писатель может выводить больше переходов
чем надо, так что только далекого будущего метки времени
засланный версии 2 читателей.
.It 
Некоторые ридеры, предназначенные для версии 2, не поддерживают 
постоянный переход на летнее время с переходами после 24:00
\(ru например, строка TZ 
.Dq "EST5EDT, 0/0, J365 / 25"
обозначает постоянное летнее время в восточной части страны
(\-04).
В качестве обходного пути автор может заменить стандартное время 
для двух восточных часовых поясов, например, 
.Dq "XXX3EDT4,0/0, J365 / 23"
для часового пояса с никогда не используемым стандартным временем (XXX, \-03) 
и отрицательным переходом на летнее время (EDT, \-04) круглый год.
В качестве альтернативы, 
в качестве частичного обходного пути автор может заменить стандартное время 
на следующий часовой пояс east \ (en, например, 
.Dq "AST4"
для постоянного
Стандартное время Атлантического океана (\-04).
.It 
Некоторые читатели предназначен для версии 2 или 3, и что требует строгого
соответствие стандарту RFC 8536, отклонять версии 4 файлов чей второй прыжок
таблицы усекаются в начале или в конце срока действия.
.It 
Некоторые читатели игнорируют нижний колонтитул и вместо этого предсказывают будущее 
временные метки на основе типа времени последнего перехода.
В качестве частичного обходного пути автор может вывести больше переходов 
, чем необходимо.
.It 
Некоторые считыватели не используют тип времени 0 для временных меток перед 
первым переходом, поскольку они определяют тип времени с помощью 
эвристики, которая не всегда выбирает тип времени 0.
В качестве частичного решения автор может вывести фиктивный файл (без операции) 
первый переход на более раннем этапе.
.It 
Некоторые читатели неправильно обрабатывают временные метки перед первым переходом 
переход с временной меткой не менее \-2 **31.
Считыватели, которые поддерживают только 32-разрядные временные метки, вероятно, будут 
более подвержены этой проблеме, например, при обработке
64-разрядных переходов, только некоторые из которых могут быть представлены в 32 
битах.
В качестве частичного решения автор может вывести фиктивный файл 
переход с отметкой времени \-2**31.
.It 
Некоторые читатели неправильно обрабатывают переход, если его временная метка имеет 
минимально возможное 64-битное значение со знаком.
Временные метки меньше \-2 ** 59 не рекомендуются.
.It
Некоторые читатели неправильно обрабатывают строки TZ в стиле POSIX, которые 
содержат 
.Dq "<" 
или 
.Dq ">".
В качестве частичного обходного пути автор может не использовать 
.Dq "<" 
или 
.Dq ">" 
для сокращений часовых поясов, содержащих только буквенные знаки 
.
.It 
Многие читатели неправильно трактуют сокращения часовых поясов, которые содержат 
символы, отличные от ASCII.
Эти символы использовать не рекомендуется.
.It 
Некоторые читатели могут неправильно интерпретировать сокращения часовых поясов, которые 
содержат менее 3 или более 6 символов или которые 
содержат символы ASCII, отличные от буквенно-цифровых, 
.Dq "\*-", 
и 
.Dq "+".
Эти сокращения не рекомендуются.
.It 
Некоторые читатели неправильно обрабатывают файлы TZif, которые указывают 
смещения UT для перехода на летнее время, которые меньше, чем UT 
смещения для соответствующего стандартного времени.
Эти считыватели не поддерживают такие местоположения, как Ирландия, в которой 
используется эквивалент строки POSIX TZ 
.Dq "IST \*-1GMT0, M10.5.0,M3.5.0/1", 
соблюдая стандартное время
(IST, +01) летом и переход на летнее время (GMT, +00) зимой.
В качестве частичного обходного пути программа записи может выводить данные для 
эквивалента строки POSIX TZ 
.Dq "GMT0IST, M3.5.0/1, M10.5.0" , 
таким образом, происходит замена стандартного времени на летнее.
Хотя этот обходной путь неверно определяет, в какое время года 
используется летнее время, он правильно фиксирует смещения UT и часовой пояс 
сокращения.
.It 
Некоторые считыватели генерируют неоднозначные временные метки для положительных високосных секунд 
которые возникают, когда смещение UTC не кратно 60 секундам.
Например, в часовом поясе со смещением UTC +01:23:45 и с 
положительной високосной секундой 78796801 (1972-06-30 23:59:60 UTC) некоторые читатели будут 
сопоставьте оба 78796800 и 78796801 с 01: 23: 45 по местному времени следующего дня 
вместо сопоставления последнего с 01: 23: 46, и они сопоставят 78796815 с 
01:23:59 вместо до 01:23:60.
Это еще не было практической проблемой, поскольку ни один гражданский орган власти 
не наблюдал такого смещения UTC с тех пор, как были введены високосные секунды 
в 1972 году.
.El 
.Pp
Некоторые проблемы взаимодействия связаны с ошибками чтения, которые 
перечислены здесь в основном как предупреждения разработчикам читалок.
.Bl -bullet 
.It 
Некоторые читалки не поддерживают отрицательные временные метки.
Разработчикам распределенных приложений следует помнить об этом 
, если им необходимо иметь дело с данными до 1970 года.
.It 
Некоторые считыватели неправильно обрабатывают временные метки перед первым переходом. 
переход с неотрицательной временной меткой.
Считыватели, которые не поддерживают отрицательные временные метки, скорее всего,
будьте более склонны к этой проблеме.
.It 
Некоторые читатели неправильно трактуют сокращения часовых поясов, такие как
.Dq "\ * -08" 
, которые содержат 
.Dq "+" , 
.Dq "\*-" , 
или цифры.
.It
Некоторые читатели плохо смещения УТ которые находятся вне
традиционный диапазон от -12 до +12 часов, и поэтому не
хранилища поддерживают как Киритимати, что находится за пределами этой
ассортимент.
.It 
Некоторые считыватели неправильно обрабатывают значения UT в диапазоне [\-3599, \-1]
секунды от UT, потому что они делят смещение на целое число 
3600, чтобы получить 0, а затем отображают часовую часть как 
.Dq "+ 00" .
.It 
Некоторые читатели неправильно интерпретируют значения UT, которые не кратны 
одному часу, или 15 минутам, или 1 минуте.
.El 
.Sh СМОТРИТЕ ТАКЖЕ
.Xr time 3 , 
.Xr localtime 3 , 
.Xr tzset 3 , 
.Xr tzset up 8 , 
.Xr zic 8 , 
.Xr zdump 8 
.Rs 
.%A A. Олсон
.%A П. Эггерт
.%A К. Мерчисон 
.%T "Формат информации о часовом поясе (TZif)"
.%R RFC 8536
.%D Февраль 2019
.%U https://datatracker.ietf.org/doc/html/rfc8536
.%U https://doi.org/10.17487/RFC8536 
.Re
