melkorbsd/ru-freebsd-man/man5/utf8.5
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Paul Borman at Krystal Technologies.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)utf2.4	8.1 (Berkeley) 6/4/93
.\"
.Dd April 7, 2004
.Dt UTF8 5
.Os
.Sh NAME
.Nm utf8
.Nd "UTF-8, формат преобразования ISO 10646"
.Sh КРАТКОЕ ОПИСАНИЕ
.Nm КОДИРОВКА 
.Qq UTF-8
.Sh ОПИСАНИЕ
Кодировка 
.Nm UTF-8
представляет символы UCS-4 в виде последовательности октетов, используя 
от 1 до 6 для каждого символа.
Она обратно совместима с
.Tn ASCII , 
таким образом, 0x00-0x7f относятся к 
.Tn ASCII 
набор символов.
Многобайтовая кодировка 
.В ASCII нет символов, отличных от Ns. 
символы 
полностью состоят из байтов, для которых установлен старший бит.
Фактическая кодировка 
представлена следующей таблицей:
.Bd -literal
[0x00000000 - 0x0000007f] [00000000.0bbbbbbb] -> 0bbbbbbbb
[0x00000080 - 0x000007ff] [00000bbb.bbbbbbbb] -> 110bbbbb, 10bbbbb
[0x00000800 - 0x0000ffff] [bbbbbbbbb.bbbbbbbbb] ->
 1110bbbb, 10bbbbbb, 10bbbbbb
[0x00010000 - 0x001fffff] [00000000.000bbbbb.bbbbbbbbb.bbbbbbbbbb] ->
 11110bbbb, 10bbbbbb, 10bbbbbb, 10bbbbbb
[0x00200000 - 0x03ffffff] [000000bb.bbbbbbbbb.bbbbbbbbbbbbbbb] ->
 111110bb, 10bbbbbb, 10bbbbbb, 10bbbbbb, 10bbbbbb
[0x04000000 - 0x7fffffff] [0bbbbbbbb.bbbbbbbbb.bbbbbbbbbb] ->
 1111110b, 10bbbbbb, 10bbbbbb, 10bbbbbb, 10bbbbbbb, 10bbbbbbbb. 
.Ed 
.Pp
Если существует более одного представления значения (например, 
0x00; 0xC0 0x80; 0xE0 0x80 0x80), всегда используется кратчайшее представление
.
Более длинные символы распознаются как ошибка, поскольку они представляют потенциальную угрозу для безопасности 
и нарушают сопоставление последовательности символов и октетов 1:1.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr euc 5 
.Rs 
.%A "Роб Пайк"
.%A "Кен Томпсон"
.%T "Привет, мир"
.%J "Материалы технической конференции USENIX зимой 1993 года"
.%Q "Ассоциация USENIX"
.%D "Январь 1993"
.Re 
.Rs 
.%A "Ф. Ерго"
.%T "UTF-8, формат преобразования ISO 10646" 
.%O "RFC 2279"
.%D "Январь 1998"
.Re 
.Rs 
.%Q "Консорциум Unicode"
.%T "Стандарт Unicode, версия 3.0"
.%D "2000"
.%O "с поправками, внесенными Приложением № 27 к стандарту Unicode: Unicode 3.1 и Приложением №28 к стандарту Unicode: Unicode 3.2"
.Re 
.Sh СТАНДАРТЫ
Кодировка 
.Nm 
совместима с RFC 2279 и Unicode 3.2.