melkorbsd/ru-freebsd-man/man5/uuencode.5
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)uuencode.format.5	8.2 (Berkeley) 1/12/94
.\"
От 12 января 1994 г.
.Dt UUENCODE 5 
.Os 
.Sh ИМЯ
.Nm uuencode 
.Формат Nd закодированного файла uuencode 
.Sh ОПИСАНИЕ
Файлы, выводимые
.Xr uuencode 1 
состоит из строки заголовка, 
за которой следует ряд строк кузова, 
и строки трейлера.
Команда 
.Xr uudecode 1 

проигнорирует любые строки, предшествующие заголовку или 
следующие за трейлером.
Строки, предшествующие заголовку, конечно, не должны 
выглядеть как заголовок.
.Pp
Строка заголовка отличается наличием первых
6 символов
.Dq begin\ \& 
(обратите внимание на пробел в конце).
Слово 
.Em начать
за ним следует режим (восьмеричный), 
и строка, которая называет удаленный файл.
Три элемента в строке заголовка разделены пробелом.
.Pp
Основная часть состоит из нескольких строк, каждая длиной не более 62 символов 
(включая завершающую новую строку).
Они состоят из количества символов, 
за которыми следуют закодированные символы, 
за которыми следует новая строка.
Количество символов - это один печатный символ, 
и представляет собой целое число, количество байтов 
представляет остальная часть строки.
Такие целые числа всегда находятся в диапазоне от 1 до 45 или 64 и могут быть 
определены путем вычитания символьного пробела (восьмеричной цифры 40) 
из символа.
Символ 64 представляет нулевое значение.
.PP
Группы по 3 байта хранятся в 4-х символов, 6 бит на символ.
Все герои всегда находятся в диапазоне от 1 до 64 и это компенсируется
космос (восьмеричном 40) чтобы принять печатными буквами.
Символ
64 представляет нулевое значение.
Последняя строка может быть короче обычных 45 байт.
Если размер не кратен 3, этот факт можно определить 
по значению count в последней строке.
Будут добавлены дополнительные символы null, чтобы количество символов было кратно 
4.
Основная часть заканчивается строкой со счетом, равным нулю.
Эта строка состоит из единицы 
.Tn ASCII 
обратная кавычка (восьмеричная цифра 140).
.Pp
Линия прицепа состоит из 
.Dq конца 
отдельной линии.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr mail 1 , 
.Xr uucp 1 , 
.Xr uudecode 1 , 
.Xr uuencode 1
.Sh ИСТОРИЯ
Формат файла 
.Nm 
появился в версии 
.Bx 4.0 .
.\" До версии 4.3 он назывался uuencode.5
