melkorbsd/ru-freebsd-man/man5/wpa_supplicant.conf.5
.\" Copyright (c) 2005 Sam Leffler <sam@errno.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 16, 2022
.Dt WPA_SUPPLICANT.CONF 5
.Os
.Sh ИМЯ 
.Nm wpa_supplicant.conf 
.Найдите файл конфигурации для
.Xr wpa_supplicant 8
.Sh ОПИСАНИЕ
Утилита 
.Xr wpa_supplicant 8 
является реализацией компонента WPA supplicant, 
то есть той части, которая выполняется на клиентских станциях.
Он реализует согласование ключа WPA с аутентификатором WPA 
и аутентификацию EAP с сервером аутентификации, используя 
информацию о конфигурации, хранящуюся в текстовом файле.
.Pp
Файл конфигурации состоит из необязательных глобальных параметров 
настроек и одного или нескольких сетевых блоков, например \& 
по одному для каждого используемого SSID.
Утилита 
.Xr wpa_supplicant 8 

автоматически выберет лучшую сеть на основе порядка 
сетевых блоков в файле конфигурации, уровня сетевой безопасности.
(Предпочтительнее WPA / WPA2) и уровень сигнала.
Комментарии обозначаются символом 
.Ql # 
; весь текст до 
конца строки будет проигнорирован.
.Sh ГЛОБАЛЬНЫЕ ПАРАМЕТРЫ
Параметры по умолчанию, используемые
.Xr wpa_supplicant 8 
может быть переопределен путем указания 
.Pp
.Dl parameter=value 
.Pp 
в файле конфигурации (обратите внимание, что пробелы не допускаются).
Значения со встроенными пробелами должны быть заключены в кавычки.
.Pp
Распознаются следующие параметры:
.Bl -tag -width indent
.It ctrl_interface
Путь к каталогу, в котором
.Xr wpa_supplicant 8 
создает 
.Ux 
файлы доменных сокетов для обмена данными 
с интерфейсными программами, такими как
.Xr wpa_cli 8 .
.It ctrl_interface_group ва 
Имя группы или идентификатор группы для применения В установка защиты на
файл интерфейс управления.
Это может быть установлено, чтобы разрешить пользователям, не имеющим права root, доступ к файлам интерфейса управления 
.
Если группа не указана, идентификатор группы интерфейса управления 
не изменяется и обычно будет равен 
идентификатору группы каталога, в котором создан сокет.
.It eapol_version
Используемая версия протокола IEEE 802.1x / EAPOL; либо 1 (по умолчанию), либо 2.
Утилита 
.Xr wpa_supplicant 8 

реализована в соответствии с IEEE 802-1X-REV-d8, который определяет
Версию EAPOL равной 2.
Однако некоторые точки доступа не работают с 
этой версией, поэтому по умолчанию
.Xr wpa_supplicant 8
сообщит, что он использует EAPOL версии 1.
Если для корректной работы с точкой доступа должна быть объявлена версия 2. 
это значение может быть установлено равным 2.
.It ap_scan
Контроль сканирования и выбора точки доступа; одно из значений 0, 1 (по умолчанию) или 2.
Для параметра 
следует использовать только значение 1 .Xr wlan 4 
модуль; остальные настройки предназначены для использования в других операционных системах.
.It Va fast_reauth
Быструю повторную аутентификацию EAP; либо 1 (по умолчанию), либо 0.
Управляйте поддержкой быстрой повторной аутентификации в методах EAP, которые ее поддерживают.
.El 
.Sh СЕТЕВЫЕ БЛОКИ
Каждая потенциальная сеть / точка доступа должна иметь 
.Dq "сетевой блок" 
который описывает, как его идентифицировать и как настроить безопасность.
Когда в файле конфигурации указано несколько сетевых блоков, 
для использования выбирается блок с наивысшим приоритетом или, если определено несколько сетей 
с одинаковым приоритетом, используется первый блок, указанный в файле конфигурации 
.
.Pp 
Описание сетевого блока имеет вид:
.Bd -literal -offset indent
сеть ={
 параметр =значение
 ...
}
.Ed 
.Pp 
(обратите внимание на начало 
.Qq Li "network={"
может не содержать пробелов).
Спецификация блока содержит один или несколько параметров 
из следующего списка:
.Bl -tag -width indent
.It Va ssid No (обязательно)
Имя сети (указанное точкой доступа).
An
.Tn ASCII 
или шестнадцатеричная строка, заключенная в кавычки.
.It Va scan_ssid
Метод сканирования SSID; 0 (по умолчанию) или 1.
Метод 0 сканирует SSID с использованием широковещательного кадра запроса проверки.
Метод 1 использует направленные кадры запроса проверки, отправляемые на каждый настроенный SSID.
Точки доступа, которые маскируются, не передавая свой SSID, требуют 
техника 1.
Помните, что этот метод может привести к тому, что сканирование может занять больше времени, 
и предоставляет список настроенных сетевых SSID для прослушивания.
.It Va bssid
Сетевой BSSID (обычно MAC-адрес точки доступа).
.It имеет приоритет.
Приоритет сети при выборе из нескольких сетей.;
более высокое значение означает, что сеть является более желательной.
По умолчанию сети имеют приоритет 0.
Когда рассматривается несколько сетей с одинаковым приоритетом. 
для выбора одной из них используется другая информация, такая как политика безопасности и 
уровень сигнала.
.It Va mode
Рабочий режим IEEE 802.11; либо 0 (инфраструктура, по умолчанию), либо 1 (IBSS).
Обратите внимание, что режим IBSS (adhoc) можно использовать только с
.Va key_mgmt 
установить в
.Li НЕТ
(открытый текст и статический WEP), или
.Va key_mgmt 
установлено значение
.Li WPA-НЕТ
(фиксированный групповой ключ TKIP /CCMP).
Кроме того, 
.Va ap_scan
должно быть установлено значение 2 для IBSS.
.Li WPA-НЕТ 
требуется
.Va proto 
установлено значение WPA,
.Va key_mgmt 
установлено значение WPA-NONE, 
.Va попарно 
установлено значение NONE, 
.Va group 
установлено значение либо
CCMP, либо TKIP (но не оба), и 
.Va psk 
также должен быть установлен.
.It Va proto
Список допустимых протоколов; один или несколько из:
.Li WPA 
(IEEE 802.11i / D3.0)
и 
.Li RSN 
(IEEE 802.11i).
.Li WPA2 
- другое название для
.Li RSN.
Если нет, установите значение по умолчанию равным 
.Qq Li "WPA RSN" .
.It Использует key_mgmt
Список допустимых протоколов управления ключами; один или несколько из:
.Li WPA-PSK
(предварительно разделяемый ключ WPA),
.Li WPA-EAP
(WPA с использованием аутентификации EAP), 
.Li IEEE8021X
(IEEE 802.1x с использованием аутентификации EAP и, 
необязательно, динамически генерируемых ключей WEP),
.Li НЕТ
(открытый текст или статические ключи WEP).
Если нет, установите значение по умолчанию равным 
.Qq Li "WPA-PSK, WPA-EAP" .
.It Va auth_alg
Список разрешенных алгоритмов аутентификации IEEE 802.11; один или несколько из:
.Li OPEN
(Аутентификация с открытой системой, требуется для WPA /WPA2), 
.Li SHARED
(Аутентификация с общим ключом), 
.Li LEAP
(LEAP / Сетевой EAP).
Если не задано, используется автоматический выбор (откройте систему с помощью LEAP 
включено, если LEAP разрешен как один из методов EAP).
.It Va pairwise
Список допустимых попарных (одноадресных) шифров для WPA; один или несколько из:
.Li CCMP
(AES в режиме счетчика с CBC-MAC, RFC 3610, IEEE 802.11i /D7.0),
.Li TKIP
(Протокол целостности временного ключа, IEEE 802.11i / D7.0),
.Li НЕТ 
(устарело).
Если нет, установите значение по умолчанию равным 
.Qq Li "CCMP TKIP" .
.It Va group
Список допустимых групповых (многоадресных) шифров для WPA; один или несколько из:
.Li CCMP
(AES в режиме счетчика с CBC-MAC, RFC 3610, IEEE 802.11i /D7.0),
.Li TKIP
(Протокол целостности временного ключа, IEEE 802.11i / D7.0),
.Li WEP104
(WEP со 104-битным ключом),
.Li WEP40
(WEP с 40-битным ключом).
Если нет, установите значение по умолчанию равным 
.Qq Li "CCMP TKIP WEP104 WEP40".
.It Va psk
Предварительно разделенный ключ WPA, используемый в режиме WPA-PSK.
Ключ задается в виде 64 шестнадцатеричных цифр или в виде 
символа 8-63
.Tn ASCII
кодовая фраза.
.Tn ASCII 
ключевые фразы динамически преобразуется в 256-битный ключ во время выполнения
используя SSID сети, или они могут быть статически конвертированы по
время configuration с помощью
утилиты
.Xr wpa_passphrase 8
.
.It Va eapol_flags
Динамическое использование ключа WEP для режима, отличного от WPA, указанное в виде битового поля.
Бит 0 (1) принудительно использует динамически генерируемые одноадресные ключи WEP.
Бит 1 (2) принудительно использует динамически генерируемые широковещательные ключи WEP.
По умолчанию для этого значения установлено значение 3 (используйте оба).
.It Va eap
Список приемлемых методов EAP; один или несколько из:
.Li MD5
(EAP-MD5, не может использоваться с WPA, 
используется только как метод фазы 2 с EAP-PEAP или EAP-TTLS),
.Li MSCHAPV2
(EAP-MSCHAPV2, не может использоваться с WPA;
используется только как метод фазы 2 с EAP-PEAP или EAP-TTLS),
.Li OTP 
(EAP-OTP, не может использоваться с WPA;
используется только как метод фазы 2 с EAP-PEAP или EAP-TTLS),
.Li GTC 
(EAP-GTC, не может использоваться с WPA;
используется только как метод фазы 2 с EAP-PEAP или EAP-TTLS),
.Li TLS 
(EAP-TLS, сертификат клиента и сервера),
.Li PEAP
(EAP-PEAP, с туннельной аутентификацией EAP), 
.Li TTLS 
(EAP-TTLS с туннельной аутентификацией EAP или PAP/ CHAP / MSCHAP / MSCHAPV2).
Если нет, установите значение по умолчанию для всех доступных методов, скомпилированных в to
.Xr wpa_supplicant 8 .
Обратите внимание, что по умолчанию
.Xr wpa_supplicant 8 
скомпилирован с поддержкой EAP; см.
.Xr make.conf 5 
для получения информации о 
.Va NO_WPA_SUPPLICANT_EAPOL 
конфигурационная переменная, которую можно использовать для отключения поддержки EAP.
.It Использует identity
Строка идентификатора для EAP.
.It использует anonymous_identity
Анонимная строка идентификатора для EAP (будет использоваться в качестве незашифрованного идентификатора 
с типами EAP, которые поддерживают разные туннельные идентификаторы; например, \& EAP-TTLS).
.It mixed_cell
Настройте, разрешены ли сети, которые допускают как открытый текст, так и шифрование 
, при выборе BSS из результатов сканирования.
По умолчанию для этого параметра установлено значение 0 (отключено).
.It Va password
Строка пароля для EAP.
.It использует ca_cert
Путь к файлу сертификата CA.
Этот файл может содержать один или несколько доверенных сертификатов CA.
Если 
.Va ca_cert 
не включен, сертификаты сервера проверяться не будут (не рекомендуется).
.It Va client_cert
Путь к файлу сертификата клиента (PEM /DER).
.It Va private_key
Путь к файлу закрытого ключа клиента (PEM /DER /PFX).
Если используется файл PKCS #12 / PFX, то 
.Va client_cert 
указывать не следует, поскольку и закрытый ключ, и сертификат будут считываться 
из файла PKCS # 12.
.It Va private_key_passwd
Пароль для любого файла закрытого ключа.
.It dh_file
Путь к файлу, содержащему параметры DH / DSA (в формате PEM).
Этот файл содержит параметры для эфемерного обмена ключами DH.
В большинстве случаев аутентификация RSA по умолчанию не использует эту конфигурацию.
Однако можно настроить RSA на использование эфемерного обмена ключами DH.
Кроме того, шифры с
Ключи DSA всегда используют эфемерные ключи DH.
Это можно использовать для обеспечения прямой секретности.
Если в файле 
.Va dh_file
находится в формате параметров DSA, он будет автоматически преобразован 
в параметры DH.
.It требует subject_match
Подстрока, которая будет сопоставлена с subject в сертификате сервера аутентификации 
.
Если эта строка задана, сервер 
сертификат принимается только в том случае, если он содержит эту строку в теме письма.
Строка темы имеет следующий формат:
.Pp 
.Dl "/ C = США / ST = Калифорния / L = Сан-Франциско / CN = Тест AS/emailAddress=as@example.com"
.It Va phase1
Параметры фазы 1 (внешняя аутентификация, т.е. Туннель TLS) 
(строка с парами поле-значение, например, 
.Qq Li peapver=0 
или 
.Qq ( "peapver=1 , peaplabel=1" ) .
.Bl -inset
.It Li peapver
может использоваться для определения того, какая версия PEAP (0 или 1) используется.
.It Li peaplabel=1 
может использоваться для принудительного ввода новой метки, 
.Dq "шифрование клиента по протоколу PEAP", 
используется при получении ключа при использовании PEAPv1 или новее.
Большинство существующих реализаций peap V1, похоже, используют старую метку, 
.Dq Li "шифрование EAP клиента", 
и 
.Xr wpa_supplicant 8 
теперь использует это как 
значение по умолчанию.
Некоторым серверам, например,
.Tn Radiator , 
может потребоваться
.Li peaplabel= 1 
конфигурация для взаимодействия с PEAPv1; см.
.Pa eap_testing.txt 
для получения более подробной информации.
.It Li peap_outer_success=0
может использоваться для завершения аутентификации PEAP на
туннелированный EAP-успех.
Это требуется для некоторых серверов RADIUS, которые 
реализуют 
.Pa draft-josefsson-pppext-eap-tls-eap-05.txt 
(например,,
.Tn Lucent NavisRadius v4.4.0 
с PEAP в 
.Dq "Проект IETF 5"
режим).
.Он Li include_tls_length=1 
может использоваться для принудительного включения
.Xr wpa_supplicant 8 
включить
TLS в поле длины сообщения во всех ТЛС сообщения, даже если они не
фрагментарный характер.
.It Li sim_min_num_chal=3
может использоваться для настройки EAP-SIM на требование трех вызовов 
(по умолчанию он принимает 2 или 3).
.It Li fast_provisioning=1 
опция позволяет в режиме реального времени предоставлять учетные данные EAP-FAST 
(PAC).
.El 
.It Va phase2
phase2: Phase2 (внутренняя аутентификация с туннелем TLS) 
(строка с парами поле-значение, например, 
.Qq Li "auth=MSCHAPV2"
для EAP-PEAP или 
.Qq Li "autheap=MSCHAPV2 autheap= MD5"
для EAP-TTLS).
.It Va ca_cert2
Нравится
.Va ca_cert 
но для внутренней фазы EAP 2.
.It Va client_cert2
Нравится
.Va client_cert 
но для внутренней фазы EAP 2.
.It Va private_key2
Нравится
.Va private_key 
но для внутренней фазы EAP 2.
.It Va private_key2_passwd
Нравится
.Va private_key_passwd 
но для внутренней фазы 2 EAP.
.It Va dh_file2
Нравится
.Va dh_file 
но для внутренней фазы EAP 2.
.It Va subject_match2
Нравится
.Va subject_match 
но для внутренней фазы 2 EAP.
.It использует eappsk
16-байтовый предварительно разделяемый ключ в шестнадцатеричном формате для использования с EAP-PSK.
.It использует nai
Пользовательский NAI для использования с EAP-PSK.
.It Использует server_nai
Сервер аутентификации NAI для использования с EAP-PSK.
.It использует pac_file
Путь к файлу, который будет использоваться для записей PAC с EAP-FAST.
утилиты
.ХС в wpa_supplicant 8
.
должен быть в состоянии создать этот файл и записать его, когда
ПАК подготовке и обновлении.
.It eap_workaround
Включение / отключение обходных путей EAP для различных проблем взаимодействия 
с неправильно работающими серверами аутентификации.
По умолчанию эти обходные пути включены.
Строгое соответствие EAP можно настроить, установив для этого значение 0.
.It использует wep_tx_keyidx 
какой ключ использовать для передачи пакетов.
.It использует ключ wep_keyN.
An 
.Tn ASCII 
строка, заключенная в кавычки для кодирования ключа WEP.
Без кавычек это шестнадцатеричная строка фактического ключа.
WEP считается небезопасным, и его следует избегать.
Точный перевод ASCII-ключа в шестнадцатеричный ключ варьируется.
По возможности используйте шестнадцатеричные ключи.
СЕРТИФИКАТЫ .El 
.Sh
Некоторые методы аутентификации EAP требуют использования сертификатов.
EAP-TLS использует сертификаты как на стороне сервера, так и на стороне клиента, 
в то время как EAP-PEAP и EAP-TTLS требуют только сертификат на стороне сервера.
При использовании сертификата клиента, соответствующий файл закрытого ключа должны
также будут добавлены в конфигурацию.
Если закрытый ключ использует кодовую фразу, это 
должно быть настроено в файле 
.Nm 
как 
.Va private_key_passwd .
.Pp 
Утилита 
.Xr wpa_supplicant 8 

поддерживает сертификаты X.509 в форматах PEM и DER.
Сертификат пользователя и закрытый ключ могут быть включены в один файл.
.Pp
Если сертификат пользователя и закрытый ключ получены в формате PKCS # 12 / PFX 
, их необходимо преобразовать в подходящий формат PEM / DER для 
использования 
.Xr wpa_supplicant 8 .
Это можно сделать с помощью программы 
.Xr openssl 1 
, например,\& с помощью следующих команд:
.Bd -literal
# преобразовать сертификат клиента и закрытый ключ в формат PEM 
openssl pkcs12 -в примере.pfx -для пользователя.pem -clcerts
# преобразовать сертификат CA (если он включен в файл PFX) в формат PEM 
файлы openssl pkcs12 -in example.pfx -out ca.pem -cacerts -nokeys 
.Ed 
.Sh 
.Bl -tag -width ".Pa /usr/share/examples/etc/wpa_supplicant.conf" -compact
.It Pa /etc/wpa_supplicant.conf
.It Pa /usr/share/examples/etc/wpa_supplicant.conf
.El 
.Sh ПРИМЕРЫ
WPA-Personal (PSK) в качестве домашней сети и WPA-Enterprise с EAP-TLS 
в качестве рабочей сети:
.Bd -literal
# разрешить использование интерфейса (например, wpa_cli) всеми пользователями в группе 'wheel' 
ctrl_interface=/var/run/wpa_supplicant 
ctrl_interface_group=колесо
#
# домашняя сеть; разрешить все допустимые шифры 
network={
 ssid="home"
 scan_ssid=1
 key_mgmt=WPA-PSK
 psk= "очень секретная фраза-пароль"
}
#
# работайте в сети; используйте EAP-TLS с WPA; разрешайте только шифры CCMP и TKIP 
сеть ={
 ssid="работа" 
 scan_ssid=1
 key_mgmt= WPA-EAP 
 pairwise=CCMP TKIP
 group=CCMP TKIP
 eap= TLS 
 identity="user@example.com"
 ca_cert="/etc/сертификат/ca.pem"
 client_cert="/etc/сертификат/user.pem"
 private_key="/etc/сертификат/user.prv"
 private_key_passwd="пароль"
}
.Ed 
.Pp 
WPA-RADIUS / EAP-PEAP / MSCHAPv2 с серверами RADIUS, использующими старую метку peaplabel 
(например, Funk Odyssey и SBR, Meetinghouse Aegis, Interlink RAD-Series):
.Bd -литерал 
ctrl_interface=/var/run/wpa_supplicant 
ctrl_interface_group=wheel 
сеть={
 ssid="example"
 scan_ssid=1
 key_mgmt= WPA-EAP
 eap= PEAP 
 идентификатор ="user@example.com"
 пароль ="foobar"
 ca_cert="/etc/cert/ca.pem"
 фаза1="peaplabel=0"
 фаза2="auth=MSCHAPV2"
}
.Изд. 
.Рр
ВП-в ttls/протокол EAP-MD5-это проблема конфигурации с анонимных идентификаторов для
незашифрованные использования.
Настоящие удостоверения передаются только в зашифрованном виде по протоколу TLS туннель.
.Bd -literal
ctrl_interface=/var/run/wpa_supplicant 
ctrl_interface_group=wheel 
сеть={
 ssid="example"
 scan_ssid=1
 key_mgmt= WPA-EAP
 eap = TTLS 
 identity="user@example.com"
 anonymous_identity="anonymous@example.com"
 пароль="foobar"
 ca_cert="/etc/cert/ca.pem"
 phase2="auth=MD5"
}
.Ed 
.Pp 
Традиционная конфигурация WEP со 104-битным ключом, заданным в шестнадцатеричном формате.
Обратите внимание, что ключ WEP не заключен в кавычки.
.Bd -литерал 
ctrl_interface=/var/run/wpa_supplicant 
ctrl_interface_group=wheel 
сеть={
 ssid="пример"
 scan_ssid=1
 key_mgmt = НЕТ
 wep_tx_keyidx= 0
 # шестнадцатеричные ключи, обозначенные без кавычек
 wep_key0=42FEEDDEAFBABEDEAFBEEFAA55
# ASCII keys denoted with quotes.
 wep_key1="FreeBSDr0cks!"
}
.Ed 
.Pp 
Минимальная конфигурация eduroam.
.Bd -literal
ctrl_interface=/var/run/wpa_supplicant 
ctrl_interface_group= колесо 
сеть ={
 ssid="eduroam"
 scan_ssid=1
 key_mgmt= WPA-EAP
 eap = TTLS 
 identity="user@example.org"
 пароль ="foobar"
 фаза 2="auth = MSCHAPV2"
}
.Ed 
.Sh СМОТРИ ТАКЖЕ
.Xr wpa_cli 8 , 
.Xr wpa_passphrase 8 , 
.Xr wpa_supplicant 8
.ИСТОРИЯ Sh
Страница руководства 
.Nm 
и 
.Xr wpa_supplicant 8 
функциональность впервые появилась в 
.Fx 6.0 .
.Sh Авторы 
Эта страница руководства является производной от 
.Pa ЧИТАЙ МЕНЯ
и 
.Pa wpa_supplicant.conf 
файлы в дистрибутиве 
.Nm wpa_supplicant 
предоставлены
.An Jouni Malinen Aq Mt j@w1.fi .
