melkorbsd/ru-freebsd-man/man5/ypldap.conf.5
.\"	$OpenBSD: ypldap.conf.5,v 1.19 2012/04/30 11:28:25 jmatthew Exp $
.\"
.\" Copyright (c) 2008 Pierre-Yves Ritschard <pyr@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 22 2020 $
.Dt YPLDAP.CONF 5
.Os
.Sh ИМЯ
.Nm ypldap.conf 
.Найдите файл конфигурации daemon YP-карты LDAP 
.Sh ОПИСАНИЕ 
.Xr ypldap 8 
предоставляет карты YP, используя LDAP в качестве серверной части.
.Sh РАЗДЕЛЫ
Файл конфигурации 
.Nm 
разделен на три основных раздела.
.Bl -tag -width xxxx
.В нем используются макросы
Пользовательские переменные могут быть определены и использованы позже, что упрощает работу с 
файлом конфигурации.
.Это глобальная конфигурация
Глобальные настройки для
.Xr ypldap 8.
.Sy Это каталоги
Параметры, относящиеся к каталогу LDAP.
.El 
.Sh МАКРОСЫ
Очень похожи на
.Xr cpp 1 
или
.Xr m4 1 , 
могут быть определены макросы, которые позже будут расширены в контексте.
Имена макросов должны начинаться с буквы, цифры или подчеркивания, 
и могут содержать любой из этих символов.
Имена макросов могут не быть зарезервированными словами (например, 
домен .Ic ) .
Макросы не заключаются в кавычки.
.Pp 
Например:
.Bd -literal -offset indent

fixed_gecos="Извлечен из LDAP"

исправлен атрибут gecos $fixed_gecos 
.Ed 
.Sh ГЛОБАЛЬНАЯ КОНФИГУРАЦИЯ
Глобальные настройки касаются основного поведения демона.
.Pp 
.Bl -tag -width Ds -compact
.Строка Ar домена It
Укажите имя домена NIS 
.Nm 
предоставит.
.It интервал в секундах
Укажите интервал в секундах, с которым будет извлечен весь каталог 
из LDAP.
.It предоставьте Ar-строку map.
Укажите карту, которая должна быть предоставлена 
.Nm
В настоящее время реализованы следующие карты: passwd.byname, passwd.byuid, 
group.byname, group.bygid.
.El
.Sh КАТАЛОГИ
Каталоги используются для описания схемы LDAP и справки 
.Nm
преобразуйте записи LDAP в
.Xr passwd 5 , 
.Xr master.passwd 5 , 
и 
.Xr group 5 
строки.
Объявление каталога имеет следующую форму:
.Bd -literal -offset indent
каталог "some.host" {
 # directives
}
.Ed 
.Pp 
Допустимыми директивами для каталогов являются:
.Bl -tag -width Ds 
.Атрибут Ic Ar name Ic соответствует строке Ar
.Xc
Сопоставьте атрибут 
.Xr passwd 5 , 
.Xr master.passwd 5, 
или 
.Xr group 5 
с указанным именем атрибута LDAP.
.Он основан на строке Ar
Используйте предоставленную базу поиска в качестве отправной точки для поиска по каталогу.
.Это строка Ic groupdn Ar.
Используйте предоставленную базу поиска в качестве отправной точки для поиска по каталогу для 
групп.
Если не указано, будет использоваться значение basedn.
.It Ic строка Ar bindcred
Используйте предоставленные учетные данные для простой аутентификации в каталоге.
.It Ic строка Ar binddn
Используйте предоставленное различаемое имя для привязки к каталогу.
.Это фиксированный атрибут Ar attribute string.
Не извлекайте указанный атрибут из LDAP, а 
вместо этого безоговорочно присваивайте ему указанное значение для 
каждой записи.
.It Ic group фильтрует Ar-строку
Используйте прилагаемый фильтр LDAP для извлечения записей группы.
.It Xo 
.Ic list Ar name Ic сопоставляет Ar-строку
.Xc
Сопоставьте 
.Xr passwd 5 ,
.Xr master.passwd 5 , 
или 
.Xr group 5 
добавьте атрибут к указанному имени атрибута LDAP.
Список создает разделенный запятыми список всех найденных атрибутов LDAP.
.Pp 
Допустимыми атрибутами являются:
.Pp 
.Bl -tag -width groupmembers -offset indent -compact
.Имя It Ic
.It Ic passwd
.It Ic uid
.It Ic gid
.It Ic gecos
.It Ic home
.It Ic shell
.It Ic change
.It Ic expire
.It Ic class
.It Ic groupname
.It Ic grouppasswd
.It Ic groupgid
.It Ic groupmembers 
.El
.It Ic passwd filter Ar string
Используйте прилагаемый фильтр LDAP для извлечения записей паролей.
.El 
.Sh ФАЙЛЫ 
.Bl -tag -width "/etc/ypldap.conf" -compact
.Он содержит /etc/ypldap.conf
.Xr ypldap 8 
файл конфигурации.
.It Pa /usr/share/examples/ypldap/ypldap.conf
.Xr ypldap 8 
пример файла конфигурации.
.El 
.Sh СМОТРИТЕ ТАКЖЕ
.Xr ypbind 8, 
.Xr ypldap 8, 
.Xr ypserv 8
.Sh ИСТОРИЯ
Формат файла 
.Nm 
впервые появился в 
.Ox 4.4 .
