melkorbsd/ru-freebsd-man/df.1
.\"-
.\" Авторское право (c) 1989, 1990, 1993
.\"	Ректоры Калифорнийского университета. Все права защищены.
.\"
.\" Разрешение на распространение и использование в исходной и бинарной формах,
.\" с изменениями или без них, разрешается при условии соблюдения следующих условий:
.\" 1. Распространение исходного кода должно сохранять приведенное выше уведомление о копирайте,
.\"    этот список условий и следующий отказ от ответственности.
.\" 2. Распространение в бинарной форме должно воспроизводить приведенное выше уведомление о копирайте,
.\"    этот список условий и следующий отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых вместе с распространением.
.\" 3. Ни название университета, ни имена его участников
.\"    не могут использоваться для продвижения производных продуктов
.\"    без явного предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО РЕГЕНТАМИ И УЧАСТНИКАМИ «КАК ЕСТЬ», И
.\" ЛЮБЫЕ ПРЯМЫЕ ИЛИ КОСВЕННЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ,
.\" ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ И СООТВЕТСТВИЯ КОНКРЕТНОЙ ЦЕЛИ,
.\" ОТКАЗЫВАЮТСЯ. В НИКАКОМ СЛУЧАЕ РЕГЕНТЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПОКАЗАТЕЛЬНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ
.\" УЩЕРБЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ЗАМЕЩАЮЩИХ ТОВАРОВ
.\" ИЛИ УСЛУГ; УТРАТОЙ ПРАВА ПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ЛИБО ПРЕРЫВАНИЕМ ДЕЯТЕЛЬНОСТИ)
.\" НЕЗАВИСИМО ОТ ТОГО, НА КАКОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, ДОГОВОРНОЙ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТНОЙ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНОЕ)
.\" ОСНОВЫВАЕТСЯ ЛИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО СООБЩЕНО О
.\" ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
."
." @(#)df.1 8.3 (Беркли) 5/8/95
."
.Dd 29 марта 2023 г.
.Dt DF 1
.Os
.Sh НАЗВАНИЕ
.Nm df
.Nd отображение свободного дискового пространства
.Sh СИНТАКСИС
.Nm
.Op Fl -libxo
.Op Fl b | g | H | h | k | m | P
.Op Fl acilnT
.Op Fl &,
.Op Fl t Ar type
.Op Ar file | file system ...
.Sh ОПИСАНИЕ
Утилита
.Nm
отображает статистику о количестве свободного дискового пространства
на указанной смонтированной
.Ar file system
или на файловой системе, частью которой является
.Ar file
.
По умолчанию количество блоков отображается с предполагаемым размером блока 512 байт.
Если не указан ни файл, ни файловая система,
отображается статистика для всех смонтированных файловых систем
(в соответствии с опцией
.Fl t
ниже).
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl -libxo
Генерировать вывод через
.Xr libxo 3
в различных форматах, читаемых человеком и машиной.
См.
.Xr xo_parse_args 3
для получения подробной информации об аргументах командной строки.
.It Fl a
Показать все точки монтирования, включая те, которые были смонтированы с флагом
.Dv MNT_IGNORE
.
Это подразумевается для файловых систем, указанных в командной строке.
.It Fl b
Явно использовать блоки размером 512 байт, переопределяя любую спецификацию
.Ev BLOCKSIZE
из среды.
Это то же самое, что и опция
.Fl P
.
Опция
.Fl k
переопределяет эту опцию.
.It Fl c
Показать общий итог.
.It Fl g
Использовать блоки размером 1073741824 байта (1 Гигабайт) вместо значения по умолчанию.
Это переопределяет любую спецификацию
.Ev BLOCKSIZE
из среды.
.It Fl h
.Dq Читаемый человеком
вывод.
Используйте суффиксы единиц: байт, Килобайт, Мегабайт, Гигабайт, Терабайт и
Петабайт (на основе степеней 1024), чтобы уменьшить количество цифр до четырех или менее.
.It Fl H , Fl Fl si
То же, что и
.Fl h
, но на основе степеней 1000.
.It Fl i
Включить статистику по количеству свободных и использованных инодов.
В сочетании с опциями
.Fl h
или
.Fl H
количество инодов масштабируется степенями 1000.
В случае, если файловая система не имеет инодов, то вместо процента использования отображается
.Sq -
.
.It Fl k
Использовать блоки размером 1024 байта (1 Килобайт) вместо значения по умолчанию.
Это переопределяет опцию
.Fl P
и любую спецификацию
.Ev BLOCKSIZE
из среды.
.It Fl l
Выбрать локально смонтированную файловую систему для отображения.
При использовании в сочетании с опцией
.Fl t Ar type
, типы файловых систем будут добавляться или исключаться в соответствии с
параметрами этой параметры.
.It Fl m
Использовать блоки размером 1048576 байт (1 Мегабайт) вместо значения по умолчанию.
Это переопределяет любую спецификацию
.Ev BLOCKSIZE
из среды.
.It Fl n
Распечатать ранее полученную статистику из файловых систем.
Эту опцию следует использовать, если возможно, что одна или несколько
файловых систем находятся в таком состоянии, что они не смогут предоставить
статистику без длительной задержки.
Когда указана эта опция,
.Nm
не будет запрашивать новую статистику у файловых систем, а ответит
возможно устаревшей статистикой, которая была получена ранее.
.It Fl P
Явно использовать блоки размером 512 байт, переопределяя любую спецификацию
.Ev BLOCKSIZE
из среды.
Это то же самое, что и опция
.Fl b
.
Опция
.Fl k
переопределяет эту опцию.
.It Fl t Ar type
Выбрать файловые системы для отображения.
Можно указать несколько типов в списке, разделенном запятыми.
Список типов файловых систем может иметь префикс
.Dq no
, чтобы указать типы файловых систем, для которых действие
.Em not
должно выполняться.
При использовании в сочетании с опцией
.Fl l
параметры этой параметры будут изменять список
локально смонтированных файловых систем, выбранных опцией
.Fl l
.
Например, команда
.Nm
:
.Bd -literal -offset indent
df -t nonfs,nullfs
.Ed
.Pp
выводит список всех файловых систем, кроме тех, которые относятся к типам NFS и NULLFS.
Команда
.Xr lsvfs 1
может быть использована для выяснения типов файловых систем
, которые доступны в системе.
.It Fl T
Включить тип файловой системы.
.It Fl ,
(Запятая) Выводить размеры, сгруппированные и разделенные тысячами, используя
немонетарный разделитель, возвращаемый
.Xr localeconv 3
, обычно запятую или точку.
Если локаль не установлена или локаль не имеет немонетарного разделителя, эта
опция не имеет эффекта.
.El
.Sh ОКРУЖАЮЩАЯ СРЕДА
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
Указывает единицы, в которых следует сообщать количество блоков.
Это использует
.Xr getbsize 3
, что позволяет использовать единицы байтов или числа, масштабированные с помощью букв
.Em k
(для кратных 1024 байтам),
.Em m
(для кратных 1048576 байтам) или
.Em g
(для гигабайтов).
Допустимый диапазон - от 512 байт до 1 ГБ.
Если значение выходит за пределы, оно будет установлено на соответствующий предел.
.El
.Sh ПРИМЕРЫ
Показать читаемое человеком свободное дисковое пространство для всех точек монтирования, включая тип файловой системы:
.Bd -literal -offset indent
$ df -ahT
Файловая_система Тип Размер Использовано Доступно Вместимость Смонтировано_на
/dev/ada1p2 ufs 213G 152G 44G 78% /
devfs devfs 1.0K 1.0K 0B 100% /dev
/dev/ada0p1 ufs 1.8T 168G 1.5T 10% /data
linsysfs linsysfs 4.0K 4.0K 0B 100% /compat/linux/sys
/dev/da0 msdosfs 7.6G 424M 7.2G 5% /mnt/usb
.Ed
.Pp
Показать ранее собранные данные, включая статистику инодов, за исключением файловых систем devfs или
linsysfs.
Обратите внимание, что префикс
.Dq no
влияет на все файловые системы в списке, а опция
.Fl t
может быть указана только один раз:
.Bd -literal -offset indent
$ df -i -n -t nodevfs,linsysfs
Файловая_система 1K-блоки Использовано Доступно Вместимость iused ifree %iused
Смонтировано_на
/dev/ada1p2 223235736 159618992 45757888 78% 1657590 27234568 6% /
/dev/ada0p1 1892163184 176319420 1564470712 10% 1319710 243300576 1%
/data
/dev/da0 7989888 433664 7556224 5% 0 0 100%
/mnt/usb
.Ed
.Pp
Показать читаемую человеком информацию для файловой системы, содержащей файл
.Pa /etc/rc.conf :
.Bd -literal -offset indent
$ df -h /etc/rc.conf
Файловая_система Размер Использовано Доступно Вместимость Смонтировано_на
/dev/ada1p2 213G 152G 44G 78% /
.Ed
.Pp
То же, что и выше, но с указанием некоторой файловой системы:
.Bd -literal -offset indent
$ df -h /dev/ada1p2
Файловая_система Размер Использовано Доступно Вместимость Смонтировано_на
/dev/ada1p2 213G 152G 44G 78% /
.Ed
.Sh ПРИМЕЧАНИЯ
Для файловых систем, отличных от Unix, сообщаемые значения использованных и свободных инодов
могут иметь другое значение, чем значения использованных и доступных файлов и
каталогов.
Примером является msdosfs, которая в случае файловых систем FAT12 или FAT16
сообщает количество доступных и свободных записей корневого каталога вместо инодов
.Po
, где от 1 до 21 такой записи каталога требуется для хранения
каждого имени файла или каталога или метки диска
.Pc .
.Sh СМ. ТАКЖЕ
.Xr lsvfs 1 ,
.Xr quota 1 ,
.Xr fstatfs 2 ,
.Xr getfsstat 2 ,
.Xr statfs 2 ,
.Xr getbsize 3 ,
.Xr getmntinfo 3 ,
.Xr libxo 3 ,
.Xr localeconv 3 ,
.Xr xo_parse_args 3 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr pstat 8 ,
.Xr quot 8 ,
.Xr swapinfo 8
.Sh СТАНДАРТЫ
За исключением большинства опций,
утилита
.Nm
соответствует
.St -p1003.1-2004
, который определяет только параметры
.Fl k , P
и
.Fl t
.
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v1 .
.Sh ОШИБКИ
Флаг
.Fl n
игнорируется, если указан файл или файловая система.
Кроме того, если точка монтирования
недоступна для пользователя, возможно, что информация о файловой системе
может быть устаревшей.
.Pp
параметры
.Fl b
и
.Fl P
идентичны.
Первая происходит из традиции BSD, а вторая требуется
для соответствия
.St -p1003.1-2004
conformity.