melkorbsd/ru-freebsd-man/os-release.5
.\"
.\" Copyright (c) 2019 M. Warner Losh <imp@FreeBSD.org>
.\"
.\" Распространение и использование в исходных и двоичных формах, с или без
.\" разрешены при соблюдении следующих условий
.\" соблюдаются:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ СОАВТОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 23 ноября 2021 г.
.Dt OS-RELEASE 5
.Os
.Sh ИМЯ
.Nm os-release
Файл .Nd с описанием текущей ОС и некоторых ее атрибутов
ОПИСАНИЕ .Sh
Файл
.Nm
представляет собой список пар ключ-значение, разделенных новой строкой.
Синтаксис этого файла представляет собой сокращенный вариант
.Xr sh 1
назначение переменной с
следующими ограничениями:
.Bl -bullet
.It
Строки нельзя конкатенировать вместе
.It
Расширение переменных не производится
.It
Все специальные символы оболочки должны быть заключены в кавычки, как описано в
.Xr sh 1
.It
Назначения переменных должны быть заключены в двойные кавычки
если они содержат символы за пределами A-Z, a-z и 0-9.
.It
Все строки должны быть в формате UTF-8
.It
Непечатаемые символы не должны использоваться в строках
.El
.Pp
Строки, начинающиеся с символа
.Ql #
игнорируются как комментарии.
ПЕРЕМЕННЫЕ .Sh
Стандартом определены следующие переменные.
.Bl -tag -width XXXXXXXXXX -compact
.It Dv ИМЯ
Строка, описывающая предпочтительное имя ОС.
.It Dv VERSION
Строка версии ОС в обычном и привычном формате.
.It Dv ID
Версия имени в нижнем регистре, содержащая только буквы a-z, 0-9,
.Ql \&. ,
.Ql - ,
и
.Ql _ .
.It Dv VERSION_ID
Версия в нижнем регистре, содержащая только a-z, 0-9,
.Ql \&. ,
.Ql - ,
и
.Ql _ .
.It Dv PRETTY_NAME
Красивая версия имени, представляемая пользователю.
Может содержать информацию о выпуске.
.It Dv ANSI_COLOR
Предлагаемое цветовое представление для ОС.
Эта строка должна быть пригодна для включения в последовательность ESC [ m ANSI/ECMA-48
для отображения ОС в предпочтительном цвете.
Эта переменная является необязательной.
.It Dv CPE_NAME
Имя CPE для операционной системы.
Это поле должно соответствовать спецификации NIST Common Platform Enumeration.
.It Dv HOME_URL
.It Dv SUPPORT_URL
.It Dv BUG_REPORT_URL
.It Dv PRIVACY_POLICY_URL
Ссылки в Интернете в формате RFC 3986, касающиеся различных аспектов этой ОС.
Эти переменные являются необязательными.
.It Dv BUILD_ID
Строка, идентифицирующая сборку.
Эта переменная необязательна.
.It Dv VARIANT
Строка, описывающая вариант данной операционной системы.
Эта переменная необязательна.
.It Dv VARIANT_ID
Версия варианта в нижнем регистре, содержащая только буквы a-z, 0-9,
.Ql \&. ,
.Ql - ,
и
.Ql _ .
Эта переменная является необязательной.
.El
.Pp
Все остальные переменные не имеют стандартного значения.
.Sh ФАЙЛЫ
.Bl -tag -width XXXXXXXXXX -compact
.It Pa /etc/os-release
Символическая ссылка на фактический
.Pa os-release
файл.
.It Pa /var/run/os-release
Сгенерированный файл os-release, описывающий текущую работающую систему.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Bl -tag -width XXXXXXXXXX -compact
.It Спецификация CPE
.Lk https://csrc.nist.gov/projects/security-content-automation-protocol/scap-specifications/cpe
.It RFC 3986
.Lk https://tools.ietf.org/html/rfc3986
.It os-release Specification
.Lk https://www.linux.org/docs/man5/os-release.html
.El
.Sh ИСТОРИЯ
Этот файл впервые появился в
.Fx 13.0 .


