melkorbsd/ru-freebsd-man/pam.conf.5
.\"-
.\" Copyright (c) 2005-2017 Dag-Erling Smørgrav
.\" Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" модификацией, разрешены при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\" 3. Имя автора не может быть использовано для поддержки или продвижения
.\" продуктов, созданных на основе данного программного обеспечения, без специального предварительного письменного
.\" разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И РАЗРАБОТЧИКАМИ ``КАК ЕСТЬ`` И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ СОАВТОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 27 июня 2023 г.
.Dt PAM.CONF 5
.Os
.Sh ИМЯ
.Nm pam.conf
.Nd Формат файла политики PAM
.Sh ОПИСАНИЕ
Библиотека PAM ищет политики в следующих файлах, в порядке убывания предпочтений
порядке убывания предпочтений:
.Bl -enum
.It
.Pa /etc/pam.d/ Ns Ar service-name
.It
.Pa /etc/pam.conf
.It
.Pa /usr/local/etc/pam.d/ Ns Ar service-name
.It
.Pa /usr/local/etc/pam.conf
.El
.Pp
Если ни в одном из этих мест нет политики для данной службы,
будет использоваться
.Dq Dv other
используется вместо нее, если она существует.
.Pp
Записи в файлах политик для каждой службы должны иметь одну из двух форм
ниже:
.Bd -незаполненный -смещение отступа
.Ar facility control-flag module-path Op Ar arguments ...
.Ar facility Cm include Ar other-service-name
.Ed
.Pp
Записи в
.Pa pam.conf Ns -style
имеют ту же форму, но снабжены дополнительным полем
поле, указывающее имя службы, к которой они применяются.
.Pp
В обоих случаях пустые строки и комментарии, введенные символом
.Ql #
игнорируются, и применяются обычные правила кавычек оболочки.
Точные сведения о том, как происходит токенизация файла, описаны в разделе
.Xr openpam_readword 3 .
.Pp
Объект
объект .Ar
указывает объект, к которому относится запись, и имеет одно из значений:
.Bl -tag -width 12n
.It Cm auth
Функции аутентификации
.Po
.Xr pam_authenticate 3 ,
.Xr pam_setcred 3
.Pc
.It Учетная запись Cm
Функции управления учетной записью
.Pq Xr pam_acct_mgmt 3
.It Cm сессия
Функции обработки сеансов
.Po
.Xr pam_open_session 3 ,
.Xr pam_close_session 3
.Pc
.It Cm пароль
Функции управления паролями
.Pq Xr pam_chauthtok 3
.El
.Pp
Сайт
флаг управления .Ar
определяет, как результат, возвращаемый модулем, влияет на
поток управления через (и конечный результат) остальные части цепочки
цепочки, и является одним из:
.Bl -tag -width 12n
.It Cm требуется
Если этот модуль работает успешно, результатом цепочки будет успех
если только не произойдет сбой в одном из последующих модулей.
В случае неудачи остальные модули цепочки продолжают выполняться, но конечным результатом
будет неудача, независимо от успеха последующих модулей.
.It Cm requisite
Если этот модуль работает успешно, результатом цепочки будет успех
если только последующие модули не потерпят неудачу.
Если модуль не работает, цепочка прерывается и результатом будет неудача.
.It Cm sufficient
Если этот модуль работает успешно, цепочка прерывается и результатом является
успех.
В случае неудачи остальные модули цепочки продолжают выполняться, но конечным результатом
будет неудача, если не удастся выполнить последующий модуль.
Связывание .It Cm
Если этот модуль работает успешно, цепочка прерывается и результатом является
успех.
В случае неудачи остальная часть цепочки продолжает выполняться, но конечным результатом
будет неудача, независимо от успеха последующих модулей.
.It Cm необязательный
Если этот модуль работает успешно, результатом цепочки будет успех
если не произойдет сбой в одном из последующих модулей.
Если этот модуль не сработает, результатом цепочки будет неудача, если не сработает более поздний модуль.
если последующий модуль не будет успешен.
.El
.Pp
Из вышесказанного есть два исключения:
.Cm sufficient
и
.Cm связывающий
рассматриваются как
.Cm необязательные
по
.Xr pam_setcred 3 ,
и в
.Dv PAM_PRELIM_CHECK
на этапе
.Xr pam_chauthtok 3 .
.Pp
Сайт
.Ar module-path
указывает имя или полный путь к вызываемому модулю.
Если указано только имя, библиотека PAM будет искать его в
следующих местах:
.Bl -enum
.It
.Pa /usr/lib
.It
.Pa /usr/local/lib
.El
.Pp
Остальные поля, если они есть, передаются модулю без изменений, если
и когда он будет вызван.
.Pp
Модуль
.Cm include
приводит к тому, что записи из другой цепочки (указанной
.Ar other-system-name )
включаются в текущую.
Это позволяет определять общесистемные политики, которые затем включаются
в специфические политики сервисов.
Общесистемная политика может быть изменена без необходимости
изменять каждую политику конкретного сервиса.
.Pp
.Bf -символический
Следите за тем, чтобы не создавать циклов при использовании
.Cm include
поскольку в настоящее время не существует функции обнаружения петель.
.Ef
.Sh МОДУЛЬНЫЕ ОПЦИИ
Некоторые функции библиотеки PAM могут изменять свое поведение при вызове служебного модуля, если
сервисным модулем, если были указаны определенные опции модуля, независимо от того.
независимо от того, придает ли им значение сам модуль.
Одной из таких опций является
.Cm debug ,
которая заставляет диспетчер включать отладочные сообщения перед
перед вызовом каждой сервисной функции и отключать их после этого (если только
они уже были включены).
Другие специальные опции включают:
.Bl -tag -width 12n
.It Cm authtok_prompt Ns = Ns Ar prompt , Cm oldauthtok_prompt Ns = Ns Ar prompt , Cm user_prompt Ns = Ns Ar prompt
Эти опции можно использовать для переопределения подсказок, используемых
.Xr pam_get_authtok 3
и
.Xr pam_get_user 3 .
.It Cm echo_pass
Этот параметр определяет, будет ли
.Xr pam_get_authtok 3
позволять пользователю видеть, что он набирает.
.It Cm try_first_pass , Cm use_first_pass
Эти параметры управляют
.Xr pam_get_authtok 3 Ns 's
использование кэшированных токенов аутентификации.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr pam 3
.Sh СТАНДАРТЫ
.Rs
.%T "X/Open Single Sign-On Service (XSSO) - подключаемые модули аутентификации"
.%D "Июнь 1997"
.Re
.Sh АВТОРЫ
Библиотека OpenPAM была разработана для
.Fx
проектом ThinkSec AS и Network Associates Laboratories, подразделением исследований в области безопасности Network Associates Inc.
Отдел исследований в области безопасности компании Network Associates, Inc.\& по
контракт DARPA/SPAWAR N66001-01-C-8035
.Pq Dq CBOSS ,
в рамках исследовательской программы DARPA CHATS.
.Pp
Библиотека OpenPAM поддерживается
.An Даг-Эрлинг См\(/orgrav Aq Mt des@des.no .



