melkorbsd/ru-freebsd-man/printcap.5
.\" Авторское право (c) 1983, 1991, 1993
.\"	Регенты Калифорнийского университета.  Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" модификацией, разрешается при соблюдении следующих условий
.\" соблюдены:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\" 3. Ни название Университета, ни имена его соавторов
.\" не могут быть использованы для поддержки или продвижения продуктов, созданных на основе этого программного обеспечения
.\" без специального предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ РЕГЕНТАМИ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ РЕГЕНТЫ ИЛИ ВКЛАДЧИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.\"     @(#)printcap.5 8.2 (Berkeley) 12/11/93
.\"
.Dd 11 октября 2000 г.
.Dt PRINTCAP 5
.Os
.Sh ИМЯ
.Nm printcap
.Nd база данных о возможностях принтера
.Sh SYNOPSIS
.Nm
.Sh ОПИСАНИЕ
Программа
.Nm Printcap
функция
представляет собой упрощенную версию функции
.Xr termcap 5
база данных
используемой для описания линейных принтеров.
Система спулинга получает доступ к
.Nm
при каждом использовании, что позволяет динамически
добавлять и удалять принтеры.
Каждая запись в базе данных
используется для описания одного принтера.
Эта база данных не может быть
заменять, как это возможно для
.Xr termcap 5 ,
поскольку это может позволить обойти учет.
.Pp
Обычно по умолчанию используется принтер
.Em lp ,
хотя переменная окружения
.Ev PRINTER
может быть использована для отмены этого параметра.
Каждая утилита спулинга поддерживает свою опцию,
.Fl P Ar printer ,
позволяющая явно указать принтер назначения.
.Pp
См.
.%T "Руководство по спулеру линейного принтера BSD 4.3"
для полного обсуждения того, как настроить базу данных для данного принтера.
.Sh ПОТРЕБИТЕЛЬСКИЕ ВОЗМОЖНОСТИ
См.
.Xr termcap 5
для описания компоновки файла.
.Bl -column Namexxx Typexx "/var/spool/lpdxxxxx"
.Sy "Имя Тип Описание по умолчанию"
.It "af str" Ta Dv NULL Ta No "имя файла учета"
.It "br num none если lp является tty, установите скорость передачи данных"
.Xr ( ioctl 2
вызов)
.It "cf str" Ta Dv NULL Ta No "фильтр данных cifplot"
.It "ct num 120 Таймаут TCP-соединения в секундах"
.It "df str" Ta Dv NULL Ta Нет "фильтр данных tex"
.Tn ( DVI
формат)
.It "du num 1 UID для запуска демона"
.It "ff str" Ta So Li \ef Sc Ta No "строка для отправки формы"
.It "fo bool false печать формы при открытии устройства"
.It "gf str" Ta Dv NULL Ta Нет "фильтр графических данных"
.Xr ( plot 3
формат
.It "hl bool false печать последней страницы заголовка разрыва"
.It "ic bool false драйвер поддерживает (нестандартный) ioctl для отступа при распечатке"
.It "if str" Ta Dv NULL Ta No "имя текстового фильтра, который выполняет учет"
.It "lf str" Ta Pa /dev/console Ta Нет "имя файла регистрации ошибок"
.It "lo str" Ta Pa lock Ta Нет "имя файла блокировки"
.It "lp str" Ta Pa /dev/lp Ta Нет "имя устройства, которое нужно открыть для вывода, или" Em port Ns @ Ns Em machine Нет "для открытия TCP сокета"
.It "mc num 0 максимальное количество копий, которые могут быть запрошены на"
.Xr lpr 1 ,
ноль = неограниченно
.It "ms str" Ta Dv NULL Ta Нет "если lp - это tty, то через запятую,"
.Xr stty 1 Ns -like
список, описывающий режимы tty
.It "mx num 0 максимальный размер файла (в"
.Dv BUFSIZ
блоки), ноль = неограниченный
.It "nd str" Ta Dv NULL Ta No "следующий каталог для списка очередей (не реализовано)"
.It "nf str" Ta Dv NULL Ta Нет "фильтр данных ditroff (независимый от устройства troff)"
.It "of str" Ta Dv NULL Ta No "имя программы фильтрации выходных данных"
.It "pc num 200 цена за фут или страницу в сотых долях цента"
.It "pl num 66 длина страницы (в строках)"
.It "pw num 132 ширина страницы (в символах)"
.It "px num 0 ширина страницы в пикселях (по горизонтали)"
.It "py num 0 длина страницы в пикселях (по вертикали)"
.It "rc bool false при отправке на удаленный хост, повторная отправка копий (см. ниже)"
.It "rf str" Ta Dv NULL Ta No "фильтр для печати"
.Tn FORTRAN
текстовые файлы
.It "rg str" Ta Dv NULL Ta No "Ограниченная группа. Доступ разрешен только членам группы"
.It "rm str" Ta Dv NULL Ta Нет "имя машины для удаленного принтера"
.It "rp str" Ta Pa lp Ta Нет "аргумент имени удаленного принтера"
.It "rs bool false Ограничить удаленных пользователей только теми, у кого есть локальные учетные записи"
.It "rw bool false открыть устройство принтера для чтения и записи"
.It "sb bool false короткий баннер (только одна строка)"
.It "sc bool false подавление множественных копий"
.It "sd str" Ta Pa /var/spool/lpd Ta Нет "каталог спула"
.It "sf bool false suppress form feeds"
.It "sh bool false suppress printing of burst page header"
.It "sr str" Ta Dv NULL Ta Нет "имя файла для хранения статистики каждого файла данных по мере его получения"
.It "ss str" Ta Dv NULL Ta Нет "имя файла для хранения статистики каждого файла данных по мере его отправки"
.It "st str" Ta Pa status Ta Нет "имя файла состояния"
.It "tf str" Ta Dv NULL Ta Нет "фильтр данных troff (cat phototypesetter)"
.It "tr str" Ta Dv NULL Ta Нет "строка трейлера для печати при опустошении очереди"
.It "vf str" Ta Dv NULL Ta Нет "фильтр растровых изображений"
.El
.Pp
Каждая двухбуквенная возможность имеет человекочитаемое альтернативное имя.
.Bl -колонка "Краткая форма" "Длинная форма"
.Sy "Краткая форма Длинная форма"
.It "af acct.file"
.It "br tty.rate"
.It "cf filt.cifplot"
.It "ct remote.timeout"
.It "df filt.dvi"
.It "du daemon.user"
.It "ff job.formfeed"
.It "fo job.topofform"
.It "gf filt.plot"
.It "hl banner.last"
.It "if filt.input"
.It "lf spool.log"
.It "lo spool.lock"
.It "lp tty.device"
.It "mc max.copies"
.It "ms tty.mode"
.It "mx max.blocks"
.It "nf filt.ditroff"
.It "of filt.output"
.It "pc acct.price"
.It "pl page.length"
.It "pw page.width"
.It "px page.pwidth"
.It "py page.plength"
.It "rc remote.resend_copies"
.It "rf filt.fortran"
.It "rg daemon.restrictgrp"
.It "rm remote.host"
.It "rp remote.queue"
.It "rs daemon.restricted"
.It "rw tty.rw"
.It "sb banner.short"
.It "sc job.no_copies"
.It "sd spool.dir"
.It "sf job.no_formfeed"
.It "sh banner.disable"
.It "sr stat.recv"
.It "ss stat.send"
.It "st spool.status"
.It "tf filt.troff"
.It "tr job.trailer"
.It "vf filt.raster"
.El
.Pp
Если драйвер локального линейного принтера поддерживает отступы, демон
должен понимать, как его вызвать.
.Sh ФИЛЬТРЫ
Сайт
.Xr lpd 8
создает конвейер
фильтров .Em
для обработки файлов для различных типов принтеров.
Выбор фильтров зависит от флагов, переданных в
.Xr lpr 1 .
Конвейер настроен следующим образом:
.Bd -literal -offset indent
p pr | если обычный текст + pr(1)
нет, если обычный текст
c cf cifplot
d df DVI (tex)
g gf plot(3)
n nf ditroff
f rf Фортран
t tf troff
v vf растровое изображение
.Ed
.Pp
Сайт
.Sy if
фильтр вызывается с аргументами:
.Bd -ragged -offset indent
.Cm if
.Op Fl c
.Fl w Ns Ar ширина
.Fl l Ns Ar длина
.Fl i Ns Ar отступ
.Fl n Ar логин
.Fl h Ar host acct-file
.Ed
.Pp
Сайт
.Fl c
передается только в том случае, если
.Fl l
флаг (передавать управляющие символы буквально)
указан в
.Xr lpr 1 .
Адрес
.Ar Width
функция
и
длина .Ar
задают ширину и длину страницы
(из
.Cm pw
и
.Cm pl
соответственно) в символах.
Сайт
.Fl n
и
.Fl h
указывают имя пользователя и имя хоста владельца
задания соответственно.
Параметр
.Ar Acct-file
функция
передается из файла
.Cm af
.Nm
запись.
.Pp
Если нет
.Cm, если
указано,
.Cm из
используется вместо него,
с тем отличием, что
.Cm of
открывается только один раз,
в то время как
.Cm if
открывается для каждого отдельного задания.
Таким образом,
.Cm if
лучше подходит для ведения бухгалтерского учета.
Сайт
.Cm of
дается только
ширина .Ar
и
длина .Ar
флаги.
.Pp
Все остальные фильтры называются так:
.Bd -ragged -offset indent
фильтр .Nm
.Fl x Ns Ar ширина
.Fl y Ns Ar длина
.Fl n Ar логин
.Fl h Ar host acct-file
.Ed
.Pp
где
.Ar ширина
и
длина .Ar
представлены в пикселях,
заданные параметром
.Cm px
и
.Cm py
соответственно.
.Pp
Все фильтры принимают
.Em stdin
в качестве файла,
.Em stdout
в качестве принтера,
могут вести журнал либо в
.Em stderr
или с помощью
.Xr syslog 3 ,
и не должен игнорировать
.Dv SIGINT .
.Sh ПЕЧАТЬ НА УДАЛЕННОМ ПРИНТЕРЕ
При печати на удаленном принтере с помощью
.Cm rm ,
можно использовать либо
.Cm if
или
.Cm of .
Если указано и то, и другое,
.Cm of
игнорируется.
Оба фильтра ведут себя одинаково, за исключением того, что им передаются
различных аргументов, как указано выше.
В частности, выходной фильтр
завершается и перезапускается для каждого переданного файла.
Это необходимо
для того, чтобы передать результирующий размер на удаленное устройство
.Xr lpd 8 .
.Pp
Если
.Fl p
был передан флаг
.Xr lpr 1 ,
.Xr pr 1
не выполняется локально, а запрашивается у удаленного
.Xr lpd 8 .
Любая фильтрация входных данных через
.Cm if
будет происходить до того, как
.Xr pr 1
а не после.
.Pp
Существуют некоторые модели сетевых принтеров, которые принимают задания от
.Xr lpd 8 ,
но они игнорируют управляющий файл задания и просто печатают
каждый файл данных по мере его поступления на принтер.
Одним из побочных эффектов такого поведения является то, что принтер будет игнорировать любой запрос
на создание нескольких копий, как указано в параметре
.Fl #
на
.Xr lpr 1
команды.
Команда
.Cm rc
вызовет
.Xr lpd 8
повторно отправить каждый файл данных для каждой копии, которую пользователь
первоначально запрошенной пользователем.
Обратите внимание, что
.Cm rc
следует указывать только на хостах, которые отправляют задания непосредственно на
принтер.
.Pp
Если
.Cm lp
указан как
.Em порт Ns @ Ns Em машина
(и
.Cm rm
не используется), данные для печати будут отправляться непосредственно на указанный
.Em-порт
на данной
.Em машине.
.Sh СТАТИСТИКА ПЕРЕДАЧИ
Когда задание печати передается на удаленную машину (которая может быть
другой unix-машиной или сетевым принтером), может оказаться полезным
вести статистику по каждой передаче.
Программа
.Cm sr
и
.Cm ss
указывают имена файлов, которые lpd должен использовать для хранения такой
статистики.
Строка статистики записывается для каждого файла данных задания
задания по мере успешной передачи файла.
Формат
одинаков как для передающей, так и для принимающей стороны
передачи.
.Pp
Статистика по получаемым файлам данных используется на сервере печати
если вас интересует производительность сети между
различными машинами, которые отправляют задания на этот сервер печати.
Сервер печати может собирать статистику о скорости выполнения каждого
задания печати по мере его поступления на сервер.
.Pp
Статистика отправляемых файлов данных может использоваться в качестве минимального
минимального учета, когда необходимо знать, кто и когда отправил задания на удаленный принтер.
удаленный принтер, когда они были отправлены и какого размера (в байтах) были файлы.
файлы.
Это не даст представления о том, сколько страниц
было напечатано, потому что не существует стандартного способа получить эту информацию
от удаленного (сетевого) принтера в этом случае.
.Sh LOGGING
Сообщения об ошибках, генерируемые самими программами линейного принтера
(т. е.
.Xr lpd 8
и связанными с ними программами)
регистрируются
.Xr syslog 3
с помощью
.Dv LPR
средства.
Сообщения, выводимые на
.Em stderr
одного из фильтров
отправляются в соответствующий
.Cm lf
файл.
Фильтры могут, конечно, использовать
.Xr syslogd 8
самостоятельно.
.Pp
К сообщениям об ошибках, отправляемым на консоль, добавляется возврат каретки и перевод строки
к ним добавляется возврат каретки и перевод строки, а не просто перевод строки.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr lpq 1 ,
.Xr lpr 1 ,
.Xr lprm 1 ,
.Xr hosts.lpd 5 ,
.Xr termcap 5 ,
.Xr chkprintcap 8 ,
.Xr lpc 8 ,
.Xr lpd 8 ,
.Xr pac 8
.Rs
.%T "4.3 Руководство по спулеру линейного принтера BSD"
.Re
.Sh ИСТОРИЯ
Сайт
.Nm
появился в
.Bx 4.2 .



