melkorbsd/ru-freebsd-man/man8/amd64/apm.8
.\" LP (Laptop Package)
.\"
.\" Copyright (c) 1994 by Tatsumi Hosokawa <hosokawa@jp.FreeBSD.org>
.\"
.\" This software may be used, modified, copied, and distributed, in
.\" both source and binary form provided that the above copyright and
.\" these terms are retained. Under no circumstances is the author
.\" responsible for the proper functioning of this software, nor does
.\" the author assume any responsibility for damages incurred with its
.\" use.
.\"
.Dd December 22, 2009
.Dt APM 8 i386
.Os
.Sh ИМЯ
.Nm apm
.Nd управляет APM BIOS и отображает его информацию
.Sh СИНТАКСИС
.Nm
.Op Fl ablstzZ
.Op Fl d Ar enable
.Op Fl e Ar enable
.Op Fl h Ar enable
.Op Fl r Ar delta
.Sh ОПИСАНИЕ
Утилита
.Nm
управляет Intel / Microsoft APM (расширенное управление питанием) BIOS и
отображает текущее состояние APM на портативных ПК.
Возможны следующие параметры:
.Bl -tag -width indent
.It Fl a
Отображает текущее состояние сети переменного тока в виде целого числа.
Значения
0, 1 и 2 соответствуют состояниям
.Dq off-line ,
.Dq on-line
и
.Dq backup power , 
соответсвенно.
.It Fl b
Отображает целочисленное значение, отражающее текущее состояние батареи.
Значения 0, 1, 2, 3 соответствуют статусам
.Dq high ,
.Dq low ,
.Dq critical ,
.Dq charging
соответсвенно.
.It Fl d Ar enable
Отключает/включает приостановку отображения отдельно от обычной приостановки,
используя логическое значение для
.Ar enable .
Похоже, что эта функция не работает на многих различных ноутбуках,
включая Libretto 30CT и 50CT.
.It Fl e Ar enable
Включает или отключает функции APM компьютера
в зависимости от логического значения аргумента
.Ar enable .
.It Fl h Ar enable
В зависимости от логического значения
.Ar enable ,
включиает или отключиает инструкцию HLT в процедуре переключения контекста ядра.
Эти опции не обязательны почти для всех реализаций APM,
но для некоторых реализаций, в которых вызов
.Dq Pa Idle CPU
приводит как к замедлению тактовой частоты процессора, так и к инструкции HLT,
.Fl h Cm false
необходимо для предотвращения снижения максимальной производительности системы.
Смотрите
.Xr apm 4
для получения подробностей.
.It Fl l
Отображает оставшийся заряд батареи в процентах.
Если ваш ноутбук не
поддерживает эту функцию, на дисплее отобразится значение 255.
.It Fl r Ar delta
Включает таймер возобновления работы, если ноутбук поддерживает его.
На самом деле это
не приводит к приостановке работы ноутбука, но если ноутбук приостановлен
и поддерживает возобновление работы из режима приостановки, то он будет возобновлен после
.Ar delta
секунды (с момента выполнения этой команды, а не с момента приостановки).
.It Fl s
Отображает статус поддержки APM в виде целого числа.
Значения
0 и 1 соответствуют состояниям
.Dq disabled
и
.Dq enabled
соответственно.
.It Fl t
Отображает расчетное оставшееся время автономной работы в секундах.
Если
оно неизвестно, отображается значение -1.
.It Fl Z
Переводит систему в режим ожидания.
В этом режиме потребляется меньше энергии, чем
в режиме полной мощности, но больше, чем в режиме приостановки.
Некоторые ноутбуки поддерживают
выход из этого состояния по таймеру или сигналу вызова.
В
выходных данных
.Nm
указано, что, как утверждается, поддерживает ваш ноутбук.
.It Fl z
Приостанавливает работу системы.
Он используется
.Xr zzz 8 .
.El
.Pp
Если параметры не указаны,
.Nm
отображает информацию и текущее состояние APM в подробном режиме.
Если задано несколько вариантов отображения, значения отображаются по одному
в строке в указанном здесь порядке.
.Sh ПРИМЕЧАНИЯ
.Xr apmconf 8
был объединен в
.Nm
и таким образом
.Nm
заменяет всю его функциональность.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr apm 4 ,
.Xr zzz 8
.Sh АВТОРЫ
.An Тацуми Хосокава, он же Mt hosokawa@jp.FreeBSD.org
.Sh ПРОБЛЕМЫ
Некоторые реализации APM не поддерживают параметры, необходимые
.Nm .
В таких системах,
.Nm
отображает их как неизвестные.
.Pp
Некоторые реализации APM не могут обрабатывать такие события, как нажатие кнопки
включения или закрытие крышки.
В таких реализациях система
.Ar must
будет отстраненна
.Ar only
с помощью
.Nm
или
.Nm zzz .
