melkorbsd/ru-freebsd-man/man7/atf.7
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.Dd September 14, 2014
.Dt ATF 7
.Os
.Sh Название
.Nm ATF
.Nd введение в систему автоматизированного тестирования
.Sh Описание
Платформа автоматизированного тестирования
.Pf ( Nm )
это
.Em коллекция библиотек
для реализации тестовых программ на различных языках
Все эти библиотеки предлагают схожую функциональность и любую тестовую программу
написанный с их помощью, он предоставляет согласованный пользовательский интерфейс.
.Pp
Тестовые программы с использованием
.Nm
библиотеки полагаются на отдельный движок времени выполнения, который выполняет их в
детерминированный способ.
Механизм выполнения изолирует тестовые программы от остальной части системы
и гарантирует устранение некоторых распространенных побочных эффектов.
Механизм выполнения также отвечает за сбор результатов всех
тесты и составление отчетов.
В настоящее время предпочтительной средой выполнения является Kyua, описанная в
.Xr kyua 1 .
.Pp
Если ваши операционные системы распространяются
.Nm ,
в нем также должна содержаться вводная часть
.Xr tests 7
страниц руководства.
Мы рекомендуем вам прочитать это прямо сейчас.
.Pp
Остальная часть этой страницы руководства служит перекрестной ссылкой на все остальные
документация, поставляемая вместе с
.Nm .
.Ss Языковые привязки
.Bl -tag -width atfXtestXprogramXXXXX
.It Xr atf-c 3
Программный интерфейс на языке С.
.It Xr atf-c++ 3
Программный интерфейс на языке С++.
.It Xr atf-sh 3
.Xr sh 1
программный интерфейс.
.El
.Ss Разные страницы
.Bl -tag -width atfXtestXprogramXXXXX
.It Xr atf-test-case 4
Общее описание тестовых примеров, независимо от языка, на котором они написаны
реализовано в.
.It Xr atf-test-program 1
Общий интерфейс, предоставляемый тестовыми программами, написанными с использованием
.Nm
библиотек.
.El
.Sh Cмотрите также
.Xr kyua 1 ,
.Xr tests 7
.Sh История
.Nm
начинался как проект Google Summer of Code 2007 под руководством NetBSD
Основа.
Его первоначальная цель состояла в том, чтобы обеспечить основу для тестирования
.Nx
операционной системы, но она выросла как самостоятельный проект, потому что
сам фреймворк не нужно было привязывать к конкретной операционной системе.
.Pp
Первоначально,
.Nm
также была отправлена коллекция библиотек, описанных на этой странице руководства
как движок времени выполнения.
С тех пор движок runtime engine был заменен на Kyua, а старые инструменты были заменены на
удаленный в
.Nm 0.20 ,
который был отправлен в начале 2014 года.
.Pp
По состоянию на конец 2014 года оба
.Fx
и
.Nx
загружали
.Nm
в своих базовых системах и предоставляют обширные наборы тестов на их основе.
.Pp
Для получения более подробной информации об исторических изменениях обратитесь к:
.Bd -literal -offset indent
.Pa /usr/share/doc/atf/NEWS
.Ed
.Sh Авторы
Для получения более подробной информации о людях, которые сделали
.Nm
возможно, обратитесь к:
.Bd -literal -offset indent
.Pa /usr/share/doc/atf/AUTHORS
.Ed
