melkorbsd/ru-freebsd-man/man7/atf.7
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.Dd Сентябрь 14, 2014
.Dt ATF 7
.Os
.Sh ИМЯ
.Nm ATF
.Nd введение в систему автоматизированного тестирования
.Sh ОПИСАНИЕ
Платформа автоматизированного тестирования
.Pf ( Nm )
это
.Em коллекция библиотек
для реализации тестовых программ на различных языках.
Все эти библиотеки предлагают схожую функциональность, и любая тестовая программа, написанная с их использованием, предоставляет согласованный пользовательский интерфейс.
.Pp
Тестовые программы с использованием
.Nm
библиотеки полагаются на отдельный движок среды выполнения, который выполняет их
детерминированным образом.
Движок среды выполнения изолирует тестовые программы от остальной системы
и обеспечивает устранение некоторых распространенных побочных эффектов.
Runtime engine также отвечает за сбор результатов всех
тестов и составление отчетов.
В настоящее время предпочтительной средой выполнения является Kyua, описанная в
.Xr kyua 1 .
.Pp
Если ваши операционные системы распространяются
.Nm ,
в нем также должна содержаться вводная часть страницы руководства
.Xr tests 7 .
Мы рекомендуем вам ознакомиться с ней прямо сейчас.
.Pp
Остальная часть этой страницы руководства служит перекрестной ссылкой на всю остальную
документацию, поставляемую вместе с
.Nm .
.Ss Языковые реализации
.Bl -tag -width atfXtestXprogramXXXXX
.It Xr atf-c 3
Программный интерфейс С.
.It Xr atf-c++ 3
Программный интерфейс C++.
.It Xr atf-sh 3
Программный интерфейс
.Xr sh 1 .
.El
.Ss Miscellaneous pages
.Bl -tag -width atfXtestXprogramXXXXX
.It Xr atf-test-case 4
Общее описание тестовых примеров, независимо от языка, на котором они
реализованы.
.It Xr atf-test-program 1
Общий интерфейс, предоставляемый тестовыми программами, написанными с использованием
.Nm
библиотеки.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr kyua 1 ,
.Xr tests 7
.Sh ИСТОРИЯ
.Nm
начинался как проект Google Summer of Code 2007 под руководством NetBSD
Foundation.
Его первоначальная цель состояла в том, чтобы обеспечить основу для тестирования
.Nx
операционная система, но она развивалась как самостоятельный проект, потому
что сам фреймворк не нужно было привязывать к конкретной операционной системе.
.Pp
Первоначально,
.Nm
прислали в виде набора библиотек, описанных на этой странице руководства, а также движок движок времени выполнения.
С тех пор движок времени выполнения был заменен на Kyua, а старые инструменты были
удалены в
.Nm 0.20 ,
который был выпущен в начале 2014 года.
.Pp
По состоянию на конец 2014 года
.Fx
и
.Nx
внедрили
.Nm
в своих базовых системах и предоставляют обширные наборы тестов на их основе.
.Pp
Для получения более подробной информации об исторических изменениях обратитесь к:
.Bd -literal -offset indent
.Pa /usr/share/doc/atf/NEWS
.Ed
.Sh АВТОРЫ
Для получения более подробной информации о людях, которые создали
.Nm ,
обратитесь к:
.Bd -literal -offset indent
.Pa /usr/share/doc/atf/AUTHORS
.Ed
