melkorbsd/ru-freebsd-man/man7/clocks.7
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\" "
.Dd January 18, 2008
.Dt CLOCKS 7
.Os
.Sh Название
.Nm Часы
.Nd различные системные таймеры
.Sh Краткий обзор
.In time.h
.Sh Описание
.Dv HZ
не является частью интерфейса приложения в
.Bx .
.Pp
Существует множество различных реальных и виртуальных часов (для хронометража) с
разные частоты:
.Bl -bullet
.It
Часы планирования.
Это настоящие часы с частотой, равной 100.
Он недоступен для приложений.
.It
Часы статистики.
Это настоящие часы с частотой, равной 128.
Он не доступен непосредственно приложениям.
.It
Часы, о которых сообщал
.Xr clock 3 .
Это виртуальные часы с частотой, равной 128.
Его фактическая частота задается макросом
.Dv CLOCKS_PER_SEC .
Обратите внимание, что
.Dv CLOCKS_PER_SEC
может быть с плавающей запятой.
Не используйте
.Xr clock 3
в новых программах в рамках
.Fx .
Это слабо по сравнению с
.Xr getrusage 2 .
Это предусмотрено для
.Tn ANSI
соответствия.
Это реализуется путем вызова
.Xr getrusage 2
и отбрасывать информацию и решимость.
.It
Часы, о которых сообщал
.Xr times 3 .
Это виртуальные часы с частотой, равной 128.
Его фактическая частота задается макросом
.Dv CLK_TCK
(устарел; не используется) и с помощью
.Fn sysconf _SC_CLK_TCK
и с помощью
.Xr sysctl 3 .
Обратите внимание, что его частота может отличаться от
.Dv CLOCKS_PER_SEC .
Не используйте
.Xr times 3
в новых программах в рамках
.Fx .
Это слабо по сравнению с
.Xr gettimeofday 2
вместе с
.Xr getrusage 2 .
Это предусмотрено для
.Tn POSIX
соответствие.
Это реализуется путем вызова
.Xr gettimeofday 2
и
.Xr getrusage 2
и отбрасывать информацию и решимость.
.It
Часы профилирования.
Это настоящие часы с частотой 1024.
Он используется в основном
.Xr moncontrol 3
и
.Xr gprof 1 .
Приложения должны определять его фактическую частоту, используя
.Xr sysctl 3
или путем считывания его из заголовка в файле данных профилирования.
.It
Часы mc146818a.
Это настоящие часы с номинальной частотой 32768.
Он разделен на часы статистики и часы профилирования.
Он недоступен для приложений.
.It
Часы микросекунд.
Это виртуальные часы с частотой 1000000.
Он используется для большей части хронометража в
.Bx
и экспортируется в приложения в
.Xr getrusage 2 ,
.Xr gettimeofday 2 ,
.Xr select 2 ,
.Xr getitimer 2 ,
и т.д.
Это часы, которые обычно должны использоваться
.Bx
приложении.
.It
Часы i8254.
Это настоящие часы/таймер с номинальной частотой 1193182.
Он оснащен тремя независимыми счетчиками времени, которые можно использовать.
Он разделен на части, чтобы указать время планирования.
Он недоступен для приложений.
.It
Тактовый сигнал TSC (64-разрядный регистр) в системах пятого поколения или более поздних версиях x86.
Это настоящие часы с частотой, эквивалентной количеству
циклов в секунду процессора (ов).
Его частоту можно найти с помощью
.Va machdep.tsc_freq
sysctl, если он доступен.
Он используется для интерполяции между значениями часов планирования.
К нему можно получить доступ с помощью
.Dv PMIOTSTAMP
просьба о
.Xr perfmon 4 .
.It
Часы ACPI.
Это настоящие часы/таймер с номинальной частотой 3579545.
Доступ к нему осуществляется через 24- или 32-битный регистр.
В отличие от тактовой частоты TSC, она поддерживает постоянную частоту тактов, даже когда центральный процессор
переходит в спящий режим или изменяется его тактовая частота.
Он недоступен для приложений.
.El
.Pp
Summary: if
.Dv HZ
если это не 1000000, то приложение, вероятно, использует неправильные часы.
.Sh SEE ALSO
.Xr gprof 1 ,
.Xr clock_gettime 2 ,
.Xr getitimer 2 ,
.Xr getrusage 2 ,
.Xr gettimeofday 2 ,
.Xr select 2 ,
.Xr clock 3 ,
.Xr moncontrol 3 ,
.Xr times 3
.Sh AUTHORS
.An -nosplit
Эта страница руководства была написана
.An J\(:org Wunsch
после описания, опубликованного
.An Bruce Evans .
