melkorbsd/ru-freebsd-man/man7/clocks.7
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\" "
.Dd January 18, 2008
.Dt CLOCKS 7
.Os
.Sh ИМЯ
.Nm clocks
.Nd различные системные таймеры
.Sh СИНТАКСИС
.In time.h
.Sh ОПИСАНИЕ
.Dv HZ
не является частью интерфейса приложения в
.Bx .
.Pp
Существует множество различных реальных и виртуальных (хронометрирующих) часов с
разной частотой:
.Bl -bullet
.It
The scheduling clock.
This is a real clock with frequency that happens to be 100.
It is not available to applications.
.It
Статистические часы.
Это реальные часы с частотой, равной 128.
Они недоступны приложениям напрямую.
.It
Часы, о которых сообщал
.Xr clock 3 .
Это виртуальные часы с частотой, равной 128.
Их фактическая частота задается макросом
.Dv CLOCKS_PER_SEC .
Обратите внимание, что
.Dv CLOCKS_PER_SEC
может быть с плавающей запятой.
Не используйте
.Xr clock 3
в новых программах в рамках
.Fx .
Это слабо по сравнению с
.Xr getrusage 2 .
Это предусмотрено для обеспечения соответствия
.Tn ANSI .
Это реализуется путем вызова
.Xr getrusage 2
и отбрасывает информацию и решение.
.It
Часы, сообщенные
.Xr times 3 .
Это виртуальные часы с частотой, равной 128.
Их фактическая частота задается макросом
.Dv CLK_TCK
(устарел; не используется) и с помощью
.Fn sysconf _SC_CLK_TCK
и с помощью
.Xr sysctl 3 .
Обратите внимание, что его частота может отличаться от
.Dv CLOCKS_PER_SEC .
Не используйте
.Xr times 3
в новых программах в рамках
.Fx .
Это слабо по сравнению с
.Xr gettimeofday 2
вместе с
.Xr getrusage 2 .
Это предусмотрено для обеспечения соответствия
.Tn POSIX .
Это реализуется путем вызова
.Xr gettimeofday 2
и
.Xr getrusage 2
и отбрасывает информацию и решение.
.It
Часы профилирования.
Это реальные часы с частотой 1024.
Они используются в основном в
.Xr moncontrol 3
и
.Xr gprof 1 .
Приложения должны определять его фактическую частоту, используя
.Xr sysctl 3
или путем считывания его из заголовка в файле данных профилирования.
.It
Часы mc146818a.
Это реальные часы с номинальной частотой 32768.
Они разделены на две части, чтобы получить статистические часы и часы для профилирования.
Они недоступны для приложений.
.It
Микросекундные часы.
Это виртуальные часы с частотой 1000000.
Они используются для большей части хронометража в
.Bx
и экспортируются в приложения в
.Xr getrusage 2 ,
.Xr gettimeofday 2 ,
.Xr select 2 ,
.Xr getitimer 2 ,
и т.д.
Это часы, которые обычно должны использоваться приложениями
.Bx .
.It
Часы i8254.
Это настоящие часы / таймер с номинальной частотой 1193182.
Они имеют три независимых счетчика времени, которые будут использоваться.
Они разделены на две части, чтобы отображать время планирования.
Они недоступны для приложений.
.It
Тактовый сигнал TSC (64-разрядный регистр) в системах пятого поколения или более поздних версиях x86.
Это реальные тактовые сигналы с частотой, эквивалентной количеству
циклов процессора (ов) в секунду.
Его частоту можно определить с помощью sysctl.
.Va machdep.tsc_freq ,
если он доступен.
Он используется для интерполяции между значениями часов планирования.
К нему можно получить доступ с помощью запроса
.Dv PMIOTSTAMP
в
.Xr perfmon 4 .
.It
Часы ACPI.
Это реальные часы/таймер с номинальной частотой 3579545.
Доступ к ним осуществляется через 24- или 32-разрядный регистр.
В отличие от тактовой частоты TSC, она поддерживает постоянную частоту тактов, даже когда процессор
находится в спящем режиме или его тактовая частота изменяется.
Она недоступна для приложений.
.El
.Pp
Резюме: если
.Dv HZ
не 1000000, то приложение, вероятно, использует неправильные часы.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr gprof 1 ,
.Xr clock_gettime 2 ,
.Xr getitimer 2 ,
.Xr getrusage 2 ,
.Xr gettimeofday 2 ,
.Xr select 2 ,
.Xr clock 3 ,
.Xr moncontrol 3 ,
.Xr times 3
.Sh АВТОРЫ
.An -nosplit
Эта страница руководства была написана
.An Й\(:орг Вуншем
после описания, опубликованного
.An Брюсом Эвансом .
