melkorbsd/ru-freebsd-man/man7/crypto.7
.\" Copyright (c) 2014-2021 The FreeBSD Foundation
.\"
.\" Portions of this documentation were written by John-Mark Gurney
.\" under the sponsorship of the FreeBSD Foundation and
.\" Rubicon Communications, LLC (Netgate).
.\"
.\" Portions of this documentation were written by Ararat River
.\" Consulting, LLC under sponsorship of the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1.  Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\" 2.  Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 11, 2022
.Dt CRYPTO 7
.Os
.Sh Название
.Nm Криптография
.Nd Алгоритмы открытого шифрования
.Sh Описание
Встроенная в ядро платформа OpenCrypto поддерживает несколько различных методов шифрования
и алгоритмы аутентификации.
В этом документе описаны параметры и требования, предъявляемые к этим алгоритмам.
Если не указано иное, все размеры, перечисленные ниже, указаны в байтах.
.Ss Средства аутентификации
Аутентификаторы вычисляют значение (также известное как дайджест, хэш или тег).
над вводом байт.
Запросы внутри ядра могут либо вычислять значение для заданного входного сигнала,
или проверьте, соответствует ли данный тег вычисленному тегу для заданных входных данных.
Поддерживаются следующие алгоритмы аутентификации:
.Bl -column "CRYPTO_AES_CCM_CBC_MAC" "XXX" "16, 24, 32" "Digest"
.It Sy Имя Ta Sy Данное время Ta Sy Размеры ключей Ta Sy Сборник Ta Sy Описание
.It Dv CRYPTO_AES_CCM_CBC_MAC Ta 12 Ta 16, 24, 32 Ta 16 Ta
Режим AES-CCM, основанный только на аутентификации
.It Dv CRYPTO_AES_NIST_GMAC Ta 12 Ta 16, 24, 32 Ta 16 Ta
Код аутентификации сообщения Galois
.It Dv CRYPTO_BLAKE2B Ta Ta 0, 64 Ta 64 Ta
Blake2b
.It Dv CRYPTO_BLAKE2S Ta Ta 0, 32 Ta 32 Ta
Blake2s
.It Dv CRYPTO_NULL_HMAC Ta Ta Ta 12 Ta
IPsec NULL HMAC
.It Dv CRYPTO_POLY1305 Ta Ta 32 Ta 16 Ta
Аутентификатор Poly1305
.It Dv CRYPTO_RIPEMD160 Ta Ta Ta 20 Ta
RIPE Message Digest-160
.It Dv CRYPTO_RIPEMD160_HMAC Ta Ta 64 Ta 20 Ta
RIPE Message Digest-160 HMAC
.It Dv CRYPTO_SHA1 Ta Ta Ta 20 Ta
SHA-1
.It Dv CRYPTO_SHA1_HMAC Ta Ta 64 Ta 20 Ta
SHA-1 HMAC
.It Dv CRYPTO_SHA2_224 Ta Ta Ta 28 Ta
SHA-2 224
.It Dv CRYPTO_SHA2_224_HMAC Ta Ta 64 Ta 28 Ta
SHA-2 224 HMAC
.It Dv CRYPTO_SHA2_256 Ta Ta Ta 32 Ta
SHA-2 256
.It Dv CRYPTO_SHA2_256_HMAC Ta Ta 64 Ta 32 Ta
SHA-2 256 HMAC
.It Dv CRYPTO_SHA2_384 Ta Ta Ta 48 Ta
SHA-2 384
.It Dv CRYPTO_SHA2_384_HMAC Ta Ta 128 Ta 48 Ta
SHA-2 384 HMAC
.It Dv CRYPTO_SHA2_512 Ta Ta Ta 64 Ta
SHA-2 512
.It Dv CRYPTO_SHA2_512_HMAC Ta Ta 128 Ta 64 Ta
SHA-2 512 HMAC
.El
.Ss Блочные шифры
Блочные шифры в OCF могут работать только с сообщениями, длина которых равна
точное число, кратное размеру блока шифра.
OCF поддерживает следующие блочные шифры:
.Bl -column "CRYPTO_CAMELLIA_CBC" "IV Size" "Block Size" "16, 24, 32"
.It Sy Название Ta Sy IV Size Ta Sy Размер блока Ta Sy Размеры ключей Ta Sy Описание
.It Dv CRYPTO_AES_CBC Ta 16 Ta 16 Ta 16, 24, 32 Ta
AES-CBC
.It Dv CRYPTO_AES_XTS Ta 8 Ta 16 Ta 32, 64 Ta
AES-XTS
.It Dv CRYPTO_CAMELLIA_CBC Ta 16 Ta 16 Ta 16, 24, 32 Ta
Camellia CBC
.It Dv CRYPTO_NULL_CBC Ta 0 Ta 4 Ta 0-256 Ta
IPsec NULL шифр
.El
.Pp
.Dv CRYPTO_AES_XTS
реализует настраиваемый блочный шифр XEX с возможностью кражи зашифрованного текста
как определено в NIST SP 800-38E.
Потребители OCF предоставляют первые 8 байт IV.
Оставшиеся 8 байт определяются как счетчик блоков, начинающийся с 0.
.Pp
ПРИМЕЧАНИЕ: Функция кражи зашифрованного текста реализована не во всех серверных системах
вот почему этот шифр требует ввода данных, кратных размеру блока.
.Ss Потоковые шифры
Потоковые шифры могут работать с сообщениями произвольной длины.
OCF поддерживает следующие потоковые шифры:
.Bl -column "CRYPTO_CHACHA20" "IV Size" "16, 24, 32"
.It Sy Название Ta Sy IV Size Ta Sy Размеры ключей Ta Sy Описание
.It Dv CRYPTO_AES_ICM Ta 16 Ta 16, 24, 32 Ta
Режим счетчика AES
.It Dv CRYPTO_CHACHA20 Ta 16 Ta 16, 32 Ta
ChaCha20
.El
.Pp
Данные для каждого запроса должны быть указаны в
.Fa crp_iv
через
.Dv CRYPTO_F_IV_SEPARATE
флаг.
.Pp
.Dv CRYPTO_AES_ICM
использует весь IV в качестве 128-битного счетчика блоков с большим порядком порядковых номеров.
IV устанавливает начальное значение счетчика для сообщения.
Если потребитель желает использовать капельницу, стоимость которой делится на
отдельные поля nonce и counter (например, IPSec),
пользователь несет ответственность за разделение запросов для обработки
встречный опрокидыватель.
.Pp
.Dv CRYPTO_CHACHA20
принимает 16-байтовое значение IV.
Первые 8 байт используются как одноразовые.
Последние 8 байт используются в качестве 64-разрядного счетчика блоков с младшим порядком байтов.
.Ss Аутентифицированное шифрование с соответствующими алгоритмами передачи данных
Алгоритмы AEAD в OCF сочетают потоковый шифр с аутентификацией
алгоритм, обеспечивающий как секретность, так и аутентификацию.
Алгоритмы AEAD принимают дополнительные аутентификационные данные (AAD)
в дополнение к зашифрованному или открытому тексту.
AAD передается алгоритму аутентификации в качестве входных данных в методе
определяется конкретным алгоритмом AEAD.
.Pp
Алгоритмы AEAD в OCF принимают одноразовый номер, который объединяется с
определенный алгоритмом счетчик для построения IV для базового
потокового шифра.
Этот одноразовый номер должен быть указан в
.Fa crp_iv
через
.Dv CRYPTO_F_IV_SEPARATE
флаг.
Некоторые алгоритмы AEAD поддерживают несколько одноразовых размеров.
Первый указанный размер - это одноразовый размер по умолчанию.
.Pp
Поддерживаются следующие алгоритмы AEAD:
.Bl -column "CRYPTO_AES_NIST_GCM_16" "12, 7-13" "16, 24, 32" "Tag"
.It Sy Названеи Ta Sy Параметры Ta Sy Размеры ключей Ta Sy Тэг Ta Sy Описание
.It Dv CRYPTO_AES_NIST_GCM_16 Ta 12 Ta 16, 24, 32 Ta 16 Ta
AES Galois/Режим счетчика
.It Dv CRYPTO_AES_CCM_16 Ta 12, 7-13 Ta 16, 24, 32 Ta 16 Ta
Счетчик AES с CBC-MAC
.It Dv CRYPTO_CHACHA20_POLY1305 Ta 12, 8 Ta 32 Ta 16 Ta
ChaCha20-Poly1305
.It Dv CRYPTO_XCHACHA20_POLY1305 Ta 24 Ta 32 Ta 16 Ta
XChaCha20-Poly1305
.El
.Sh Смотрите также
.Xr crypto 4 ,
.Xr crypto 9
.Sh История
.Nm
Страница руководства впервые появилась в
.Fx 10.1 .
