melkorbsd/ru-freebsd-man/man7/crypto.7
.\" Copyright (c) 2014-2021 The FreeBSD Foundation
.\"
.\" Portions of this documentation were written by John-Mark Gurney
.\" under the sponsorship of the FreeBSD Foundation and
.\" Rubicon Communications, LLC (Netgate).
.\"
.\" Portions of this documentation were written by Ararat River
.\" Consulting, LLC under sponsorship of the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1.  Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\" 2.  Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 11, 2022
.Dt CRYPTO 7
.Os
.Sh ИМЯ
.Nm crypto
.Nd алгоритмы OpenCrypto
.Sh ОПИСАНИЕ
Встроенная в ядро платформа OpenCrypto framework поддерживает несколько различных алгоритмов шифрования
и аутентификации.
В этом документе описаны параметры и требования к этим алгоритмам.
Если не указано иное, все размеры, указанные ниже, указаны в байтах.
.Ss Authenticators
Средства аутентификации вычисляют значение (также известное как дайджест, хэш или тег)
на основе введенных байт.
Запросы, выполняемые ядром, могут либо вычислять значение для заданных входных данных,
либо проверять, соответствует ли данный тег вычисленному тегу для заданных входных данных.
Поддерживаются следующие алгоритмы аутентификации:
.Bl -column "CRYPTO_AES_CCM_CBC_MAC" "XXX" "16, 24, 32" "Digest"
.It Sy Name Ta Sy Nonce Ta Sy Key Sizes Ta Sy Digest Ta Sy Description
.It Dv CRYPTO_AES_CCM_CBC_MAC Ta 12 Ta 16, 24, 32 Ta 16 Ta
Authentication-only mode of AES-CCM
.It Dv CRYPTO_AES_NIST_GMAC Ta 12 Ta 16, 24, 32 Ta 16 Ta
Galois message authentication code
.It Dv CRYPTO_BLAKE2B Ta Ta 0, 64 Ta 64 Ta
Blake2b
.It Dv CRYPTO_BLAKE2S Ta Ta 0, 32 Ta 32 Ta
Blake2s
.It Dv CRYPTO_NULL_HMAC Ta Ta Ta 12 Ta
IPsec NULL HMAC
.It Dv CRYPTO_POLY1305 Ta Ta 32 Ta 16 Ta
Poly1305 authenticator
.It Dv CRYPTO_RIPEMD160 Ta Ta Ta 20 Ta
RIPE Message Digest-160
.It Dv CRYPTO_RIPEMD160_HMAC Ta Ta 64 Ta 20 Ta
RIPE Message Digest-160 HMAC
.It Dv CRYPTO_SHA1 Ta Ta Ta 20 Ta
SHA-1
.It Dv CRYPTO_SHA1_HMAC Ta Ta 64 Ta 20 Ta
SHA-1 HMAC
.It Dv CRYPTO_SHA2_224 Ta Ta Ta 28 Ta
SHA-2 224
.It Dv CRYPTO_SHA2_224_HMAC Ta Ta 64 Ta 28 Ta
SHA-2 224 HMAC
.It Dv CRYPTO_SHA2_256 Ta Ta Ta 32 Ta
SHA-2 256
.It Dv CRYPTO_SHA2_256_HMAC Ta Ta 64 Ta 32 Ta
SHA-2 256 HMAC
.It Dv CRYPTO_SHA2_384 Ta Ta Ta 48 Ta
SHA-2 384
.It Dv CRYPTO_SHA2_384_HMAC Ta Ta 128 Ta 48 Ta
SHA-2 384 HMAC
.It Dv CRYPTO_SHA2_512 Ta Ta Ta 64 Ta
SHA-2 512
.It Dv CRYPTO_SHA2_512_HMAC Ta Ta 128 Ta 64 Ta
SHA-2 512 HMAC
.El
.Ss Block Ciphers
Блочные шифры в OCF могут работать только с сообщениями, длина которых в
точности кратна размеру блока шифра.
OCF поддерживает следующие блочные шифры:
.Bl -column "CRYPTO_CAMELLIA_CBC" "IV Size" "Block Size" "16, 24, 32"
.It Sy Name Ta Sy IV Size Ta Sy Block Size Ta Sy Key Sizes Ta Sy Description
.It Dv CRYPTO_AES_CBC Ta 16 Ta 16 Ta 16, 24, 32 Ta
AES-CBC
.It Dv CRYPTO_AES_XTS Ta 8 Ta 16 Ta 32, 64 Ta
AES-XTS
.It Dv CRYPTO_CAMELLIA_CBC Ta 16 Ta 16 Ta 16, 24, 32 Ta
Camellia CBC
.It Dv CRYPTO_NULL_CBC Ta 0 Ta 4 Ta 0-256 Ta
IPsec NULL cipher
.El
.Pp
.Dv CRYPTO_AES_XTS
реализует настраиваемый блочный шифр XEX с возможностью кражи зашифрованного
текста, как определено в NIST SP 800-38E.
Пользователи предоставляют первые 8 байт IV.
Оставшиеся 8 байт определяются как счетчик блоков, начинающийся с 0.
.Pp
ПРИМЕЧАНИЕ: Функция кражи зашифрованного текста реализована не во всех серверных
системах, поэтому для этого шифра требуется ввод данных, кратный размеру блока.
.Ss Stream Ciphers
Потоковые шифры могут работать с сообщениями произвольной длины.
OCF поддерживает следующие потоковые шифры:
.Bl -column "CRYPTO_CHACHA20" "IV Size" "16, 24, 32"
.It Sy Name Ta Sy IV Size Ta Sy Key Sizes Ta Sy Description
.It Dv CRYPTO_AES_ICM Ta 16 Ta 16, 24, 32 Ta
AES Counter Mode
.It Dv CRYPTO_CHACHA20 Ta 16 Ta 16, 32 Ta
ChaCha20
.El
.Pp
Данные для каждого запроса должны быть предоставлены в
.Fa crp_iv
с помощью флага
.Dv CRYPTO_F_IV_SEPARATE .
.Pp
.Dv CRYPTO_AES_ICM
использует весь IV в качестве 128-разрядного счетчика блоков с большим порядком порядковых номеров.
IV устанавливает начальное значение счетчика для сообщения.
Если пользователь желает использовать IV, значение которого разделено на
отдельные поля nonce и counter (например, IPSec),
пользователь несет ответственность за разделение запросов для обработки
переключения счетчика.
.Pp
.Dv CRYPTO_CHACHA20
принимает 16-байтовое значение IV.
Первые 8 байт используются в качестве одноразового значения.
Последние 8 байт используются в качестве 64-разрядного счетчика блоков в порядке убывания.
.Ss Authenticated Encryption with Associated Data Algorithms
Алгоритмы AEAD в OCF сочетают потоковый шифр с
алгоритмом аутентификации, обеспечивая как секретность, так и аутентификацию.
Алгоритмы AEAD принимают дополнительные данные аутентификации (AAD)
в дополнение к зашифрованному или открытому тексту.
AAD передается алгоритму аутентификации в качестве входных данных в методе,
определенном конкретным алгоритмом AEAD.
.Pp
Алгоритмы AEAD в OCF принимают одноразовый код, который объединяется с определенным
алгоритмом счетчиком для построения IV для базового
потокового шифра.
Этот одноразовый код должен быть указан в
.Fa crp_iv
с помощью флага
.Dv CRYPTO_F_IV_SEPARATE .
Некоторые алгоритмы AEAD поддерживают несколько одноразовых размеров.
Первый указанный размер является одноразовым размером по умолчанию.
.Pp
Поддерживаются следующие алгоритмы AEAD:
.Bl -column "CRYPTO_AES_NIST_GCM_16" "12, 7-13" "16, 24, 32" "Tag"
.It Sy Name Ta Sy Nonce Ta Sy Key Sizes Ta Sy Tag Ta Sy Description
.It Dv CRYPTO_AES_NIST_GCM_16 Ta 12 Ta 16, 24, 32 Ta 16 Ta
AES Galois/Counter Mode
.It Dv CRYPTO_AES_CCM_16 Ta 12, 7-13 Ta 16, 24, 32 Ta 16 Ta
AES Counter with CBC-MAC
.It Dv CRYPTO_CHACHA20_POLY1305 Ta 12, 8 Ta 32 Ta 16 Ta
ChaCha20-Poly1305
.It Dv CRYPTO_XCHACHA20_POLY1305 Ta 24 Ta 32 Ta 16 Ta
XChaCha20-Poly1305
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr crypto 4 ,
.Xr crypto 9
.Sh ИСТОРИЯ
Страница руководства
.Nm
впервые появилась в
.Fx 10.1 .
