melkorbsd/ru-freebsd-man/man7/environ.7
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)environ.7	8.3 (Berkeley) 4/19/94
.\"
.Dd August 5, 2020
.Dt ENVIRON 7
.Os
.Sh НАИМЕНОВАНИЕ
.Nm environ
.Nd пользовательская среда
.Sh СИНОПСИС
.Ar extern char **environ ;
.Sh ОПИСАНИЕ
Массив строк, называемый
.Ar окружающая среда
предоставляется каждому процессу с помощью
.Xr execve 2
при запуске процесса.
По условию эти строки имеют вид
.Va name Ns No = Ns Ar value ,
и называются
.Dq переменные окружения.
Процесс может запрашивать, обновлять и удалять эти строки с помощью команды
.Xr getenv 3 ,
.Xr setenv 3 ,
и
.Xr unsetenv 3
функции, соответственно.
Оболочки также предоставляют команды для работы с окружением;
Они описаны на страницах руководства по соответствующим оболочкам.
.Pp
Ниже приведен список переменных окружения, которые обычно
который обычно встречается в
.Ux
система.
Он включает только те переменные, которые пользователь может ожидать увидеть во время
повседневной работе с системой, и он далеко не полный.
Переменные окружения, специфичные для конкретной программы или библиотечной функции
документируются в
.Sx ОКРУЖАЮЩАЯ СРЕДА
раздел соответствующей страницы руководства.
.Sh ОКРУЖАЮЩАЯ СРЕДА
.Bl -tag -width LD_LIBRARY_PATH
.It Ev BLOCKSIZE
Размер блоков, используемых несколькими командами, связанными с диском,
прежде всего
.Xr df 1 ,
.Xr du 1
и
.Xr ls 1 .
.Ev BLOCKSIZE
можно указать в единицах байта, указав число,
в единицах килобайта, указав число, за которым следует
.Ql K
или
.Ql k ,
в единицах мегабайта путем указания числа, за которым следует
.Ql M
или
.Ql m ,
и в единицах гигабайта путем указания числа, за которым следует
по адресу
.Ql G
или
.Ql g .
Размеры меньше 512 байт или больше гигабайта игнорируются.
Эта переменная обрабатывается командой
.Xr getbsize 3
функция.
.It Ev COLUMNS
Предпочтительная для пользователя ширина столбцов терминала.
Для этого используются такие утилиты, как
.Xr ls 1
и
.Xr who 1
используется для форматирования вывода в столбцы.
Если значение не задано или пусто, утилиты будут использовать
.Xr ioctl 2
чтобы запросить ширину у драйвера терминала.
.It Ev EDITOR
Имя редактора по умолчанию.
.It Ev EXINIT
Стартовый список команд, считываемый
.Xr ex 1
и
.Xr vi 1 .
.It Ev HOME
Каталог входа пользователя в систему, задаваемый
.Xr login 1
из файла паролей
.Xr passwd 5 .
.It Ev LANG
Эта переменная настраивает все программы, использующие
.Xr setlocale 3
использовать указанную локаль, за исключением случаев, когда
.Ev LC_*
переменные не установлены.
.It Ev LC_ALL
Переопределяет значения
.Ev LC_COLLATE ,
.Ev LC_CTYPE ,
.Ev LC_MESSAGES ,
.Ev LC_MONETARY ,
.Ev LC_NUMERIC ,
.Ev LC_TIME
и
.Ev LANG .
.It Ev LC_COLLATE
Язык, которое будет использоваться для упорядочивания строк.
.It Ev LC_CTYPE
Язык, используемое для классификации символов
(буква, пробел, цифра и т. д.) и для интерпретации последовательностей байтов как
многобайтовые символы.
.It Ev LC_MESSAGES
Язык, который будет использоваться для диагностических сообщений.
.It Ev LC_MONETARY
Язык, используемый для интерпретации ввода денежных знаков
и форматирования выходных данных.
.It Ev LC_NUMERIC
Язык, используемый для интерпретации ввода и форматирования числовых данных
форматирования вывода.
.It Ev LC_TIME
Язык, используемый для интерпретации вводимых дат и
для форматирования выходных данных.
.It Ev MAIL
Место расположения пользовательского
почтового ящика вместо используемого по умолчанию /var/mail,
используемое
.Xr mail 1 ,
.Xr sh 1 ,
и многих других почтовых клиентов.
.It Ev MANPATH
Последовательность каталогов, разделенных двоеточиями, поиск по которым осуществляется
.Xr man 1
при поиске страниц руководства.
.It Ev NLSPATH
Список каталогов для поиска каталога сообщений, на который ссылается
.Ev LC_MESSAGES .
Смотреть
.Xr catopen 3 .
.It Ev PAGER
Программа пагинатора по умолчанию.
Программа, указанная этой переменной, используется
.Xr mail 1 ,
.Xr man 1 ,
.Xr ftp 1 ,
и т. д. для отображения информации, которая длиннее, чем текущий экран.
.It Ev PATH
Последовательность каталогов, разделенных двоеточиями, поиск по которым осуществляется
.Xr csh 1 ,
.Xr sh 1 ,
.Xr system 3 ,
.Xr execvp 3 ,
и т.д. при поиске исполняемого файла.
.Ev PATH
первоначально устанавливается в ``/usr/bin:/bin''.
.Xr login 1 .
.It Ev POSIXLY_CORRECT
При установке любого значения эта переменная окружающая среда изменяет поведение
определенных команд, чтобы они (в основном) выполнялись строго POSIX-совместимым образом.
.It Ev PRINTER
Имя принтера по умолчанию, который будет использоваться командой
.Xr lpr 1 ,
.Xr lpq 1 ,
и
.Xr lprm 1 .
.It Ev PWD
Путь к текущему каталогу.
.It Ev SHELL
Полный путь к оболочке входа пользователя в систему.
.It Ev TERM
Тип терминала, для которого должен быть подготовлен вывод.
Эта информация используется такими командами, как
.Xr nroff 1 Pq Pa ports/textproc/groff
или
.Xr plot 1
которые могут использовать специальные возможности терминала.
Смотреть
.Pa /usr/share/misc/termcap
.Pq Xr termcap 5
для получения списка типов терминалов.
.It Ev TERMCAP
Строка, описывающая терминал в
.Ev TERM ,
или, если
она начинается с '/', имя файла termcap.
Смотреть
.Ev TERMPATH
ниже, и
.Xr termcap 5 .
.It Ev TERMPATH
Последовательность имен путей к файлам termcap, разделенных двоеточиями или пробелами,
которые ищутся для описания терминалов в указанном порядке.
Имея
не
.Ev TERMPATH
эквивалентен
.Ev TERMPATH
из
.Pa $HOME/.termcap:/etc/termcap .
.Ev TERMPATH
игнорируется, если
.Ev TERMCAP
содержит полное имя пути.
.It Ev TMPDIR
Каталог, в котором хранятся временные файлы.
Большинство приложений используют либо
.Pa /tmp
либо
.Pa /var/tmp .
Установка этой переменной заставит их использовать другую директорию.
.It Ev TZ
Часовой пояс, используемый при отображении дат.
Обычный формат - это имя пути относительно
.Pa /usr/share/zoneinfo .
Например, команда
.Pp
.Dl env TZ=America/Los_Angeles date
.Pp
отображает текущее время в Калифорнии.
Смотреть
.Xr tzset 3
для получения дополнительной информации.
.It Ev USER
Имя пользователя для входа в систему.
Рекомендуется, чтобы портативные приложения использовали
.Ev LOGNAME
вместо него.
.El
.Pp
Другие имена могут быть помещены в окружающую среду с помощью программы
.Ic экспорт 
командой и
.Ar name=value
аргументы в
.Xr sh 1 ,
или с помощью
.Ic setenv
если вы используете
.Xr csh 1 .
Неразумно изменять некоторые
.Xr sh 1
переменные, которые часто экспортируются командой
.Pa .profile
файлы, такие как
.Ev MAIL ,
.Ev PS1 ,
.Ev PS2 ,
и
.Ev IFS ,
если только вы не знаете, что делаете.
.Pp
Текущие переменные окружающей среды могут быть выведены на печать с помощью команды
.Xr env 1 ,
.Xr set 1
или
.Xr printenv 1
в
.Xr sh 1
и
.Xr env 1 ,
.Xr printenv 1
или
.Cm printenv
built-in команда в
.Xr csh 1 .
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr cd 1 ,
.Xr csh 1 ,
.Xr env 1 ,
.Xr ex 1 ,
.Xr login 1 ,
.Xr printenv 1 ,
.Xr sh 1 ,
.Xr execve 2 ,
.Xr execle 3 ,
.Xr getbsize 3 ,
.Xr getenv 3 ,
.Xr setenv 3 ,
.Xr setlocale 3 ,
.Xr system 3 ,
.Xr termcap 3 ,
.Xr termcap 5
.Sh HISTORY
Страница
.Nm
руководства появилась в
.At v7 .

