melkorbsd/ru-freebsd-man/man7/ffs.7
.\" Copyright (c) 2001 Networks Associates Technology, Inc.
.\" Все права защищены.
.\"
.\" Это программное обеспечение было разработано для проекта FreeBSD Chris
.\" Костелло из Safeport Network Services и NAI Labs, компания Security
.\" исследовательского подразделения Network Associates, Inc. по контракту DARPA/SPAWAR
.\" контракт N66001-01-C-8035 ("CBOSS"), как часть исследовательской программы DARPA CHATS
.\" исследовательской программы.
.\"
.\" Распространение и использование в исходных и двоичных формах, с модификацией или без
.\" разрешены при соблюдении следующих условий
.\" соблюдаются:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. Перераспределение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах
.\" уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\" документации и/или других материалах, поставляемых вместе с дистрибутивом.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРАМИ И РАЗРАБОТЧИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ
.\" НЕ ПРИНИМАЮТСЯ.  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ СОАВТОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ.
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ
.\" ИЛИ УСЛУГИ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТ, СТРОГИЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ), ВОЗНИКАЮЩИХ КАКИМ-ЛИБО ОБРАЗОМ
.\" В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 3 мая 2020 г.
.Dt FFS 7
.Os
.Sh ИМЯ
.Nm ffs
.Nd Быстрая файловая система Berkeley
.Sh СИНОПСИС
В конфигурационном файле ядра:
.Cd "параметры FFS"
.Cd "параметры QUOTA"
.Cd "параметры SOFTUPDATES"
.Cd "параметры SUIDDIR"
.Cd "параметры UFS_ACL"
.Cd "параметры UFS_DIRHASH"
.Cd "параметры UFS_EXTATTR"
.Cd "параметры UFS_EXTATTR_AUTOSTART"
.Cd "параметры UFS_GJOURNAL"
.Pp
В
.Xr fstab 5 :
.Bd -literal -compact
/dev/disk0a /mnt ufs rw 1 1
.Ed
.Sh ОПИСАНИЕ
Быстрая файловая система Berkeley
предоставляет средства для хранения данных файловой системы на дисковом устройстве.
.Nm
была оптимизирована в течение многих лет
для повышения скорости и надежности
и используется по умолчанию
.Fx
файловая система.
.Ss Квоты
.Bl -tag -width 2n
.It Cd "параметры QUOTA"
Эта опция позволяет системным администраторам
устанавливать ограничения на использование диска
для каждого пользователя.
Квоты можно использовать только для файловых систем
смонтированных с помощью
.Cm quota
опцией;
см.
.Xr quota 1
и
.Xr edquota 8 .
.El
.Ss программное обновления
.Bl -tag -width 2n
.It Cd "параметры SOFTUPDATES"
Функция программного обновления отслеживает записи на диск
и обеспечивает выполнение зависимостей обновления метаданных
(например, обновление карт свободных блоков)
для обеспечения согласованности файловой системы.
.Pp
Чтобы создать новую файловую систему с включенной функцией программных обновлений
включено,
используйте
.Xr newfs 8
команда:
.Pp
.D1 Nm newfs Fl U Ar fs
.Pp
.Ar fs
может быть либо точкой монтирования, указанной в
.Xr fstab 5
.Pq e.g. , Pa /usr ,
либо дисковым устройством
.Pq e.g., Pa /dev/da0a .
.Pp
Можно включить программное обновление на
.Em unmounted
файловой системы с помощью
.Xr tunefs 8
команда:
.Pp
.D1 Nm tunefs Fl n Cm enable Ar fs
.Pp
Программное обновления могут также добавить журналирование, которое уменьшает время, затрачиваемое на
.Xr fsck_ffs 8
на очистку файловой системы после сбоя с нескольких минут до нескольких секунд.
Журнал помещается в узел с именем
.Pa .sujournal ,
и хранится в виде кругового журнала, состоящего из сегментов, содержащих
записи, описывающие операции с метаданными.
.Pp
Чтобы создать новую файловую систему с включенной функцией мягких обновлений
и включенной журнализацией мягких обновлений,
используйте следующую команду:
.Pp
.D1 Nm newfs Fl j Ar fs
.Pp
Это запускает
.Xr tunefs 8
команда после
.Xr newfs 8
команда с
.Fl U
флаг включен.
Можно включить журналирование мягких обновлений на
.Em unmounted
файловой системы с помощью
.Xr tunefs 8
команда:
.Pp
.D1 Nm tunefs Fl j Cm enable Ar fs
.Pp
Этот флаг автоматически включает функцию плавного обновления
если она не включена.
Обратите внимание, что этот
.Xr tunefs 8
не выполнится, если файл
.Pa .sujournal
уже существует до включения журналирования мягких обновлений.
.El
.Ss Наследование прав собственности на файлы
.Bl -tag -width 2n
.It Cd "параметры SUIDDIR"
Для использования в средах совместного доступа к файлам
в сетях, включающих
.Tn "Microsoft Windows"
и
.Tn "Apple Macintosh"
компьютеры,
этот параметр позволяет файлам на файловых системах
смонтированных с помощью
.Cm suiddir
опция
унаследовать право собственности на свой каталог,
т.е.,
.Dq "Если это мой каталог, то это должен быть мой файл."
.El
.Ss Списки контроля доступа
.Bl -tag -width 2n
.It Cd "параметры UFS_ACL"
Списки контроля доступа позволяют объединять
тонкую информацию о дискреционном контроле доступа
с файлами и каталогами.
Эта опция требует наличия параметра
.Dv UFS_EXTATTR
и рекомендуется, чтобы
.Dv UFS_EXTATTR_AUTOSTART
также включена,
чтобы ACL включались атомарно при монтировании файловой системы.
.El
.Pp
Чтобы включить поддержку ACL,
в файловой системе должны быть доступны два расширенных атрибута
.Dv EXTATTR_NAMESPACE_SYSTEM
пространства имен:
.Pa posix1e.acl_access ,
который содержит ACL доступа,
и
.Pa posix1e.acl_default ,
в котором хранится ACL по умолчанию для каталогов.
Если вы используете расширенные атрибуты файловой системы,
следующие команды могут быть использованы для
выделения места и создания необходимых файлов подложки EA
для ACL в корне каждой файловой системы.
В этих примерах используется корневая файловая система;
см.
.Sx "Расширенные атрибуты"
для получения более подробной информации.
.Bd -literal -offset indent
mkdir -p /.attribute/system
cd /.attribute/system
extattrctl initattr -p / 388 posix1e.acl_access
extattrctl initattr -p / 388 posix1e.acl_default
.Ed
.Pp
При следующем монтировании корневой файловой системы,
атрибуты будут автоматически запущены, если
.Dv UFS_EXTATTR_AUTOSTART
включен в конфигурацию ядра,
и будут включены ACL.
.Ss Хеширование каталогов
.Bl -tag -width 2n
.It Cd "параметры UFS_DIRHASH"
Реализует схему поиска каталогов на основе хэша
для ускорения доступа к очень большим каталогам.
.El
.Ss Расширенные атрибуты
.Bl -tag -width 2n
.It Cd "параметры UFS_EXTATTR"
Расширенные атрибуты позволяют связывать
дополнительные произвольные метаданные с файлами и каталогами,
которые могут назначаться и извлекаться как из пользовательского интерфейса
а также из ядра; см.
.Xr extattrctl 8 .
.It Cd "параметры UFS_EXTATTR_AUTOSTART"
Если эта опция определена,
.Nm
будет искать
.Pa .attribute
в подкаталоге корня файловой системы во время операции монтирования.
Если он будет найден, поддержка расширенных атрибутов будет
будет автоматически запущена поддержка расширенных атрибутов для этой файловой системы.
.El
.Ss Журналирование на основе GEOM
.Bl -tag -width 2n
.It Cd "параметры UFS_GJOURNAL"
Реализует журналирование файловой системы UFS на уровне блоков,
как для данных, так и для метаданных.
Чтобы включить эту функцию,
создайте
.Xr gjournal 8
провайдера GEOM для блочного устройства с помощью следующей команды
следующую команду:
.Pp
.D1 Nm gjournal label Ar da0
.Pp
В этом примере,
.Pa /dev/da0
используется в качестве целевого блочного устройства,
и
.Pa /dev/da0.journal
будет создан.
Затем создайте новую файловую систему с помощью
.Xr newfs 8
с флагом журналирования на уровне блоков и смонтируйте ее:
.Pp
.D1 Nm newfs Fl J Ar /dev/da0.journal
.D1 Nm mount Fl o Cm async Ar /dev/da0.journal Ar /mnt
.Pp
.Cm async
опция не является обязательной, но рекомендуется для повышения производительности
поскольку журналирование гарантирует согласованность
.Cm async
монтирование.
.Pp
Также можно включить журналирование на уровне блоков
в существующей файловой системе.
Для этого,
используйте
.Xr gjournal 8
для маркировки базового блочного устройства и
.Xr tunefs 8
чтобы включить флаг журналирования на уровне блока:
.Pp
.D1 Nm gjournal label Ar da0
.D1 Nm tunefs Fl J Cm enable Ar /dev/da0.journal
.D1 Nm mount Fl o Cm async Ar /dev/da0.journal Ar /mnt
.El
.Ss Xr sysctl 8 MIBs
Следующие
.Xr sysctl 8
MIB определены для использования с
.Nm :
.Bl -hang -width ".Va vfs.ffs.doreallocblk"
.It Va vfs.ffs.doasyncfree
Асинхронная запись измененных блоков i-узла и косвенных блоков
при перераспределении блоков файловой системы, чтобы они были смежными.
.Pq Default: 1 .
.It Va vfs.ffs.doreallocblks
Включить поддержку перераспределения блоков
чтобы они были смежными.
.Pq Default: 1 .
.El
.Sh ИСТОРИЯ
Адрес
.Nm
впервые появилась в
.Fx 4.5 .
.Sh СМОТРИТЕ ТАКЖЕ
.Xr quota 1 ,
.Xr acl 3 ,
.Xr extattr 3 ,
.Xr edquota 8 ,
.Xr extattrctl 8 ,
.Xr fsck_ffs 8 ,
.Xr sysctl 8 ,
.Xr tunefs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%D August 1984
.%T "Быстрая файловая система для UNIX"
.%J "Транзакции ACM в компьютерных системах"
.%N 2
.%V 3
.%P 181-197
.Re
.Rs
.%A M. McKusick
.%D June 2000
.%T "Программное обновления: метод устранения большинства синхронных операций записи в быстрой файловой системе"
.%J "Материалы трека Freenix на ежегодной технической конференции Usenix 1999"
.%P 71-84
.Re
.Rs
.%A M. McKusick
.%A J. Roberson
.%D May 2010
.%T "Журнал программное обновления"
.%J "Канадская конференция BSD 2010 (BSDCan)"
.Re
