melkorbsd/ru-freebsd-man/man7/growfs.7
.\" Copyright 2014 John-Mark Gurney
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 22, 2022
.Dt GROWFS 7
.Os
.Sh ИМЯ
.Nm growfs ,
.Nm growfs_fstab
.Nd запуск скриптов для расширения корневой файловой системы и добавления подкачки
.Sh ОПИСАНИЕ
Скрипт
.Nm
обычно запускается при первой загрузке после установки системы.
Если размер загрузочного диска превышает размер корневой файловой системы и загрузочных разделов,
а корневая файловая система находится в последнем разделе,
.Nm
позволяет расширить корневую файловую систему.
Также можно добавить раздел подкачки, размер которого по умолчанию составляет 10% от объема загрузочного диска.
Для подкачки можно увеличить объем памяти вдвое - до 4 ГБ,
8 ГБ - до 8 ГБ оперативной памяти и объем памяти более 8 ГБ.
Это также ограничено значением
.Xr sysctl 8
из
.Li vm.swap_maxpages
деленным на 2.
По умолчанию раздел подкачки не создается, если существующий раздел подкачки найден
или указан в
.Pa /etc/fstab ,
или объем диска меньше 15 ГБ.
Скрипт
.Nm growfs_fstab
добавляет любой новый раздел подкачки в
.Pa /etc/fstab
после того, как корневая файловая система станет доступной для записи,
и позволит использовать ее в качестве раздела дампа, если переменная
.Va dumpdev
из
.Xr rc.conf 5
установлена на
.Li AUTO .
.Pp
Следующие опции в
.Pa /etc/rc.conf
контролируют поведение
.Nm :
.Bl -tag -width ".Va growfs_swap_size" -offset indent
.It Va growfs_enable
.Pq Dq Li NO
Если установлено значение
.Dq Li YES ,
при первой загрузке компьютера корневая файловая система будет автоматически
расширена, если это возможно, чтобы заполнить все доступное пространство после нее,
после дополнительного добавления устройства подкачки в конце.
.It Va growfs_swap_size
.Pq Dq Li \&
Если установлено значение
.Dq Li 0 ,
добавление раздела подкачки отключено.
Пустое значение
.Pq Dq Li \&
позволяет создать раздел подкачки с размером по умолчанию.
Если задано другое значение,
раздел подкачки будет создан с указанным размером в байтах,
даже если будет обнаружен другой раздел подкачки.
.El
.Pp
Настройка для
.Va growfs_swap_size
может быть установлена в среде ядра, и в этом случае она переопределяет
значение из
.Pa /etc/rc.conf .
.Pp
Чтобы расширить корневую файловую систему без перезагрузки, выполните следующую команду:
.Dl % /etc/rc.d/growfs onestart
Кроме того, если добавлен раздел подкачки, выполните команду:
.Dl % /etc/rc.d/growfs_fstab onestart
Обратите внимание, что при повторном расширении диска
и если корневая файловая система ранее была расширена
и добавлен раздел подкачки, необходимо удалить раздел
подкачки перед этой процедурой,
чтобы расширить корневую файловую систему до нового размера.
Во время расширения может быть создан новый раздел подкачки.
.Sh ПРИМЕЧАНИЯ ПО ИСПОЛЬЗОВАНИЮ
Скрипт
.Nm
выполняет только попытку расширения корневой файловой системы,
и свободное пространство должно быть доступно сразу после корневого раздела.
Обычно это используется для изображений, которые имеют единую файловую систему.
Скрипт требует, чтобы
.Xr awk 1
присутствовал и находился на пути.
Обычно это означает, что
.Pa /usr
должен быть доступен до запуска скрипта.
.Sh ФАЙЛЫ
.Bl -tag -compact -width Pa
.It Pa /etc/fstab
.It Pa /etc/rc.conf
.El
.Sh ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
.Ex -std
.Sh СМОТРИТЕ ТАКЖЕ
.Xr fstab 5 ,
.Xr rc.conf 5 ,
.Xr growfs 8 ,
.Xr zpool 8
.Sh ИСТОРИЯ
Страница руководства
.Nm
впервые появилась в
.Fx 10.1 .
Возможность добавления раздела подкачки была добавлена в
.Fx 13.2 .
.Sh АВТОРЫ
Справочная страница и сценарий были написаны
.An Джон-Марком Гурни Aq Mt jmg@FreeBSD.org .
Возможность создания раздела подкачки была добавлена
.An Майклом Карелс Aq Mt karels@FreeBSD.org .
