melkorbsd/ru-freebsd-man/man7/hostname.7
.\" Copyright (c) 1987, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)hostname.7	8.2 (Berkeley) 12/30/93
.\"
.Dd December 25, 2013
.Dt HOSTNAME 7
.Os
.Sh Название
.Nm имя хоста
.Nd описание разрешений имени хоста
.Sh Описание
Имена хостов - это домены, где домен представляет собой иерархическую структуру, разделенную точками
список поддоменов; например, машина monet, в Беркли
поддомен EDU, поддомен Интернета, будет представлен в виде
.Pp
.Dl monet.Berkeley.EDU
.Pp
(без завершающей точки).
.Pp
Имена хостов часто используются в сетевых клиентских и серверных программах,
который, как правило, должен преобразовывать название в адрес для использования.
(Эта функция обычно выполняется библиотечной подпрограммой
.Xr gethostbyname 3 . )
Имена хостов обрабатываются средством распознавания интернет-имен следующим образом.
.Pp
Если имя состоит из одного компонента, т.е. не содержит точки,
и если переменная окружения
.Dq Ev HOSTALIASES
задается как имя файла,
в этом файле выполняется поиск любой строки, соответствующей введенному имени хоста.
Файл должен состоять из строк, состоящих из двух строк, разделенных пробелами,
первым из которых является псевдоним имени хоста,
и второе из них - это полное имя хоста
который будет заменен на этот псевдоним.
Если найдено совпадение между именами хостов без учета регистра, которое необходимо устранить
и в первом поле строки в файле просматривается подставленное имя
завершается без дальнейшей обработки.
.Pp
Если входное имя заканчивается точкой в конце,
конечная точка удаляется,
а оставшееся имя просматривается без дальнейшей обработки.
.Pp
Если входное имя не заканчивается точкой в конце, выполняется поиск по нему
просматривая список доменов до тех пор, пока не будет найдено совпадение.
Список поиска по умолчанию включает в себя сначала локальный домен,
затем следуют его родительские домены, содержащие как минимум 2 компонента имен (сначала самые длинные).
Например,
В домене CS.Berkeley.EDU, название lithium.CChem будет проверен в первую очередьт
так lithium.CChem.CS.Berkeley.EDU а затема,как lithium.CChem.Berkeley.EDU.
Lithium.CChem.EDU не будет опробован, так как есть только один компонент
оставшийся от локального домена.
Путь поиска может быть изменен по сравнению с заданным по умолчанию
с помощью общесистемного конфигурационного файла (см.
.Xr resolver 5 ) .
.Sh Смотрите также
.Xr gethostbyname 3 ,
.Xr resolver 5
.Sh История
.Nm Имя хоста
появился в
.Bx 4.2 .
