melkorbsd/ru-freebsd-man/man7/intro.7
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)intro.7	8.1 (Berkeley) 6/5/93
.\"
.Dd November 19, 2020
.Dt INTRO 7
.Os
.Sh Название
.Nm Введение
.Nd различные информационные страницы
.Sh Описание
Этот раздел содержит различную документацию.
.Bl -tag -width "mdoc.samples(7)" -offset абзац
.It Xr arch 7
поддерживаемые архитектуры и платформы процессоров
.It Xr ascii 7
карта набора символов ASCII
.It Xr build 7
инструкции по сборке для
.Fx
.It Xr c 7
язык программирования С
.It Xr clocks 7
часы с системным хронометражем, доступные в
.Fx
.It Xr crypto 7
криптографические алгоритмы, предоставляемые OpenCrypto в
.Fx
.It Xr development 7
введение в разработку
.Fx
.It Xr environ 7
пользовательская среда
.It Xr ffs 7
часто используемая файловая система в
.Fx
.It Xr firewall 7
простые брандмауэры под
.Fx
.It Xr hier 7
иерархия файловой системы в
.Fx
.It Xr hostname 7
описание разрешения имени хоста
.It Xr release 7
расположение
.Fx
релизы и снапшоты
.It Xr ports 7
знакомство с портовой инфраструктурой
.Fx
.It Xr security 7
функции безопасности, доступные в
.Fx
.It Xr stats 7
статистические утилиты, доступные в
.Fx
.It Xr tests 7
введение в
.Fx
Набор тестов
.It Xr tuning 7
общие рекомендации по настройке
.Fx
.El
.Sh Смотрите также
.Xr man 1 ,
.Xr intro 2 ,
.Xr intro 3 ,
.Xr intro 4 ,
.Xr intro 5 ,
.Xr intro 6 ,
.Xr intro 8 ,
.Xr intro 9
.Sh История
.Nm
страница руководства по разделу появилась в
.Bx 4.2 .
