melkorbsd/ru-freebsd-man/man7/man.7
.\" $Id: man.7,v 1.148 2021/08/05 14:31:14 schwarze Exp $
.\"
.\" Copyright (c) 2009, 2010, 2011, 2012 Kristaps Dzonsons <kristaps@bsd.lv>
.\" Copyright (c) 2011-2015, 2017-2020 Ingo Schwarze <schwarze@openbsd.org>
.\" Copyright (c) 2017 Anthony Bentley <bentley@openbsd.org>
.\" Copyright (c) 2010 Joerg Sonnenberger <joerg@netbsd.org>
.\"
.\" Разрешение на использование, копирование, изменение и распространение данного программного обеспечения для любых

.\" уведомление об авторских правах и данное разрешение будут присутствовать во всех копиях.
.\"
.\" ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ", И АВТОР ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ.
.\" В ОТНОШЕНИИ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ
.\" ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА
.\" ЛЮБЫЕ СПЕЦИАЛЬНЫЕ, ПРЯМЫЕ, КОСВЕННЫЕ ИЛИ ПОСЛЕДУЮЩИЕ УБЫТКИ ИЛИ ЛЮБЫЕ УБЫТКИ
.\" ВОЗНИКШИЕ В РЕЗУЛЬТАТЕ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БУДЬ ТО В
.\" ПО ДОГОВОРУ, ХАЛАТНОСТИ ИЛИ ДРУГИМ ДЕЛИКТНЫМ ДЕЙСТВИЯМ, ВОЗНИКАЮЩИМ ИЗ
.\" ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ РАБОТОЙ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.
.\"
.Dd $Mdocdate: August 5 2021 $
.Dt MAN 7
.Os
.Sh ИМЯ
.Nm man
.Nd Устаревший язык форматирования для справочных страниц
.Sh ОПИСАНИЕ
.Nm man
был стандартным языком форматирования для
.At
с 1979 по 1989 год.
Не используйте его для написания новых страниц руководства: это чисто презентационный
и не поддерживает семантическую разметку.
Используйте
.Xr mdoc 7
вместо него.
.Pp
В
.Nm
строки, начинающиеся с управляющего символа
.Sq \&.
называются
.Dq macro cписки .
Первое слово - это имя макроса.
Обычно оно состоит из двух заглавных букв.
Список переносимых макросов см.
.Sx ОБЗОР МАКРОСОВ.
Слова, следующие за именем макроса, являются аргументами макроса.
.Pp
Строки, не начинающиеся с управляющего символа, называются
.Dq text списки .
Они представляют собой текст произвольной формы для печати; форматирование текста
зависит от соответствующего контекста обработки:
.Bd -literal -offset indent
\&.SH Макростроки изменяют состояние управления.
Текстовые строки интерпретируются в рамках текущего состояния.
.Ed
.Pp
Многие аспекты базового синтаксиса языка
.Nm
Язык; Смотрите
.Xr roff 7
см.
.Em СИНТАКСИС ЯЗЫКА
и
.Em СИНТАКСИС МАКРОСОВ
разделы в
.Xr roff 7
руководство для получения подробной информации, в частности о
комментариев, экранирующих последовательностей, пробельных символов и кавычек.
.Pp
Каждый
.Nm
начинается с
.Ic TH
макроса, указывающего имя и раздел документа, за которым следует макрос
.Sx ИМЯ
отформатированный следующим образом:
.Bd -literal -offset indent
\&.TH PROGNAME 1 1979-01-10
\&.SH ИМЯ
\efBprogname\efR \e(en одна строка о том, что он делает
.Ed
.Sh ОБЩИЕ СВЕДЕНИЯ
Этот обзор отсортирован таким образом, что макросы одинакового назначения перечислены вместе.
Устаревшие и непортируемые макросы не включены в обзор,
но их можно найти в алфавитном справочнике ниже.
.Bl -column "RS, RE" description
.It Ic TH Ta set the title: Ar name section date Op Ar source Op Ar volume
.It Ic AT Ta display AT&T UNIX version in the page footer (<= 1 argument)
.It Ic UC Ta display BSD version in the page footer (<= 1 argument)
.El
.Ss Разделы и параграфы
.Bl -column "RS, RE" description
.It Ic SH Ta section header (one line)
.It Ic SS Ta subsection header (one line)
.It Ic PP Ta start an undecorated paragraph (no arguments)
.It Ic RS , RE Ta reset the left margin: Op Ar width
.It Ic IP Ta indented paragraph: Op Ar head Op Ar width
.It Ic TP Ta tagged paragraph: Op Ar width
.It Ic PD Ta set vertical paragraph distance: Op Ar height
.It Ic in Ta additional indent: Op Ar width
.El
.Ss Физическая разметка
.Bl -column "RS, RE" description
.It Ic B Ta boldface font
.It Ic I Ta italic font
.It Ic SB Ta small boldface font
.It Ic SM Ta small roman font
.It Ic BI Ta alternate between boldface and italic fonts
.It Ic BR Ta alternate between boldface and roman fonts
.It Ic IB Ta alternate between italic and boldface fonts
.It Ic IR Ta alternate between italic and roman fonts
.It Ic RB Ta alternate between roman and boldface fonts
.It Ic RI Ta alternate between roman and italic fonts
.El
.Sh СПРАВОЧНИК ПО МАКРОСАМ
Этот раздел представляет собой каноническую ссылку на все макросы, расположенные
в алфавитном порядке.
О масштабировании отдельных макросов см.
.Sx СИНТАКСИС МАКРОСОВ .
.Bl -tag -width 3n
.It Ic AT
Устанавливает объем нижнего колонтитула для совместимости с man страницами из
.At
запросы.
Необязательные аргументы указывают, из какого выпуска он взят.
Этот макрос является расширением, впервые появившимся в
.Bx 4.3 .
.It Ic B
Текст выделяется жирным шрифтом.
.It Ic BI
Текст попеременно отображается жирным шрифтом и курсивом.
Таким образом,
.Sq .BI this word and that
вызывает
.Sq this
и
.Sq and
выделяются жирным шрифтом, в то время как
.Sq word
и
.Sq that
выделены курсивом.
Пробелы между аргументами в выводе опущены.
.Pp
Пример:
.Pp
.Dl \&.BI bold italic bold italic
.It Ic BR
Текст попеременно отображается жирным шрифтом и романским (шрифт по умолчанию).
Пробелы между аргументами при выводе опускаются.
См. также
.Ic BI .
.It Ic DT
Восстанавливает позиции табулятора по умолчанию.
Они заданы с интервалом в 0,5 дюйма.
Это не имеет никакого эффекта, если позиции табулятора не были изменены с помощью команды
.Xr roff 7
.Ic ta
запрос.
.It Ic EE
Это нестандартная версия 9
.At
расширение, позднее принятое GNU.
В
.Xr mandoc 1 ,
оно делает то же самое, что и
.Xr roff 7
.Ic fi
запрос (переключение в режим заполнения).
.It Ic EX
Это нестандартная версия 9
.At
расширение, позднее принятое GNU.
В
.Xr mandoc 1 ,
оно делает то же самое, что и
.Xr roff 7
.Ic nf
запрос (переключение в режим отсутствия заполнения).
.It Ic HP
Начать абзац, начальная строка которого выравнивается по левому краю, но
последующие строки выводятся с отступом, со следующим синтаксисом:
.Pp
.D1 Pf . Ic HP Op Ar width
.Pp
.Ar width
является аргументом
.Xr roff 7
ширина масштабирования.
Если он указан, он сохраняется для последующих левых полей абзаца;
если не указан, используется сохраненная ширина или ширина по умолчанию.
.Pp
Этот макрос переносимый, но устаревший
потому что он не имеет хорошего представления в HTML-выводах,
обычно он оказывается неотличим от
.Ic PP .
.It Ic I
Текст выделяется курсивом.
.It Ic IB
Текст попеременно выделяется курсивом и жирным шрифтом.
Пробелы между аргументами при выводе опускаются.
См. также
.Ic BI .
.It Ic IP
Начните абзац с отступом, используя следующий синтаксис:
.Pp
.D1 Pf . Ic IP Op Ar head Op Ar width
.Pp
.Ar width
является аргументом
.Xr roff 7
масштабируемая ширина, определяющая левое поле.
Он сохраняется для последующих левых полей абзацев; если он не указан, используется сохраненная или
используется ширина по умолчанию.
.Pp
.Ar head
используется как ведущий термин, вытесняемый на левое поле.
Это полезно для абзацев с пулями и т. д.
.It Ic IR
Текст выводится поочередно курсивом и римским шрифтом (шрифт по умолчанию).
Пробелы между аргументами при выводе опускаются.
См. также
.Ic BI .
.It Ic LP
Синоним для
.Ic PP .
.It Ic ME
Завершение блока mailto, начатого с
.Ic MT .
Это нестандартное расширение GNU.
.It Ic MT
Начало блока mailto.
Это нестандартное расширение GNU.
Оно имеет следующий синтаксис:
.Bd -unfilled -offset indent
.Pf . Ic MT Ar address
описание ссылки, которая должна быть показана
.Pf . Ic ME
.Ed
.It Ic OP
Необязательный аргумент командной строки.
Это нестандартное расширение DWB.
Оно имеет следующий синтаксис:
.Pp
.D1 Pf . Ic OP Ar key Op Ar value
.Pp
.Ar key
обычно является флагом командной строки, а
.Ar value
его аргумент.
.It Ic P
Синоним для
.Ic PP
является
.At III
расширение, позднее принятое в
.Bx 4.3 .
.It Ic PD
Укажите вертикальный пробел, который должен быть вставлен перед каждым новым абзацем.
.br
Синтаксис выглядит следующим образом:
.Pp
.D1 Pf . Ic PD Op Ar height
.Pp
.Ar height
является аргументом
.Xr roff 7
ширина масштабирования.
По умолчанию он равен
.Cm 1v .
Если единица измерения опущена,
.Cm v
принимается за единицу.
.Pp
Этот макрос влияет на интервал перед любыми последующими экземплярами
.Ic HP ,
.Ic IP ,
.Ic LP ,
.Ic P ,
.Ic PP ,
.Ic SH ,
.Ic SS ,
.Ic SY ,
и
.Ic TP .
.It Ic PP

Начните неоформленный абзац.
Объем абзаца закрывается последующим абзацем,
подразделом, разделом или концом файла.
Сохраненная ширина абзаца по левому краю сбрасывается на значение по умолчанию.
.It Ic RB
Текст попеременно отображается романским (шрифт по умолчанию) и полужирным начертанием.
Пробелы между аргументами при выводе опускаются.
См. также
.Ic BI .
.It Ic RE
Явное закрытие области действия предшественника
.Ic RS .
Левое поле по умолчанию восстанавливается до состояния, предшествующего этому
.Ic RS
вызов.
.Pp
Синтаксис следующий:
.Pp
.D1 Pf . Ic RE Op Ar level
.Pp
Без аргумента используется самый последний
.Ic RS
блок закрывается.
Если
.Ar level
равен 1, все открытые
.Ic RS
блоки закрываются.
В противном случае,
.Ar level No \(mi 1
вложенный
.Ic RS
блоки остаются открытыми.
.It Ic RI
Текст попеременно отображается романским (шрифт по умолчанию) и курсивным шрифтом.
Пробелы между аргументами при выводе опускаются.
См. также
.Ic BI .
.It Ic RS
Временно сбрасывает левое поле по умолчанию.
Имеет следующий синтаксис:
.Pp
.D1 Pf . Ic RS Op Ar width
.Pp
.Ar width
является аргументом
.Xr roff 7
ширина масштабирования.
Если он не указан, используется сохраненная ширина или ширина по умолчанию.
.Pp
См. также
.Ic RE .
.It Ic SB
Текст отображается маленьким размером (на один пункт меньше, чем шрифт по умолчанию)
жирный шрифт.
Этот макрос является расширением, которое, вероятно, впервые появилось в SunOS 4.0
и позднее было принято GNU и
.Bx 4.4 .
.It Ic SH
Начало раздела.
Область действия секции закрывается только другой секцией или концом
файла.
Ширина абзаца по левому краю сбрасывается на значение по умолчанию.
.It Ic SM
Текст отображается мелким шрифтом (на один пункт меньше, чем шрифт по умолчанию).
шрифта по умолчанию).
.It Ic SS
Начало подраздела.
Область действия подраздела закрывается последующим подразделом,
разделом или концом файла.
Ширина абзаца по левому краю сбрасывается на значение по умолчанию.
.It Ic SY
Начать блок синопсиса со следующим синтаксисом:
.Bd -unfilled -offset indent
.Pf . Ic SY Ar command
.Ar arguments
.Pf . Ic YS
.Ed
.Pp
Это нестандартное расширение GNU
и очень редко используется даже на страницах руководств GNU.
Форматирование аналогично
.Ic IP .
.It Ic TH
Задайте имя страницы руководства для использования в верхнем и нижнем колонтитулах страницы
и нижнем колонтитуле со следующим синтаксисом:
.Pp
.D1 Pf . Ic TH Ar name section date Op Ar source Op Ar volume
.Pp

Обычно документ
.Ar name
указывается заглавными буквами.
.Ar section
обычно представляет собой одну цифру, в некоторых случаях за ней следует буква.
Рекомендуемая
.Ar date
формат
.Sy YYYY-MM-DD
как указано в стандарте ISO-8601;
если аргумент не соответствует, он печатается дословно.
Если аргумент
.Ar date
пуст или не указан, используется текущая дата.
Необязательный
.Ar source
указывает на организацию, предоставляющую утилиту.
Если не указано,
.Xr mandoc 1
использует свой
.Fl Ios
аргумент.
Адрес
.Ar volume
заменяет стандартное название тома
.Ar section .
.Pp
Примеры:
.Pp
.Dl \&.TH CVS 5 "1992-02-12" GNU
.It Ic TP
Начать абзац, в котором заголовок, если он превышает ширину отступа, следует
следует новая строка; если нет, то тело следует на той же строке после
после перехода на ширину отступа.
Последующие строки выводятся с отступом.
Синтаксис выглядит следующим образом:
.Bd -unfilled -offset indent
.Pf . Ic TP Op Ar width
.Ar head No \e" one line
.Ar body
.Ed
.Pp
.Ar width
аргумент
.Xr roff 7
ширина масштабирования.
Если он указан, он сохраняется для последующих левых отступов абзаца; если
если не указан, используется сохраненная ширина или ширина по умолчанию.
.It Ic TQ
Как
.Ic TP ,
за исключением того, что перед абзацем не вставляется вертикальный интервал.
Это нестандартное расширение GNU
и очень редко используется даже на страницах руководств GNU.
.It Ic UC
Устанавливает объем нижнего колонтитула для совместимости с man страницами с расширением
.Bx
выпусков.
Необязательный первый аргумент указывает, из какого выпуска он взят.
Этот макрос является расширением, которое впервые появилось в
.Bx 3 .
.It Ic UE
Завершает блок унифицированного идентификатора ресурса, начатый с
.Ic UR .
Это нестандартное расширение GNU.
.It Ic UR
Начало блока унифицированных идентификаторов ресурсов.
Это нестандартное расширение GNU.
Оно имеет следующий синтаксис:
.Bd -unfilled -offset indent
.Pf . Ic UR Ar uri
описание ссылки, которая должна быть показана
.Pf . Ic UE
.Ed
.It Ic YS
Завершить блок синопсиса, начатый с
.Ic SY .
Это нестандартное расширение GNU.
.It Ic in
Отступ относительно текущего отступа:
.Pp
.D1 Pf . Ic в ширине Op Ar
.Pp
Если
.Ar width
подписана, то новое смещение является относительным.
В противном случае оно является абсолютным.
Это значение сбрасывается при переходе к следующему абзацу, разделу или подразделу.
.El
.Sh СИНТАКСИС МАКРОСОВ
Адрес
.Nm
Макросы классифицируются по области видимости: область видимости строки или область видимости блока.
Строчные макросы имеют область видимости только для текущей строки (и, в некоторых
в некоторых ситуациях - на последующую строку).
Блочные макросы относятся к текущей строке и последующим строкам до тех пор, пока
пока не будут закрыты другим блочным макросом.
.Ss Линейные макросы
Строковые макросы обычно относятся к текущей строке, а их тело
состоящее из нуля или более аргументов.
Если макрос привязан к следующей строке, а аргументы строки пусты,
вместо него используется следующая строка, которая должна быть текстом.
Таким образом:
.Bd -literal -offset indent
\&.I
foo
.Ed
.Pp
эквивалентно
.Sq .I foo .
Если макросы следующей строки вызываются последовательно, используется только последний.
Если за макросом следующей строки следует макрос, не являющийся макросом следующей строки, будет выдана ошибка
будет выдана ошибка.
.Pp
Синтаксис следующий:
.Bd -literal -offset indent
\&.YO \(lBbody...\(rB
\(lBbody...\(rB
.Ed
.Bl -column "MacroX" "ArgumentsX" "ScopeXXXXX" "CompatX" -offset indent
.It Em Macro Ta Em Arguments Ta Em Scope     Ta Em Notes
.It Ic AT  Ta    <=1       Ta    current   Ta    \&
.It Ic B   Ta    n         Ta    next-line Ta    \&
.It Ic BI  Ta    n         Ta    current   Ta    \&
.It Ic BR  Ta    n         Ta    current   Ta    \&
.It Ic DT  Ta    0         Ta    current   Ta    \&
.It Ic EE  Ta    0         Ta    current   Ta    Version 9 At
.It Ic EX  Ta    0         Ta    current   Ta    Version 9 At
.It Ic I   Ta    n         Ta    next-line Ta    \&
.It Ic IB  Ta    n         Ta    current   Ta    \&
.It Ic IR  Ta    n         Ta    current   Ta    \&
.It Ic OP  Ta    >=1       Ta    current   Ta    DWB
.It Ic PD  Ta    1         Ta    current   Ta    \&
.It Ic RB  Ta    n         Ta    current   Ta    \&
.It Ic RI  Ta    n         Ta    current   Ta    \&
.It Ic SB  Ta    n         Ta    next-line Ta    \&
.It Ic SM  Ta    n         Ta    next-line Ta    \&
.It Ic TH  Ta    >1, <6    Ta    current   Ta    \&
.It Ic UC  Ta    <=1       Ta    current   Ta    \&
.It Ic in  Ta    1         Ta    current   Ta    Xr roff 7
.El
.Ss Блочные макросы
Блочные макросы состоят из головы и тела.
Как и в случае со строчными макросами, головка относится к текущей строке и, в некоторых случаях, к следующей строке.
в некоторых случаях - на следующую строку (условия следующей строки, как в
.Sx Линейные макросы
применяются и здесь).
.Pp
Синтаксис следующий:
.Bd -literal -offset indent
\&.YO \(lBhead...\(rB
\(lBhead...\(rB
\(lBbody...\(rB
.Ed
.Pp
Закрытие области видимости тела может быть в раздел, где макрос закрывается
по адресу
.Ic SH ;
подсекция, закрытая разделом или
.Ic SS ;
или параграф, закрытый разделом, подразделом,
.Ic HP ,
.Ic IP ,
.Ic LP ,
.Ic P ,
.Ic PP ,
.Ic RE ,
.Ic SY ,
или
.Ic TP .
Нет закрытия относится к явному макросу закрытия блока.
.Pp
Как правило, блочные макросы не могут быть вложенными; таким образом, вызов блочного макроса
в то время как область видимости другого блочного макроса открыта, и открытая область видимости не
неявно закрыта, является синтаксически некорректным.
.Bl -column "MacroX" "ArgumentsX" "Head ScopeX" "sub-sectionX" "compatX" -offset indent
.It Em Macro Ta Em Arguments Ta Em Head Scope Ta Em Body Scope  Ta Em Notes
.It Ic HP  Ta    <2        Ta    current    Ta    paragraph   Ta    \&
.It Ic IP  Ta    <3        Ta    current    Ta    paragraph   Ta    \&
.It Ic LP  Ta    0         Ta    current    Ta    paragraph   Ta    \&
.It Ic ME  Ta    0         Ta    none       Ta    none        Ta    GNU
.It Ic MT  Ta    1         Ta    current    Ta    to \&ME     Ta    GNU
.It Ic P   Ta    0         Ta    current    Ta    paragraph   Ta    \&
.It Ic PP  Ta    0         Ta    current    Ta    paragraph   Ta    \&
.It Ic RE  Ta    <=1       Ta    current    Ta    none        Ta    \&
.It Ic RS  Ta    1         Ta    current    Ta    to \&RE     Ta    \&
.It Ic SH  Ta    >0        Ta    next-line  Ta    section     Ta    \&
.It Ic SS  Ta    >0        Ta    next-line  Ta    sub-section Ta    \&
.It Ic SY  Ta    1         Ta    current    Ta    to \&YS     Ta    GNU
.It Ic TP  Ta    n         Ta    next-line  Ta    paragraph   Ta    \&
.It Ic TQ  Ta    n         Ta    next-line  Ta    paragraph   Ta    GNU
.It Ic UE  Ta    0         Ta    current    Ta    none        Ta    GNU
.It Ic UR  Ta    1         Ta    current    Ta    part        Ta    GNU
.It Ic YS  Ta    0         Ta    none       Ta    none        Ta    GNU
.El
.Pp
Если блочный макрос расположен в следующей строке, за ним могут следовать только строчные
макросы для оформления текста.
.Ss Работа со шрифтами
в
.Nm
документах, как
.Sx Физическая разметка
макросы и
.Xr roff 7
.Ql \ef
Для выбора шрифтов можно использовать escape-последовательности шрифтов.
В текстовых строках эффект ручного выбора шрифта по escape-последовательностям
длится только до следующего вызова макроса; В макролиниях он длится только
до конца области видимости макроса.
Обратите внимание, что макросы, такие как
.Ic BR
открывают и закрывают область видимости шрифта для каждого аргумента.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr man 1 ,
.Xr mandoc 1 ,
.Xr eqn 7 ,
.Xr mandoc_char 7 ,
.Xr mdoc 7 ,
.Xr roff 7 ,
.Xr tbl 7
.Sh ИСТОРИЯ
.Nm
язык впервые появился в виде пакета макросов для набора текста roff
система в
.At v7 .
.Pp
Автономная реализация, входящая в состав
.Xr mandoc 1
впервые появилась в
.Ox 4.6 .
.Sh АВТОРЫ
.An -nosplit
.An Douglas McIlroy Aq Mt m.douglas.mcilroy@dartmouth.edu
разработал и реализовал оригинальную версию этих макросов,
написал оригинальную версию этой страницы руководства,
и первым использовал их при редактировании первого тома
.At v7
страницы руководства.
.Pp
.An James Clark
позже переписали макросы для groff.
.An Eric S. Raymond Aq Mt esr@thyrsus.com
и
.An Werner Lemberg Aq Mt wl@gnu.org
добавили расширенный
.Nm
макросы в groff в 2007 году.
.Pp
.Xr mandoc 1
программа и этот
.Nm
Референс был написан
.An Kristaps Dzonsons Aq Mt kristaps@bsd.lv .
