melkorbsd/ru-freebsd-man/man7/pcap-linktype.7
.\" Copyright (c) 1987, 1988, 1989, 1990, 1991, 1992, 1994, 1995, 1996, 1997
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.TH PCAP-LINKTYPE 7 "6 April 2020"
.SH ИМЯ
pcap-linktype \- типы заголовков канального уровня, поддерживаемые libpcap
.SH ОПИСАНИЕ
Для оперативного захвата или ``сохранения файла'', libpcap предоставляет в качестве возвращаемого
значения процедуры
.BR pcap_datalink (3) ,
значение, указывающее тип заголовка канального уровня в
начале передаваемых пакетов.  Это не обязательно тот тип
заголовка канального уровня, который используется для перехвата пакетов в сети,
из которой они перехватываются; например, пакеты из IEEE
Сеть стандарта 802.11 может быть предоставлена libpcap с заголовками Ethernet, которые
сетевой адаптер или драйвер сетевого адаптера генерирует из
Заголовки стандарта 802.11.  Имена этих значений начинаются с
.BR DLT_ ,
поэтому их иногда называют "DLT_значениями".
.PP
Значения, сохраненные в поле тип заголовка канального уровня
в заголовке файла сохранения, в большинстве, но не во всех случаях, совпадают со значениями,
возвращаемыми
.BR pcap_datalink ().
Имена этих значений начинаются с
.BR LINKTYPE_ .
.PP
Типы заголовков канального уровня, поддерживаемые libpcap, описаны по адресу
https://www.tcpdump.org/linktypes.html .
.SH СМОТРИТЕ ТАКЖЕ
.BR pcap (3)
