melkorbsd/ru-freebsd-man/man7/pcap-filter.7
.\" Copyright (c) 1987, 1988, 1989, 1990, 1991, 1992, 1994, 1995, 1996, 1997
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.TH PCAP-FILTER 7 "19 November 2022"
.SH ИМЯ
pcap-filter \- синтаксис пакетного фильтра
.br
.ad
.SH ОПИСАНИЕ
.LP
.BR pcap_compile (3)
используется для компиляции строки в программу фильтрации.
Затем результирующая программа фильтрации может быть применена к
некоторому потоку пакетов, чтобы определить, какие пакеты будут отправлены в
.BR pcap_loop (3),
.BR pcap_dispatch (3),
.BR pcap_next (3),
или
.BR pcap_next_ex (3).
.LP
\fIВыражение фильтра\fP состоит из одного или нескольких
.IR примитивов .
Примитивы обычно состоят из
.I id
(имя или номер), которому предшествует один или несколько определителей.
Существует три
различных вида квалификаторов:
.IP \fItype\fP
.I type
определители указывают, к какому типу объектов относится идентификационное имя или номер.
Возможны следующие типы
.BR host ,
.BR net ,
.B port
и
.BR portrange .
Например, `\fBhost\fP foo', `\fBnet\fP 128.3', `\fBport\fP 20', `\fBportrange\fP 6000-6008'.
Если тип не указан,
предполагается уточняющий
.B host .
.IP \fIdir\fP
.I dir
квалификаторы определяют конкретное направление передачи в и/или из
.IR id .
Возможными направлениями являются
.BR src ,
.BR dst ,
.BR "src or dst" ,
.BR "src and dst" ,
.BR ra ,
.BR ta ,
.BR addr1 ,
.BR addr2 ,
.BR addr3 ,
и
.BR addr4 .
Например, `\fBsrc\fP foo', `\fBdst net\fP 128.3', `\fBsrc or dst port\fP ftp-data'.
Если
нет квалификатора dir, предполагается `\fBsrc or dst\fP'.
Квлификаторы
.BR ra ,
.BR ta ,
.BR addr1 ,
.BR addr2 ,
.BR addr3 ,
и
.B addr4
действительны только для канальных уровней беспроводной локальной сети стандарта IEEE 802.11.
.IP \fIproto\fP
.I proto
квалификаторы ограничивают соответствие определенному протоколу.
Возможными
протоколами являются:
.BR ether ,
.BR fddi ,
.BR tr ,
.BR wlan ,
.BR ip ,
.BR ip6 ,
.BR arp ,
.BR rarp ,
.BR decnet ,
.BR sctp ,
.B tcp
и
.BR udp .
Например, `\fBether src\fP foo', `\fBarp net\fP 128.3', `\fBtcp port\fP 21',
`\fBudp portrange\fP 7000-7009', `\fBwlan addr2\fP 0:2:3:4:5:6'.
Если отсутствует квалификатор
.I proto ,
то принимаются все протоколы, соответствующие данному типу.
Например, `\fBsrc\fP foo' означает `\fB(ip or arp or rarp) src\fP foo',
`\fBnet\fP bar' означает `\fB(ip or arp or rarp) net\fP bar' и
`\fBport\fP 53' означает `\fB(tcp or udp or sctp) port\fP 53'
(обратите внимание, что в этих примерах используется недопустимый синтаксис для иллюстрации принципа).
.LP
[\fBfddi\fP на самом деле псевдоним для \fBether\fP; синтаксический анализатор обрабатывает их
одинаково как означающие ``уровень канала передачи данных, используемый в указанном
сетевом интерфейсе''.  Заголовки FDDI содержат адреса источника
и назначения, аналогичные Ethernet, и часто содержат типы пакетов,
аналогичные Ethernet, поэтому вы можете выполнять фильтрацию по этим полям FDDI так же, как и по
аналогичным полям Ethernet.
Заголовки FDDI также содержат другие поля,
но вы не можете указать их явно в выражении фильтра.
.LP
Аналогично, \fBtr\fP and \fBwlan\fP являются псевдонимами для \fBether\fP; утверждения предыдущего
абзаца о заголовках FDDI также применимы к заголовкам Token Ring
и 802.11 wireless LAN.  Для заголовков стандарта 802.11
адресом назначения является поле DA, а адресом источника - поле SA; поля
BSSID, RA и TA не проверяются.]
.LP
В дополнение к вышесказанному, существуют некоторые специальные 'примитивные' ключевые
слова, которые не соответствуют шаблону:
.BR gateway ,
.BR broadcast ,
.BR less ,
.B greater
и арифметические выражения.
Все это описано ниже.
.LP
Более сложные выражения фильтра создаются с использованием слов
.BR and ,
.B or
и
.B not
(или эквивалентно: `\fB&&\fP', `\fB||\fP' и `\fB!\fP' соответственно)
чтобы объединить примитивы.
Например, `\fBhost\fP foo \fBand not port\fP ftp \fBand not port\fP ftp-data'.
Чтобы сэкономить на вводе текста, идентичные списки определителей могут быть опущены.
Например,
`\fBtcp dst port\fP ftp \fBor\fP ftp-data \fBor\fP domain'это в точности то же самое, что
`\fBtcp dst port\fP ftp \fBor tcp dst port\fP ftp-data \fBor tcp dst port\fP domain'.
.LP
Допустимыми примитивами являются:
.IP "\fBdst host \fIhostnameaddr\fR"
Значение True, если поле назначения IPv4/v6 пакета равно \fIhostnameaddr\fP,
который может быть либо адресом, либо именем.
.IP "\fBsrc host \fIhostnameaddr\fR"
Значение True, если поле источника IPv4/v6 пакета равно \fIhostnameaddr\fP.
.IP "\fBhost \fIhostnameaddr\fP"
Значение True, если либо источником, либо получателем пакета IPv4/v6 является \fIhostnameaddr\fP.
.IP
Любое из приведенных выше основных выражений может быть дополнено ключевыми словами
\fBip\fP, \fBarp\fP, \fBrarp\fP, или \fBip6\fP, как в:
.in +.5i
.nf
\fBip host \fIhostnameaddr\fR
.fi
.in -.5i
что эквивалентно:
.in +.5i
.nf
\fBether proto \\\fRip \fBand host \fIhostnameaddr\fR
.fi
.in -.5i
Если имя \fIhostnameaddr\fR содержит несколько адресов IPv4/v6, каждый адрес
будет проверен на соответствие.
.IP "\fBether dst \fIethernameaddr\fP"
Значение True, если адрес назначения Ethernet равен \fIethernameaddr\fP.
\fIethernameaddr\fP
может быть либо именем из /etc/ethers или числовой MAC-адрес
формы "xx:xx:xx:xx:xx:xx", "xx.xx.xx.xx.xx.xx", "xx-xx-xx-xx-xx-xx",
"xxxx.xxxx.xxxx", "xxxxxxxxxxxx",или различные смеси из ':', '.', и '-',
где каждый "x" это шестнадцатеричная цифра (0-9, a-f, или A-F).
.IP "\fBether src \fIethernameaddr\fP"
Значение True, если адрес источника Ethernet равен \fIethernameaddr\fP.
.IP "\fBether host \fIethernameaddr\fP"
Значение True, если адрес источника или назначения Ethernet равен \fIethernameaddr\fP.
.IP "\fBgateway\fP \fIhost\fP"
Значение True, если пакет использовал \fIhost\fP как шлюз.
То есть, адрес
источника или назначения Ethernet был \fIhost\fP но ни IP-адрес источника,
ни IP-адрес назначения не был \fIhost\fP.
\fIHost\fP должно быть имя и
должно быть найдено как с помощью механизмов преобразования имени хоста в IP-адрес
компьютера (файл имен хостов, DNS, NIS и т.д.), так и с помощью механизма преобразования
имени хоста в Ethernet-адрес. (/etc/ethers, т т.д.).
(Эквивалентным выражением является
.in +.5i
.nf
\fBether host \fIethernameaddr \fBand not host \fIhostnameaddr\fR
.fi
.in -.5i
которое может использоваться как с именами, так и с цифрами для \fIhostnameaddr / ethernameaddr\fP.)
На данный момент этот синтаксис не работает в конфигурации с поддержкой IPv6.
.IP "\fBdst net \fInetnameaddr\fR"
Значение True, если адрес назначения пакета IPv4/v6 имеет сетевой
номер \fInetnameaddr\fP.
\fINet\fP это может быть либо имя из базы данных сетей
(/etc/networks, etc.) или сетевой номер.
Сетевой номер IPv4 может быть записан в виде четверки с точками (например, 192.168.1.0),
тройки с точками (например, 192.168.1), пары с точкой (например, 172.16), или одиночный
номер (например, 10); маска сети равна 255.255.255.255 для четверки с точками
(что означает, что она действительно соответствует хосту), 255.255.255.0 для
тройки с точками, 255.255.0.0 для пары с точкой или 255.0.0.0 для одиночного числа.
Сетевой номер IPv6 должен быть указан полностью; маска
сети - ff:ff:ff:ff:ff:ff:ff:ff:ff, поэтому совпадения по "сети" IPv6 на самом деле всегда совпадают
с хостами, а для совпадения по сети требуется длина маски сети.
.IP "\fBsrc net \fInetnameaddr\fR"
Значение True, если исходный адрес IPv4/v6 пакета имеет сетевой
номер \fInetnameaddr\fP.
.IP "\fBnet \fInetnameaddr\fR"
Значение True, если адрес источника или получателя пакета IPv4/v6 имеет сетевой
номер \fInetnameaddr\fP.
.IP "\fBnet \fInetaddr\fR \fBmask \fInetmask\fR"
Значение True, если IPv4-адрес соответствует \fInetaddr\fR с конкретным \fInetmask\fR.
Может быть квалифицирован с \fBsrc\fR или \fBdst\fR.
Обратите внимание, что этот синтаксис недопустим для IPv6 \fInetaddr\fR.
.IP "\fBnet \fInetaddr\fR/\fIlen\fR"
Значение True, если IPv4/v6 адреса соотвветствуют \fInetaddr\fR с маской сети \fIlen\fR
немного шире.
Может быть квалифицирован с \fBsrc\fR или \fBdst\fR.
.IP "\fBdst port \fIportnamenum\fR"
Значение True, если пакет является протоколом IPv4/v6 TCP, UDP или SCTP и имеет
значение порта назначения, равное \fIportnamenum\fP.
\fIportnamenum\fP может быть номером или именем, используемым в /etc/services (смотрите
.BR tcp (4P)
и
.BR udp (4P)).
Если используется имя,
проверяется как номер порта, так и протокол.
Если используется число или неоднозначное имя,
проверяется только номер порта (например, `\fBdst port\fR 513' будет напечатан как
трафик tcp/login, так и трафик udp/who, и `\fBport\fR domain' будет выводиться
как tcp/domain, так и udp/domain трафик).
.IP "\fBsrc port \fIportnamenum\fR"
Значение True, если значение порта источника пакета равно \fIportnamenum\fP.
.IP "\fBport \fIportnamenum\fR"
Значение True, если либо исходный, либо целевой порт пакета является \fIportnamenum\fP.
.IP "\fBdst portrange \fIportnamenum1-portnamenum2\fR"
Значение True, если пакет является протоколом IPv4/v6 TCP, UDP или SCTP и имеет
значение порта назначения между\fIportnamenum1\fP и \fIportnamenum2\fP (оба включены).
.I portnamenum1
и
.I portnamenum2
интерпретируются таким же образом, как и параметр
.I portnamenum
для
.BR port .
.IP "\fBsrc portrange \fIportnamenum1-portnamenum2\fR"
Значение True, если пакет имеет значение исходного порта между\fIportnamenum1\fP и
\fIportnamenum2\fP (оба включены).
.IP "\fBportrange \fIportnamenum1-portnamenum2\fR"
Значение True, если порт источника или назначения пакета находится между
\fIportnamenum1\fP и \fIportnamenum2\fP (оба включены).
.IP
Любое из приведенных выше выражений порта или диапазона портов может быть дополнено
ключевыми словами \fBtcp\fP, \fBudp\fP или \fBsctp\fP, как в:
.in +.5i
.nf
\fBtcp src port \fIportnamenum\fR
.fi
.in -.5i
который соответствует только TCP-пакетам, исходным портом которых является \fIportnamenum\fP.
.IP "\fBless \fIlength\fR"
Значение True, если длина пакета меньше или равна \fIlength\fP.
Это эквивалентно:
.in +.5i
.nf
\fBlen <= \fIlength\fP
.fi
.in -.5i
.IP "\fBgreater \fIlength\fR"
Значение True, если длина пакета больше или равна \fIlength\fP.
Это эквивалентно:
.in +.5i
.nf
\fBlen >= \fIlength\fP
.fi
.in -.5i
.IP "\fBip proto \fIprotocol\fR"
Значение True, если пакет является пакетом типа IPv4(смотрите
.BR ip (4P))
протокола \fIprotocol\fP.
\fIProtocol\fP может быть номером или одним из имен, распознанных
.BR getprotobyname (3)
(как, например, в `\fBgetent\fR(1) protocols'), как правило, из записи в
.IR \%/etc/protocols ,
например:
.BR ah ,
.BR esp ,
.B eigrp
(только в Linux, FreeBSD, NetBSD, DragonFly BSD, и macOS),
.BR icmp ,
.BR igmp ,
.B igrp
(только в OpenBSD),
.BR pim ,
.BR sctp ,
.BR tcp ,
.B udp
или
.BR vrrp .
Обратите внимание, что большинство из этих примеров идентификаторов
также являются ключевыми словами и должны быть экранированы с помощью обратной косой черты (\\).
Обратите внимание, что этот примитив не соответствует цепочке заголовков протокола.
.IP "\fBicmp\fR"
Аббревиатура для:
.in +.5i
.nf
\fBip proto\fR 1
.fi
.in -.5i
.IP "\fBip6 proto \fIprotocol\fR"
Значение True, если пакет является пакетом протокола IPv6 \fIprotocol\fP.
(Смотритте `\fBip proto\fP' выше о значении \fIprotocol\fR.)
Обратите внимание, что в варианте ICMP IPv6 используется другой номер протокола с именем
.B \%ipv6-icmp
в AIX, FreeBSD, illumos, Linux, macOS, NetBSD, OpenBSD, Solaris и Windows.
Обратите внимание, что этот примитив не использует цепочку заголовков протокола.
.IP "\fBicmp6\fR"
Аббревиатура для:
.in +.5i
.nf
\fBip6 proto\fR 58
.fi
.in -.5i
.IP "\fBproto \fIprotocol\fR"
Значение True, если пакет является пакетом протокола IPv4 или IPv6
\fIprotocol\fP.  (Смотрите `\fBip proto\fP' выше о значении
\fIprotocol\fP.)  Обратите внимание, что этот примитив не
использует цепочку заголовков протокола.
.IP  "\fBah\fR, \fBesp\fR, \fBpim\fR, \fBsctp\fR, \fBtcp\fR, \fBudp\fR"
Аббревиатура для:
.in +.5i
.nf
\fBproto \\\fIprotocol\fR
.fi
.in -.5i ,
где \fIprotocol\fR один из вышеперечисленных протоколов.
.IP "\fBip6 protochain \fIprotocol\fR"
Значение True, если пакет является пакетом IPv6
и содержит заголовок протокола с типом \fIprotocol\fR
в цепочке заголовков протокола.
(Смотрите `\fBip proto\fP' выше о значении \fIprotocol\fP.)
Например,
.in +.5i
.nf
\fBip6 protochain\fR 6
.fi
.in -.5i
сопоставляет любой пакет IPv6 с заголовком протокола TCP в цепочке заголовков протокола.
Пакет может содержать, например,
заголовок аутентификации, заголовок маршрутизации или заголовок опции перехода
между заголовками IPv6 и TCP.
Код BPF, генерируемый этим примитивом, является сложным и
не может быть оптимизирован с помощью кода оптимизатора BPF, а также не поддерживается
механизмами фильтрации в ядре, поэтому это может быть несколько медленным процессом и может
привести к отбрасыванию большего количества пакетов.
.IP "\fBip protochain \fIprotocol\fR"
Эквивалентно \fBip6 protochain \fIprotocol\fR, но это для IPv4.
(Смотрите `\fBip proto\fP' выше о значении \fIprotocol\fP.)
.IP "\fBprotochain \fIprotocol\fR"
Значение True, если пакет является IPv4 или IPv6 пакетом протокола
\fIprotocol\fP.  (Смотрите `\fBip proto\fP' выше о значении
\fIprotocol\fP.)  Обратите внимание, что этот примитив отслеживает
цепочку заголовков протокола.
.IP "\fBether broadcast\fR"
Значение True, если пакет является широковещательным пакетом Ethernet.
Ключевое слово \fBether\fP
является необязательным.
.IP "\fBip broadcast\fR"
Значение True, если пакет является широковещательным пакетом IPv4.
Он проверяет соблюдение соглашений о широковещательной передаче как с использованием нулей, так и с использованием единиц,
и просматривает маску подсети на интерфейсе, на котором выполняется перехват.
.IP
Если маска подсети интерфейса, на котором выполняется захват,
недоступна, либо потому, что интерфейс, на котором
выполняется захват, не имеет маски сети, либо потому, что захват выполняется в Linux
в "любом" интерфейсе, который может подключаться к нескольким интерфейсам, эта
проверка не будет работать корректно.
.IP "\fBether multicast\fR"
Значение True, если пакет является многоадресным пакетом Ethernet.
Ключевое слово \fBether\fP
является необязательным.
Это сокращение от `\fBether[\fP0\fB] & \fP1\fB != \fP0'.
.IP "\fBip multicast\fR"
Значение True, если пакет является многоадресным пакетом IPv4.
.IP "\fBip6 multicast\fR"
Значение True, если пакет является многоадресным пакетом IPv6.
.IP  "\fBether proto \fIprotocol\fR"
Значение True, если пакет относится к  ether типу \fIprotocol\fR.
\fIProtocol\fP может быть числом или одним из имен
\fBaarp\fP, \fBarp\fP, \fBatalk\fP, \fBdecnet\fP, \fBip\fP, \fBip6\fP,
\fBipx\fP, \fBiso\fP, \fBlat\fP, \fBloopback\fP, \fBmopdl\fP, \fBmoprc\fP, \fBnetbeui\fP,
\fBrarp\fP, \fBsca\fP или \fBstp\fP.
Обратите внимание, что эти идентификаторы (кроме\fBloopback\fP) также являются ключевыми
словами и должны быть экранированы с помощью обратной косой черты (\\).
.IP
[В случае с FDDI (например, `\fBfddi proto \\arp\fR'), Token Ring
(например, `\fBtr proto \\arp\fR'), и Беспроводные локальные сети стандарта IEEE 802.11 (например,
`\fBwlan proto \\arp\fR'), для большинства из этих
протоколов идентификатор протокола берется из заголовка 802.2 Logical Link Control (LLC),
который обычно располагается поверх заголовка FDDI, Token Ring или
заголовка 802.11.
.IP
При фильтрации по большинству идентификаторов протоколов в FDDI, Token Ring или
В стандарте 802.11 фильтр проверяет только поле идентификатора протокола в заголовке LLC
в так называемом формате SNAP с идентификатором организационной единицы (OUI)
, равным 0x000000, для инкапсулированного Ethernet; он не проверяет, находится ли пакет
в формате SNAP с OUI, равным 0x000000.
Исключением являются:
.RS
.TP
\fBiso\fP
фильтр проверяет поля DSAP (Точка доступа к службе назначения) и
SSAP (Точка доступа к службе источника) в заголовке LLC;
.TP
\fBstp\fP and \fBnetbeui\fP
фильтр проверяет DSAP в заголовке LLC;
.TP
\fBatalk\fP
фильтр проверяет наличие пакета в формате SNAP с OUI 0x080007
и типом AppleTalk etype.
.RE
.IP
В случае Ethernet фильтр проверяет поле тип Ethernet
для большинства этих протоколов.  Исключением являются:
.RS
.TP
\fBiso\fP, \fBstp\fP, and \fBnetbeui\fP
фильтр проверяет наличие кадра 802.3, а затем проверяет заголовок LLC, как
это делается для FDDI, Token Ring и 802.11;
.TP
\fBatalk\fP
фильтр проверяет как тип AppleTalk etype во фрейме Ethernet, так и
пакет в формате SNAP, как это делается для FDDI, Token Ring и 802.11;
.TP
\fBaarp\fP
фильтр проверяет наличие типа AppleTalk ARP либо во
фрейме Ethernet, либо во фрейме привязки 802.2 с OUI, равным 0x000000;
.TP
\fBipx\fP
фильтр проверяет наличие etype IPX во фрейме Ethernet, IPX
DSAP в заголовке LLC, инкапсуляцию
IPX в стандарте 802.3 без заголовка LLC и etype IPX во фрейме SNAP.
.RE
.IP "\fBip\fR, \fBip6\fR, \fBarp\fR, \fBrarp\fR, \fBatalk\fR, \fBaarp\fR, \fBdecnet\fR, \fBiso\fR, \fBstp\fR, \fBipx\fR, \fBnetbeui\fP"
Аббривиатуры для:
.in +.5i
.nf
\fBether proto \\\fIprotocol\fR
.fi
.in -.5i
где \fIprotocol\fR это один из вышеперечисленных протоколов.
.IP "\fBlat\fR, \fBmoprc\fR, \fBmopdl\fR"
Аббривиатуры для:
.in +.5i
.nf
\fBether proto \\\fIprotocol\fR
.fi
.in -.5i
где \fIprotocol\fR это один из вышеперечисленных протоколов.
Обратите внимание, что не все приложения, использующие
.BR pcap (3)
на данный момент знают, как анализировать эти протоколы.
.IP "\fBdecnet src \fIdecnetaddr\fR"
Значение True, если адрес источника DECnet равен
.IR decnetaddr ,
который может быть адресом вида `10.123" или
именем хоста DECnet.
[Поддержка имен хостов DECnet доступна только в системах ULTRIX,
настроенных для запуска DECnet.]
.IP "\fBdecnet dst \fIdecnetaddr\fR"
Значение True, если адрес назначения DECnet равен
.IR decnetaddr .
.IP "\fBdecnet host \fIdecnetaddr\fR"
Значение True, если адрес источника или назначения DECnet равен
.IR decnetaddr .
.IP \fBllc\fP
Значение True, если пакет имеет заголовок 802.2 LLC.  Это включает:
.IP
Пакеты Ethernet с полем длины, а не с полем типа, которые
не являются необработанными пакетами NetWare-over-802.3;
.IP
Пакеты данных стандарта IEEE 802.11;
.IP
Пакеты Token Ring (проверка фреймов LLC не выполняется);
.IP
Пакеты FDDI (для фреймов LLC проверка не выполняется);
.IP
LLC-инкапсулированные пакеты ATM для SunATM в Solaris.
.IP "\fBllc\fP \fItype\fR"
Истинно, если пакет имеет заголовок 802.2 LLC и имеет указанный
.IR type .
.I type
может быть одним из:
.RS
.TP
\fBi\fR
Information (I) PDUs
.TP
\fBs\fR
Supervisory (S) PDUs
.TP
\fBu\fR
Unnumbered (U) PDUs
.TP
\fBrr\fR
Receiver Ready (RR) S PDUs
.TP
\fBrnr\fR
Receiver Not Ready (RNR) S PDUs
.TP
\fBrej\fR
Reject (REJ) S PDUs
.TP
\fBui\fR
Unnumbered Information (UI) U PDUs
.TP
\fBua\fR
Unnumbered Acknowledgment (UA) U PDUs
.TP
\fBdisc\fR
Disconnect (DISC) U PDUs
.TP
\fBsabme\fR
Set Asynchronous Balanced Mode Extended (SABME) U PDUs
.TP
\fBtest\fR
Test (TEST) U PDUs
.TP
\fBxid\fR
Exchange Identification (XID) U PDUs
.TP
\fBfrmr\fR
Frame Reject (FRMR) U PDUs
.RE
.IP \fBinbound\fP
Пакет был получен хостом, выполняющим перехват, а не
отправлен этим хостом.  Это поддерживается только для определенных типов канального уровня,
таких как SLIP и ``готовый'' режим перехвата Linux,
используемый для ``любого'' устройства и для некоторых других типов устройств.
.IP \fBoutbound\fP
Пакет был отправлен хостом, выполняющим перехват, а не
получен этим хостом.  Это поддерживается только для определенных типов канального уровня,
таких как SLIP и ``готовый'' режим перехвата Linux,
используемый для ``любого'' устройства и для некоторых других типов устройств.
.IP "\fBifname \fIinterface\fR"
Значение True, если пакет был зарегистрирован как пришедший из указанного интерфейса (применяется
только к пакетам, зарегистрированным OpenBSD или FreeBSD
.BR pf (4)).
.IP "\fBon \fIinterface\fR"
Синоним модификатора
.B ifname .
.IP "\fBrnr \fInum\fR"
True, если пакет был зарегистрирован как соответствующий указанному номеру правила PF
(применяется только к пакетам, зарегистрированным OpenBSD или FreeBSD
.BR pf (4)).
.IP "\fBrulenum \fInum\fR"
Синоним модификатора
.B rnr .
.IP "\fBreason \fIcode\fR"
Значение True, если пакет был зарегистрирован с указанным кодом причины PF.  Известными
кодами являются:
.BR \%match ,
.BR \%bad-offset ,
.BR \%fragment ,
.BR \%short ,
.BR \%normalize ,
и
.B memory
(применяется только к пакетам, зарегистрированным OpenBSD или FreeBSD
.BR pf (4)).
.IP "\fBrset \fIname\fR"
Значение True, если пакет был зарегистрирован как соответствующий указанному
имени набора правил PF для привязанного набора правил (применяется только к пакетам, зарегистрированным OpenBSD
или FreeBSD
.BR pf (4)).
.IP "\fBruleset \fIname\fR"
Синоним модификатора
.B rset .
.IP "\fBsrnr \fInum\fR"
Значение True, если пакет был зарегистрирован как соответствующий указанному номеру правила PF
привязанного набора правил (применяется только к пакетам, зарегистрированным OpenBSD или
FreeBSD
.BR pf (4)).
.IP "\fBsubrulenum \fInum\fR"
Синоним модификатора
.B srnr .
.IP "\fBaction \fIact\fR"
Значение True, если PF выполнил указанное действие при регистрации пакета.  Известными действиями
являются:
.B pass
и
.B block
и, с более поздними версиями
.BR pf (4),
.BR nat ,
.BR rdr ,
.B binat
и
.B scrub
(применяется только к пакетам, зарегистрированным OpenBSD или FreeBSD
.BR pf (4)).
.IP "\fBwlan ra \fIehost\fR"
Значение True, если стандарт IEEE 802.11 RA является
.IR ehost .
Поле RA используется во всех фреймах, за исключением фреймов управления.
.IP "\fBwlan ta \fIehost\fR"
Значение True, если стандарт IEEE 802.11 TA является
.IR ehost .
Поле TA используется во всех кадрах, за исключением управляющих кадров и управляющих кадров
CTS (Clear To Send) и ACK (Acknowledgment).
.IP "\fBwlan addr1 \fIehost\fR"
Значение True, если первый адрес IEEE 802.11 равен
.IR ehost .
.IP "\fBwlan addr2 \fIehost\fR"
Значение True, если второй адрес IEEE 802.11, если он присутствует, является
.IR ehost .
Второе адресное поле используется во всех фреймах, за исключением управляющих фреймов CTS
(Clear To Send) и ACK (Acknowledgment).
.IP "\fBwlan addr3 \fIehost\fR"
Значение True, если третий адрес IEEE 802.11, если он присутствует, является
.IR ehost .
Третье адресное поле используется во фреймах управления и данных, но не
во фреймах управления.
.IP "\fBwlan addr4 \fIehost\fR"
Значение True, если четвертый адрес IEEE 802.11, если он присутствует, является
.IR ehost .
Четвертое адресное поле используется только для
фреймов WDS (Wireless Distribution System).
.IP "\fBtype \fIwlan_type\fR"
Значение True, если тип фрейма IEEE 802.11 соответствует указанному \fIwlan_type\fR.
Действительными \fIwlan_type\fRs являются:
\fBmgt\fP,
\fBctl\fP
и \fBdata\fP.
.IP "\fBtype \fIwlan_type \fBsubtype \fIwlan_subtype\fR"
Значение True, если тип фрейма IEEE 802.11 соответствует указанному \fIwlan_type\fR
и подтип фрейма соответствует указанному \fIwlan_subtype\fR.
.IP
Если указанный \fI wlan_type\fR равен \fBmgt\fP,
то допустимыми \fI wlan_subtype\fRs являются:
\fBassoc-req\fP,
\fBassoc-resp\fP,
\fBreassoc-req\fP,
\fBreassoc-resp\fP,
\fBprobe-req\fP,
\fBprobe-resp\fP,
\fBbeacon\fP,
\fBatim\fP,
\fBdisassoc\fP,
\fBauth\fP и
\fBdeauth\fP.
.IP
Если указанный \fIwlan_type\fR равен \fBctl\fP,
то допустимыми \fIwlan_subtype\fRs являются:
\fBps-poll\fP,
\fBrts\fP,
\fBcts\fP,
\fBack\fP,
\fBcf-end\fP и
\fBcf-end-ack\fP.
.IP
Если указанный \fIwlan_type\fR раввен \fBdata\fP,
то допустимыми \fIwlan_subtype\fRs являются:
.BR \%data ,
.BR \%data-cf-ack ,
.BR \%data-cf-poll ,
.BR \%data-cf-ack-poll ,
.BR \%null ,
.BR \%cf-ack ,
.BR \%cf-poll ,
.BR \%cf-ack-poll ,
.BR \%qos-data ,
.BR \%qos-data-cf-ack ,
.BR \%qos-data-cf-poll ,
.BR \%qos-data-cf-ack-poll ,
.BR \%qos ,
.B \%qos-cf-poll
и
.BR \%qos-cf-ack-poll .
.IP "\fBsubtype \fIwlan_subtype\fR"
Значение True, если подтип фрейма IEEE 802.11 соответствует указанному \fIwlan_subtype\fR
и фрейм имеет тип, к которому относится указанный \fIwlan_subtype\fR.
.IP "\fBdir \fIdirection\fR"
Значение True, если направление кадра IEEE 802.11 соответствует указанному
.IR direction .
Действительными указаниями являются:
.BR nods ,
.BR tods ,
.BR fromds ,
.BR dstods ,
или числовое значение.
.IP "\fBvlan \fI[vlan_id]\fR"
Значение True, если пакет является пакетом VLAN стандарта IEEE 802.1Q.
Если указан необязательный \fIvlan_id\fR, значение true будет только в том случае, если пакет имеет указанный
\fIvlan_id\fR.
Обратите внимание, что первое ключевое слово \fBvlan\fR, встречающееся в выражении,
изменяет смещения декодирования для остальной части выражения в
предположении, что пакет является пакетом VLAN.  Ключевое слово `\fBvlan \fI[vlan_id]\fR` может использоваться более одного раза для фильтрации по
иерархиям VLAN.  Каждое использование этого ключевого слова увеличивает смещения фильтра
на 4.
.IP
Например:
.in +.5i
.nf
\fBvlan\fP 100 \fB&& vlan\fR 200
.fi
.in -.5i
фильтры в VLAN 200, инкапсулированные в VLAN 100, и
.in +.5i
.nf
\fBvlan && vlan \fP300 \fB&& ip\fR
.fi
.in -.5i
фильтрует протокол IPv4, инкапсулированный в VLAN 300, инкапсулированный в любой
VLAN более высокого порядка.
.IP "\fBmpls \fI[label_num]\fR"
Значение True, если пакет является пакетом MPLS.
Если указан необязательный \fIlabel_num\fR, значение true будет только в том случае, если пакет имеет указанный
\fIlabel_num\fR.
Обратите внимание, что первое ключевое слово \fBmpls\fR, встречающееся в выражении,
изменяет смещения декодирования для остальной части выражения в
предположении, что пакет является IP-пакетом, инкапсулированным в MPLS.  Ключевое слово
`\fBmpls \fI[label_num]\fR` может использоваться более одного раза для
фильтрации по иерархиям MPLS.  Каждое использование этого ключевого слова увеличивает смещение
фильтра на 4.
.IP
Например:
.in +.5i
.nf
\fBmpls\fP 100000 \fB&& mpls\fR 1024
.fi
.in -.5i
фильтрует пакеты с внешней меткой 100000 и внутренней меткой
1024, и
.in +.5i
.nf
\fBmpls && mpls\fP 1024 \fB&& host\fR 192.9.200.1
.fi
.in -.5i
фильтрует пакеты до 192.9.200.1 или начиная с них с внутренней меткой 1024 и
любой внешней меткой.
.IP \fBpppoed\fP
Значение True, если пакет является пакетом обнаружения PPP-over-Ethernet
(тип Ethernet 0x8863).
.IP "\fBpppoes \fI[session_id]\fR"
Значение True, если пакет является пакетом сеанса PPP-over-Ethernet
(тип Ethernet 0x8864).
Если указан необязательный \fIsession_id\fR значение true будет только в том случае, если пакет имеет указанный
\fIsession_id\fR.
Обратите внимание, что первое ключевое слово \fbpppoe\fR, встречающееся в выражении,
изменяет смещения декодирования для остальной части выражения в
предположении, что пакет является пакетом сеанса PPPoE.
.IP
Например:
.in +.5i
.nf
\fBpppoes\fP 0x27 \fB&& ip\fR
.fi
.in -.5i
фильтрует протокол IPv4, инкапсулированный в идентификатор сеанса PPPoE 0x27.
.IP "\fBgeneve \fI[vni]\fR"
Значение True, если пакет является пакетом Geneve (UDP-порт 6081). Если указан необязательный параметр \fIvni\fR,
значение true будет только в том случае, если пакет имеет указанный \fIvni\fR.
Обратите внимание, что когда в выражении встречается ключевое слово \fBgeneve\fR,
оно изменяет смещения декодирования для оставшейся части
выражения в предположении, что пакет является пакетом Geneva.
.IP
Например:
.in +.5i
.nf
\fBgeneve\fP 0xb \fB&& ip\fR
.fi
.in -.5i
фильтрует протокол IPv4, инкапсулированный в Geneva, с помощью VNI 0xb. Это будет
соответствовать как протоколу IPv4, инкапсулированному непосредственно в Geneva, так и протоколу IPv4, содержащемуся
во фрейме Ethernet.
.IP "\fBiso proto \fIprotocol\fR"
Значение True, если пакет является пакетом OSI с типом протокола \fIprotocol\fP.
\fIProtocol\fP может быть числом или одним из имен
\fBclnp\fP, \fBesis\fP, или \fBisis\fP.
.IP "\fBclnp\fR, \fBesis\fR, \fBisis\fR"
Аббревиатуры для:
.in +.5i
.nf
\fBiso proto \\\fIprotocol\fR
.fi
.in -.5i
где \fIprotocol\fR из вышеперечисленных протоколов.
.IP "\fBl1\fR, \fBl2\fR, \fBiih\fR, \fBlsp\fR, \fBsnp\fR, \fBcsnp\fR, \fBpsnp\fR"
Аббривиатуры для типов IS-IS PDU.
.IP "\fBvpi\fP \fIn\fR"
Значение True, если пакет является пакетом ATM, для SunATM в Solaris, с идентификатором
виртуального пути, равным
.IR n .
.IP "\fBvci\fP \fIn\fR"
Значение True, если пакет является пакетом ATM, для SunATM в Solaris, с идентификатором
виртуального канала
.IR n .
.IP \fBlane\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и является
пакетом полосы пропускания ATM.
Обратите внимание, что первое ключевое слово \fBlane\fR, встречающееся в выражении,
изменяет тесты, выполняемые в остальной части выражения,
исходя из предположения, что пакет является либо пакетом Ethernet с эмуляцией полосы
пропускания, либо пакетом управления файлом полосы пропускания.  Если \fBlane\fR не указан,
тесты выполняются в предположении, что пакет является
пакетом, инкапсулированным в LLC.
.IP \fBoamf4s\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и представляет
собой сегмент OAM F4 flow cell (VPI=0 и VCI=3).
.IP \fBoamf4e\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и представляет
собой сквозную ячейку потока OAM F4 (VPI=0 и VCI=4).
.IP \fBoamf4\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и представляет
собой сегментную или сквозную ячейку потока OAM F4 (VPI=0 & (VCI=3 | VCI=4)).
.IP \fBoam\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и представляет
собой сегментную или сквозную ячейку потока OAM F4 (VPI=0 & (VCI=3 | VCI=4)).
.IP \fBmetac\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и находится
в цепи сигнализации meta (VPI=0 и VCI=1).
.IP \fBbcc\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и передается
по широковещательной сигнальной схеме (VPI=0 и VCI=2).
.IP \fBsc\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и находится
в сигнальной цепи (VPI=0 и VCI=5).
.IP \fBilmic\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris и передается
по каналу ILMI (VPI=0 и VCI=16).
.IP \fBconnectmsg\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris, передается
по сигнальной схеме и представляет собой сообщение Q.2931 Setup, Call Proceeding, Connect,
Connect Ack, Release или сообщение Release Done.
.IP \fBmetaconnect\fP
Значение True, если пакет является пакетом ATM для SunATM в Solaris,
подключен к каналу сигнализации meta и представляет собой сообщение Q.2931 Setup, Call Proceeding, Connect,
Release, или Release Done message.
.IP  "\fIexpr1 relop expr2\fR"
Значение True, если соотношение сохраняется.  \fIRelop\fR является одним из
.RB { > ,
.BR < ,
.BR >= ,
.BR <= ,
.BR = ,
.BR == ,
.BR != }
(где
.B =
означает то же самое, что
.BR == ).
Каждое из \fIexpr1\fR и \fIexpr2\fR является арифметическим выражением, состоящим из
целочисленных констант (выраженных в стандартном синтаксисе C), обычных двоичных операторов
.RB { + ,
.BR - ,
.BR * ,
.BR / ,
.BR % ,
.BR & ,
.BR | ,
.BR ^ ,
.BR << ,
.BR >> },
оператор длины и специальные
принадлежности для пакетной передачи данных.  Обратите внимание, что все сравнения выполняются без знака, так что, например,
0x80000000 и 0xffffffff равны > 0.
.IP
Операторы фильтрации
.B %
и
.B ^
в настоящее время в ядре поддерживаются только в
определенных операционных системах (например, FreeBSD, Linux с ядрами 3.7 и более поздних
версий, NetBSD); во всех других системах (например, AIX, illumos, Solaris,
OpenBSD), если
используются эти операторы, фильтрация будет выполняться в пользовательском режиме, что
увеличит накладные расходы на захват пакетов и может привести
к отбрасыванию большего количества пакетов.
.IP
Оператор длины, обозначаемый ключевым словом \fBlen\fP, задает
длину пакета.
.IP
Чтобы получить доступ к данным внутри пакета, используйте следующий синтаксис:
.in +.5i
.nf
\fIproto\fB [ \fIexpr\fB : \fIsize\fB ]\fR
.fi
.in -.5i
.I Proto
является одним из
.BR arp ,
.BR atalk ,
.BR carp ,
.BR decnet ,
.BR ether ,
.BR fddi ,
.BR icmp ,
.BR icmp6 ,
.BR igmp ,
.BR igrp ,
.BR ip ,
.BR ip6 ,
.BR lat ,
.BR link ,
.BR mopdl ,
.BR moprc ,
.BR pim ,
.BR ppp ,
.BR radio ,
.BR rarp ,
.BR sca ,
.BR sctp ,
.BR slip ,
.BR tcp ,
.BR tr ,
.BR udp ,
.B vrrp
или
.BR wlan ,
и
указывает уровень протокола для индексной операции.
.RB ( ether ,
.BR fddi ,
.BR link ,
.BR ppp ,
.BR slip ,
.B tr
и
.BR wlan
все они относятся к
канальному уровню. \fBradio\fR относится к "заголовку радио", добавленному в некоторым
перехватам данных стандарта 802.11.)
Обратите внимание, что \fBtcp\fR, \fBudp\fR и другие типы протоколов верхнего уровня
применяются только к IPv4, а не к IPv6 (это будет исправлено в будущем).
Смещение в байтах относительно указанного уровня протокола
задается параметром \fIexpr\fR.
Параметр \fISize\fR является необязательным и указывает количество байтов в
интересующей области; оно может быть равно одному, двум или четырем, а по умолчанию равно единице.

Например, `\fBether[\fP0\fB] &\fP 1 \fB!=\fP 0' перехватывает весь многоадресный трафик.
Выражение `\fbp[\fP 0\fB] &\fP 0xf \fB!=\fP5'
перехватывает все пакеты IPv4 с параметрами.
Выражение
`\fBip[\fP6:2\fB] &\fP 0x1fff \fB=\fP 0'
перехватывает только нефрагментированные дейтаграммы IPv4 и обнуляет фрагментированные
дейтаграммы IPv4.
Эта проверка неявно применяется к операциям индексирования \fBtcp\fP и \fBudp\fP.
Например, \fBtcp[\fP0\fB]\fP всегда означает первый
байт протокола TCP \fIheader\fP, и никогда не означает первый байт
промежуточного фрагмента.
.IP
Некоторые смещения и значения полей могут быть выражены в виде имен, а не
в виде числовых значений.
Доступны следующие смещения полей заголовка протокола:
\fBicmptype\fP (Поле типа ICMP), \fBicmp6type\fP (Поле типа ICMPv6),
\fBicmpcode\fP (Поле кода ICMP), \fBicmp6code\fP (Поле кода ICMPv6) и
\fBtcpflags\fP (Поле флагов TCP).
.IP
Доступны следующие значения полей типа ICMP:
.BR \%icmp-echoreply ,
.BR \%icmp-unreach ,
.BR \%icmp-sourcequench ,
.BR \%icmp-redirect ,
.BR \%icmp-echo ,
.BR \%icmp-routeradvert ,
.BR \%icmp-routersolicit ,
.BR \%icmp-timxceed ,
.BR \%icmp-paramprob ,
.BR \%icmp-tstamp ,
.BR \%icmp-tstampreply ,
.BR \%icmp-ireq ,
.BR \%icmp-ireqreply ,
.BR \%icmp-maskreq ,
.BR \%icmp-maskreply .
.IP
Доступны следующие значения полей типа ICMPv6:
.BR \%icmp6-destinationunreach ,
.BR \%icmp6-packettoobig ,
.BR \%icmp6-timeexceeded ,
.BR \%icmp6-parameterproblem ,
.BR \%icmp6-echo ,
.BR \%icmp6-echoreply ,
.BR \%icmp6-multicastlistenerquery ,
.BR \%icmp6-multicastlistenerreportv1 ,
.BR \%icmp6-multicastlistenerdone ,
.BR \%icmp6-routersolicit ,
.BR \%icmp6-routeradvert ,
.BR \%icmp6-neighborsolicit ,
.BR \%icmp6-neighboradvert ,
.BR \%icmp6-redirect ,
.BR \%icmp6-routerrenum ,
.BR \%icmp6-nodeinformationquery ,
.BR \%icmp6-nodeinformationresponse ,
.BR \%icmp6-ineighbordiscoverysolicit ,
.BR \%icmp6-ineighbordiscoveryadvert ,
.BR \%icmp6-multicastlistenerreportv2 ,
.BR \%icmp6-homeagentdiscoveryrequest ,
.BR \%icmp6-homeagentdiscoveryreply ,
.BR \%icmp6-mobileprefixsolicit ,
.BR \%icmp6-mobileprefixadvert ,
.BR \%icmp6-certpathsolicit ,
.BR \%icmp6-certpathadvert ,
.BR \%icmp6-multicastrouteradvert ,
.BR \%icmp6-multicastroutersolicit ,
.BR \%icmp6-multicastrouterterm .
.IP
Доступны следующие значения полей флагов TCP: \fBtcp-fin\fP,
\fBtcp-syn\fP, \fBtcp-rst\fP, \fBtcp-push\fP,
\fBtcp-ack\fP, \fBtcp-urg\fP, \fBtcp-ece\fP,
\fBtcp-cwr\fP.
.LP
Примитивы могут быть объединены с помощью:
.IP
Заключенная в круглые скобки группа примитивов и операторов.
.IP
Отрицание (`\fB!\fP' или `\fBnot\fP').
.IP
Объединение (`\fB&&\fP' или `\fBand\fP').
.IP
Чередование (`\fB||\fP' или `\fBor\fP').
.LP
Отрицание имеет наивысший приоритет.
Чередование и объединение имеют одинаковый приоритет и ассоциируются
слева направо.
Обратите внимание, что для объединения теперь требуются явные маркеры \fBand\fR, а не сопоставление.
.LP
Если идентификатор задан без ключевого слова, то используется самое последнее ключевое
слово.
Например,
.in +.5i
.nf
\fBnot host\fP vs \fBand\fR ace
.fi
.in -.5i
это сокращение от
.in +.5i
.nf
\fBnot host\fP vs \fBand host\fR ace
.fi
.in -.5i
который не следует путать с
.in +.5i
.nf
\fBnot (host \fPvs\fB or \fPace\fB)\fR
.fi
.in -.5i
.SH ПРИМЕРЫ
.LP
Чтобы выбрать все пакеты, прибывающие на `sundown" или отправляющиеся с него:
.RS
.nf
\fBhost\fP sundown
.fi
.RE
.LP
Для выбора трафика между "helios" и "hot" или "ace":
.RS
.nf
\fBhost\fP helios \fBand (\fPhot \fBor\fP ace\fB)\fP
.fi
.RE
.LP
Для выбора всех пакетов IPv4 между "ace" и любым хостом, кроме "helios":
.RS
.nf
\fBip host\fP ace \fBand not\fP helios
.fi
.RE
.LP
Чтобы выделить весь трафик между локальными хостами и хостами Berkeley:
.RS
.nf
\fBnet\fP ucb-ether
.fi
.RE
.LP
Чтобы отобрать весь FTP-трафик через интернет-шлюз `snup', выполните следующие действия:
.RS
.nf
\fBgateway\fP snup \fBand (port\fP ftp \fBor\fP ftp-data\fB)\fP
.fi
.RE
.LP
Чтобы выбрать трафик IPv4, который не поступает с локальных хостов и не предназначен для них
(если ваш шлюз подключен к другой сети, этот материал никогда не должен попадать
в вашу локальную сеть).
.RS
.nf
\fBip and not net \fPlocalnet
.fi
.RE
.LP
Чтобы выбрать начальный и конечный пакеты (пакеты SYN и FIN) для каждого
TCP-диалог, в котором задействован нелокальный хост.
.RS
.nf
\fBtcp[tcpflags] & (tcp-syn|tcp-fin) !=\fP 0 \fBand not src and dst net\fP localnet
.fi
.RE
.LP
Чтобы выбрать TCP-пакеты с установленными флагами RST и ACK.
(т.е. выберите только флаги RST и ACK в поле flags, и если результат
"RST и ACK оба установлены", выполните сопоставление)
.RS
.nf
.B
tcp[tcpflags] & (tcp-rst|tcp-ack) == (tcp-rst|tcp-ack)
.fi
.RE
.LP
Чтобы выбрать все HTTP-пакеты IPv4, поступающие на порт 80 и исходящие из него, т.е. печатать только
пакеты, содержащие данные, а не, например, пакеты SYN и FIN и
пакеты только для подтверждения.  (IPv6 оставлен в качестве упражнения для читателя).
.RS
.nf
\fBtcp port\fP 80 \fBand (((ip[\fP2:2\fB] - ((ip[\fP0\fB]&\fP0xf\fB)<<\fP2\fB)) - ((tcp[\fP12\fB]&\fP0xf0\fB)>>\fP2\fB)) != \fP0\fB)
.fi
.RE
.LP
Для выбора пакетов IPv4 длиной более 576 байт, отправляемых через шлюз `snup':
.RS
.nf
\fBgateway\fP snup \fBand ip[\fP2:2\fB] >\fP 576
.fi
.RE
.LP
Чтобы выбрать широковещательные или многоадресные пакеты IPv4, которые
.I не
были отправлены через широковещательную или многоадресную рассылку Ethernet:
.RS
.nf
\fBether[\fP0\fB] &\fP 1 \fB=\fP 0 \fBand ip[\fP16\fB] >=\fP 224
.fi
.RE
.LP
Чтобы выбрать все ICMP-пакеты, которые не являются эхо-запросами/ответами (т.е. не
пинговыми пакетами):
.RS
.nf
.B
icmp[icmptype] != icmp-echo and icmp[icmptype] != icmp-echoreply
.B
icmp6[icmp6type] != icmp6-echo and icmp6[icmp6type] != icmp6-echoreply
.fi
.RE
.SH ОБРАТНАЯ СОВМЕСТИМОСТЬ
Кодовые имена типов ICMPv6, а также имена флагов TCP
.B tcp-ece
и
.B tcp-cwr
стали доступны в версии libpcap 1.9.0.
.PP
Ключевое слово
.B geneve
стало доступно в версии libpcap 1.8.0.
.SH СМОТРИТЕ ТАКЖЕ
.BR pcap (3)
.SH НЕИСПРАВНОСТИ
Чтобы сообщить о проблеме с безопасностью, пожалуйста, отправьте электронное письмо по адресу \%security@tcpdump.org.
.LP
Чтобы сообщить об ошибках и других проблемах, внести исправления, запросить
функцию, предоставить общую обратную связь и т.д., пожалуйста, ознакомьтесь с файлом
.I CONTRIBUTING.md
в корневом каталоге дерева исходных текстов libpcap.
.LP
Выражения фильтрации для полей, отличных от тех, которые указаны в заголовках Token Ring,
не будут корректно обрабатывать пакеты Token Ring, маршрутизируемые из источника.
.LP
Выражения фильтрации для полей, отличных от тех, что указаны в заголовках 802.11, не
будут корректно обрабатывать пакеты данных стандарта 802.11 с установленными параметрами Todd и From DS.
.LP
`\fBip6 proto\fP'
должен следовать за цепочкой заголовков, но в данный момент это не так.
`\fBip6 protochain\fP'
предоставляется для такого поведения.  Например, для сопоставления фрагментов IPv6:
`\fBip6 protochain\fP 44'
.LP
Арифметическое выражение для заголовков транспортного уровня, например \fBtcp[0]\fP,
не работает с пакетами IPv6.
Оно просматривает только пакеты IPv4.