melkorbsd/ru-freebsd-man/man7/pcap-tstamp.7
.\"
.\" Copyright (c) 1987, 1988, 1989, 1990, 1991, 1992, 1994, 1995, 1996, 1997
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.TH PCAP-TSTAMP 7 "14 July 2020"
.SH ИМЯ
pcap-tstamp \- временные метки пакетов в libpcap
.SH ОПИСАНИЕ
При перехвате трафика каждому пакету присваивается временная метка, представляющая
для входящих пакетов время прибытия пакета, а для исходящих
пакетов - время передачи пакета.  Это время является
приблизительным значением времени прибытия или передачи.  Если он предоставляется
операционной системой, запущенной на хосте, на котором выполняется захват,
существует несколько причин, по которым он может не точно отражать время
прибытия или передачи:
.IP
если временная метка применяется к пакету при
получении пакета сетевым стеком, сетевой стек может не видеть пакет до
тех пор, пока для пакета не будет доставлено прерывание или событие таймера не заставит
драйвер сетевого устройства выполнить опрос на наличие пакетов, и временная метка может
не применяться до тех пор, пока пакет не получит некоторое количество сообщений. обработка выполняется другим
кодом в сетевом стеке, поэтому может возникнуть значительная задержка
между моментом получения последнего бита пакета
устройством захвата и моментом, когда сетевой стек помечает пакет временными метками;
.IP
таймер, используемый для создания временных меток, может иметь низкое разрешение,
например, это может быть таймер, обновляемый один раз за
такт работы операционной системы хоста, при этом таймер операционной системы хоста будет работать каждые несколько
миллисекунд;
.IP
таймер с высоким разрешением может использовать счетчик, который работает со скоростью,
зависящей от тактовой частоты процессора, и эта тактовая частота может
со временем увеличиваться или уменьшаться, и таймер может быть не в состоянии
компенсировать все эти корректировки;
.IP
часы операционной системы хоста могут со временем корректироваться в соответствии
со стандартом времени, с которым синхронизируется хост, что может быть
сделано путем временного замедления или ускорения хода часов или путем
однократной настройки;
.IP
различные процессорные ядра в многоядерной или многопроцессорной системе могут
работать с разной скоростью или не иметь синхронизированных счетчиков
времени, поэтому пакеты, помеченные разными ядрами, могут иметь
несогласованные временные метки;
.IP
некоторые источники времени, такие как те, которые предоставляют POSIX "секунды с начала
эпохи", не учитывают високосные секунды, что означает, что секундная часть
.RB ( tv_sec )
временной метки может не увеличиваться на високосную секунду, так что
часть временной метки, составляющая доли секунды, может превышать
ноль, но вторая часть не изменится, или часы могут идти
немного медленнее в течение периода, предшествующего високосной секунде.
.LP
По этим причинам разница во времени между временными метками пакетов не
обязательно будет точно отражать разницу во времени между временем получения
или передачи пакетов.
.LP
Кроме того, пакеты, помеченные временем разными ядрами, могут быть
помечены временем в одном порядке и добавлены в очередь пакетов
для чтения libpcap в другом порядке, поэтому временные метки могут не
увеличиваться монотонно.
.LP
Некоторые устройства захвата на некоторых платформах могут предоставлять временные метки для
пакетов; эти временные метки обычно имеют высокое разрешение и
обычно применяются к пакету при поступлении первого или последнего бита
пакета и, таким образом, являются более точными, чем временные метки, предоставляемые
операционной системой хоста.  Однако эти временные метки могут быть не
синхронизированы с часами операционной системы хоста, так что,
например, временная метка пакета может не соответствовать временной
метке события на хосте, вызванного поступлением этого пакета.
Если они синхронизированы с часами операционной системы хоста, некоторые из
перечисленных выше проблем, связанных с отметками времени, предоставляемыми операционной системой хоста,
могут также относиться к отметкам времени, предоставляемым устройством захвата.
.LP
В зависимости от устройства записи и программного обеспечения на хосте, libpcap
может разрешать использование различных типов временных меток.  Программа предоставляет
.BR pcap_list_tstamp_types (3) ,
для дескриптора захвата пакета, созданного
.BR pcap_create (3)
но еще не активирован с помощью
.BR pcap_activate (3),
список типов временных меток, поддерживаемых устройством записи для этого
дескриптора.
Список может быть пустым, и в этом случае выбор типа временных меток
для этого устройства записи не предлагается.  Если список не пуст, процедура
.BR pcap_set_tstamp_type (3)
может быть использована после вызова
.BR pcap_create ()
и перед вызовом
.BR pcap_activate ()
чтобы указать тип временной метки, которая будет использоваться на устройстве.
Здесь перечислены типы временных меток; первое значение - это #define для
использования в коде, второе значение - это значение, возвращаемое с помощью
.BR pcap_tstamp_type_val_to_name (3)
и принятое
.BR pcap_tstamp_type_name_to_val (3) .
.RS 5
.TP 5
.BR PCAP_TSTAMP_HOST " - " host
Временная метка, предоставленная хостом, на котором выполняется запись.  
Точность этой временной метки не определена; она может быть
синхронизирована с часами операционной системы хоста, а может и не синхронизироваться.
.TP 5
.BR PCAP_TSTAMP_HOST_LOWPREC " - " host_lowprec
Временная метка, предоставляемая хостом, на котором выполняется запись.
Это временная метка низкой точности, синхронизированная с
часами операционной системы хоста.
.TP 5
.BR PCAP_TSTAMP_HOST_HIPREC " - " host_hiprec
Временная метка, предоставляемая хостом, на котором выполняется запись.
Это высокоточная временная метка, синхронизированная с
часами операционной системы хоста. Ее получение может оказаться более дорогостоящим, чем
.BR PCAP_TSTAMP_HOST_LOWPREC .
.TP 5
.BR PCAP_TSTAMP_HOST_HIPREC_UNSYNCED " - " host_hiprec_unsynced
Временная метка, предоставляемая хостом, на котором выполняется запись.
Это высокоточная временная метка, не синхронизированная с
часами операционной системы хоста. Ее получение может оказаться более дорогостоящим, чем
.BR PCAP_TSTAMP_HOST_LOWPREC .
.TP 5
.BR PCAP_TSTAMP_ADAPTER " - " adapter
Временная метка, предоставляемая сетевым адаптером, на котором выполняется запись.
Это высокоточная временная метка, синхронизированная с
часами операционной системы хоста.
.TP 5
.BR PCAP_TSTAMP_ADAPTER_UNSYNCED " - " adapter_unsynced
Временная метка, предоставляемая сетевым адаптером, на котором выполняется запись.
Это высокоточная временная метка; она не синхронизирована с
часами операционной системы хоста.
.RE
.LP
Временные метки, синхронизированные с системными часами, могут изменяться в обратном направлении, так как
системные часы могут идти в обратном направлении. Если часы не синхронизированы с
системными часами, это может быть связано с тем, что системные часы не
показывают точное время, потому что другие часы не показывают точное время, или
с обоими причинами.
.LP
Временные метки, предоставляемые хостом, обычно соответствуют времени, когда
код с временной меткой видит пакет; это может быть некоторый неизвестный промежуток
времени после получения сетевым адаптером первого или последнего бита пакета
из-за пакетной обработки прерываний для поступления пакетов,
задержек в очереди и т.д.
.LP
По умолчанию при выполнении записи в реальном времени или чтении из сохраненного файла
временные метки указываются в секундах с 1 января 1970 года, 00:00:00 UTC,
и в микросекундах, начиная с этого значения в секундах, даже если
на устройстве записи или в сохраненном файле доступны временные метки с более высоким разрешением.
Если при чтении файла сохранения временные метки в файле имеют
разрешение более одной микросекунды, дополнительные цифры разрешения
отбрасываются.
.LP
Процедура
.BR pcap_set_tstamp_precision (3)
может быть использована после вызова
.BR pcap_create ()
и после вызова
.BR pcap_activate ()
чтобы указать разрешение временных меток, которые необходимо получить для устройства.
Если аппаратное или программное обеспечение не может предоставить временную метку с более высоким разрешением, вызов
.BR pcap_set_tstamp_precision ()
потерпит неудачу, и временные метки, указанные после вызова
.BR pcap_activate ()
будет иметь микросекундное разрешение.
.LP
При открытии файла сохранения процедуры
.BR \%pcap_open_offline_with_tstamp_precision (3)
и
.BR \%pcap_fopen_offline_with_tstamp_precision (3)
могут использоваться для указания разрешения временных меток, которые будут считываться
из файла; если временные метки в файле имеют меньшее разрешение,
часть временных меток, составляющая доли секунды, будет масштабирована до
указанного разрешения.
.LP
Процедура
.BR pcap_get_tstamp_precision (3)
возвращает разрешение временных меток, которые будут предоставлены;
при захвате пакетов это не отражает фактическую точность
временных меток, предоставляемых аппаратным обеспечением или операционной системой, и при
чтении файла сохранения это не указывает на фактическую точность временных
меток в файле.
.SH СМОТРИТЕ ТАКЖЕ
.BR pcap (3)
