melkorbsd/ru-freebsd-man/man7/pkg.7
.\" Авторское право (c) 2013 Bryan Drewery <bdrewery@FreeBSD.org>
.\" Все права защищены.
.\"
.\" Распространение и использование в исходном коде и двоичном формате, с
.\" изменениями или без них, разрешено при соблюдении следующих условий:
.\" 1. При повторном распространении исходного кода должны сохраняться вышеуказанное
.\"    уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. При повторном распространении в двоичной форме должны воспроизводиться вышеуказанное
.\"    уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\"    документации и/или других материалах, прилагаемых к дистрибутиву.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ "КАК ЕСТЬ", И
.\" МЫ НЕ ДАЕМ НИКАКИХ ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И Т.П.
.\" АВТОР НИ В КОЕМ СЛУЧАЕ НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ПОКАЗАТЕЛЬНЫЙ ИЛИ ЛОГИЧЕСКИ ВЫТЕКАЮЩИЙ
.\" УЩЕРБ (ВКЛЮЧАЯ: ПРИОБРЕТЕНИЕ ЗАМЕНЯЮЩИХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЮ ВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ,
.\" ДАННЫХ ИЛИ ПРИБЫЛИ; ПЕРЕБОИ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ,
.\" ИЛИ ПРАВОНАРУШЕНИЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ ПРАВОНАРУШЕНИЕ ИНЫМ ОБРАЗОМ),
.\" ВОЗНИКАЮЩЕЕ КАКИМ-ЛИБО ОБРАЗОМ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ,
.\" ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd Август 24, 2022
.Dt PKG 7
.Os
.Sh НАИМЕНОВАНИЕ
.Nm pkg
.Nd утилита для управления пакетами
.Sh ОБЗОР
.Nm
.Op Fl d
.Ar command ...
.Nm
.Cm add
.Op Fl dfy
.Op Fl r Ar reponame
.Ar pkg.txz
.Nm
.Fl N
.Nm
.Op Fl 46d
.Cm bootstrap
.Op Fl fy
.Op Fl r Ar reponame
.Sh ОПИСАНИЕ
.Nm
это инструмент управления пакетами.
Он используется для управления локальными пакетами, установленными из
.Xr ports 7 ,
и для установки/обновления пакетов из удаленных репозиториев.
.Pp
Чтобы избежать проблем с обратной несовместимостью, актуальный инструмент 
.Xr pkg 8
не установлен в базовой системе.
При первом запуске,
.Nm
запустит загрузочный файл реального
.Xr pkg 8
из удаленного хранилища.
.Bl -tag
.It Nm Ar command ...
Если
.Xr pkg 8
еще не установлен, он будет извлечен, его подпись будет проверена,
он будет установлен, а затем ему будет отправлена исходная команда.
Если он уже установлен, запрошенная команда будет отправлена в реальный
.Xr pkg 8 .
.It Nm Cm add Oo Fl fy Oc Oo Fl r Ar reponame Oc Ar pkg.txz
Устанавливает
.Xr pkg 8
из локального пакета, а не из удаленного.
Если включена проверка подписи, то перед установкой пакета должен
существовать правильный файл подписи и подпись должна быть действительной.
Если указан флаг
.Fl f ,
то
.Xr pkg 8
будет установлен независимо от того, установлен ли он уже.
Если указан флаг
.Fl y ,
то при начальной загрузке
.Xr pkg 8 
не будет запрашиваться подтверждение.
.Pp
Если указано значение
.Ar reponame ,
то будет использоваться конфигурация подписи для этого репозитория.
.It Nm Fl N
Не выполняет загрузку, а просто определяет, установлен ли
.Xr pkg 8
на самом деле или нет.
Возвращает 0 и количество установленных пакетов,
если они есть, в противном случае 1.
.It Nm Oo Fl 46 Oc Cm bootstrap Oo Fl fy Oc \
Oo Fl r Ar reponame Oc
Пробуйте выполнить загрузку и ничего не пересылает в
.Xr pkg 8
после его установки.
При значениях
.Fl 4
и
.Fl 6 ,
.Nm
принудительно запустит IPv4 или IPv6 соответственно для получения
.Xr pkg 8
и его сигнатур по мере необходимости.
Если указан флаг
.Fl f ,
то
.Xr pkg 8
wбудет извлечен и установлен независимо от того, установлен ли он уже.
Если указан флаг
.Fl y
то при начальной загрузке
.Xr pkg 8
одтверждение запрашиваться не будет.
.Pp
Если указано значение
.Ar reponame ,
о будет использоваться конфигурация для этого репозитория.
.El
.Sh ОПЦИИ
.Nm 
поддерживает следующие опции:
.Bl -tag -width indent
.It Fl d, Fl -debug
Показывает отладочную информацию.
Может быть вызван более одного раза для повышения уровня детализации.
Если вызван дважды, включается функция отладочного вывода
.Xr fetch 3 .
.El
.Sh КОНФИГУРАЦИЯ
Конфигурация зависит от того, находится ли она в файле конфигурации
репозитория или в файле глобальной конфигурации.
Конфигурация репозитория по умолчанию для
.Fx
хранится в
.Pa /etc/pkg/FreeBSD.conf ,
а дополнительные
файлы конфигурации репозитория можно найти в
.Ev REPOS_DIR ,
или
.Pa /usr/local/etc/pkg/repos
если он не задан.
.Pp
Для начальной загрузки
.Nm
обработает все найденные репозитории и по умолчанию будет
использовать последний включенный репозиторий.
.Pp
Конфигурация репозитория хранится в следующем формате:
.Bd -literal -offset indent
FreeBSD: {
  url: "pkg+http://pkg.FreeBSD.org/${ABI}/latest",
  mirror_type: "srv",
  signature_type: "none",
  fingerprints: "/usr/share/keys/pkg",
  enabled: yes
}
.Ed
.Pp
.Bl -tag -width signature_type -compact
.It url
Обращается к
.Dv PACKAGESITE
в разделе
.Sx ENVIRONMENT
.It mirror_type
Обращается к
.Dv MIRROR_TYPE
в разделе
.Sx ENVIRONMENT
.It signature_type
Обращается к
.Dv SIGNATURE_TYPE
в разделе
.Sx ENVIRONMENT
.It fingerprints
Обращается к
.Dv FINGERPRINTS
в разделе
.Sx ENVIRONMENT
.It enabled
Определяет, следует ли использовать это хранилище или нет.
Допустимые значения:
.Dv yes ,
.Dv true ,
.Dv 1 ,
.Dv no ,
.Dv false ,
.Dv 0 .
.El
.Pp
Глобальная конфигурация может быть сохранена в файле
.Pa /usr/local/etc/pkg.conf
в следующем формате:
.Bd -literal -offset indent
PACKAGESITE: "pkg+http://pkg.FreeBSD.org/${ABI}/latest",
MIRROR_TYPE: "srv",
SIGNATURE_TYPE: "none",
FINGERPRINTS: "/usr/share/keys/pkg",
ASSUME_ALWAYS_YES: "yes"
REPOS_DIR: ["/etc/pkg", "/usr/local/etc/pkg/repos"]
.Ed
.Pp
Ссылается на
.Sx ENVIRONMENT
для каждой переменной.
.Sh ОКРУЖЕНИЕ
Для переопределения настроек можно установить следующие переменные среды
из используемого файла
.Pa pkg.conf .
.Bl -tag -width "ASSUME_ALWAYS_YES"
.It Ev MIRROR_TYPE
Определяет, какой тип зеркала следует использовать.
Допустимые значения:
.Dv SRV ,
.Dv HTTP ,
.Dv NONE .
.It Ev ABI
Определяет ABI для пакета, который должен быть загружен.
ABI по умолчанию определяется из
.Pa /bin/sh .
.It Ev ASSUME_ALWAYS_YES
Если этот параметр установлен, то при начальной загрузке
.Xr pkg 8 
подтверждение запрашиваться не будет.
.It Ev SIGNATURE_TYPE
Если установлено значение
.Dv FINGERPRINTS
то при начальной загрузке
.Xr pkg 8 
потребуется подпись,
которая будет проверена на соответствие известным отпечаткам сертификата.
.It Ev FINGERPRINTS
Если для параметра
.Sy SIGNATURE_TYPE
задано значение
.Dv FINGERPRINTS ,
то это значение
должно быть равно пути к каталогу, в котором находятся известные файлы.
.It Ev PACKAGESITE
URL-адрес, с которого будут извлекаться
.Xr pkg 8
и другие пакеты.
.It Ev REPOS_DIR
Список каталогов, разделенных запятыми,
в которых следует искать файлы конфигурации репозитория.
.El
.Sh ФАЙЛЫ
Конфигурация считывается из файлов в указанном порядке.
Этот путь можно изменить, установив
.Ev REPOS_DIR .
Последний включенный репозиторий используется для начальной загрузки
.Xr pkg 8 .
.Bl -tag -width "/usr/local/etc/pkg/repos/*.conf"
.It Pa /usr/local/etc/pkg.conf
.It Pa /etc/pkg/FreeBSD.conf
.It Pa /usr/local/etc/pkg/repos/*.conf
.El
.Sh ПРИМЕРЫ
Здесь приведены некоторые примеры.
олный список доступных команд доступен в
.Xr pkg 8
после его начальной загрузки.
.Pp
Поиск пакета:
.Dl $ pkg search perl
.Pp
Установка пакета:
.Dl % pkg install perl
.Pp
Список установленных пакетов:
.Dl $ pkg info
.Pp
Обновление из удаленного репозитория:
.Dl % pkg upgrade
.Pp
Список неавтоматических пакетов:
.Dl $ pkg query -e '%a = 0' %o
.Pp
Список автоматических пакетов:
.Dl $ pkg query -e '%a = 1' %o
.Pp
Удалить установленный пакет:
.Dl % pkg delete perl
.Pp
Удаление ненужных зависимостей:
.Dl % pkg autoremove
.Pp
Изменяет пакет с автоматического на неавтоматический,
что предотвратит его удаление с помощью
.Xr pkg-autoremove 8 :
.Dl % pkg set -A 0 perl
.Pp
Изменяет пакет с неавтоматического на автоматический,
что приведет к тому, что
.Xr pkg-autoremove 8
разрешит его удаление, как только от этого ничего не будет зависеть:
.Dl % pkg set -A 1 perl
.Pp
Создёт файл пакета из установленного пакета:
.Dl % pkg create -o /usr/ports/packages/All perl
.Pp
Определяет, какой пакет установил файл:
.Dl $ pkg which /usr/local/bin/perl
.Pp
Проверка установленных пакетов на предмет
получения рекомендаций по безопасности:
.Dl $ pkg audit
.Pp
Проверяет установленные пакеты на предмет потерь контрольных сумм пакетов:
.Dl # pkg check -s -a
.Pp
Проверяет, нет ли пропущенных зависимостей:
.Dl # pkg check -d -a
.Sh СМОТРИТЕ ТАКЖЕ
.Xr ports 7 ,
.Xr pkg 8
.Sh ИСТОРИЯ
Команда 
.Nm
впервые появилась в
.Fx 9.1 .
на стала использоваться по умолчанию в
.Fx 10.0 ,
заменив набор инструментов
pkg_install состоящий из
.Xr pkg_add 1 ,
.Xr pkg_info 1 и
.Xr pkg_create 1 .
