melkorbsd/ru-freebsd-man/man7/ports.7
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 24, 2023
.Dt PORTS 7
.Os
.Sh ИМЯ
.Nm ports
.Nd устанавливаемые приложения.Sh ОПИСАНИЕ
Коллекция портов
.Fx
предлагает простой способ компиляции и установки сторонних приложений.
Она также используется для создания пакетов,
которые будут установлены с помощью
.Xr pkg 8 .
.Pp
Дерево портов, обычно расположенное в
.Pa /usr/ports ,
состоит из подкаталогов, по одному для каждой категории;
они, в свою очередь, содержат отдельные порты.
Каждый порт представляет собой каталог с метаданными и исправлениями,
необходимыми для компиляции и запуска исходного кода приложения во
.Fx .
Скомпилировать приложение так же просто, как набрать
.Dq Li "make build"
в каталоге портов.
.Pa Makefile
автоматически извлекает исходный код приложения либо с локального диска,
либо из сети, распаковывает его, применяет исправления и компилирует.
Он также рекурсивно обрабатывает зависимости других компонентов
программного обеспечения, от которых зависит создание и работа порта.
После этого
.Dq Li "make install"
устанавливает приложение.
.Pp
Коллекция портов
.Fx
оддерживается в нескольких разделах, которые различаются
в основном версиями предоставляемого программного обеспечения: основной
.Em main
раздел содержит все последние изменения и соответствует последнему
.Em latest
набору пакетов, в то время как ежеквартальные 
.Em quarterly
разделы содержат только критические исправления.
Основной
.Em main
раздел можно клонироватьи обновлять из репозитория Git, расположенного по адресу:
.Pp
.Lk https://git.FreeBSD.org/ports.git
.Pp
так, например:
.Pp
.Cm git clone https://git.FreeBSD.org/ports.git
.Pp
Ежеквартальные
.Em quarterly
ветви можно найти в Git в виде таких ветвей, как
.Pa yyyyQn
, где
.Em yyyy
обозначает год, а
.Em n
квартал (
.Po 1 to 4 
.Pc ), например:
.Pp
.Cm git clone -b 2021Q2 https://git.FreeBSD.org/ports.git
.Pp
Как правило, рекомендуется использовать ветку
.Nm
соответствующую используемому репозиторию
.Xr pkg 8 .
По умолчанию для
.Fx CURRENT
сам
.Xr pkg 8
настроен на установку пакетов,
собранных из основной
.Em main
ветки, в то время как для версий
.Fx STABLE
или RELEASE он настроен на установку пакетов,
собранных из последней ежеквартальной
.Em quarterly
ветки.
Настроенный в данный момент репозиторий
.Xr pkg 8
можно проверить, просмотрев поле
.Em url
в выходных данных
.Cm pkg -vv .
.Pp
Для получения дополнительной информации об использовании портов смотрите раздел
.Dq "Packages and Ports"
в руководстве
.Sm off
.%B "The FreeBSD Handbook"
.No \&:
.Sm on
.Pp
.Lk https://docs.FreeBSD.org/en/books/handbook/ports/
.Pp
Дополнительные сведения о создании новых портов см. в
.Sm off
.%B "The Porter's Handbook"
.No \&:
.Sm on
.Pp
.Lk https://docs.FreeBSD.org/en/books/porters-handbook/
.Sh ЦЕЛИ	
Некоторые из целевых объектов
.Xr make 1
работают рекурсивно через подкаталоги.
Это позволяет, например, установить все порты
.Dq Li biology
с помощью одной команды. Целями, которые выполняют это, являются
.Cm build , checksum , clean , configure ,
.Cm depends , extract , fetch , install ,
и
.Cm package .
.Pp
Следующие целевые объекты будут запускаться
автоматически каждым следующим целевым объектом по порядку.
То есть
.Cm build
будет запускаться (при необходимости) с помощью
.Cm install ,
и так далее до
.Cm fetch .
Обычно вы будете использовать только целевой объект
.Cm install .
.Bl -tag -width ".Cm configure"
.It Cm config
Настройте
.Va OPTIONS
для этого порта с помощью
.Xr dialog4ports 1 .
.It Cm fetch
Извлекает все файлы, необходимые для создания этого порта,
с сайтов, перечисленных в разделах
.Va MASTER_SITES
и
.Va PATCH_SITES .
Смотрите разделы
.Va FETCH_CMD , MASTER_SITE_OVERRIDE
и
.Va MASTER_SITE_BACKUP .
.It Cm checksum
Убедитесь, что полученная контрольная сумма дистрибутивных файлов
соответствует той, с которой был протестирован порт.
Если контрольная сумма дистрибутивного файла не совпадает,
также будут выбраны дистрибутивные файлы,
которые отсутствуют или не прошли проверку при вычислении контрольной суммы.
При определении
.Va NO_CHECKSUM
этот шаг будет пропущен.
.It Cm depends
Установливает (или компилирует,
если требуется только компиляция) все зависимости текущего порта.
При вызове целевыми объектами
.Cm extract
или
.Cm fetch
это выполняется по частям как
.Cm fetch-depends , build-depends ,
и т.д.
При определении
.Va NO_DEPENDS
этот шаг будет пропущен.
.It Cm extract
Разворачивает дистрибутивный файл в рабочий каталог.
.It Cm patch
Применяет все исправления, которые необходимы для работы порта.
.It Cm configure
Настраивает порт. На этом этапе некоторые порты
будут задавать вам вопросы. Смотрите раздел
.Va INTERACTIVE
и
.Va BATCH .
.It Cm build
Создает порт. Это то же самое, что и вызов целевого объекта
.Cm all .
.It Cm install
Установливает порт и зарегистрируйте его в системе пакетов. 
Это все, что вам нужно сделать.
.It Cm install-missing-packages
Устанавливает отсутствующие зависимости из пакетов вместо их создания.
.El
.Pp
Следующие целевые программы не запускаются во время обычного процесса установки.
.Bl -tag -width ".Cm fetch-recursive"
.It Cm showconfig
Отображает
.Va OPTIONS
конфигурации для этого порта.
.It Cm showconfig-recursive
Отображает
.Va OPTIONS
конфигурации для этого порта и всех его зависимостей.
.It Cm rmconfig
Удаляет настройки
.Va OPTIONS
для этого порта.
.It Cm rmconfig-recursive
Удаляет настройки
.Va OPTIONS
для этого порта и всех его зависимостей.
.It Cm config-conditional
Пропустите порты, для которых уже были настроены соответствующие
.Va OPTIONS .
.It Cm config-recursive
Настраивает
.Va OPTIONS
для этого порта и всех зависимых от него устройств с помощью
.Xr dialog4ports 1 .
.It Cm fetch-list
Показывает список файлов, которые необходимо извлечь для создания порта (но не его зависимостей).
.It Cm fetch-recursive
Извлекает дистрибутивные файлы порта и все зависимые от него файлы.
.It Cm fetch-recursive-list
Показывает список файлов, которые будут извлечены с помощью
.Cm fetch-recursive .
.It Cm build-depends-list , run-depends-list
Выводит список всех зависимостей прямой компиляции или запуска для этого порта.
.It Cm all-depends-list
Выводит список всех рекурсивных зависимостей для этого порта.
.It Cm pretty-print-build-depends-list , pretty-print-run-depends-list
Выводит список всех зависимостей рекурсивной компиляции
или запуска для этого порта с указанием имени порта и версии.
.It Cm missing
Выводит список отсутствующих зависимостей, которые должны быть установлены для порта.
.It Cm clean
Удаляет расширенный исходный код.
Это приведет к возврату к зависимостям, если не определено значение
.Va NOCLEANDEPENDS .
.It Cm distclean
Удалите дистрибутивные файлы порта и выполните целевую очистку
.Cm clean .
Часть
.Cm clean
возвращается к зависимостям, если не определен параметр
.Va NOCLEANDEPENDS ,
но часть
.Cm distclean
никогда не возвращается (возможно, это ошибка).
.It Cm reinstall
Используйте это для восстановления порта после использования
.Xr pkg-delete 8 ,
когда вы должны были использовать
.Cm deinstall .
.It Cm deinstall
Удаляет установленный порт из системы, аналогично
.Xr pkg-delete 8 .
.It Cm deinstall-all
Удаляет из системы все установленные порты с одинаковым
.Va PKGORIGIN .
.It Cm package
Создайте двоичный пакет для порта. Порт будет
установлен, если он еще не был установлен. Пакет представляет собой файл
.Pa .pkg ,
который вы можете использовать для установки порта на другие компьютеры с помощью
.Xr pkg-add 8 .
Если каталог, указанный в
.Va PACKAGES
не существует, пакет будет помещен в
.Pa /usr/ports/category/port/work/pkg .
Дополнительную информацию смотрите в
.Va PKGREPOSITORY
и
.Va PKGFILE .
.It Cm package-recursive
Как и
.Cm package ,
но также создает пакет для каждого зависимого порта.
.It Cm package-name
Выводит название с указанием версии порта.
.It Cm readmes
Создает порт
.Pa README.html .
Это можно использовать из
.Pa /usr/ports
для создания доступной для просмотра веб-страницы со всеми портами в вашей системе!
.It Cm search
Выполните поиск в
.Pa INDEX
файле по шаблону, указанному в
.Va key
(поиск по имени порта, комментарию и зависимым ссылкам),
.Va name
(поиск только по имени порта),
.Va path
(поиск по пути к порту),
.Va info
(поиск по информации о порту),
.Va maint
(поиск по сопровождающему порта),
.Va cat
(поиск по категории порта),
.Va bdeps
(выполняет поиск в зависимости от времени сборки порта),
.Va rdeps
(выполняет поиск в зависимости от времени выполнения порта),
.Va www
(выполняет поиск на веб-сайте порта)
.Xr make 1
переменные и их аналоги для исключения:
.Va xname , xkey
и т.д.
Например, можно было бы ввести:
.Pp
.Dl "cd /usr/ports && make search name=query"
.Pp
чтобы найти все записи, название которых совпадает с
.Dq Li query .
Результаты включают в себя путь к соответствующим портам,
комментарий, сопровождающий, зависимости построения и запуска.
.Bd -literal -offset indent
cd /usr/ports && make search name=pear- \e
    xbdeps=apache
.Ed
.Pp
Чтобы найти все записи, названия которых содержат
.Dq Li pear-
и для которых apache не указан в зависимостях во время сборки.
.Bd -literal -offset indent
cd /usr/ports && make search name=pear- \e
    xname='ht(tp|ml)'
.Ed
.Pp
Чтобы найти все записи, названия которых содержат
.Dq Li pear- ,
но не
.Dq Li html
или
.Dq Li http .
.Bd -literal -offset indent
make search key=apache display=name,path,info keylim=1
.Ed
.Pp
Чтобы найти записи, содержащие
.Dq Li apache
в любом из полей "имя", "путь", "информация", игнорируйте остальную часть записи.
.Pp
По умолчанию поиск выполняется без учета регистра. Чтобы сделать его
чувствительным к регистру, вы можете использовать переменную
.Va icase :
.Bd -literal -offset indent
make search name=p5-R icase=0
.Ed
.It Cm quicksearch
Уменьшенный вывод
.Cm search .
Отображаются только имя, путь и инфо.
.It Cm describe
Создайте однострочное описание каждого порта для использования в
.Pa INDEX
файле.
.It Cm maintainer
Отображаете адрес электронной почты сопровождающего порта.
.It Cm index
Создает
.Pa /usr/ports/INDEX ,
который будет использоваться объектами
.Cm pretty-print-*
и
.Cm search .
Запуск объекта
.Cm index
обеспечит соответствие вашего 
.Pa INDEX
файла вашему дереву портов.
.It Cm fetchindex
Извлекает
.Pa INDEX
файл из кластера
.Fx .
.El
.Sh ОКРУЖЕНИЕ
Вы можете изменить все это.
.Bl -tag -width ".Va MASTER_SITES"
.It Va PORTSDIR
Расположение дерева портов. По умолчанию это
.Pa /usr/ports .
.It Va WRKDIRPREFIX
Где можно создать какие-либо временные файлы. Полезно, если
.Va PORTSDIR
доступен только для чтения (возможно, смонтирован с компакт-диска).
.It Va DISTDIR
То, где найти/поместить дистрибутивные файлы, обычно
.Pa distfiles/
в
.Va PORTSDIR .
.It Va SU_CMD
Команда, используемая для повышения привилегий для настройки и установки порта.
Непривилегированный пользователь должен иметь доступ на запись к
.Va WRKDIRPREFIX
и
.Va DISTDIR .
Значение по умолчанию
.Ql /usr/bin/su root -c .
Многие пользователи устанавливают для него значение
.Ql /usr/local/bin/sudo -E sh -c
для удобства.
.It Va PACKAGES
Используется только для назначения
.Cm package ;
базовый каталог для дерева пакетов, обычно
.Pa packages/
в
.Va PORTSDIR .
сли этот каталог существует, дерево пакетов будет (частично) создано.
Выход из этого каталога не требуется; если этого не произойдет,
пакеты будут помещены в текущий каталог, или вы можете определить один из
.Bl -tag -width ".Va PKGREPOSITORY"
.It Va PKGREPOSITORY
Каталог, в который нужно поместить пакет.
.It Va PKGFILE
Полный путь к пакету.
.El
.It Va LOCALBASE
WГде установлены существующие компоненты и где искать файлы
при разрешении зависимостей (обычно
.Pa /usr/local ) .
.It Va PREFIX
Где установить этот порт (обычно устанавливается таким же, как у
.Va LOCALBASE ) .
.It Va MASTER_SITES
Основные сайты для распространения файлов, если они не найдены локально.
.It Va PATCH_SITES
Основные места расположения файлов исправлений для распространения, если они не находятся локально.
.It Va MASTER_SITE_FREEBSD
Если установлено, перейдите на главный сайт
.Fx
для получения всех файлов.
.It Va MASTER_SITE_OVERRIDE
Попробуйте сначала зайти на эти сайты, чтобы найти все файлы и исправления.
.It Va MASTER_SITE_BACKUP
Попробуйте зайти на эти сайты для получения всех файлов и исправлений в последнюю очередь.
.It Va RANDOMIZE_MASTER_SITES
Попробуйте выбрать места загрузки в случайном порядке.
.It Va MASTER_SORT
Отсортируйте места загрузки в соответствии с указанным пользователем шаблоном.
Пример:
.Dl .dk .sunet.se .se dk.php.net .no .de heanet.dl.sourceforge.net
.It Va MASTER_SITE_INDEX
То где взять исходный код
.Pa INDEX ,
sсозданный на кластере
.Fx
(для целевого объекта
.Cm fetchindex ).
По умолчанию используется значение
.Pa https://download.FreeBSD.org/ports/index/ .
.It Va FETCHINDEX
Команда для получения
.Pa INDEX
(для целевого значения
.Cm fetchindex ).
о умолчанию используется
.Dq Li "fetch -am" .
.It Va NOCLEANDEPENDS
Если определено, не позволяет
.Cm clean
выполнять рекурсию к зависимостям.
.It Va FETCH_CMD
Команда, используемая для извлечения файлов.
По умолчанию
.Xr fetch 1 .
.It Va FORCE_PKG_REGISTER
Если установлено, перезапишет все существующие регистрации пакетов в системе.
.It Va INTERACTIVE
Если он определен, работает с портом только в том случае, если это требует взаимодействия.
.It Va BATCH
Если определено, работает с портом только в том случае,
если он может быть установлен на 100% автоматически.
.It Va DISABLE_VULNERABILITIES
Если определено, отключаеет проверку на наличие уязвимостей
в системе безопасности с помощью
.Xr pkg-audit 8
при установке новых портов.
.It Va NO_IGNORE
Если определено, разрешает установку портов, помеченных как
.Aq Va FORBIDDEN .
По умолчанию платформа Ports framework прерывает установку при попытке
установки запрещенного порта. Конечно, эти порты могут работать не так,
как ожидалось, но если вы действительно знаете,
что делаете, и уверены в установке запрещенного порта, то
.Va NO_IGNORE
позволяет вам это сделать.
.It Va NO_CHECKSUM
Если определено, пропускает проверку контрольной суммы порта.
.It Va TRYBROKEN
Если определено, попытается создать порт, даже если он помечен как
.Aq Va BROKEN .
.It Va PORT_DBDIR
Каталог, в котором хранятся результаты настройки
.Va OPTIONS .
о умолчанию используется
.Pa /var/db/ports .
Каждый порт, на котором были настроены
.Va OPTIONS ,
будет иметь подкаталог с уникальным именем, содержащий один файл
.Pa options .
.El
.Sh СОЗДАНИЕ ПЕРЕМЕННЫХ
В следующем списке приведены названия и краткое описание многих переменных,
которые используются при создании портов.
Более подробную информацию об этих и других связанных с ними
переменных можно найти в
.Pa ${PORTSDIR}/Mk/*
руководстве по портированию
.Fx
Porter's Handbook.
.Bl -tag -width "WITH_CCACHE_BUILD"
.It Va WITH_DEBUG
.Pq Vt bool
Если задано, для двоичных файлов портов устанавливаются отладочные символы.
.It Va WITH_DEBUG_PORTS
Список источников, для которых нужно задать значение
.Va WITH_DEBUG .
.It Va DEBUG_FLAGS
.Pq По умолчанию: Ql -g
ополнительные флажки
.Va CFLAGS
для установки при параметре
.Va WITH_DEBUG .
.It Va WITH_CCACHE_BUILD
.Pq Vt bool
Если задано, позволяет использовать
.Xr ccache 1
для создания портов.
.It Va CCACHE_DIR
Какой каталог использовать для данных
.Xr ccache 1 .
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /usr/ports/Mk/bsd.port.mk" -compact
.It Pa /usr/ports
Каталог портов по умолчанию.
.It Pa /usr/ports/Mk/bsd.port.mk
The big Kahuna.
.El
.Sh ПРИМЕРЫ
.Bl -tag -width 0n
.It Sy Пример 1\&: No Создание и установка порта
.Pp
Следующая команда создает и устанавливает Emacs.
.Bd -literal -offset 2n
.Li # Ic cd /usr/ports/editors/emacs
.Li # Ic make install
.Ed
.It Sy Пример 2\&: No Установка зависимостей с помощью Xr pkg 8
.Pp
В следующем примере показано, как создать и установить порт
без необходимости создавать его зависимости.
Вместо этого зависимости загружаются через
.Xr pkg 8 .
.Bd -literal -offset 2n
.Li # Ic make install-missing-packages
.Li # Ic make install
.Ed
.Pp
Это особенно полезно, когда создание зависимостей требует больших затрат времени и ресурсов
.Pq например Pa lang/rust .
едостатком является то, что
.Xr pkg 8
предлагает только пакеты, созданные с набором опций по умолчанию
.Va OPTIONS .
.It Sy Пример 3\&: No Создание нестандартного стиля порта
.Pp
Следующая команда создает нестандартный вариант порта.
(В этом случае
.Pa devel/py-pip
будет создан с поддержкой Python 3.7.)
.Bd -literal -offset 2n
.Li # Ic cd /usr/ports/devel/py-pip
.Li # Ic env FLAVOR=py37 make build
.Ed
.It Sy Пример  4\&: No Настройка параметров портов с помощью Xr make.conf 5
.Pp
В следующих строках представлены различные способы настройки параметров портов с помощью
.Xr make.conf 5
(в качестве альтернативы, например, запуску
.Dq Li make config ) :
.Bd -literal -offset 2n
# Включите NLS для всех портов, если не настроено иное,
# с помощью диалогового окна параметров.
OPTIONS_SET=		NLS
# Отключите документы для всех портов, переопределяющие параметры,
# установленные в диалоговом окне параметров.
OPTIONS_UNSET_FORCE=	DOCS
# Отключите документы и примеры для порта shells/zsh.
shells_zsh_UNSET=	DOCS EXAMPLES
.Ed
.Pp
Эти и другие переменные, связанные с параметрами, описаны в файле
.Pa /usr/ports/Mk/bsd.options.mk .
.It Sy Пример  5\&: No становка переменных Xr make 1 для определенных портов с помощью Xr make.conf 5
.Pp
В следующем примере показано, как установить произвольные переменные
.Xr make 1
только для определенных портов:
.Bd -literal -offset 2n
# Установите DISABLE_MAKE_JOBS для порта lang/rust:
\&.if ${.CURDIR:M*/lang/rust}
DISABLE_MAKE_JOBS=	yes
TRYBROKEN=		yes
\&.endif
.Ed
.It Sy Пример 6\&: No Порты отладки
По умолчанию порты создаются и упаковываются без поддержки отладки
(например, из двоичных файлов удаляются отладочные символы,
для компиляции используются флаги оптимизации, подробное ведение
журнала отключено).
аличие в портах отладочных символов можно регулировать с помощью настроек в
.Xr make.conf 5 ,
например,
.Bd -literal -offset 2n
# Включите отладку для всех портов.
WITH_DEBUG=		yes
# Включите отладку для выбранных портов.
WITH_DEBUG_PORTS=	mail/dovecot security/krb5
.Ed
.Pp
Также можно использовать переменные отладки в командной строке:
.Bd -literal -offset 2n
.Li # Ic make -DWITH_DEBUG DEBUG_FLAGS="-g -O0" build
.Ed
.Pp
Смотрите раздел
.Sx MAKE VARIABLES ,
чтобы узнать больше об отладочных переменных.
.Pp
Чтобы понять детали того, что происходит при установке отладочных
переменных, лучше всего обратиться к файлам, расположенным по адресу
.Pa ${PORTSDIR}/Mk/*
.Po Pa bsd.port.mk
в частности
.Pc .
.Pp
Если для определенного порта включена отладка, платформа ports framework будет:
.Bl -bullet
.It
Add
.Va DEBUG_FLAGS
(defaults to
.Ql -g )
to
.Va CFLAGS .
.It
Попытайтесь предотвратить удаление двоичных файлов
(в том числе проверьте цель установки, чтобы заменить
.Ql install-strip
на
.Ql install ) .
ыл ли удален двоичный файл, можно проверить с помощью
.Xr file 1 .
.It
Попробуйте включить другие функции отладки,
такие как debug build type или подробное ведение журнала.
Однако это зависит от порта, и платформа ports framework 
может не знать о каждой поддерживаемой функции отладки, 
которую может предложить данная часть программного обеспечения).
.El
.El
.Sh СМОТРИ ТАКЖЕ
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr development 7 ,
.Xr pkg 7
.Pp
Дополнительная документация для разработчиков:
.Bl -dash -width "" -offset indent
.It
.Xr portlint 1
.It
.Pa /usr/ports/Mk/bsd.port.mk
.El
.Pp
Дополнительная документация для пользователя:
.Bl -dash -width "" -offset indent
.It
.Xr pkg 8
.It
.Lk "https://www.FreeBSD.org/ports" "Доступный для поиска индекс всех портов:"
.El
.Sh ИСТОРИЯ
Коллекция портов появилась в
.Fx 1.0 .
С тех пор она распространилась на
.Nx
и
.Ox .
.Sh АВТОРЫ
.An -nosplit
Эта страница руководства была создана
.An David O'Brien .
.Sh ОШИБКИ
Документация по портам разделена на четыре части \(em
.Pa /usr/ports/Mk/bsd.port.mk ,
.%B "The Porter's Handbook" ,
the
.Dq "Packages and Ports"
часть
.%B "The FreeBSD Handbook" ,
и эта страница руководства.
