melkorbsd/ru-freebsd-man/man7/roff.7
.\" $Id: roff.7,v 1.116 2021/09/18 12:23:06 schwarze Exp $
.\"
.\" Copyright (c) 2010, 2011, 2012 Kristaps Dzonsons <kristaps@bsd.lv>
.\" Copyright (c) 2010-2019 Ingo Schwarze <schwarze@openbsd.org>
.\"
.\" Разрешение на использование, копирование, изменение и распространение данного программного обеспечения для любых

.\" уведомление об авторских правах и данное разрешение будут присутствовать во всех копиях.
.\"
.\" ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ", И АВТОР ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ.
.\" В ОТНОШЕНИИ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ
.\" ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА
.\" ЛЮБЫЕ СПЕЦИАЛЬНЫЕ, ПРЯМЫЕ, КОСВЕННЫЕ ИЛИ ПОСЛЕДУЮЩИЕ УБЫТКИ ИЛИ ЛЮБЫЕ УБЫТКИ
.\" ВОЗНИКШИЕ В РЕЗУЛЬТАТЕ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БУДЬ ТО В
.\" ПО ДОГОВОРУ, ХАЛАТНОСТИ ИЛИ ДРУГИМ ДЕЛИКТНЫМ ДЕЙСТВИЯМ, ВОЗНИКАЮЩИМ ИЗ
.\" ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ РАБОТОЙ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.
.\"
.Dd $Mdocdate: September 18 2021 $
.Dt ROFF 7
.Os
.Sh ИМЯ
.Nm roff
.Nd cправочник по языку roff для mandoc
.Sh ОПИСАНИЕ
.Nm roff
это язык форматирования текста общего назначения.
Поскольку традиционные реализации языка
.Xr mdoc 7
и
.Xr man 7
основаны на нем,
во многих реальных руководствах используется небольшое количество
.Nm
запросов и управляющих последовательностей, перемежающихся с их
.Xr mdoc 7
или
.Xr man 7
кодом.
Для правильного форматирования таких руководств необходимо использовать
.Xr mandoc 1
поддерживает подмножество
.Nm
запросов и escapes.
Несмотря на то, что на этой странице руководства перечислены все
.Nm
запросы и управляющие последовательности, она содержит лишь частичную информацию
о запросах, не поддерживаемых
.Xr mandoc 1
и об особенностях языка, которые не имеют значения для страниц руководства.
Для получения полной информации
.Nm
обратитесь к разделу
.Sx СМОТРИТЕ ТАКЖЕ
раздел.
.Pp
Строки ввода, начинающиеся с управляющего символа
.Sq \&.
разбираются на запросы и макросы.
Такие строки называются
.Dq списки запроса
или
.Dq macro списки
соответственно.
Запросы изменяют состояние обработки и управляют форматированием;
некоторые макросы также определяют структуру документа и производят форматирование
вывод.
Одиночная кавычка
.Pq Qq \(aq
принимается в качестве альтернативного управляющего символа,
обрабатывается
.Xr mandoc 1
так же, как
.Ql \&.
.Pp
Строки, не начинающиеся с управляющих символов, называются
.Dq text списки .
Они представляют собой текст произвольной формы для печати; форматирование текста
зависит от соответствующего контекста обработки.
.Sh СИНТАКСИС ЯЗЫКА
.Nm
Документы могут содержать только графические 7-битные символы ASCII, символ пробела и, при определенных обстоятельствах, символ табуляции.
и, при определенных обстоятельствах, символ табуляции.
Символ обратной косой черты
.Sq \e
обозначает начало управляющей последовательности, используемой, например, для
.Sx Комментарии
и
.Sx Специальные символы.
Для получения полного списка управляющих последовательностей обратитесь к разделу
.Sx ССЫЛКА НА ESCAPE-ПОСЛЕДОВАТЕЛЬНОСТЬ
ниже.
.Ss Комментарии
Текст, следующий за экранированной двойной кавычкой
.Sq \e\(dq ,
в строке запроса, макроса или текста, игнорируется до конца строки.
Строка запроса, начинающаяся с управляющего символа и экранированного комментария
.Sq \&.\e\(dq
также игнорируется.
Кроме того, строки запроса, содержащие только управляющий символ и необязательный
необязательное пробельное пространство в конце строки, удаляются из ввода.
.Pp
Примеры:
.Bd -literal -offset indent -compact
\&.\e\(dq Это строка комментария.
\&.\e\(dq Следующая строка игнорируется:
\&.
\&.Sh EXAMPLES \e\(dq Это тоже комментарий.
\&example text \e\(dq Так и это.
.Ed
.Ss Специальные символы
Специальные символы используются для кодирования особых глифов и отображаются
и по-разному отображаются на разных носителях.
Они могут встречаться в запросах, макросах и текстовых строках.
Последовательности начинаются с символа эвакуации
.Sq \e
за которым следует либо открытая парентеза
.Sq \&(
для двухсимвольных последовательностей; открытая скобка
.Sq \&[
для n-символьных последовательностей (завершается закрытой скобкой
.Sq \&] ) ;
или одиночная односимвольная последовательность.
.Pp
Примеры:
.Bl -tag -width Ds -offset indent -compact
.It Li \e(em
Двухбуквенный символ тире em.
.It Li \ee
Однобуквенный обратный слеш.
.El
.Pp
См.
.Xr mandoc_char 7
для полного списка.
.Ss Выбор шрифта
В
.Xr mdoc 7
и
.Xr man 7
шрифты обычно выбираются с помощью макросов.
.Ic \ef
и
.Ic \&ft
можно использовать для ручного изменения шрифта,
но это не рекомендуется в
.Xr mdoc 7
документах.
Такое ручное изменение шрифта отменяется многими последующими макросами.
.Pp
Поддерживаются следующие шрифты:
.Pp
.Bl -tag -width CW -offset indent -compact
.It Cm B
Полужирный шрифт.
.It Cm BI
Шрифт, который одновременно является жирным и курсивным.
.It Cm CB
Полужирный шрифт постоянной ширины.
Такой же, как
.Cm B
в терминальном выводе.
.It Cm CI
Курсивный шрифт постоянной ширины.
То же, что и
.Cm I
в терминальном выводе.
.It Cm CR
Обычный шрифт постоянной ширины.
То же, что и
.Cm R
в терминальном выводе.
.It Cm CW
Псевдоним для
.Cm CR .
.It Cm I
Курсивный шрифт.
.It Cm P
Возврат к предыдущему шрифту.
Если макрос вызвал изменение шрифта с момента последнего
.Ic \ef
последовательности eascape или
.Ic \&ft
это возвращает к шрифту, предшествующему последнему изменению шрифта в макросе, а не к шрифту, предшествующему последнему изменению шрифта вручную.
макроса, а не к шрифту перед последним изменением шрифта вручную.
.It Cm R
Римский шрифт.
Это шрифт по умолчанию.
.It Cm 1
Псевдоним для
.Cm R .
.It Cm 2
Псевдоним для
.Cm I .
.It Cm 3
Псевдоним для
.Cm B .
.It Cm 4
Псевдоним для
.Cm BI .
.El
.Pp
Примеры:
.Bl -tag -width Ds -offset indent -compact
.It Li \efBbold\efR
Напишите в \fBbold\fP, затем переключитесь в режим обычного шрифта.
.It Li \efIitalic\efP
Напишите в \fIitalic\fP, затем вернитесь в предыдущий режим шрифта.
.It Li \ef(BIbold italic\efP
Напишите в \f(BIbold italic\fP, затем вернитесь к предыдущему режиму шрифта.
.El
.Ss Пробелы
Пробельные символы состоят из символа пробела.
В текстовых строках пробельные символы сохраняются в пределах строки.
В строках запросов и макросов пробельные символы отделяют аргументы и удаляются.
.Pp
Незачеркнутые пробелы в конце строки удаляются из ввода текстовых строк, за исключением случаев, когда они используются в
буквальном контексте.
В целом, не рекомендуется использовать пробельные символы в любой строке ввода по причинам
из соображений переносимости.
В редких случаях, когда символ пробела необходим в конце
в конце строки ввода, он может быть принудительно установлен с помощью
.Sq \e\ \e& .
.Pp
Буквальные символы пробела могут быть получены на выходе
с помощью управляющих последовательностей.
В строках макросов они также могут быть включены в аргументы с помощью кавычек; см.
.Sx СИНТАКСИС МАКРОСОВ
для получения подробной информации.
.Pp
Пустые текстовые строки, которые могут включать пробельные символы, разрешены только
только в литеральных контекстах.
Если первым символом текстовой строки является пробел, эта строка печатается
с новой строкой.
.Ss Ширина масштабирования
Многие запросы и макросы поддерживают масштабирование ширины своих аргументов.
Синтаксис для масштабирования ширины следующий
.Sq Li [+-]?[0-9]*.[0-9]*[:unit:] ,
где десятичной дроби должна предшествовать или следовать хотя бы одна цифра.
.Pp
Принимаются следующие единицы масштабирования:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It c
сантиметр
.It i
дюйм
.It P
пика (1/6 дюйма)
.It p
точка (1/72 дюйма)
.It f
масштаб
.Sq u
на 65536
.It v
вертикальный размах по умолчанию
.It m
ширина отображаемого
.Sq m
.Pq em
символ
.It n
ширина отрисованного
.Sq n
.Pq en
символ
.It u
горизонтальный размах по умолчанию для терминала
.It M
mini-em (1/100 em)
.El
.Pp
При использовании любых других значений, кроме
.Sq m ,
.Sq n ,
или
.Sq v
обязательно не переносится на разные носители.
См.
.Sx СОВМЕСТИМОСТЬ .
.Pp
Если единица масштабирования не указана, числовое значение интерпретируется
в соответствии с правилами по умолчанию
.Sq v
для вертикальных пробелов и
.Sq u
для горизонтальных.
.Pp
Примеры:
.Bl -tag -width ".Bl -tag -width 2i" -offset indent -compact
.It Li \&.Bl -tag -twidth 2i
двухдюймовый отступ маркированного списка в
.Xr mdoc 7
.It Li \&.HP 2i
двухдюймовый отступ маркированного списка в
.Xr man 7
.It Li \&.sp 2v
два вертикальных пробела
.El
.Ss Интервал между предложениями
Каждое предложение должно заканчиваться в конце строки ввода.
Таким образом, форматтер сможет применить нужное количество
интервал после точки, восклицательного знака или вопросительного знака, за которым следует ноль или более невосклицательных знаков,
или вопросительного знака, за которыми следует ноль или более не закрывающих предложение
разделителей
.Po
.Sq \&) ,
.Sq \&] ,
.Sq \&' ,
.Sq \&"
.Pc .
.Pp
Правильный интервал также разумно сохраняется, если предложение заканчивается на
на границе макростроки.
.Pp
Если строка ввода заканчивается точкой, восклицательным или вопросительным
не являющимся концом предложения, добавьте пробел нулевой ширины.
.Pq Sq \e& .
.Pp
Примеры:
.Bd -literal -offset indent -compact
Не завершайте предложения посередине строки таким образом.  Вместо этого,
заканчивайте предложение вот так.
Макрос будет заканчиваться следующим образом:
\&.Xr mandoc 1 \&.
Аббревиатура в конце строки ввода нуждается в экранировании, например \e&
например.
.Ed
.Sh СИНТАКСИС ЗАПРОСА
Строка запроса или макроса состоит из:
.Pp
.Bl -enum -compact
.It
управляющий символ
.Sq \&.
или
.Sq \(aq
в начале строки,
.It
произвольное количество пробельных символов,
.It
имя запроса или макроса, которое представляет собой одно слово произвольной
длины, завершенное пробелами,
.It
и ноль или более аргументов, ограниченных пробелами.
.El
.Pp
Таким образом, все следующие строки запроса эквивалентны:
.Bd -literal -offset indent
\&.ig end
\&.ig end
\&. ig end
.Ed
.Sh СИНТАКСИС МАКРОСОВ
Макросы предоставляются в
.Xr mdoc 7
и
.Xr man 7
и могут быть определены с помощью
.Ic \&de
запросом.
При вызове они следуют тому же синтаксису, что и запросы, за исключением того, что
аргументы макросов можно заключать в кавычки, заключая их
в двойные кавычки
.Pq Sq \(dq .
Текст, заключенный в кавычки, даже если он содержит пробельные символы или может привести к
если он содержит пробелы или без кавычек вызвал бы вызов макроса, всегда считается буквальным текстом.
Внутри текста, заключенного в кавычки, пары символов двойных кавычек
.Pq Sq Qq
преобразуются в одиночные двойные кавычки.
.Pp
Чтобы распознать начало аргумента, заключенного в кавычки, открывающему символу
символ кавычек должен предшествовать символу пробела.
Аргумент, заключенный в кавычки, продолжается до следующего символа двойной кавычки, который не является
или до конца строки ввода, в зависимости от того, что наступит раньше.
Оставлять завершающий символ двойной кавычки в конце строки
не рекомендуется.
Для ясности, если в одной строке ввода следует несколько аргументов,
рекомендуется после завершающего символа двойной кавычки
символом пробела; в случае если следующий символ после завершающего
двойной кавычки, то он считается началом
следующего, не заключенного в кавычки аргумента.
.Pp
Как в аргументах, заключенных в кавычки, так и в аргументах без кавычек, пары обратных косых черт
.Pq Sq \e\e
преобразуются в одиночные обратные слеши.
В аргументах без кавычек пробельные символы могут быть альтернативно включены
поставив перед ними обратную косую черту
.Pq Sq \e\~ ,
но для ясности обычно лучше использовать кавычки.
.Pp
Примеры:
.Bl -tag -width Ds -offset indent -compact
.It Li .Fn strlen \(dqconst char *s\(dq
Групповые аргументы
.Qq const char *s
в один аргумент функции.
Если не указано,
.Qq const ,
.Qq char ,
и
.Qq *s
будут считаться отдельными аргументами.
.It Li .Op \(dqFl a\(dq
Рассмотрим
.Qq \&Fl a
как литеральный текст, а не макрос флага.
.El
.Sh ЗАПРОСИТЬ ССЫЛКУ
.Xr mandoc 1
.Nm
распознает следующие запросы.
Для запросов, помеченных как "игнорируемые" или "неподдерживаемые", любые аргументы
игнорируются, а количество аргументов не проверяется.
.Bl -tag -width Ds
.It Ic \&ab Op Ar message
Прервать обработку.
В настоящее время не поддерживается.
.It Ic \&ad Op Cm b | c | l | n | r
Установка режима выравнивания строк для последующего текста.
В настоящее время игнорируется.
.It Ic \&af Ar registername format
Назначить формат вывода для регистра чисел.
В настоящее время игнорируется.
.It Ic \&aln Ar newname oldname
Создать псевдоним для регистра чисел.
В настоящее время не поддерживается.
.It Ic \&als Ar newname oldname
Создание псевдонима для запроса, строки, макроса или переадресации.
.It Ic \&am Ar macroname Op Ar endmacro
Добавление к определению макроса.
Синтаксис этого запроса такой же, как у
.Ic \&de .
.It Ic \&am1 Ar macroname Op Ar endmacro
Добавление к макроопределению, отключение режима совместимости с roff
во время выполнения макроса (расширение groff).
Синтаксис этого запроса такой же, как у запроса
.Ic \&de1 .
Поскольку
.Xr mandoc 1
не реализует
.Nm
режим совместимости, он обрабатывает этот запрос как псевдоним для
.Ic \&am .
.It Ic \&ami Ar macrostring Op Ar endstring
Добавление к определению макроса с косвенным указанием имени макроса
(расширение groff).
Синтаксис этого запроса такой же, как и у запроса
.Ic \&dei .
.It Ic \&ami1 Ar macrostring Op Ar endstring
Добавление к определению макроса с косвенным указанием имени макроса
и отключение режима совместимости с roff во время выполнения макроса
(расширение groff).
Синтаксис этого запроса такой же, как у запроса
.Ic \&dei1 .
Поскольку
.Xr mandoc 1
не реализует
.Nm
режим совместимости вообще, он обрабатывает этот запрос как псевдоним для
.Ic \&ami .
.It Ic \&as Ar stringname Op Ar string
Добавление к заданной пользователем строке.
Синтаксис этого запроса такой же, как и у запроса
.Ic \&ds .
Если пользовательская строка с указанным именем еще не существует,
то перед добавлением она будет установлена в пустую строку.
.It Ic \&as1 Ar stringname Op Ar string
Добавление в пользовательскую строку, отключение режима совместимости с roff
во время выполнения макроса (расширение groff).
Синтаксис этого запроса такой же, как и у запроса
.Ic \&ds1 .
Поскольку
.Xr mandoc 1
не реализует
.Nm
режим совместимости, он обрабатывает этот запрос как псевдоним для
.Ic \&as .
.It Ic \&asciify Ar divname
Полностью отформатировать див.
В настоящее время не поддерживается.
.It Ic \&backtrace
Вывести обратную трассировку стека ввода.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&bd Ar font Oo Ar curfont Oc Op Ar offset
Искусственное повышение жирности путем повторной печати с небольшими сдвигами.
В настоящее время игнорируется.
.It Ic \&bleedat Ar left top width height
Устанавливает параметр страницы BleedBox для генерации PDF.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&blm Ar macroname
Устанавливает ловушку пустых строк.
В настоящее время не поддерживается.
.It Ic \&box Ar divname
Начать отвод без включения частично заполненной строки.
В настоящее время не поддерживается.
.It Ic \&boxa Ar divname
Добавить к отводу, не включая частично заполненную строку.
В настоящее время не поддерживается.
.It Ic \&bp Oo Cm + Ns | Ns Cm - Oc Ns Ar pagenumber
Начать новую страницу.
В настоящее время игнорируется.
.It Ic \&BP Ar source height width position offset flags label
Определяет рамку и помещает в нее изображение.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&br
Прервать строку вывода.
.It Ic \&break
Выйти из внутренней строки
.Ic \&while
цикла.
.It Ic \&breakchar Ar char ...
Необязательные символы перевода строки.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&brnl Ar N
Разрыв строки вывода после следующей
.Ar N
строки ввода.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&brp
Разрыв и распространение выходной строки.
В настоящее время это расширение реализовано как псевдоним для
.Ic \&br .
.It Ic \&brpnl Ar N
Прерывание и распространение строки вывода после следующей
.Ar N
входных строк.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&c2 Op Ar char
Изменяет управляющий символ без разрыва.
В настоящее время не поддерживается.
.It Ic \&cc Op Ar char
Изменение управляющего символа.
Если
.Ar char
не указан, управляющий символ сбрасывается на
.Sq \&. .
При этом завершающие символы игнорируются.
.It Ic \&ce Op Ar N
Отцентрировать следующий
.Ar N
строк ввода без заполнения.
.Ar N
по умолчанию равен 1.
Аргумент, равный 0 или меньше, завершает центрирование.
В настоящее время макросы высокого уровня прерывают центрирование.
.It Ic \&cf Ar filename
Вывод содержимого файла.
Игнорируется из-за небезопасности.
.It Ic \&cflags Ar flags char ...
Установка флагов символов.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&ch Ar macroname Op Ar dist
Изменить местоположение ловушки.
В настоящее время игнорируется.
.It Ic \&char Ar glyph Op Ar string
Определить или переопределить символ ASCII или последовательность экранирования символов.
.Ar glyph
для отображения в виде
.Ar string ,
которая может быть пустой.
Поддерживается только частично в
.Xr mandoc 1 ;
может некорректно взаимодействовать с
.Ic \&tr .
.It Ic \&chop Ar stringname
Удаляет последний символ из макроса, строки или отвлечения.
В настоящее время не поддерживается.
.It Ic \&class Ar classname char ...
Определяет класс символов.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&close Ar streamname
Закрыть открытый файл.
Игнорируется, так как небезопасно.
.It Ic \&CL Ar color text
Печать текста в цвете.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&color Op Cm 1 | 0
Активировать или деактивировать цвета.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&composite Ar from to
Определяет компонент имени для составных имен глифов.
Это расширение groff и в настоящее время не поддерживается.
.It Ic \&continue
Немедленно начать следующую итерацию функции
.Ic \&while
цикла.
В настоящее время не поддерживается.
.It Ic \&cp Op Cm 1 | 0
Переключатель
.Nm
включить или выключить режим совместимости.
В настоящее время игнорируется.
.It Ic \&cropat Ar left top width height
Устанавливает параметр страницы CropBox для генерации PDF.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&cs Ar font Op Ar width Op Ar emsize
Режим постоянного межсимвольного интервала.
В настоящее время игнорируется.
.It Ic \&cu Op Ar N
Подчеркивание следующего
.Ar N
Строки ввода, включающие пробельные символы.
В настоящее время игнорируется.
.It Ic \&da Ar divname
Добавление к отклонению.
В настоящее время не поддерживается.
.It Ic \&dch Ar macroname Op Ar dist
Изменить местоположение ловушки в текущем отводе.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&de Ar macroname Op Ar endmacro
Определить
.Nm
макрос.
Его синтаксис может быть следующим
.Bd -literal -offset indent
.Pf . Ic \&de Ar macroname
.Ar definition
\&..
.Ed
.Pp
or
.Bd -literal -offset indent
.Pf . Ic \&de Ar macroname endmacro
.Ar definition
.Pf . Ar endmacro
.Ed
.Pp
Обе формы определяют или переопределяют макрос
.Ar macroname
для представления
.Ar definition ,
которое может состоять из одной или нескольких строк ввода, включая символы новой строки, завершающие каждую строку.
символы, завершающие каждую строку, и, по желанию, содержащие вызовы
.Nm
запросы,
.Nm
макросы или макросы высокого уровня, такие как
.Xr man 7
или
.Xr mdoc 7
макросы, в зависимости от того, что относится к данному документу.
.Pp
Указание пользовательского
.Ar endmacro
работает так же, как и для
.Ic \&ig ;
а именно, вызов
.Sq Pf . Ar endmacro
сначала завершает
.Ar definition ,
после чего оно также оценивается как
.Nm
запрос или
.Nm
макрос, но не как макрос высокого уровня.
.Pp
Макрос может быть вызван позже с помощью синтаксиса
.Pp
.D1 Pf . Ar macroname Op Ar argument Op Ar argument ...
.Pp
Что касается разбора аргументов, см.
.Sx СИНТАКСИС МАКРОСОВ
выше.
.Pp
Строка, вызывающая макрос, будет заменена
во входном потоке на
.Ar definition ,
заменяя все вхождения
.No \e\e$ Ns Ar N ,
где
.Ar N
это цифра, по
.Ar N Ns th Ar argument .
Например,
.Bd -literal -offset indent
\&.de ZN
\efI\e^\e\e$1\e^\efP\e\e$2
\&..
\&.ZN XtFree .
.Ed
.Pp
производит
.Pp
.D1 \efI\e^XtFree\e^\efP.
.Pp
во входном потоке, а значит, и в выходном: \fI\^XtFree\^\fP.
Каждое вхождение \e\e$* заменяется всеми аргументами,
объединенными одиночными пробелами.
Вариант \e\e$@ аналогичен, за исключением того, что каждый аргумент
отдельно.
.Pp
Поскольку макросы и пользовательские строки используют общую таблицу строк,
определяя макрос
.Ar macroname
уничтожает определяемую пользователем строку
.Ar macroname ,
и
.Ar definition
может быть также напечатано с помощью
.Sq \e*
синтаксис строчной интерполяции, описанный ниже
.Ic ds ,
но это редко бывает полезно, поскольку каждое макроопределение содержит по крайней мере
один явный символ новой строки.
.Pp
Чтобы предотвратить бесконечную рекурсию, как groff, так и
.Xr mandoc 1
ограничивают глубину стека для расширения макросов и строк
до большого, но конечного числа, а
.Xr mandoc 1
также ограничивает длину расширяемой строки ввода.
Не полагайтесь на точные значения этих ограничений.
.It Ic \&de1 Ar macroname Op Ar endmacro
Определить
.Nm
макрос, который будет выполняться при
.Nm
режим совместимости будет отключен во время выполнения макроса.
Это расширение groff.
Поскольку
.Xr mandoc 1
не реализует
.Nm
режим совместимости, он обрабатывает этот запрос как псевдоним для
.Ic \&de .
.It Ic \&defcolor Ar newname scheme component ...
Определение имени цвета.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&dei Ar macrostring Op Ar endstring
Определить
.Nm
макрос, указывая имя макроса косвенно (расширение groff).
Синтаксис этого запроса такой же, как и у запроса
.Ic \&de .
Эффект тот же, что и в случае:
.Pp
.D1 Pf . Cm \&de No \e* Ns Bo Ar macrostring Bc Op \e* Ns Bq Ar endstring
.It Ic \&dei1 Ar macrostring Op Ar endstring
Определить a
.Nm
макрос, который будет выполняться с помощью
.Nm
режим совместимости выключен на время выполнения макроса,
указывая имя макроса косвенно (расширение groff).
Поскольку
.Xr mandoc 1
не реализует
.Nm
режим совместимости, он обрабатывает этот запрос как псевдоним для
.Ic \&dei .
.It Ic \&device Ar string ...
.It Ic \&devicem Ar stringname
Эти два запроса имеют смысл только при использовании специфического для groff промежуточного
и не поддерживаются.
.It Ic \&di Ar divname
Начать отвлечение.
В настоящее время не поддерживается.
.It Ic \&do Ar command Op Ar argument ...
Выполнить
.Nm
запрос или макрос с отключенным режимом совместимости.
В настоящее время не поддерживается.
.It Ic \&ds Ar stringname Op Oo \(dq Oc Ns Ar string
Определяет пользовательскую строку.
Адрес
.Ar stringname
и
.Ar string
разделяются пробелами.
Если
.Ar string
начинается с символа двойной кавычки, этот символ не будет частью
строки.
Все оставшиеся символы в строке ввода образуют
.Ar string
включая пробельные символы и символы двойных кавычек, в том числе и концевые.
.Pp
.Ar string
может быть интерполирована в последующий текст с помощью
.No \e* Ns Bq Ar stringname
для
.Ar stringname
произвольной длины, или \e*(NN или \e*N, если длина
.Ar stringname
составляет два или один символ соответственно.
Интерполяцию можно предотвратить, экранировав ведущую обратную косую черту;
то есть звездочка, которой предшествует четное количество обратных косых черточек
не вызывает интерполяции строки.
.Pp
Поскольку пользовательские строки и макросы используют общую таблицу строк,
определение строки
.Ar stringname
уничтожает макрос
.Ar stringname ,
и
.Ar stringname
используемый для определения строки, также может быть вызван как макрос,
в этом случае следующая строка ввода будет добавлена к
.Ar string ,
образуя новую входную строку, передаваемую в
.Nm
синтаксический анализатор.
Например,
.Bd -literal -offset indent
\&.ds badidea .S
\&.badidea
H SYNOPSIS
.Ed
.Pp
вызывает
.Ic SH
макрос при использовании в
.Xr man 7
документе.
Разумеется, такое злоупотребление категорически не рекомендуется.
.It Ic \&ds1 Ar stringname Op Oo \(dq Oc Ns Ar string
Определяет пользовательскую строку, которая будет расширена с помощью функции
.Nm
режим совместимости будет отключен во время расширения строки.
Это расширение groff.
Поскольку
.Xr mandoc 1
не реализует
.Nm
режим совместимости, он обрабатывает этот запрос как псевдоним для
.Ic \&ds .
.It Ic \&dwh Ar dist macroname
Установить ловушку местоположения в текущем дивергенте.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&dt Op Ar dist macroname
Установить ловушку внутри диверсии.
В настоящее время не поддерживается.
.It Ic \&ec Op Ar char
Включить механизм отвода и изменить символ отвода.
.Ar char
по умолчанию используется обратная косая черта
.Pq Sq \e .
.It Ic \&ecr
Восстановление символа эвакуации.
В настоящее время не поддерживается.
.It Ic \&ecs
Сохранить управляющий символ.
В настоящее время не поддерживается.
.It Ic \&el Ar body
.Dq else
половина условного оператора if/else.
Выводит результат из стека условных оценок, подталкиваемого
.Ic \&ie
и использует его в качестве условия.
Если в стеке нет записей (например, из-за отсутствия предыдущих
.Ic \&ie
вызовов)
то предполагается false.
Синтаксис этого запроса аналогичен
.Ic \&if
за исключением того, что условный знак отсутствует.
.It Ic \&em Ar macroname
Устанавливает ловушку в конце ввода.
В настоящее время не поддерживается.
.It Ic \&EN
Завершить блок уравнений.
См.
.Ic \&EQ .
.It Ic \&eo
Полностью отключить механизм выхода.
.It Ic \&EP
Завершение изображения, начатого
.Ic \&BP .
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&EQ
Начало блока уравнений.
См.
.Xr eqn 7
для описания языка уравнений.
.It Ic \&errprint Ar message
Выводит строку, похожую на сообщение об ошибке.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&ev Op Ar envname
Переключение на другое окружение.
В настоящее время не поддерживается.
.It Ic \&evc Op Ar envname
Копирование окружения в текущее окружение.
В настоящее время не поддерживается.
.It Ic \&ex
Прервать обработку и выйти.
В настоящее время не поддерживается.
.It Ic \&fallback Ar curfont font ...
Выбор последовательности возврата для шрифта.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&fam Op Ar familyname
Изменить семейство шрифта.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&fc Op Ar delimchar Op Ar padchar
Определяет разделительный и прокладочный символ для полей.
В настоящее время не поддерживается.
.It Ic \&fchar Ar glyphname Op Ar string
Определяет запасной глиф.
В настоящее время не поддерживается.
.It Ic \&fcolor Ar colorname
Устанавливает цвет заливки для объектов \eD.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&fdeferlig Ar font string ...
Отложить создание лигатуры.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&feature Cm + Ns | Ns Cm - Ns Ar name
Включить или отключить функцию OpenType.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&fi
Прервать строку вывода и переключиться в режим заливки,
который активен по умолчанию, но может быть завершен с помощью команды
.Ic \&nf
запросом.
В режиме заполнения ввод из последующих строк ввода добавляется в
в одну и ту же выходную строку до тех пор, пока следующее слово не перестанет помещаться,
после чего выходная строка разрывается.
Этот запрос подразумевается командой
.Xr mdoc 7
.Ic \&Sh
макрос и
.Xr man 7
.Ic \&SH ,
.Ic \&SS ,
и
.Ic \&EE
макросы.
.It Ic \&fkern Ar font minkern
Управление использованием таблиц кернинга для шрифта.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&fl
Вывод промывки.
В настоящее время игнорируется.
.It Ic \&flig Ar font string char ...
Определить лигатуры.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&fp Ar позиция шрифта Op Ar filename
Назначить позицию шрифта.
В настоящее время игнорируется.
.It Ic \&fps Ar mapname ...
Монтирует шрифт со специальной картой символов.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&fschar Ar font glyphname Op Ar string
Определяет специфический для шрифта резервный glyph.
Это расширение groff и в настоящее время не поддерживается.
.It Ic \&fspacewidth Ar font Op Ar afmunits
Устанавливает специфическую для шрифта ширину символа пробела.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&fspecial Ar curfont Op Ar font ...
Условное определение специального шрифта.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&ft Op Ar font
Изменить шрифт; см.
.Sx Выбор шрифта.
.Ar font
по умолчанию принимает значение
.Cm P .
.It Ic \&ftr Ar newname Op Ar oldname
Перевести имя шрифта.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&fzoom Ar font Op Ar permille
Увеличить размер шрифта.
В настоящее время игнорируется.
.It Ic \&gcolor Op Ar colorname
Установка цвета глифа.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&hc Op Ar char
Установка символа дефиса.
В настоящее время игнорируется.
.It Ic \&hcode Ar char code ...
Установка кодов символов дефиса.
В настоящее время игнорируется.
.It Ic \&hidechar Ar font char ...
Скрыть символы в шрифте.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&hla Ar language
Установить язык дефисов.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&hlm Op Ar number
Устанавливает максимальное количество последовательных дефисных строк.
В настоящее время игнорируется.
.It Ic \&hpf Ar filename
Загрузить файл с шаблоном дефиса.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&hpfa Ar filename
Загрузка файла с шаблонами дефисов, добавление к текущим шаблонам.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&hpfcode Ar code code ...
Определяет значения отображения для кодов символов в шаблонах дефиса.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&hw Ar word ...
Определяет точки дефиса в словах.
В настоящее время игнорируется.
.It Ic \&hy Op Ar mode
Установите автоматический режим расстановки переносов.
В настоящее время игнорируется.
.It Ic \&hylang Ar language
Установить язык дефиса.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&hylen Ar nchar
Минимальная длина слова для дефиса.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&hym Op Ar length
Задать отступ от дефиса.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&hypp Ar penalty ...
Определить штрафы за дефисное написание.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&hys Op Ar length
Задать пространство для дефиса.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&ie Ar condition body
.Dq if
половина условного оператора if/else.
Результат условия заталкивается в стек, используемый последующими
вызовах
.Ic \&el ,
которые могут быть разделены любым промежуточным вводом (или вообще отсутствовать).
Его синтаксис эквивалентен
.Ic \&if .
.It Ic \&if Ar condition body
Начать выполнение условия.
Этот запрос также можно записать следующим образом:
.Bd -unfilled -offset indent
.Pf . Ic \&if Ar condition No \e{ Ns Ar body
.Ar body ... Ns \e}
.Ed
.Bd -unfilled -offset indent
.Pf . Ic \&if Ar condition No \e{\e
.Ar body ...
.Pf . No \e}
.Ed
.Pp
.Ar condition
представляет собой булево выражение.
В настоящее время,
.Xr mandoc 1
поддерживает следующее подмножество условий roff:
.Bl -bullet
.It
Если
.Sq \&!
имеет префикс
.Ar condition,
оно логически инвертировано.
.It
Если первый символ
.Ar condition
является
.Sq n
.Pq nroff mode
или
.Sq o
.Pq odd page,
будет оценена как true, а body
.Ar body
начинается со следующего символа.
.It
Если первый символ
.Ar condition
это
.Sq e
.Pq even page ,
.Sq t
.Pq troff mode ,
или
.Sq v
.Pq vroff mode ,
будет равно false, а body
.Ar body
начинается со следующего символа.
.It
Если первый символ
.Ar condition
является
.Sq c
.Pq character available ,
то оно принимает значение true, если следующий символ является символом ASCII
или допустимой управляющей последовательностью символов, или false в противном случае.
.Ar body
начинается с символа, следующего за этим следующим символом.
.It
Если первый символ
.Ar condition
является
.Sq d ,
то оно оценивается как true, если остальные символы
.Ar condition
является именем существующего макроса или строки, определенной пользователем;
в противном случае - false.
.It
Если первый символ
.Ar condition
является
.Sq r ,
то оно оценивается как true, если остальные символы
.Ar condition
является именем существующего регистра чисел;
в противном случае - false.
.It
Если
.Ar condition
начинается со скобки или с опционального знакового
целое число, оно оценивается в соответствии с правилами
.Sx Числовые выражения
которые описаны ниже.
Результат оценивается как true, если результат положительный,
или в false, если результат нулевой или отрицательный.
.It
В противном случае первый символ
.Ar condition
рассматривается как разделитель и оценивается как true, если строка
от первого до второго его вхождения равна строке
строке, идущей от второго до третьего вхождения.
.It
Если
.Ar condition
не может быть разобрано, то его значение равно false.
.El
.Pp
Если условие ложно, его дочерние элементы не обрабатываются, но
синтаксически интерпретируются, чтобы сохранить целостность входного
документа.
Таким образом,
.Pp
.D1 \&.if t .ig
.Pp
отбрасывает
.Sq \&.ig ,
что может привести к интересным результатам, но
.Pp
.D1 \&.if t .if t \e{\e
.Pp
будет продолжать синтаксическую интерпретацию до закрытия блока заключительного
условного блока.
Подусловия, в этом случае, очевидно, наследуют истинностное значение
родительского.
.Pp
Если
.Ar body
начинается экранированной скобкой
.Sq \e{ ,
область видимости продолжается до конца строки ввода, содержащей
соответствующую последовательность закрывающих скобок
.Sq \e} .
Если
.Ar body
не заключено в скобки, область видимости продолжается до конца строки.
Если
.Ar condition
сопровождается
.Ar body
в той же строке, независимо от того, заключено оно в скобки или нет, то запросы и макросы
.Em must
начинаться с управляющего символа.
Как правило, в этом случае интуитивно понятнее написать
.Bd -unfilled -offset indent
.Pf . Ic \&if Ar condition No \e{\e
.Pf . Ar request
.Pf . No \e}
.Ed
.Pp
чем если бы запрос или макрос следовал как
.Pp
.D1 Pf . Ic \&if Ar condition Pf \e{. Ar request
.Pp
Область действия условия всегда разбирается, но выполняется только в том случае, если
условие оценивается как истина.
.Pp
Обратите внимание на то, что
.Sq \e}
преобразуется в управляющую последовательность нулевой ширины, если не передается как
отдельный макрос
.Sq \&.\e} .
Например,
.Pp
.D1 \&.Fl a \e} b
.Pp
приведет к
.Sq \e}
будет считаться аргументом
.Sq \&Fl
макроса.
.It Ic \&ig Op Ar endmacro
Игнорирует ввод.
Его синтаксис может быть следующим
.Bd -literal -offset indent
.Pf . Cm \&ig
.Ar ignored text
\&..
.Ed
.Pp
or
.Bd -literal -offset indent
.Pf . Cm \&ig Ar endmacro
.Ar ignored text
.Pf . Ar endmacro
.Ed
.Pp
В первом случае ввод игнорируется до тех пор, пока не будет получено сообщение
.Sq \&...
запрос встречается в своей строке.
Во втором случае ввод игнорируется до тех пор, пока не встретится указанный
.Sq Pf . Ar endmacro
не будет встречен.
Не используйте символ завершения
.Sq \e
нигде в определении
.Ar endmacro ;
Это приведет к очень странному поведению.
.Pp
Когда
.Ar endmacro
является запросом roff или макросом roff, как, например, в
.Pp
.D1 \&.ig если
.Pp
последующий вызов
.Ic \&if
сначала завершит
.Ar ignored text ,
а затем будет вызван как обычно.
В противном случае будет завершен только
.Ar ignored text ,
и аргументы, следующие за ним, или
.Sq \&...
отбрасываются.
.It Ic \&in Op Oo Cm + Ns | Ns Cm - Oc Ns Ar width
Изменение отступа.
См.
.Xr man 7 .
Игнорируется в
.Xr mdoc 7 .
.It Ic \&index Ar register stringname substring
Найти подстроку в строке.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&it Ar expression macro
Устанавливает ловушку для входной строки.
Именованный
.Ar macro
будет вызван после обработки количества строк входного текста
указанных числовым
.Ar expression .
Во время оценки
.Ar expression .
используются суффиксы единиц измерения, описанные ниже
.Sx Ширина масштабирования
игнорируются.
.It Ic \&itc Ar expression macro
Устанавливает ловушку для входных строк, не считая строк, заканчивающихся на \ec.
В настоящее время не поддерживается.
.It Ic \&IX Ar class keystring
Для поддержки генерации оглавления,
.Xr pod2man 1
выдает этот пользовательский макрос, обычно не определяя его.
Чтобы избежать сообщения о большом количестве ложных ошибок,
.Xr mandoc 1
игнорирует его.
.It Ic \&kern Op Cm 1 | 0
Включает или выключает кернинг.
В настоящее время игнорируется.
.It Ic \&kernafter Ar font char ... afmunits ...
Усиление кернинга после некоторых символов.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&kernbefore Ar font char ... afmunits ...
Увеличивает кернинг перед некоторыми символами.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&kernpair Ar font char ... font char ... afmunits
Добавляет пару kerning в таблицу kerning.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&lc Op Ar glyph
Определяет символ повторения лидера.
В настоящее время не поддерживается.
.It Ic \&lc_ctype Ar localename
Установить
.Dv LC_CTYPE
locale.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&lds Ar macroname string
Определить локальную строку.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&length Ar register string
Подсчитывает количество вводимых символов в строке.
В настоящее время не поддерживается.
.It Ic \&letadj Ar lspmin lshmin letss lspmax lshmax
Динамический интервал между буквами и изменение их формы.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&lf Ar lineno Op Ar filename
Изменение номера строки для сообщений об ошибках.
Игнорируется из-за небезопасности.
.It Ic \&lg Op Cm 1 | 0
Включить или выключить механизм ligature.
В настоящее время игнорируется.
.It Ic \&lhang Ar font char ... afmunits
Hang characters на левом поле.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&linetabs Op Cm 1 | 0
Включить или отключить режим строчных табуляций.
Это расширение groff и в настоящее время не поддерживается.
.It Ic \&ll Op Oo Cm + Ns | Ns Cm - Oc Ns Ar width
Изменение длины выводимой строки.
Если в меню "Параметры" задано значение
.Ar width
опущен, длина строки возвращается к предыдущему значению.
По умолчанию для терминального вывода установлено значение 78n.
Если указан знак, длина строки прибавляется или вычитается;
в противном случае она устанавливается на указанное значение.
Использовать этот запрос в новых руководствах не рекомендуется по нескольким причинам,
в том числе потому, что он отменяет
.Xr mandoc 1
.Fl O Cm width
параметра командной строки.
.It Ic \&lnr Ar register Oo Cm + Ns | Ns Cm - Oc Ns Ar value Op Ar increment
Установка регистра локальных чисел.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&lnrf Ar register Oo Cm + Ns | Ns Cm - Oc Ns Ar value Op Ar increment
Установка локального регистра с плавающей точкой.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&lpfx Ar string
Установка префикса строки.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&ls Op Ar factor
Устанавливает межстрочный интервал.
Принимает один целочисленный аргумент, определяющий расстояние по вертикали между
последующих строк выводимого текста, измеряемое в единицах v.
В настоящее время игнорируется.
.It Ic \&lsm Ar macroname
Устанавливает leading spaces trap.
Это расширение groff и в настоящее время не поддерживается.
.It Ic \&lt Op Oo Cm + Ns | Ns Cm - Oc Ns Ar width
Задает длину строки заголовка.
В настоящее время игнорируется.
.It Ic \&mc Ar glyph Op Ar dist
Печать margin символа на правом margin.
.Ar dist
в настоящее время игнорируется; вместо него используется 1n.
.It Ic \&mediasize Ar media
Установка размера носителя устройства.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&minss Ar width
Устанавливает минимальное пространство для слов.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&mk Op Ar register
Отметить вертикальную позицию.
В настоящее время игнорируется.
.It Ic \&mso Ar filename
Загрузка макрофайла по пути поиска.
Игнорируется из-за небезопасности.
.It Ic \&na
Отключить регулировку без изменения режима регулировки.
В настоящее время игнорируется.
.It Ic \&ne Op Ar height
Объявить о необходимости заданного минимального вертикального пространства
перед следующей ловушкой или низом страницы.
В настоящее время игнорируется.
.It Ic \&nf
Разрыв строки вывода и переход в режим отсутствия заполнения.
Последующие строки ввода сохраняются вместе на одной строке вывода
даже при превышении правого поля,
а разрывы строк при последующем вводе вызывают разрывы строк вывода.
Этот запрос подразумевается в строке
.Xr mdoc 7
.Ic \&Bd Fl unfilled
и
.Ic \&Bd Fl литерал
макросами, а также
.Xr man 7
.Ic \&EX
макросом.
.Ic \&fi
запрос переключается обратно в режим заполнения по умолчанию.
.It Ic \&nh
Выключает режим автоматического дефисного написания.
В настоящее время игнорируется.
.It Ic \&nhychar Ar char ...
Определяет символы, запрещающие дефисное написание.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&nm Op Ar start Op Ar inc Op Ar space Op Ar indent
Выводить номера строк.
В настоящее время не поддерживается.
.It Ic \&nn Op Ar number
Временно отключить нумерацию строк.
В настоящее время не поддерживается.
.It Ic \&nop Ar body
Выполнение оставшейся части строки ввода как запроса, макроса или текстовой строки,
пропуская
.Ic \&nop
и все пробельные символы, следующие за ним.
В основном используется для отступа текстовых строк внутри макроопределений.
.It Ic \&nr Ar register Oo Cm + Ns | Ns Cm - Oc Ns Ar expression Op Ar stepsize
Определение или изменение регистра.
Регистр - это произвольное строковое значение, определяющее некоторое состояние,
которое влияет на синтаксический разбор и/или форматирование.
Для синтаксиса
.Ar expression ,
см.
.Sx Числовые выражения
ниже.
Если перед выражением стоит знак, то регистр будет
инкрементируется или декрементируется, а не присваивается.
.Pp
.Ar stepsize
используется программой
.Ic \en+
функция автоматического увеличения.
Это остается неизменным, если опущен при изменении существующего регистра,
а при определении нового регистра по умолчанию принимает значение 0.
.Pp
Следующий
.Ar register
обрабатывается особым образом:
.Bl -tag -width Ds
.It Cm nS
Если он установлен в целое положительное значение, то некоторые
.Xr mdoc 7
макросы будут вести себя так же, как и в
.Em СИНОПСИС
раздел.
Если установить значение 0, то эти макросы будут вести себя так же, как и вне раздела
.Em СИНОПСИС
даже при вызове внутри секции
.Em СИНОПСИС
самой секции.
Обратите внимание, что запуск нового
.Xr mdoc 7
с
.Ic \&Sh
сбросит этот регистр.
.El
.It Xo
.Ic \&nrf Ar register Oo Cm + Ns | Ns Cm - Oc Ns Ar expression
.Op Ar increment
.Xc
Определение или изменение регистра с плавающей точкой.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&nroff
Принудительный режим nroff.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&ns
Включить режим no-space.
В настоящее время игнорируется.
.It Ic \&nx Op Ar filename
Прервать обработку текущего входного файла и обработать другой.
Игнорируется, так как небезопасно.
.It Ic \&open Ar stream file
Открыть файл для записи.
Игнорируется из-за небезопасности.
.It Ic \&opena Ar stream file
Открыть файл для добавления.
Игнорируется из-за небезопасности.
.It Ic \&os
Вывод сохраненного вертикального пространства.
В настоящее время игнорируется.
.It Ic \&output Ar string
Вывод непосредственно на промежуточный вывод.
Не поддерживается.
.It Ic \&padj Op Cm 1 | 0
Глобальное управление выравниванием абзаца по времени.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&papersize Ar media
Установка размера бумаги.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&pc Op Ar char
Изменить символ номера страницы.
В настоящее время игнорируется.
.It Ic \&pev
Печатные среды.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&pi Ar command
Направить вывод в команду оболочки.
Игнорируется из-за небезопасности.
.It Ic \&PI
Низкоуровневый запрос, используемый
.Ic \&BP .
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&pl Op Oo Cm + Ns | Ns Cm - Oc Ns Ar height
Изменение длины страницы.
В настоящее время игнорируется.
.It Ic \&pm
Выводить имена и размеры макросов, строк и отвлекающих элементов
в стандартный вывод ошибок.
В настоящее время игнорируется.
.It Ic \&pn Oo Cm + Ns | Ns Cm - Oc Ns Ar number
Изменить номер следующей страницы.
В настоящее время игнорируется.
.It Ic \&pnr
Вывести все регистры чисел на стандартный вывод ошибок.
В настоящее время игнорируется.
.It Ic \&po Op Oo Cm + Ns | Ns Cm - Oc Ns Ar offset
Устанавливает горизонтальное смещение страницы.
Если аргумент не указан, то смещение страницы возвращается к своему
предыдущему значению.
Если указан знак, то новое смещение страницы вычисляется относительно
относительно текущего; в противном случае оно будет абсолютным.
Аргумент соответствует синтаксису
.Sx Ширина масштабирования
а единицей масштабирования по умолчанию является
.Cm m .
.It Ic \&ps Op Oo Cm + Ns | Ns Cm - Oc Ns size
Изменение размера точки.
В настоящее время игнорируется.
.It Ic \&psbb Ar filename
Получение ограничительной рамки PostScript-файла.
В настоящее время не поддерживается.
.It Ic \&pshape Ar indent length ...
Установка специальной формы для текущего абзаца.
Это расширение Heirloom и в настоящее время не поддерживается.
.It Ic \&pso Ar command
Включить вывод команды оболочки.
Игнорируется из-за небезопасности.
.It Ic \&ptr
Вывести имена и позиции всех ловушек на стандартный вывод ошибок.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&pvs Op Oo Cm + Ns | Ns Cm - Oc Ns Ar height
Изменение расстояния между post-vertical.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&rchar Ar glyph ...
Удаление определений glyph.
В настоящее время не поддерживается.
.It Ic \&rd Op Ar prompt Op Ar argument ...
Чтение из стандартного ввода.
В настоящее время игнорируется.
.It Ic \&recursionlimit Ar maxrec maxtail
Устанавливает максимальную глубину стека для рекурсивных макросов.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&return Op Ar twice
Выход из текущего выполняемого макроса и возврат к вызывающему.
Аргумент в настоящее время игнорируется.
.It Ic \&rfschar Ar font glyph ...
Удаление определений glyph обратного хода, специфичных для шрифта.
В настоящее время не поддерживается.
.It Ic \&rhang Ar font char ... afmunits
Повесить символы на правое поле.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&rj Op Ar N
Обосновать следующий
.Ar N
строк ввода до правого поля без заполнения.
.Ar N
по умолчанию равен 1.
Аргумент, равный 0 или меньше, прекращает выравнивание по правому краю.
.It Ic \&rm Ar macroname
Удаление запроса, макроса или строки.
.It Ic \&rn Ar oldname newname
Переименовать запрос, макрос, дивергенцию или строку.
В
.Xr mandoc 1 ,
макросы, определяемые пользователем,
.Xr mdoc 7
и
.Xr man 7
макросы и пользовательские строки могут быть переименованы, но переименование
предопределенных строк и
.Nm
не поддерживается, а переадресация вообще не реализована.
.It Ic \&rnn Ar oldname newname
Переименование регистра номеров.
В настоящее время не поддерживается.
.It Ic \&rr Ar register
Удалить регистр.
.It Ic \&rs
Завершить режим отсутствия пробелов.
В настоящее время игнорируется.
.It Ic \&rt Op Ar dist
Возврат в отмеченную вертикальную позицию.
В настоящее время игнорируется.
.It Ic \&schar Ar glyph Op Ar string
Определяет глобальный запасной glyph.
Это расширение groff и в настоящее время не поддерживается.
.It Ic \&sentchar Ar char ...
Определяет символы окончания предложения.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&shc Op Ar glyph
Изменить символ мягкого дефиса.
В настоящее время игнорируется.
.It Ic \&shift Op Ar number
Сдвиг аргументов макроса
.Ar number
раз, по умолчанию один раз: \e\e$i становится тем, чем было \e\e$i+число.
Также уменьшите \en(.$ на
.Ar number
.It Ic \&sizes Ar size ...
Определяет допустимые размеры точек.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&so Ar filename
Включить исходный файл.
Файл считывается и его содержимое обрабатывается как входной сигнал вместо
.Ic \&so
строки запроса.
Чтобы избежать случайного включения несвязанных файлов,
.Xr mandoc 1
принимает только относительные пути, не содержащие строк
.Qq ../
и
.Qq /... .
.Pp
Этот запрос требует
.Xr man 1
чтобы перейти в нужный каталог перед вызовом
.Xr mandoc 1 ,
по условию в корень дерева руководств.
Типичное использование выглядит следующим образом:
.Pp
.Dl \&.so man3/Xcursor.3
.Pp
Поскольку вся эта концепция довольно хрупкая, использование
.Ic \&so
не рекомендуется.
Используйте
.Xr ln 1
вместо него.
.It Ic \&sp Op Ar height
Разрывает строку вывода и выдает вертикальный пробел.
Аргумент соответствует синтаксису
.Sx Ширина масштабирования
и по умолчанию равен одной пустой строке
.Pq Li 1v .
.It Ic \&spacewidth Op Cm 1 | 0
Устанавливает ширину пробела из файла метрики шрифта.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&special Op Ar font ...
Определяет специальный шрифт.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&spreadwarn Op Ar width
Предупреждение о большом интервале между словами.
В настоящее время игнорируется.
.It Ic \&ss Ar wordspace Op Ar sentencespace
Установка размера символов пробела.
В настоящее время игнорируется.
.It Ic \&sty Ar position style
Ассоциировать стиль с позицией шрифта.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&substring Ar stringname startpos Op Ar endpos
Замена пользовательской строки на подстроку.
В настоящее время не поддерживается.
.It Ic \&sv Op Ar height
Экономия вертикального пространства.
В настоящее время игнорируется.
.It Ic \&sy Ar command
Выполнить команду оболочки.
Игнорируется из-за небезопасности.
.It Ic \&T&
Повторный запуск макета таблицы с сохранением опций предыдущего вызова таблицы
вызова.
См.
.Ic \&TS .
.It Ic \&ta Op Ar width ... Op Cm T Ar width ...
Установка ограничителей табуляции.
.Ar width .
аргумент соответствует синтаксису
.Sx Ширина масштабирования
Если перед аргументом стоит знак плюс, то он относится к предыдущей остановке табуляции.
Аргументы после
.Cm T
.It Ic \&tkf Ar font minps width1 maxps width2
используются многократно и так часто, как это необходимо; при каждом повторном использовании
они берутся относительно последней ранее установленной остановки табуляции.
Когда
.Ic \&ta
вызывается без аргументов, все ограничители табуляции очищаются.
.It Ic \&tc Op Ar glyph
Изменение символа повторения табуляции.
В настоящее время не поддерживается.
.It Ic \&TE
Завершить контекст таблицы.
См.
.Ic \&TS .
.It Ic \&ti Oo Cm + Ns | Ns Cm - Oc Ns Ar width
Разрыв строки вывода и отступ следующей строки вывода на
.Ar width .
Если указан знак, временной отступ вычисляется
относительно текущего отступа; в противном случае он будет абсолютным.
Синтаксис аргумента соответствует синтаксису
.Sx Ширина масштабирования
а единицей масштабирования по умолчанию является
.Cm m .
.It Ic \&tkf Ar font minps width1 maxps width2
Включает track kerning для шрифта.
В настоящее время игнорируется.
.It Ic \&tl No \& Ap Ar left Ap Ar center Ap Ar right Ap
Печать строки заголовка.
В настоящее время не поддерживается.
.It Ic \&tm Ar string
Печать в стандартный вывод ошибок.
В настоящее время игнорируется.
.It Ic \&tm1 Ar string
Печать в стандартный вывод ошибок с разрешением ведущих пробелов.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&tmc Ar string
Печать в стандартный вывод ошибок без завершающей новой строки.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&tr Ar glyph glyph ...
Вывод перевода символов.
Первый glyph в каждой паре заменяется вторым.
Можно использовать экранирование символов; например,
.Pp
.Dl tr \e(xx\e(yy
.Pp
заменяет все вызовы \e(xx на \e(yy.
.It Ic \&track Ar font minps width1 maxps width2
Статическое отслеживание пробелов между буквами.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&transchar Ar char ...
Определяет прозрачные символы для завершения предложений.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&trf Ar filename
Вывести содержимое файла, не допуская недопустимых символов.
Это расширение groff и игнорируется из-за небезопасности.
.It Ic \&trimat Ar left top width height
Устанавливает параметр страницы TrimBox для генерации PDF.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&trin Ar glyph glyph ...
Перевод выходных символов, игнорируется
.Ic \&asciify .
В настоящее время не поддерживается.
.It Ic \&trnt Ar glyph glyph ...
Перевод выходного символа, игнорируется \e!
В настоящее время не поддерживается.
.It Ic \&troff
Принудительное использование режима troff.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&TS
Начать таблицу, которая форматирует ввод в выровненные строки и столбцы.
См.
.Xr tbl 7
для описания языка tbl.
.It Ic \&uf Ar font
Глобальная установка шрифта подчеркивания.
В настоящее время игнорируется.
.It Ic \&ul Op Ar N
Подчеркивание следующее
.Ar N
строк ввода.
В настоящее время игнорируется.
.It Ic \&unformat Ar divname
Снимает форматирование пробелов и табуляции в диве.
В настоящее время не поддерживается.
.It Ic \&unwatch Ar macroname
Отключение уведомления о строке или макросе.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&unwatchn Ar register
Отключить уведомление для регистра.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&vpt Op Cm 1 | 0
Включить или отключить vertical position traps.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&vs Op Oo Cm + Ns | Ns Cm - Oc Ns Ar height
Изменение вертикального интервала.
В настоящее время игнорируется.
.It Ic \&warn Ar flags
Установить уровень предупреждения.
В настоящее время игнорируется.
.It Ic \&warnscale Ar si
Устанавливает индикатор масштаба, используемый в предупреждениях.
Это расширение groff и в настоящее время игнорируется.
.It Ic \&watch Ar macroname
Уведомлять об изменении строки или макроса.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&watchlength Ar maxlength
При изменении сообщать о содержимом макросов и строк
до указанной длины.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&watchlength Ar register
Уведомляет об изменении регистра.
Это расширение Heirloom и в настоящее время игнорируется.
.It Ic \&wh Ar dist Op Ar macroname
Устанавливает ловушку расположения страницы.
В настоящее время не поддерживается.
.It Ic \&while Ar condition body
Повторное выполнение при выполнении
.Ar condition
является истинным, с синтаксисом, аналогичным
.Ic \&if .
В настоящее время реализовано с двумя ограничениями: не может быть вложенным,
и каждый цикл должен начинаться и заканчиваться в одной и той же области видимости.
.It Ic \&write Oo \(dq Oc Ns Ar string
Запись в открытый файл.
Игнорируется, так как небезопасно.
.It Ic \&writec Oo \(dq Oc Ns Ar string
Запись в открытый файл без добавления новой строки.
Игнорируется из-за небезопасности.
.It Ic \&writem Ar macroname
Запись макроса или строки в открытый файл.
Игнорируется из-за небезопасности.
.It Ic \&xflag Ar level
Установить уровень расширения.
Это расширение Heirloom и в настоящее время игнорируется.
.El
.Ss Числовые выражения
.Ic \&nr ,
.Ic \&if ,
и
.Ic \&ie
принимают в качестве аргументов целочисленные числовые выражения.
Они всегда оцениваются с помощью C
.Vt int
тип; целочисленное переполнение работает так же, как и в языке C.
Числа состоят из произвольного количества цифр
.Sq 0
до
.Sq 9
перед которыми ставится необязательный знак
.Sq +
или
.Sq - .
За каждым числом может следовать одна необязательная единица масштабирования, описанная ниже
.Sx Ширина масштабирования .
При этом действуют следующие уравнения:
.Bd -literal -offset indent
1i = 6v = 6P = 10m = 10n = 72p = 1000M = 240u = 240
254c = 100i = 24000u = 24000
1f = 65536u = 65536
.Ed
.Pp
Реализованы следующие двоичные операторы.
Если не указано иное, они ведут себя так же, как в языке C:
.Pp
.Bl -tag -width 2n -compact
.It Ic +
сложение
.It Ic -
вычитание
.It Ic *
умножение
.It Ic /
деление
.It Ic %
остаток от деления
.It Ic <
меньше чем
.It Ic >
больше
.It Ic ==
равный
.It Ic =
равно, тот же эффект, что и
.Ic ==
(отличается от C)
.It Ic <=
меньше или равно
.It Ic >=
больше или равно
.It Ic <>
не равно (соответствует C
.Ic != ;
Этот вариант имеет ограниченную переносимость, он поддерживается Heirloom roff,
но не groff)
.It Ic &
логическое и (соответствует C
.Ic && )
.It Ic \&:
логическое или (соответствует C
.Ic || )
.It Ic <?
минимальное (отсутствует в C)
.It Ic >?
максимум (недоступно в C)
.El
.Pp
Понятие старшинства отсутствует; оценка выполняется слева направо,
за исключением случаев, когда подвыражения заключены в круглые скобки.
Внутри круглых скобок пробельные символы игнорируются.
.Sh ССЫЛКА НА ESCAPE-ПОСЛЕДОВАТЕЛЬНОСТЬ
.Xr mandoc 1
.Nm
распознает следующие экранирующие последовательности.
В
.Xr mdoc 7
и
.Xr man 7
не рекомендуется использовать управляющие последовательности, за исключением тех, которые
описанных в
.Sh ССЫЛКА НА ESCAPE-ПОСЛЕДОВАТЕЛЬНОСТЬ
.Pp
Обратная косая черта, за которой следует любой символ, не перечисленный здесь
просто печатает сам этот символ.
.Bl -tag -width Ds
.It Ic \e<newline>
Обратная косая черта в конце строки ввода может быть использована для продолжения
логической строки ввода на следующую физическую строку ввода, соединяя текст
на обеих строках, как если бы он был на одной строке ввода.
.It Ic \e<space>
Экранирующая последовательность backslash-space
.Pq Sq \e\ \e\ \&
это символ неразрывного пробела размером с пробел; см.
.Sx Пробелы
и
.Xr mandoc_char 7 .
.It Ic \e!
Встраивает текст до конца строки ввода включительно в
текущий отвод или в промежуточный вывод без интерпретации
запросов, макросов и escapes.
В настоящее время не поддерживается.
.It Ic \e\(dq
Оставшаяся часть входной строки обрабатывается как
.Sx Комментарии .
.It Ic \e#
Продолжение строки с комментарием.
Отбросьте остаток физической строки ввода и продолжите логическую
логическую строку ввода на следующей физической строке ввода, соединяя текст на
соединяя текст на обеих строках, как если бы он был на одной строке ввода.
Это расширение groff.
.It Ic \e$ Ns Ar arg
Расширение аргумента макроса, см.
.Ic \&de .
.It Ic \e%
Дефис разрешен в этой точке слова; игнорируется
.Xr mandoc 1 .
.It Ic \e&
Непечатаемый символ нулевой ширины,
часто используется для различных видов экранирования; см.
.Sx Пробелы ,
.Xr mandoc_char 7 ,
и
.Dq СИНТАКСИС МАКРОСОВ
и
.Dq Разделители
разделы в
.Xr mdoc 7 .
.It Ic \e\(aq
Специальный символ острого ударения; используйте
.Ic \e(aa
вместо него.
.It Ic \e( Ns Ar cc
.Sx Специальные символы
с двухбуквенными именами, см.
.Xr mandoc_char 7 .
.It Ic \e)
Пробел нулевой ширины, прозрачный для определения конца предложения;
игнорируется
.Xr mandoc 1 .
.It Ic \e*[ Ns Ar name Ns Ic \&]
Интерполировать строку с
.Ar name .
Для коротких имен существуют варианты
.Ic \e* Ns Ar c
и
.Ic \e*( Ns Ar cc .
.Pp
Одна строка предопределена в
.Nm
языкового уровня:
.Ic \e*(.T
Расширяется до имени устройства вывода,
например, ascii, utf8, ps, pdf, html или markdown.
.Pp
Наборы макросов традиционно предопределяют дополнительные строки, которые не являются
не переносимы и различаются в разных реализациях.
Те, которые поддерживаются
.Xr mandoc 1
перечислены в
.Xr mandoc_char 7 .
.Pp
Строки могут быть определены, изменены и удалены с помощью команды
.Ic \&ds ,
.Ic \&as ,
и
.Ic \&rm
запросами.
.It Ic \e,
Коррекция левого курсива (расширение groff); игнорируется запросами
.Xr mandoc 1 .
.It Ic \e-
Специальный символ
.Dq математический знак минус;
см.
.Xr mandoc_char 7
для подробностей.
.It Ic \e/
коррекция правого курсива (расширение groff); игнорируется
.Xr mandoc 1 .
.It Ic \e:
Разрыв строки разрешен в этой точке слова
без вставки дефиса.
.It Ic \e?
Встраивать текст до следующего
.Ic \e?
в текущий отвод без интерпретации запросов, макросов,
и эскейпов.
Это расширение groff и в настоящее время не поддерживается.
.It Ic \e[ Ns Ar name Ns Ic \&]
.Sx Специальные символы
с именами произвольной длины, см.
.Xr mandoc_char 7 .
.It Ic \e^
Двенадцатый эм полуузкий пробельный символ, фактически нулевой ширины в
.Xr mandoc 1 .
.It Ic \e_
Специальный символ подчеркивания; используется
.Ic \e(ul
вместо него.
.It Ic \e`
Специальный символ могильного ударения; используйте
.Ic \e(ga
вместо него.
.It Ic \e{
Начало условного ввода; см.
.Ic \&if .
.It Ic \e\(ba
Символ с узким пробелом в одну шестую em, фактически нулевой ширины в
.Xr mandoc 1 .
.It Ic \e}
Конец условного ввода; см.
.Ic \&if .
.It Ic \e~
Символ неразрывного пробела.
.It Ic \e0
Символ пробела шириной в цифру.
.It Ic \eA\(aq Ns Ar string Ns Ic \(aq
Определение якоря; игнорируется
.Xr mandoc 1 .
.It Ic \ea
Ведущий символ; игнорируется
.Xr mandoc 1 .
.It Ic \eB\(aq Ns Ar string Ns Ic \(aq
Интерполировать
.Sq 1
если
.Ar string
соответствует синтаксису
.Sx Числовые выражения
описанному выше, или
.Sq 0
иначе.
.It Ic \eb\(aq Ns Ar string Ns Ic \(aq
Функция построения скобок; игнорируется
.Xr mandoc 1 .
.It Ic \eC\(aq Ns Ar имя Ns Ic \(aq
.Sx Специальные символы
с именами произвольной длины.
.It Ic \ec
Встречается в конце строки вводимого текста,
следующая строка текста считается продолжением этой строки,
даже если между ними есть строки запроса или макроса.
Пробельные символы не вставляются.
.It Ic \eD\(aq Ns Ar string Ns Ic \(aq
Функция рисования графики; игнорируется
.Xr mandoc 1 .
.It Ic \ed
Перемещение вниз на половину строки; игнорируется
.Xr mandoc 1 .
.It Ic \eE
Символ Escape, который не должен интерпретироваться в режиме копирования.
В
.Xr mandoc 1 ,
в настоящее время он выполняет те же функции, что и
.Ic \e
сам по себе.
.It Ic \ee
Специальный символ обратной косой черты.
.It Ic \eF[ Ns Ar name Ns Ic \&]
Переключение семейства шрифтов (расширение groff); игнорируется
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \eF Ns Ar c
и
.Ic \eF( Ns Ar cc .
.It Ic \ef[ Ns Ar name Ns Ic \&]
Переключитесь на шрифт
.Ar name ,
см.
.Sx Выбор шрифта.
Для коротких имен существуют варианты
.Ic \ef Ns Ar c
и
.Ic \ef( Ns Ar cc .
Пустое имя
.Ic \ef[]
по умолчанию принимает значение
.Ic \efP .
.It Ic \eg[ Ns Ar name Ns Ic \&]
Интерполирует формат регистра чисел; игнорируется
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \eg Ns Ar c
и
.Ic \eg( Ns Ar cc .
.It Ic \eH\(aq Ns Oo +|- Oc Ns Ar number Ns Ic \(aq
Установить высоту текущего шрифта; игнорируется
.Xr mandoc 1 .
.It Ic \eh\(aq Ns Oo Cm \&| Oc Ns Ar ширина Ns Ic \(aq
Горизонтальное движение.
Если задана вертикальная полоса, движение осуществляется относительно текущего
отступа.
В противном случае - относительно текущей позиции.
Единицей масштабирования по умолчанию является
.Cm m .
.It Ic \ek[ Ns Ar name Ns Ic \&]
Отметка места горизонтального ввода в регистре; игнорируется
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \ek Ns Ar c
и
.Ic \ek( Ns Ar cc .
.It Ic \eL\(aq Ns Ar number Ns Oo Ar c Oc Ns Ic \(aq
Функция рисования вертикальных линий; игнорируется
.Xr mandoc 1 .
.It Ic \el\(aq Ns Ar ширина Ns Oo Ar c Oc Ns Ic \(aq
Нарисовать горизонтальную линию шириной
.Ar width
используя глиф
.Ar c .
.It Ic \eM[ Ns Ar name Ns Ic \&]
Установка цвета заливки (фона) (расширение groff); игнорируется
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \eM Ns Ar c
и
.Ic \eM( Ns Ar cc .
.It Ic \em[ Ns Ar name Ns Ic \&]
Установка цвета рисунка глифа (расширение groff); игнорируется
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \em Ns Ar c
и
.Ic \em( Ns Ar cc .
.It Ic \eN\(aq Ns Ar число Ns Ic \(aq
Характер
.Ar number
на текущем шрифте.
.It Ic \en Ns Oo +|- Oc Ns Ic \&[ Ns Ar имя Ns Ic \&]
Интерполировать регистр номера
.Ar name .
Для коротких имен существуют варианты
.Ic \en Ns Ar c
и
.Ic \en( Ns Ar cc .
Если указан необязательный знак,
регистр сначала увеличивается или уменьшается на величину
.Ar stepsize
который был указан в соответствующем
.Ic \&nr
и измененное значение интерполируется.
.It Ic \eO Ns Ar digit , Ic \eO[5 Ns аргументов Ns Ic \&]
Подавление вывода.
Это расширение groff и в настоящее время не поддерживается.
С аргументом
.Ic 1 , 2 , 3 ,
или
.Ic 4 ,
он игнорируется.
.It Ic \eo\(aq Ns Ar string Ns Ic \(aq
Перечеркивание, запись всех символов, содержащихся в строке
.Ar string
в одну и ту же позицию вывода.
В режимах вывода терминала и HTML,
будет виден только последний из символов.
.It Ic \ep
Прерывает строку вывода в конце текущего слова.
.It Ic \eR\(aq Ns Ar name Oo +|- Oc Ns Ar number Ns Ic \(aq
Установить регистр номера; игнорируется
.Xr mandoc 1 .
.It Ic \er
Перемещение на одну строку вверх; игнорируется
.Xr mandoc 1 .
.It Ic \eS\(aq Ns Ar number Ns Ic \(aq
Наклонный вывод; игнорируется
.Xr mandoc 1 .
.It Ic \es\(aq Ns Oo +|- Oc Ns Ar number Ns Ic \(aq
Изменить размер точки; игнорируется
.Xr mandoc 1 .
Альтернативные формы
.Ic \es Ns Oo +|- Oc Ns Ar n ,
.Ic \es Ns Oo +|- Oc Ns Ic \(aq Ns Ar number Ns Ic \(aq ,
.Ic \es[ Ns Oo +|- Oc Ns Ar number Ns Ic \&] ,
и
.Ic \es Ns Oo +|- Oc Ns Ic \&[ Ns Ar number Ns Ic \&]
также разбираются и игнорируются.
.It Ic \et
Горизонтальная табуляция; игнорируется
.Xr mandoc 1 .
.It Ic \eu
Переместиться на полстроки вверх; игнорируется
.Xr mandoc 1 .
.It Ic \eV[ Ns Ar name Ns Ic \&]
Интерполировать переменную окружения; игнорируется
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \eV Ns Ar c
и
.Ic \eV( Ns Ar cc .
.It Ic \ev\(aq Ns Ar number Ns Ic \(aq
Вертикальное движение; игнорируется
.Xr mandoc 1 .
.It Ic \ew\(aq Ns Ar string Ns Ic \(aq
Интерполировать ширину
.Ar string .
.Xr mandoc 1
предполагает, что после расширения пользовательских строк, строка
.Ar string .
содержит только обычные символы, без управляющих последовательностей, и что каждый символ
символ имеет ширину 24 базовые единицы.
.It Ic \eX\(aq Ns Ar string Ns Ic \(aq
Выход
.Ar string .
как функция управления устройством; игнорируется в режиме nroff и при
.Xr mandoc 1 .
.It Ic \ev\(aq Ns Ar number Ns Ic \(aq
Функция дополнительного пробела в строке; игнорируется
.Xr mandoc 1 .
.It Ic \eY[ Ns Ar name Ns Ic \&]
Вывод строки в качестве функции управления устройством; игнорируется в режиме nroff и программой
.Xr mandoc 1 .
Для коротких имен существуют варианты
.Ic \eY Ns Ar c
и
.Ic \eY( Ns Ar cc .
.It Ic \eZ\(aq Ns Ar string Ns Ic \(aq
Печать
.Ar string
с нулевой шириной и высотой; игнорируется
.Xr mandoc 1 .
.It Ic \ez
Вывод следующего символа без перемещения позиции курсора.
.El
.Sh СОВМЕСТИМОСТЬ
.Xr mandoc 1
реализация
.Nm
является неполной.
К основным нереализованным функциям относятся:
.Pp
.Bl -dash -compact
.It
По соображениям безопасности,
.Xr mandoc 1
никогда не читает и не записывает внешние файлы, кроме как через
.Ic \&so
запросы с безопасными относительными путями.
.It
Отсутствует автоматическое выделение дефисов, нет настройки правого поля,
и очень ограниченная поддержка центрирования; вывод всегда устанавливается заподлицо с левым краем.
.It
Отсутствует поддержка установки табулятора и ведущих символов,
и поддержка ручного изменения отступа ограничена.
.It
.Sq u
является единицей масштабирования по умолчанию.
В традиционных системах troff эта единица изменяется в зависимости от
носителя вывода.
.It
Измерения ширины реализованы грубым способом
и часто дают неверные результаты.
Поддержка явных запросов на перемещение и экранирование ограничена.
.It
Отсутствует концепция страниц вывода, нет поддержки поплавков,
рисования графики и включения картинок;
терминальный вывод всегда непрерывный.
.It
Запросы, касающиеся цвета, семейства шрифтов, размера шрифтов,
и манипуляций с глифами игнорируются.
Поддержка шрифтов очень ограничена.
Кернинг не реализован, лигатуры не создаются.
.It
.Qq \(aq
не подавляет разрывы строк.
.It
Не реализованы диверсии и окружения,
а поддержка ловушек очень неполна.
.It
Использование макросов не поддерживается внутри
.Xr tbl 7
код.
.El
.Pp
Специальная семантика
.Cm nS
регистра чисел является идиосинкразией
.Ox
и не поддерживается другими руководствами.
.Xr mdoc 7
реализациями.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr mandoc 1 ,
.Xr eqn 7 ,
.Xr man 7 ,
.Xr mandoc_char 7 ,
.Xr mdoc 7 ,
.Xr tbl 7
.Rs
.%A Joseph F. Ossanna
.%A Brian W. Kernighan
.%I AT&T Bell Laboratories
.%T Troff User's Manual
.%R Технический отчет по вычислительной технике
.%N 54
.%C Murray Hill, New Jersey
.%D 1976 and 1992
.%U http://www.kohala.com/start/troff/cstr54.ps
.Re
.Rs
.%A Joseph F. Ossanna
.%A Brian W. Kernighan
.%A Gunnar Ritter
.%T Heirloom Documentation Tools Nroff/Troff User's Manual
.%D September 17, 2007
.%U http://heirloom.sourceforge.net/doctools/troff.pdf
.Re
.Sh ИСТОРИЯ
Система набора RUNOFF, чьи исходные данные легли в основу
.Nm ,
была написана на языках MAD и FAP для операционной системы CTSS Джеромом Е.
Зальтцером в 1964 году.
Doug McIlroy переписал ее на BCPL в 1969 году, переименовав ее в
.Nm .
Dennis M. Ritchie переписал версию McIlroy's
.Nm
на ассемблере PDP-11 для
.At v1 ,
Joseph F. Ossanna  улучшил roff и переименовал его в nroff
для
.At v2 ,
затем портировал nroff на C как troff, который БBrian W. Kernighan выпустил в версии
.At v7 .
В 1989 году James Clark повторно реализовал troff на C++, назвав его groff.
.Sh АВТОРЫ
.An -nosplit
Это
.Nm
была написана
.An Kristaps Dzonsons Aq Mt kristaps@bsd.lv
и
.An Ingo Schwarze Aq Mt schwarze@openbsd.org .