melkorbsd/ru-freebsd-man/man7/sdoc.7
.\" Copyright (c) 2001, 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The names of the authors may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: sec-doc.7,v 1.7 2001/12/22 00:14:12 rwatson Exp$
.\"
.Dd September 5, 2005
.Dt SDOC 7
.Os
.Sh ИМЯ
.Nm sdoc
.Nd руководство по добавлению разделов о мерах безопасности на страницы руководства
.Sh ОПИСАНИЕ
В этом документе представлены рекомендации по
добавлению разделов о мерах безопасности на страницы руководства.
В нем приведены два типичных примера.
.Pp
Рекомендации по написанию страниц руководства
.Fx
в мандате
.Xr groff_mdoc 7 ,
каждая страница руководства, описывающая ту или иную функцию системы
.Fx
должна содержать раздел соображения безопасности,
в котором описывается, какие требования безопасности могут быть нарушены
при неправильном использовании этой функции.
При написании этих разделов авторы должны стремиться
найти золотую середину между двумя противоречивыми целями:
краткость и полнота.
С одной стороны, разделы, посвященные вопросам безопасности, не должны быть слишком подробными,
иначе занятых читателей можно будет отговорить от их чтения.
С другой стороны, разделы, посвященные вопросам безопасности, не должны быть неполными,
иначе они не справятся со своей задачей - проинструктировать читателя о том, как избежать любого небезопасного использования.
В этом документе приведены рекомендации по обеспечению баланса между краткостью и полнотой
в разделе, посвященном безопасности, для данной функции системы
.Fx .
.Ss Where to Start
Начните с перечисления
общих требований безопасности, которые могут быть нарушены
при неправильном использовании функции.
Существует четыре класса требований безопасности:
.Bl -hang -offset indent
.It Em integrity
(пример: лицам, не являющимся администраторами, не следует изменять системные двоичные файлы),
.It Em confidentiality
(пример: лицам, не являющимся администраторами, не следует просматривать файл теневых паролей),
.It Em availability
(пример: веб-сервер должен своевременно отвечать на запросы клиентов), и
.It Em correctness
(пример: программа ps должна предоставлять именно те функциональные возможности,
которые описаны в ее документации, - ни больше, ни меньше.)
.El
.Pp
В разделе Рекомендации по обеспечению безопасности следует пояснять, как можно неправильно использовать функцию
для нарушения каждого общего требования безопасности из списка.
Каждое объяснение должно сопровождаться инструкциями,
которым читатель должен следовать, чтобы избежать нарушения.
При обращении к потенциальным уязвимостям,
описанным на странице руководства по безопасному программированию,
.Xr sprog 7 ,
аналогичным образом, делайте перекрестные ссылки на этот документ,
а не воспроизводите информацию.
По возможности, ссылайтесь на этот документ,
а не на содержащийся в нем материал.
.Ss Where to Stop
Проблемы безопасности часто взаимосвязаны;
отдельные проблемы часто имеют далеко идущие последствия.
Например, корректность работы практически любой динамически компонуемой программы
зависит от правильной реализации и конфигурации
средства компоновки во время выполнения.
Корректность этой программы, в свою очередь,
зависит от корректности ее библиотек,
компилятора, использованного для ее сборки,
корректности предыдущего компилятора, который использовался для сборки этого компилятора,
и так далее,
как описано Томпсоном (смотрите раздел
.Sx СМОТРИТЕ ТАКЖЕ ,
ниже).
.Pp
В целях краткости в разделах, посвященных вопросам безопасности,
следует описывать только те вопросы, которые непосредственно связаны с функцией,
являющейся предметом данной страницы руководства.
Обратитесь к другим страницам руководства,
а не дублируйте материал, найденный там.
.Sh ПРИМЕРЫ
Разделы, посвященные соображениям безопасности, для большинства отдельных функций можно использовать
в соответствии с этой простой формулой:
.Pp
.Bl -enum -offset indent -compact
.It
Приведите одно или два предложения, описывающие каждую потенциальную
проблему безопасности.
.It
Приведите одно или два предложения, описывающие, как избежать каждой потенциальной
проблемы безопасности.
.It
Приведите краткий пример в коде.
.El
.Pp
Это пример раздела, посвященного соображениям безопасности, на странице руководства
.Xr strcpy 3 :
.Pp
Функцию
.Fn strcpy
легко использовать не по назначению, что позволяет злоумышленникам произвольно
изменять функциональность запущенной программы
с помощью атаки на переполнение буфера.
.Pp
Избегайте использования
.Fn strcpy .
Вместо этого используйте
.Fn strncpy
и убедитесь, что в целевой буфер не копируется больше символов,
чем он может вместить.
Не забудьте обнулить целевой буфер,
так как
.Fn strncpy
не завершит работу строки назначения, если она будет усечена.
.Pp
Обратите внимание, что
.Fn strncpy
также это может быть проблематично.
Возможно, усечение строки вообще связано с соображениями безопасности.
Поскольку усеченная строка не будет такой длинной, как исходная,
она может ссылаться на совершенно другой ресурс,
и использование усеченного ресурса
может привести к очень некорректному поведению.
Пример:
.Bd -literal
void
foo(const char *arbitrary_string)
{
	char onstack[8];

#if defined(BAD)
	/*
	 * This first strcpy is bad behavior.  Do not use strcpy()!
	 */
	(void)strcpy(onstack, arbitrary_string);     /* BAD! */
#elif defined(BETTER)
	/*
	 * The following two lines demonstrate better use of
	 * strncpy().
	 */
	(void)strncpy(onstack, arbitrary_string, sizeof(onstack) - 1);
	onstack[sizeof(onstack - 1)] = '\\0';
#elif defined(BEST)
	/*
	 * These lines are even more robust due to testing for
	 * truncation.
	 */
	if (strlen(arbitrary_string) + 1 > sizeof(onstack))
		err(1, "onstack would be truncated");
	(void)strncpy(onstack, arbitrary_string, sizeof(onstack));
#endif
}
.Ed
.Pp
Разделы, посвященные инструментам и командам, посвященным соображениям безопасности,
обычно не содержат шаблонов.
Пусть ваш список требований безопасности, которые могут быть нарушены,
послужит вам ориентиром;
объясните каждое из них и перечислите решения в максимально сжатой форме.
.Pp
Это пример раздела, посвященного соображениям безопасности, на странице руководства
.Xr rtld 1 :
.Pp
Используя переменные среды LD_LIBRARY_PATH и LD_PRELOAD,
злоумышленники могут заставить динамический компоновщик
подключать совместно используемые библиотеки собственного изобретения
к адресному пространству процессов, выполняющих программы с неустановленным идентификатором пользователя/группы.
Эти совместно используемые библиотеки могут произвольно изменять функциональность
программы, заменяя вызовы стандартных библиотечных функций
вызовами своих собственных.
Хотя эта функция отключена для программ set-user-ID и set-group-ID,
ее все равно можно использовать для создания троянских программ в других программах.
.Pp
Все пользователи должны знать, что корректная работа
динамически подключаемых программ, в которых не задан идентификатор пользователя/идентификатор группы, зависит от правильной
настройки этих переменных среды,
и стараться избегать действий, которые могут привести к установлению для них значений,
которые могут привести к связыванию компоновщика во время
выполнения с общими библиотеками других программ. неизвестная родословная.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr groff_mdoc 7 ,
.Xr security 7 ,
.Xr sprog 7
.Rs
.%A "Эдвард Аморозо, AT&T Bell Laboratories"
.%B "Основы технологии компьютерной безопасности"
.%I "P T R Прентис Холл"
.%D "1994"
.Re
.Rs
.%A "Кен Томпсон"
.%T "Размышления о доверии"
.%J "Communications of the ACM"
.%I "Association for Computing Machinery, Inc."
.%P "761-763"
.%N "Vol. 27, No. 8"
.%D "Август, 1984"
.Re
.Sh ИСТОРИЯ
Страница руководства
.Nm
впервые появилась в
.Fx 5.0 .
.Sh АВТОРЫ
.An Тим Фрейзер Aq Mt tfraser@tislabs.com ,
Проект NAI Labs CBOSS
.An Брайан Фельдман Aq Mt bfeldman@tislabs.com ,
Проект NAI Labs CBOSS
