melkorbsd/ru-freebsd-man/man7/stats.7
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2020 Daniel Ebdrup Jensen
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 22, 2021
.Dt STATS 7
.Os
.Sh ИМЯ
.Nm stats
.Nd информация о различных статистических утилитах
.Sh ОПИСАНИЕ
Пользовательское пространство
.Fx
частично содержит ряд утилит, которые можно использовать
для определения состояния системы во время выполнения и, при необходимости, из основных файлов.
.Sh КОМАНДЫ
Следующие команды,
.Pq отсортированные в алфавитном порядке , 
в настоящее время включены в базовую систему, и периодически появляются новые.
.Bl -tag -width "zpool iostat"
.It Nm btsockstat
Отображение информации о разъеме Bluetooth
.It Nm ctlstat
Утилита статистики целевого слоя CAM
.It Nm dwatch
Наблюдайте за процессами, когда они запускают определенный тест DTrace
.It Nm fstat
Идентификация активных файлов
.It Nm gstat
Печать статистики о дисках GEOM
.It Nm ibstat
Отображение информации из драйвера InfiniBand
.It Nm ifmcstat
Вывод статистики управления группами многоадресной рассылки для каждого интерфейса
.It Nm iostat
Отчет о статистике ввода-вывода подсистемы ядра
.It Nm ipfstat
Отображение статистики фильтрации IPF-пакетов и списка фильтров
.It Nm kldstat
Отображение состояния динамического компоновщика ядра
.It Nm lockstat
Отчет о блокировке ядра и статистике профилирования
.It Nm mailstats
Отображение почтовой статистики
.It Nm netstat
Отображение состояния сети и статистики
.It Nm nfsstat
Отображение статистики NFS
.It Nm plockstat
Отслеживание статистики блокировок pthread с помощью DTrace
.It Nm pmcstat
Измерение производительности с помощью аппаратного обеспечения для мониторинга производительности
.It Nm procstat
Получите подробную информацию о процессе
.It Nm pstat
Структуры данных системы отображения
.It Nm sockstat
Список открытых сокетов
.It Nm stat
Отображение состояния файла
.It Nm systat
Отоюражение статистики системы
.It Nm vmstat
Отчет о статистике виртуальной памяти
.It Nm zpool iostat
Отчет о статистике ввода-вывода ZFS
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr btsockstat 1 ,
.Xr dwatch 1 ,
.Xr fstat 1 ,
.Xr intro 1 ,
.Xr lockstat 1 ,
.Xr netstat 1 ,
.Xr plockstat 1 ,
.Xr procstat 1 ,
.Xr sockstat 1 ,
.Xr stat 1 ,
.Xr systat 1 ,
.Xr intro 7 ,
.Xr ctlstat 8 ,
.Xr gstat 8 ,
.Xr ibstat 8 ,
.Xr ifmcstat 8 ,
.Xr intro 8 ,
.Xr iostat 8 ,
.Xr ipfstat 8 ,
.Xr kldstat 8 ,
.Xr mailstats 8 ,
.Xr pmcstat 8 ,
.Xr pstat 8 ,
.Xr vmstat 8 ,
.Xr zpool 8
.Sh ИСТОРИЯ
Страница руководства
.Nm
впервые появилась в
.Fx 13.0 .
.Sh АВТОРЫ
.An Даниэль Эбдруп Йенсен Aq Mt debdrup@FreeBSD.org
