melkorbsd/ru-freebsd-man/man7/stdint.7
.\" Copyright (c) 2002 Mike Barcroft <mike@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 15, 2002
.Dt STDINT 7
.Os
.Sh ИМЯ
.Nm stdint
.Nd "стандартные целочисленные типы"
.Sh СИНТАКСИС
.In stdint.h
.Sh ОПИСАНИЕ
Заголовок
.In stdint.h
предоставляет переносимые из исходного кода целочисленные типы определенного
размера, наименьший объем памяти при минимальном размере, максимальную скорость
доступа при минимальном размере, наибольший размер целого числа и
типы, способные хранить указатели.
.Pp
Типы
.Vt int8_t ,
.Vt int16_t ,
.Vt int32_t ,
и
.Vt int64_t
предоставляют тип целого числа со знаком шириной 8, 16, 32 или 64 бита соответственно.
Типы
.Vt uint8_t ,
.Vt uint16_t ,
.Vt uint32_t ,
и
.Vt uint64_t
предоставляют тип целого числа без знака шириной 8, 16, 32 или 64 бита соответственно.
Эти целочисленные типы следует использовать, когда требуется определенный размер.
.Pp
Типы
.Vt int_fast8_t ,
.Vt int_fast16_t ,
.Vt int_fast32_t ,
и
.Vt int_fast64_t
предоставляют самый быстрый тип целого числа со знаком шириной
не менее 8, 16, 32 или 64 бит соответственно.
Типы
.Vt uint_fast8_t ,
.Vt uint_fast16_t ,
.Vt uint_fast32_t ,
и
.Vt uint_fast64_t
предоставляют самый быстрый тип целого числа без знака шириной
не менее 8, 16, 32 или 64 бит соответственно.
Эти типы следует использовать, когда скорость доступа имеет
первостепенное значение и когда не требуется определенный размер.
.Pp
Типы
.Vt int_least8_t ,
.Vt int_least16_t ,
.Vt int_least32_t ,
и
.Vt int_least64_t
предоставляют целочисленный тип со знаком, занимающий наименьший объем памяти,
шириной не менее 8, 16, 32 или 64 бит соответственно.
Типы
.Vt uint_least8_t ,
.Vt uint_least16_t ,
.Vt uint_least32_t ,
и
.Vt uint_least64_t
предоставляют тип беззнакового целого числа с наименьшим объемом занимаемой памяти
шириной не менее 8, 16, 32 или 64 бит соответственно.
Эти типы следует использовать, когда требуется объем памяти
и когда не требуется определенный размер.
.Pp
Тип
.Vt intmax_t
предоставляет тип целого числа со знаком,
достаточно большой для хранения любого другого целого числа со знаком.
Тип
.Vt uintmax_t
предоставляет тип unsigned integer,
достаточный для хранения любого другого целого числа без знака.
Эти типы, как правило, являются самыми большими
типами целых чисел со знаком и без знака, доступными для конкретной архитектуры.
.Pp
Тип
.Vt intptr_t
предоставляет тип целого числа со знаком, который может содержать указатель на
.Vt void ,
который позже может быть преобразован обратно в указатель на
.Vt void .
.Pp
Тип
.Vt uintptr_t
предоставляет целочисленный тип без знака с возможностью хранения указателя на
.Vt void ,
который позже может быть преобразован обратно в указатель на
.Vt void .
.Pp
Кроме того, заголовок
.In stdint.h
определяет некоторые макросы, но ни один из них здесь не описан.
.Sh СТАНДАРТЫ
Заголовок
.In stdint.h
соответствует требованиям
.St -isoC-99
и
.St -p1003.1-2001 .
.Sh ИСТОРИЯ
Заголовок
.In stdint.h
впервые был представлен в
.Fx 5.0 .
