melkorbsd/ru-freebsd-man/man7/sticky.7
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)sticky.8	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt STICKY 7
.Os
.Sh ИМЯ
.Nm sticky
.Nd каталоги с привязанным текстом и только для добавления
.Sh ОПИСАНИЕ
Специальный файловый режим, называемый
.Em sticky bit
(режим S_ISTXT),
используется для указания особого режима
работы с каталогами.
Для обычных файлов он игнорируется.
Смотрите
.Xr chmod 2
или файл
.In sys/stat.h
для получения объяснения режимов работы файлов.
.Sh СВАЯЗАННЫЕ КАТАЛОГИ
Каталог, для которого установлен`sticky bit', становится каталогом только для добавления, или, точнее,
каталогом, в котором удаление файлов ограничено.
Файл из фиксированного каталога может быть удален или переименован
пользователем только в том случае, если у пользователя есть разрешение на запись в каталог и
он является владельцем файла, владельцем каталога
или суперпользователем.
Эта функция полезна для таких каталогов, как
.Pa /tmp ,
которые должны быть общедоступны для записи, но
должны лишать пользователей лицензии на произвольное
удаление или переименование файлов друг друга.
.Pp
Любой пользователь может создать отдельный каталог.
Смотрите
.Xr chmod 1
для получения подробной информации об изменении режимов работы файлов.
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At 32v .
.Sh НЕИСПРАВНОСТИ
Ни
.Xr open 2 ,
ни
.Xr mkdir 2
не создаст файл с установленным битом sticky.
