melkorbsd/ru-freebsd-man/man7/tbl.7
.\"	$Id: tbl.7,v 1.37 2021/09/18 12:34:27 schwarze Exp $
.\"
.\" Copyright (c) 2010, 2011 Kristaps Dzonsons <kristaps@bsd.lv>
.\" Copyright (c) 2014,2015,2017,2018,2019 Ingo Schwarze <schwarze@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 18 2021 $
.Dt TBL 7
.Os
.Sh ИМЯ
.Nm tbl
.Nd языковой справочник tbl для mandoc
.Sh ОПИСАНИЕ
Язык
.Nm tbl
форматирует таблицы.
Он используется на страницах
.Xr mdoc 7
и
.Xr man 7 .
В данном руководстве описывается подмножество языка
.Nm
принятого утилитой
.Xr mandoc 1 .
.Pp
Каждая таблица запускается с помощью макроса
.Xr roff 7
.Ic \&TS ,
состоять не более чем из одной строки
.Sx Options ,
одна или несколько строк
.Sx Layout ,
одна или несколько строк
.Sx Data ,
и заканчивается макросом
.Ic \&TE .
Все входные данные должны быть 7-битными в формате ASCII.
.Ss Options
Если первая строка таблицы заканчивается точкой с запятой, она содержит
параметры без учета регистра, разделенные пробелами, символами табуляции или запятыми.
В противном случае она интерпретируется как первая строка
.Sx Layout .
.Pp
Доступны следующие опции.
Для некоторых из них требуются аргументы, заключенные в круглые скобки:
.Bl -tag -width Ds
.It Cm allbox
Нарисуйте однострочный прямоугольник вокруг каждой ячейки таблицы.
.It Cm box
Нарисуйте однострочный прямоугольник вокруг таблицы.
Для обеспечения совместимости с GNU это также может быть вызвано с помощью
.Cm frame .
.It Cm center
Расположите таблицу по центру, а не смещайте ее влево.
Для обеспечения совместимости с GNU это также может быть вызвано с помощью
.Cm centre .
.It Cm decimalpoint
Используйте односимвольный аргумент в качестве десятичной точки с помощью клавиши компоновки
.Cm n .
Это расширение GNU.
.It Cm delim
Используйте два символа аргумента в качестве разделителей
.Xr eqn 7 .
В настоящее время не поддерживается.
.It Cm doublebox
Обведите таблицу двойной линией.
Для обеспечения совместимости с GNU это также может быть вызвано с помощью
.Cm doubleframe .
.It Cm expand
Увеличьте ширину таблицы до текущей длины строки.
В данный момент игнорируется.
.It Cm linesize
Рисуйте линии с размером точки, указанным в аргументе unsigned integer.
В данный момент игнорируется.
.It Cm nokeep
Разрешить разрывы страниц в таблице.
Это расширение GNU, и в настоящее время оно игнорируется.
.It Cm nospaces
Игнорируйте начальные и конечные пробелы в ячейках данных.
Это расширение GNU.
.It Cm nowarn
Отключите предупреждения о таблицах, длина которых превышает текущую строку.
Это расширение GNU, и в настоящее время оно игнорируется.
.It Cm tab
Используйте односимвольный аргумент в качестве разделителя между ячейками данных.
По умолчанию используется символ горизонтальной табуляции.
.El
.Ss Layout
Расположение таблицы следует за линией
.Sx Options
или макрос
.Xr roff 7
.Ic \&TS
или
.Ic \&T& .
Каждая строка макета определяет, как одна строка
.Sx Data
отформатирована.
Последняя строка макета заканчивается точкой.
Это также относится ко всем остальным строкам данных.
Несколько строк макета могут быть соединены запятыми в одной физической
строке ввода.
.Pp
Каждая строка макета состоит из одной или нескольких спецификаций ячеек макета,
необязательно разделенных пробелом.
Следующие ключевые символы без учета регистра указывают начало новой
спецификации ячейки:
.Bl -tag -width 2n
.It Cm c
Расположите строку по центру в этой ячейке.
.It Cm r
Выровняйте строку в этой ячейке по правому краю.
.It Cm l
Выровняйте строку в этой ячейке по левому краю.
.It Cm n
Обнулите число по его последней десятичной точке.
Если в числе нет десятичной точки,
то предполагается, что оно следует за числом после запятой.
.It Cm s
Горизонтально охватывать столбцы, начиная с последней ячейки макета
.Pf non- Cm s .
Это ошибка, если интервал столбца следует за ячейкой
.Cm _
или
.Cm = ,
или появляется первой в строке макета.
Объединенная ячейка в целом занимает только одну ячейку
соответствующей строки данных.
.It Cm a
Выровняйте строку по левому краю и заполните ее одним пробелом.
.It Cm \(ha
По вертикали охватывают строки, начиная с последней ячейки макета
.Pf non- Cm \(ha .
Использование вертикального интервала в первой строке макета приводит к ошибке.
В отличие от горизонтального интервала, вертикальный интервал использует ячейку данных
и удаляет содержимое.
.It Cm _
Нарисуйте в этой ячейке одну горизонтальную линию.
При этом используется ячейка данных и удаляется содержимое.
Ее также можно вызвать с помощью
.Cm \- .
.It Cm =
Нарисуйте в этой ячейке двойную горизонтальную линию.
При этом используется ячейка с данными, а содержимое удаляется.
.El
.Pp
За каждым ключом ячейки может следовать ноль или более из следующих
модификаторов без учета регистра:
.Bl -tag -width 2n
.It Cm b
Используйте жирный шрифт для обозначения содержимого этой ячейки.
.It Cm d
Переместите содержимое вниз, в последнюю строку этого вертикального интервала.
В данный момент игнорируется.
.It Cm e
Сделайте этот столбец шире, чтобы он соответствовал максимальной ширине
любого другого столбца, также имеющего модификатор
.Cm e .
.It Cm f
Следующие один или два символа указывают шрифт, который будет использоваться для этой ячейки.
В названиях шрифтов, состоящих из одного символа, должен быть пробел или точка.
Смотрите руководство
.Xr roff 7
для поиска поддерживаемых названий шрифтов.
.It Cm i
Используйте курсивный шрифт для обозначения содержимого этой ячейки.
.It Cm m
Укажите макрос запуска ячейки.
Это расширение GNU и в настоящее время не поддерживается.
.It Cm p
Укажите размер точки в следующем аргументе без знака
или измените его с помощью следующего аргумента со знаком.
В данный момент игнорируется.
.It Cm v
Установите интервал между строками по вертикали равным следующему аргументу без знака
или измените его с помощью следующего аргумента со знаком.
В данный момент игнорируется.
.It Cm t
Не центрируйте содержимое по вертикали в этом интервале,
оставьте его в верхней строке.
В данный момент игнорируется.
.It Cm u
Переместить содержимое ячейки вверх на половину строки таблицы.
В данный момент игнорируется.
.It Cm w
Укажите минимальную ширину столбца.
.It Cm x
После определения ширины всех остальных столбцов распределите
оставшуюся длину строки между всеми столбцами, имеющими модификатор
.Cm x .
.It Cm z
Не используйте эту ячейку для определения ширины этого столбца.
.It Cm \&|
Нарисуйте единственную вертикальную линию справа от этой ячейки.
.It Cm ||
Нарисуйте двойную вертикальную линию справа от этой ячейки.
.El
.Pp
Если модификатор состоит из десятичных цифр,
он указывает минимальный интервал в единицах
.Cm n
между этим столбцом и следующим столбцом справа.
Значение по умолчанию равно 3.
Если есть вертикальная линия, она проводится внутри интервала.
.Ss Data
Раздел с данными следует за последней строкой
.Sx Layout .
Каждая строка данных состоит из одной или нескольких ячеек данных, разделенных символами
.Cm tab .
.Pp
Если ячейка данных содержит только два байта
.Ql \e\(ha ,
приведенная выше ячейка распространяется на эту строку, как если бы спецификация компоновки
этой ячейки была
.Cm \(ha .
.Pp
Если ячейка данных содержит только один символ
.Ql _
или
.Ql = ,
через ячейку проводится одинарная или двойная горизонтальная линия,
соединяющая соседние ячейки.
Если ячейка данных содержит только последовательность из двух символов
.Ql \e_
или
.Ql \e= ,
внутри ячейки проводится одинарная или двойная горизонтальная линия,
не соединяющая соседние ячейки.
Если строка данных не содержит ничего, кроме одного символа
.Ql _
или
.Ql = ,
горизонтальная линия, проходящая через всю таблицу, вставляется
без использования строки макета.
.Pp
Вместо любой ячейки данных можно использовать текстовый блок.
Он начинается с
.Ic \&T{
в конце физической строки ввода.
Строка ввода заканчивается внутри текстового блока,
не завершая ни текстовый блок, ни его ячейку данных.
Она заканчивается только в том случае, если
.Ic \&T}
отображается в начале физической строки ввода, за которой следует
индикатор конца ячейки.
Если за
.Ic \&T}
следует конец физической строки ввода, текстовый блок,
ячейка данных, то строка данных заканчивается в этой точке.
Если за
.Ic \&T}
следует символ
.Cm tab ,
заканчивается только текстовый блок и ячейка данных,
но строка данных продолжается ячейкой данных, следующей за символом
.Cm tab .
Если за
.Ic \&T}
следует какой-либо другой символ, он не завершает текстовый блок,
а переходит к следующей физической строке ввода.
.Sh ПРИМЕРЫ
Четкое выравнивание и выбор шрифта:
.Bd -literal -offset indent
\&.TS
rb c  lb
r  ci l.
r	center	l
ri	ce	le
right	c	left
\&.TE
.Ed
.Bd -filled -offset indent
.TS
rb c  lb
r  ci l.
r	center	l
ri	ce	le
right	c	left
.TE
.Ed
.Pp
Некоторые порты в
.Ox 6.1
для отображения выравнивания чисел и рисования линий:
.Bd -literal -offset indent
\&.TS
box tab(:);
r| l
r  n.
software:version
_
AFL:2.39b
Mutt:1.8.0
Ruby:1.8.7.374
TeX Live:2015
\&.TE
.Ed
.Bd -filled -offset indent
.TS
box tab(:);
r| l
r  n.
software:version
_
AFL:2.39b
Mutt:1.8.0
Ruby:1.8.7.374
TeX Live:2015
.TE
.Ed
.sp 2v
Расчеты пролетов и пропускной ширины:
.Bd -literal -offset indent
\&.TS
box tab(:);
lz  s | rt
lt| cb| \(ha
\(ha | rz  s.
left:r
l:center:
:right
\&.TE
.Ed
.Bd -filled -offset indent
.TS
box tab(:);
lz  s | rt
lt| cb| ^
^ | rz  s.
left:r
l:center:
:right
.TE
.Ed
.sp 2v
Текстовые блоки, указание интервалов между ними, определение и выравнивание
ширины столбцов, размещение строк в отдельных ячейках и переопределение
.Cm allbox :
.Bd -literal -offset indent
\&.TS
allbox tab(:);
le le||7 lw10.
The fourth line:_:line 1
of this column:=:line 2
determines:\_:line 3
the column width.:T{
This text is too wide to fit into a column of width 17.
T}:line 4
T{
No break here.
T}::line 5
\&.TE
.Ed
.Bd -filled -offset indent
.TS
allbox tab(:);
le le||7 lw10.
The fourth line:_:line 1
of this column:=:line 2
determines:\_:line 3
the column width.:T{
This text is too wide to fit into a column of width 17.
T}:line 4
T{
No break here.
T}::line 5
.TE
.Ed
.sp 2v
Эти примеры были созданы для компактной демонстрации многих особенностей
.Nm .
На страницах с настоящим руководством таблицы должны быть как можно более простыми.
Обычно они лучше выглядят, менее хрупкие и более портативные.
.Sh СОВМЕСТИМОСТЬ
Реализация в
.Xr mandoc 1
.Nm
не поддерживает макросы
.Xr mdoc 7
и
.Xr man 7
и уравнения
.Xr eqn 7
внутри таблиц.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr mandoc 1 ,
.Xr man 7 ,
.Xr mandoc_char 7 ,
.Xr mdoc 7 ,
.Xr roff 7
.Rs
.%A М. Э. Леск
.%T Tbl \(em Программа для форматирования таблиц
.%D 11 июня 1976 года
.Re
.Sh ИСТОРИЯ
Утилита tbl, являющаяся препроцессором для troff, была первоначально написана М.
Э. Леском в Bell Labs в 1975 году.
Новая версия tbl, входящая в состав пакета groff, была выпущена
Джеймсом Кларком в 1990 году.
Отдельная реализация tbl была написана Кристапсом Дзонсонсом в
2010.
Это легло в основу реализации, которая впервые появилась в
.Ox 4.9
как часть утилиты
.Xr mandoc 1 .
.Sh АВТОРЫ
Эта ссылка на
.Nm
была написана
.An Кристапом Дзонсонсом Aq Mt kristaps@bsd.lv
и
.An Инго Шварце Aq Mt schwarze@openbsd.org .
.Sh НЕИСПРАВНОСТИ
В режиме вывода
.Fl T
.Cm utf8 ,
вместо двойных линий рисуются жирные линии.
Это невозможно улучшить, поскольку стандарт Unicode предоставляет только
неполный набор символов для рисования прямоугольников с двойными линиями,
в то время как он предоставляет полный набор символов для рисования прямоугольников
с жирными линиями.
Маловероятно, что это можно будет улучшить в будущем, поскольку
символы для рисования рамок уже помечены в Unicode как символы,
предназначенные только для обратной совместимости с устаревшими системами,
и их использование не рекомендуется.
Поэтому маловероятно, что в будущем будут добавлены недостающие символы.
