melkorbsd/ru-freebsd-man/man7/term.7
.\"***************************************************************************
.\" Copyright 2018-2019,2020 Thomas E. Dickey                                *
.\" Copyright 1998-2011,2017 Free Software Foundation, Inc.                  *
.\"                                                                          *
.\" Permission is hereby granted, free of charge, to any person obtaining a  *
.\" copy of this software and associated documentation files (the            *
.\" "Software"), to deal in the Software without restriction, including      *
.\" without limitation the rights to use, copy, modify, merge, publish,      *
.\" distribute, distribute with modifications, sublicense, and/or sell       *
.\" copies of the Software, and to permit persons to whom the Software is    *
.\" furnished to do so, subject to the following conditions:                 *
.\"                                                                          *
.\" The above copyright notice and this permission notice shall be included  *
.\" in all copies or substantial portions of the Software.                   *
.\"                                                                          *
.\" THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS  *
.\" OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF               *
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   *
.\" IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,   *
.\" DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR    *
.\" OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR    *
.\" THE USE OR OTHER DEALINGS IN THE SOFTWARE.                               *
.\"                                                                          *
.\" Except as contained in this notice, the name(s) of the above copyright   *
.\" holders shall not be used in advertising or otherwise to promote the     *
.\" sale, use or other dealings in this Software without prior written       *
.\" authorization.                                                           *
.\"***************************************************************************
.\"
.\" $Id: term.7,v 1.28 2020/02/02 23:34:34 tom Exp $
.TH term 7
.ie \n(.g .ds `` \(lq
.el       .ds `` ``
.ie \n(.g .ds '' \(rq
.el       .ds '' ''
.ds n 5
.ds d /usr/share/misc/terminfo
.SH ИМЯ
term \- соглашения о присвоении имен типам терминалов
.SH ОПИСАНИЕ
.PP
Переменная среды \fBTERM\fR обычно должна содержать название
используемого вами терминала, консоли или устройства отображения.
Эта информация
важна для всех программ, ориентированных на экран, включая ваш редактор и почтовую программу.
.PP
По умолчанию \fBTERM\fR будет установлено для каждой строки одним из следующих способов
\fB/etc/inittab\fR (например, System\-V-like UNIXes)
или \fB/etc/ttys\fR (BSD UNIXes).
Этого почти всегда будет достаточно для рабочих станций и микрокомпьютерных консолей.
.PP
Если вы используете коммутируемую линию, тип подключенного к ней устройства может отличаться.
В старых системах UNIX предустановлен очень простой тип терминала,
как \*(``dumb\*('' или \*(``dialup\*('' на коммутируемых линиях.
На более новых устройствах может быть предварительно установлено \*(``vt100\*('', что отражает распространенность DEC
терминалов и эмуляторов персональных компьютеров, совместимых с VT100.
.PP
Современные telnet передают вашу переменную окружения \fBTERM\fR с локальной стороны на
удаленную.
Могут возникнуть проблемы, если удаленная запись terminfo или termcap
для вашего типа не совместима с вашим типом, но такая ситуация встречается редко, и
ее почти всегда можно избежать путем явного экспорта \*(``vt100\*(''
(предполагая, что вы на самом деле используете консоль,
терминал или эмулятор терминала с надстройкой VT100.)
.PP
В любом случае, вы можете по своему усмотрению изменить настройки system \fBTERM\fR
в своем профиле shell.
Утилита \fBtset\fP(1) может оказаться полезной;
вы можете задать ему набор правил для определения или запроса типа терминала
на основе устройства tty и скорости передачи данных в бодах.
.PP
Установка собственного значения \fBTERM\fR также может быть полезна, если вы создали
пользовательскую запись, включающую параметры (такие как визуальный звонок или обратное видео),
которые вы хотите изменить на системный тип по умолчанию для вашей строки.
.PP
Описания типов терминалов хранятся в виде файлов с данными о возможностях под ними
\*d.
Чтобы просмотреть список всех названий терминалов, распознанных системой, выполните
.sp
	toe | more
.sp
из своего терминала.
Эти файлы возможностей представлены в двоичном формате, оптимизированном для
ускорения поиска (в отличие от старого текстового формата \fBtermcap\fR, который они заменяют);
чтобы проверить запись, вы должны использовать команду \fBinfocmp\fR(1M).
Вызовите его следующим образом:
.sp
	infocmp \fIentry_name\fR
.sp
где \fIentry_name\fR - это имя типа, который вы хотите проверить (и
имя файла его возможностей в подкаталоге \*d, названном по его первой
букве).
Эта команда создает файл возможностей в текстовом формате, описанном в
\fBterminfo\fR(\*n).
.PP
В первой строке описания \fBterminfo\fR(\*n) указаны имена, по которым
terminfo распознает терминал,
разделенные символами \*(``|\*('' (pipe-bar), а поле last name
заканчивается запятой.
Поле first name является основным именем типа
\fIprimary name\fR и используется при настройке \fBTERM\fR.  Поле last
name (если оно отличается от первого first) на самом деле является описанием типа
терминала (оно может содержать пробелы; остальные должны быть отдельными словами).
Поля name между first и last (если они есть) являются псевдонимами для терминала,
обычно это исторические имена, сохраняемые для совместимости.
.PP
Существуют некоторые правила выбора основных имен терминалов, которые помогают
сохранить их информативность и уникальность.
Вот пошаговое руководство по присвоению
имен терминалам, в котором также объясняется, как их анализировать:
.PP
Сначала выберите корневое имя.
Корень будет состоять из строчной буквы,
за которой будут следовать до семи строчных букв или цифр.
Вам следует избегать использования
знаков препинания в корневых именах, поскольку они используются и интерпретируются как
имена файлов, а встроенные в них метасимволы оболочки (такие как !, $, *, ? и т.д.)
могут привести к странному и бесполезному поведению.
Косая черта (/) или любой другой символ,
который может быть интерпретирован любой файловой системой (\e, $, [, ]), особенно
опасен (terminfo не зависит от платформы и выбирает имена со специальными символами).
символы могут когда-нибудь усложнить жизнь пользователям будущего порта).
Символ точки (.) относительно безопасен, если на одно корневое
имя приходится не более одного символа; в некоторых исторических названиях терминалов он используется.
.PP
Корневое имя для типа консоли терминала или рабочей станции почти всегда должно
начинаться с префикса поставщика (например, \fBhp\fR для Hewlett-Packard, \fBwy\fR для
Wyse, или \fBatt\fR для терминалов AT&T), или общее название терминальной линии
(\fBvt\fR для терминалов серии VT от DEC, или \fBsun\fR для Sun
Консоли для рабочих станций Microsystems или \fBregent\fR для серии ADDS Regent.
Вы можете просмотреть дерево terminfo, чтобы увидеть, какие префиксы уже широко используются.
После префикса корневого имени, при необходимости, следует указать номер модели;
таким образом, \fBvt100\fR, \fBhp2621\fR, \fBwy50\fR.
.PP
Корневым именем для консоли типа PC-Unix должно быть имя операционной системы,
т.е. \fBlinux\fR, \fBbsdos\fR, \fBfreebsd\fR, \fBnetbsd\fR.  Оно должно
\fInot\fR не должен быть \fBconsole\fR или любым другим универсальным, который может вызвать путаницу в
многоплатформенной среде!  Если указан номер модели, он должен указывать
либо на уровень выпуска операционной системы, либо на уровень выпуска консольного драйвера.
.PP
Корневым именем эмулятора терминала (при условии, что оно не соответствует ни одному из
стандартных типов ANSI или vt100) должно быть название программы или ее легко
узнаваемая аббревиатура (например, \fBversaterm\fR, \fBctrm\fR).
.PP
После корневого имени вы можете добавить любое разумное количество
суффиксов объектов, разделенных дефисом.
.TP 5
2p
Имеет две страницы памяти.
Аналогично, 4p, 8p и т.д.
.TP 5
mc
Magic-cookie.
Некоторые терминалы (особенно старые Wyses) могут поддерживать только один
атрибут без потери magic-cookie.
Их базовая запись обычно сочетается
с другой, которая имеет этот суффикс и использует magic cookies для поддержки нескольких
атрибутов.
.TP 5
\-am
Включите автоматическое отступление (обводка по правому краю).
.TP 5
\-m
Монорежим \ - отключение поддержки цвета.
.TP 5
\-na
Нет клавиш со стрелками \ - termcap игнорирует клавиши со стрелками, которые на самом деле есть на
терминале, поэтому пользователь может использовать клавиши со стрелками локально.
.TP 5
\-nam
Нет auto-margin \- подавляет возможность.
.TP 5
\-nl
Без надписей \ - подавить неявные надписи.
.TP 5
\-nsl
Нет строки состояния \ - отключить строку состояния.
.TP 5
\-pp
Имеет используемый порт принтера.
.TP 5
\-rv
Терминал в режиме обратной видеосъемки (черное на белом).
.TP 5
\-s
Включите строку состояния.
.TP 5
\-vb
Используйте видимый звуковой сигнал (вспышку) вместо звукового сигнала.
.TP 5
\-w
Широкий; терминал работает в режиме 132 столбцов.
.PP
Обычно, если ваш тип терминала является вариантом, предназначенным для указания
высоты строки, этот суффикс должен идти первым.
Итак, для гипотетического терминала FuBarCo
model 2317 в 30-строчном режиме с обратным видео наилучшей формой была бы
\fBfubar\-30\-rv\fR (а не, скажем, \*(``fubar\-rv\-30\*('').
.PP
Типы терминалов, которые записываются не как отдельные элементы, а скорее как
компоненты, подключаемые к другим элементам с помощью функций \fBuse\fP,
различаются с помощью встроенных знаков плюс, а не тире.
.PP
Команды, которые используют тип терминала для управления отображением, часто принимают параметр \-T,
который принимает аргумент имени терминала.
Такие программы должны
использовать переменную окружения \fBTERM\fR, если параметр \-T не указан.
.SH ПОРТАТИВНОСТЬ
Для обеспечения максимальной совместимости с более старыми версиями System V Unix имена и псевдонимы
должны быть уникальными в пределах первых 14 символов.
.SH ФАЙЛЫ
.TP 5
\*d/?/*
составленная база данных о возможностях терминала
.TP 5
/etc/inittab
инициализация строки tty (UNIX-файлы, подобные AT&T)
.TP 5
/etc/ttys
инициализация строки tty (BSD-подобные UNIX-системы)
.SH СМОТРИТЕ ТАКЖЕ
\fBcurses\fR(3X), \fBterminfo\fR(\*n), \fBterm\fR(\*n).
