melkorbsd/ru-freebsd-man/man7/tests.7
.\"	$NetBSD: tests.kyua.7,v 1.2 2013/07/20 21:39:59 wiz Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 19, 2020
.Dt TESTS 7
.Os
.Sh ИМЯ
.Nm tests
.Nd введение в набор тестов
.Fx
.Sh ОПИСАНИЕ
Набор тестов
.Fx
предоставляет набор автоматизированных тестов для двух основных целей.
С одной стороны, набор тестов помогает
.Em разработчикам
обнаруживать ошибки и регрессии при изменении дерева исходных текстов.
С другой стороны, это помогает
.Em конечным пользователям
(и, в частности, системным администраторам) убедиться в том, что новые установки
операционной системы
.Fx
правильно работают на своей аппаратной платформе, а также обеспечивают,
чтобы система не страдала от сбоев в работе во время регулярной эксплуатации и технического обслуживания.
.Pp
Набор тестов
.Fx
можно найти в иерархии
.Pa /usr/tests .
.Pp
На этой странице руководства описано, как запустить набор тестов и как настроить
некоторые из его дополнительных функций.
Информацию о написании тестов смотрите в
.Xr atf 7 .
.Ss Installing the test suite
Если каталог
.Pa /usr/tests
отсутствует, то вам придется включить сборку набора
тестов, перестроить вашу систему и установить результаты.
Вы можете сделать это, установив
.Sq WITH_TESTS=yes
в вашем файле
.Pa /etc/src.conf
(смотрите
.Xr src.conf 5
для получения подробной информации)
и перестроить систему, как описано в
.Xr build 7 .
.Ss When to run the tests?
Прежде чем углубиться в подробности запуска набора тестов, вот несколько
сценариев, в которых вы должны его запустить:
.Bl -bullet -offset indent
.It
После новой установки
.Fx
убедитесь, что система корректно работает на вашей аппаратной платформе.
.It
После обновления
.Fx
до другой версии, убедитесь, что новый код хорошо работает на вашей
аппаратной платформе и что обновление не привело к регрессиям в вашей
конфигурации.
.It
После изменения исходного дерева для обнаружения любых новых ошибок и/или регрессий.
.It
Периодически, возможно, с помощью задания
.Xr cron 8 ,
чтобы гарантировать, что любые изменения в системе (такие как установка
пакетов сторонних производителей или внесение изменений в файлы конфигурации вручную) не
приведут к непредвиденным сбоям.
.El
.Ss Running the tests
Используйте следующую команду для запуска всего набора тестов:
.Bd -literal -offset indent
$ kyua test -k /usr/tests/Kyuafile
.Ed
.Pp
Описанное выше будет повторяться во всех тестовых программах в
.Pa /usr/tests
рекурсивно, выполняйте их, сохраняйте их результаты и отладочные данные в
базе данных Kyua (по умолчанию в
.Pa ~/.kyua/store.db ) ,
и выводите сводку результатов.
Эта сводка содержит краткий подсчет всех выполненных тестов и количество
неудачных из них.
.Pp
Можно ограничить количество запускаемых тестов, указав их названия в
командной строке.
Например, это позволит выполнять тесты для утилит
.Xr cp 1
и
.Xr cut 1 :
.Bd -literal -offset indent
$ kyua test -k /usr/tests/Kyuafile bin/cp usr.bin/cut
.Ed
.Ss Obtaining reports of the tests execution
Дополнительную информацию о результатах тестирования можно получить
с помощью различных команд создания отчетов Kyua.
Например, приведенный ниже текстовый отчет о выполненных
тестах с указанием того, какие из них завершились неудачей:
.Bd -literal -offset indent
$ kyua report --verbose -r <.db file from output of test>
.Ed
.Pp
В этом примере будет сгенерирован HTML-отчет, готовый к публикации на
веб-сервере:
.Bd -literal -offset indent
$ kyua report-html --output ~/public_html/tests
.Ed
.Pp
Для получения более подробной информации об интерфейсе командной строки Kyua, пожалуйста, обратитесь
к его справочной странице
.Xr kyua 1 .
.Ss Configuring the tests
Некоторые тестовые примеры в наборе тестов
.Fx
требуют ручную настройку администратором для их запуска.
Если не определены определенные свойства, тесты, для которых они требуются, будут
пропущены.
.Pp
Наборы тестов настраиваются путем определения их конфигурационных
переменных в
.Pa /etc/kyua/kyua.conf .
Формат этого файла подробно описан в
.Xr kyua.conf 5 .
.Pp
В наборе тестов доступны следующие переменные конфигурации
.Fx :
.Bl -tag -width "allow_sysctl_side_effects"
.It allow_devfs_side_effects
Если определено, включает тесты, которые могут уничтожать и воссоздавать полупостоянные
узлы устройств, такие как дисковые устройства.
Без этой переменной тесты могут по-прежнему создавать и уничтожать узлы устройств, которые
обычно являются временными, такие как /dev/tap* и /dev/pts*, при условии,
что впоследствии они будут очищены.
Однако тесты, для которых требуется эта переменная, имеют упрощенные требования к очистке;
они должны воссоздать все устройства, которые они уничтожили, но не обязательно с
тем же именем разработчика.
.It allow_sysctl_side_effects
Включает тесты, которые изменяют глобально значимые переменные
.Xr sysctl 8 .
Тесты отменят все изменения, внесенные на этапах очистки.
.It disks
Необходимо указать список узлов дисковых устройств, разделенных пробелами.
Тесты, которым требуется деструктивный доступ к дискам, должны использовать эти устройства.
Тесты не требуются для сохранения каких-либо данных, имеющихся на этих дисках.
.It fibs
Должен быть установлен разделенный пробелами список FIBS (таблиц маршрутизации).
Тесты, которым необходимо изменить таблицу маршрутизации, могут использовать любую из них.
Тесты будут очищать все новые маршруты, которые они создают.
.El
.Ss What to do if something fails?
Если произойдет
.Em какой-либо сбой
во время выполнения набора тестов, пожалуйста, подумайте о том, чтобы сообщить об этом
.Fx
разработчикам, чтобы можно было проанализировать и устранить неисправность.
Для этого отправьте сообщение в соответствующий список рассылки или отправьте
отчет о проблеме.
Для получения более подробной информации, пожалуйста, обратитесь к:
.Bl -bullet -offset indent -compact
.It
.Lk https://lists.freebsd.org/ "FreeBSD Mailing Lists"
.It
.Lk https://www.freebsd.org/support/ "Problem Reporting"
.El
.Sh ФАЙЛЫ
.Bl -tag -compact -width "/etc/kyua/kyua.conf"
.It Pa /etc/kyua/kyua.conf
Общесистемный конфигурационный файл для
.Xr kyua 1 .
.It Pa ~/.kyua/kyua.conf
Пользовательский конфигурационный файл для
.Xr kyua 1 ;
переопределяет системный файл.
.It Pa ~/.kyua/store.db
База данных результатов по умолчанию, используемая Kyua.
.It Pa /usr/tests/
Расположение набора тестов
.Fx .
.It Pa /usr/tests/Kyuafile
Файл определения набора тестов верхнего уровня.
.El
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr kyua 1 ,
.Xr atf 7 ,
.Xr build 7 ,
.Xr development 7
.Sh ИСТОРИЯ
Набор тестов
.Fx
впервые появился в
.Fx 10.1
и был установлен по умолчанию в
.Fx 11.0 .
.Pp
Страница руководства
.Nm
впервые появилась в
.Nx 6.0
и позже был портирован на
.Fx 10.1 .
.Pp
Тестовый драйвер
.Xr kyua 1 ,
был импортирован как часть базовой системы в
.Fx 13.0 ,
ранее доступный только в
.Xr ports 7 .
.Sh АВТТОРЫ
.An Хулио Мерино Aq Mt jmmv@FreeBSD.org
