melkorbsd/ru-freebsd-man/man7/vdevprops.7
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2021 Klara, Inc.
.\"
.Dd October 30, 2022
.Dt VDEVPROPS 7
.Os
.
.Sh ИМЯ
.Nm vdevprops
.Nd собственные и определяемые пользователем свойства ZFS vdevs
.
.Sh ОПИСАНИЕ
Свойства делятся на два типа: собственные и определяемые пользователем
.Pq или Qq пользовательские
свойства.
Собственные свойства либо передают внутреннюю статистику, либо управляют поведением ZFS.
Кроме того, родные свойства могут быть как редактируемыми, так и доступными только для чтения.
Пользовательские свойства не влияют на поведение ZFS, но вы можете использовать их для аннотирования
vdevs таким образом, чтобы это было полезно для вашей среды.
Для получения дополнительной информации о пользовательских свойствах см.
Пользовательские свойства .Sx
ниже.
.
.Ss Родные свойства 
Каждый vdev имеет набор свойств, которые экспортируют статистику о vdev
а также управляют различным поведением.
Свойства не наследуются от vdev верхнего уровня, за исключением
checksum_n, checksum_t, io_n и io_t.
.Pp
Значения числовых свойств могут быть указаны с помощью человекочитаемых суффиксов
.Po, например,
.Sy k , KB , M , Gb ,
и так далее, вплоть до
.Sy Z
для зеттабайта
.Pc .
Следующие допустимы
.Pq и аналогичные
спецификации:
.Li 1536M , 1.5g , 1.50GB .
.Pp
Значения нечисловых свойств учитывают регистр и должны быть строчными.
.Pp
Следующие собственные свойства содержат статистические данные о
vdev.
Эти свойства не могут быть изменены.
.Bl -tag -width "фрагментация"
.It Sy емкость
Процент используемого пространства vdev
.It Sy state
состояние этого vdev, например онлайн, неисправен или автономно.
.It Sy guid
глобально уникальный идентификатор этого vdev
.It Sy asize
Выделяемый размер этого vde
.It Sy psize
Физический размер этого vdev
.It Sy ashift
Размер физического сектора этого vdev, выраженный как степень двойки
.It Sy size
Общий размер этого vdev
.It Sy free
Количество оставшегося свободного места на этом vdev
.It Sy allocated
Количество выделенного пространства на этом vdev
.It Sy expandsize
На сколько может расшириться этот vdev
.It Sy fragmentation
Процент фрагментации на этом vdev
.It Sy parity
Уровень четности для этого vdev
.It Sy devid
Идентификатор устройства для этого vdev
.It Sy physpath
Физический путь к устройству
.It Sy encpath
Путь корпуса к устройству
.It Sy fru
Полевая заменяемая единица, обычно номер модели
.It Sy parent
Родитель данного vdev
.It Sy children
Список дочерних устройств этого vdev, разделенный запятыми
.It Sy numchildren
Количество дочерних устройств, принадлежащих этому vdev
.It Sy read_errors , write_errors , checksum_errors , initialize_errors
Количество ошибок каждого типа, с которыми столкнулся этот vdev
.It Sy null_ops , read_ops , write_ops , free_ops , claim_ops , trim_ops
Количество операций ввода-вывода каждого типа, выполненных этим vdev
.It Xo
.Sy null_bytes , read_bytes , write_bytes , free_bytes , claim_bytes ,
.Sy trim_bytes
.Xc
Суммарный размер всех операций каждого типа, выполненных этим vdev
.It Sy removing
Если это устройство в настоящее время удаляется из пула
.El
.Pp
Следующие собственные свойства могут быть использованы для изменения поведения vdev.
.Bl -tag -width "allocating"
.It Sy checksum_n , checksum_t , io_n , io_t , slow_io_n , slow_io_t
Настройте службу управления сбоями, указав пороговые значения контрольной суммы/ввод-вывод <N>
ошибок за <T> секунд, соответственно.
Эти свойства могут быть установлены для vdev листового и верхнего уровня.
Если свойство задано на листовом vdev и vdev верхнего уровня, будет использоваться значение листового vdev.
Если свойство установлено только на vdev верхнего уровня, будет использоваться это значение.
Значения этих свойств не сохраняются при замене vdev.
По этой причине рекомендуется устанавливать свойство на vdev верхнего уровня -
а не на самом листовом vdev.
Значения по умолчанию для
.Sy OpenZFS on Linux
10 ошибок на 600 секунд.
Для
.Sy OpenZFS on FreeBSD
значения по умолчанию смотри в
.Xr zfsd 8 .
.It Sy комментарий
Текстовый комментарий длиной до 8192 символов.
.It Sy bootsize
Объем пространства, который необходимо зарезервировать для системного раздела EFI
.It Sy failfast
Если это устройство должно передавать ошибки BIO обратно в ZFS, используется для отключения
отказоустойчивости.
.It Sy path
Путь к устройству для данного vdev.
.It Sy allocating
Если это устройство должно выполнять новое распределение, используется для отключения устройства,
когда оно запланировано для последующего удаления.
См.
.Xr zpool-remove 8 .
.El
.Ss Пользовательские свойства
В дополнение к стандартным собственным свойствам ZFS поддерживает произвольные пользовательские
свойства.
Пользовательские свойства не влияют на поведение ZFS, но приложения или администраторы могут использовать их для аннотирования vdev.
администраторы могут использовать их для аннотирования vdevs.
.Pp
Имена пользовательских свойств должны содержать двоеточие
.Pq Qq Sy \&:
чтобы отличать их от собственных свойств.
Они могут содержать строчные буквы, цифры и следующие знаки препинания
символы: двоеточие
.Pq Qq Sy \&: ,
тире
.Pq Qq Sy - ,
точка
.Pq Qq Sy \&. ,
и подчеркивание
.Pq Qq Sy _ .
Предполагается, что имя свойства делится на две части
например
.Ar модуль : Ns Ar свойство ,
но это пространство имен не поддерживается ZFS.
Имена пользовательских свойств могут состоять не более чем из 256 символов и не могут начинаться с тире
.Pq Qq Sy - .
.Pp
При программном использовании пользовательских свойств настоятельно рекомендуется использовать
обратное доменное имя DNS для
.Ar модуль 
чтобы уменьшить вероятность того, что два
независимо разработанные пакеты используют одно и то же имя свойства для разных
целей.
.Pp
Значения пользовательских свойств представляют собой произвольные строки и
и никогда не проверяются.
В качестве параметра можно использовать
.Nm zpool Cm set
с пустым значением, чтобы очистить пользовательское свойство.
Значения свойств ограничены 8192 байтами.
.Sh СМОТРИ ТАКЖЕ
.Xr zpoolprops 7 ,
.Xr zpool-set 8
