melkorbsd/ru-freebsd-man/man7/zpool-features.7
.\"
.\" Copyright (c) 2012, 2018 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development
.\" and Distribution License (the "License").  You may not use this file except
.\" in compliance with the License. You can obtain a copy of the license at
.\" usr/src/OPENSOLARIS.LICENSE or https://opensource.org/licenses/CDDL-1.0.
.\"
.\" See the License for the specific language governing permissions and
.\" limitations under the License. When distributing Covered Code, include this
.\" CDDL HEADER in each file and include the License file at
.\" usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this
.\" CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your
.\" own identifying information:
.\" Portions Copyright [yyyy] [name of copyright owner]
.\" Copyright (c) 2019, Klara Inc.
.\" Copyright (c) 2019, Allan Jude
.\" Copyright (c) 2021, Colm Buckley <colm@tuatha.org>
.\"
.Dd June 23, 2022
.Dt ZPOOL-FEATURES 7
.Os
.
.Sh ИМЯ
.Nm zpool-features
.Nd описание функций ZFS pool
.
.Sh ОПИСАНИЕ
Версии форматов для пула ZFS на диске задаются с помощью 
.Dq функций
, которые заменяют старые номера форматов на диске
.Pq последний поддерживаемый номер формата на диске - 28.
Чтобы включить какую-либо функцию в пуле, используйте
.Nm zpool Cm upgrade ,
или установите свойство
.Sy feature Ns @ Ns Ar feature-name
на
.Sy enabled .
Пожалуйста, также ознакомьтесь с разделом
.Sx Наборы функций совместимости
для получения информации о том, как наборы функций могут быть включены вместе.
.Pp
Формат пула не влияет на совместимость версий файловой системы или возможность
отправки файловых систем между пулами.
.Pp
Поскольку большинство функций могут быть включены независимо друг от друга,
формат пула на диске определяется набором всех функций, помеченных как
.Sy active
в пуле.
Если пул был создан с помощью другой версии программного
обеспечения, этот набор может содержать неподдерживаемые функции.
.
.Ss Identifying features
У каждой функции есть руководство по форме
.Ar com.example : Ns Ar feature-name .
Измененное DNS-имя гарантирует, что руководство по функциям уникально для всех
реализаций ZFS.
При обнаружении неподдерживаемых функций в пуле они
будут идентифицированы с помощью соответствующих руководств.
Информацию об этих функциях смотрите в документации к реализации ZFS, на основе которой был создан пул.
.Pp
Каждая поддерживаемая функция также имеет краткое название.
По общему правилу, краткое название функции - это та часть руководства по ней, которая следует
за
.Sq \&:
.Po ,
т.е.
.Ar com.example : Ns Ar feature-name
будет иметь краткое название
.Ar feature-name
.Pc ,
однако краткое название функции может отличаться в разных реализациях ZFS, если
соблюдение соглашения приведет к конфликтам имен.
.
.Ss Feature states
Объекты могут находиться в одном из трех состояний:
.Bl -tag -width "disabled"
.It Sy active
Эта функция поддерживает изменения формата на диске, которые влияют на пул.
Для импорта пула в режиме чтения-записи требуется поддержка этой функции.
Если эта функция не совместима только с режимом чтения,
для импорта пула в режиме только для чтения также требуется поддержка
.Pq смотрите Sx Read-only compatibility .
.It Sy enabled
Администратор отметил эту функцию как включенную в пуле, но
изменения формата функций на диске еще не были внесены.
Пул по-прежнему может быть импортирован программным обеспечением, которое не поддерживает эту функцию,
но в любой момент в формат на диске могут быть внесены изменения,
которые переведут функцию в состояние
.Sy active .
Некоторые функции могут поддерживать возврат к состоянию
.Sy enabled
после того, как стал
.Sy active .
Более подробную информацию смотрите в документации по конкретным функциям.
.It Sy disabled
Изменения формата этой функции на диске не были внесены и не будут внесены
до тех пор, пока администратор не переведет функцию в состояние
.Sy enabled .
Функции нельзя отключить после того, как они были включены.
.El
.Pp
Состояние поддерживаемых функций отображается через свойства пула формы
.Sy feature Ns @ Ns Ar short-name .
.
.Ss Read-only compatibility
Некоторые функции могут вносить изменения в формат диска, которые не влияют на способность другого
программного обеспечения считывать данные из пула.
Эти функции называются
.Dq read-only compatible .
Если все неподдерживаемые функции в пуле совместимы только для чтения,
пул можно импортировать в режиме только для чтения, установив свойство
.Sy readonly
во время импорта
.Po смотрите
.Xr zpool-import 8
для получения подробной информации об импорте пулов
.Pc .
.
.Ss Unsupported features
Для каждой неподдерживаемой функции, включенной в импортированном пуле, используется свойство пула
с именем
.Sy unsupported Ns @ Ns Ar feature-name
будет указано, почему импорт был разрешен, несмотря на неподдерживаемую функцию.
Для этого свойства возможны следующие значения:
.Bl -tag -width "readonly"
.It Sy inactive
Функция находится в состоянии
.Sy enabled
и, следовательно, формат пула на диске
по-прежнему совместим с программным обеспечением, которое не поддерживает эту функцию.
.It Sy readonly
Эта функция совместима только с чтением, и пул был импортирован в
режиме только для чтения.
.El
.
.Ss Feature dependencies
Функционирование некоторых функций зависит от того, включены ли другие функции.
Включение функции автоматически активирует все функции, от которых она зависит.
.
.Ss Compatibility feature sets
Иногда пулу необходимо поддерживать совместимость с
определенным форматом на диске, включая и отключая определенные функции.
Функция
.Sy compatibility
облегчает это, позволяя считывать наборы функций из текстовых файлов.
Если установлено значение
.Sy off
.Pq значение по умолчанию ,
наборы функций совместимости отключены
.Pq т.е. все функции включены ;
когда установлено значение
.Sy legacy ,
никакие функции не включены.
Если задан список имен файлов, разделенных запятыми
.Po
каждое имя файла может быть либо абсолютным путем, либо относительным к
.Pa /etc/zfs/compatibility.d
или
.Pa /usr/share/zfs/compatibility.d
.Pc ,
списки запрашиваемых функций считываются из этих файлов,
разделенных пробелами и/или запятыми.
Включены только те функции, которые присутствуют во всех файлах.
.Pp
К файлам применяются простые проверки на работоспособность:
их размер должен составлять от 1 до 16 КБ и заканчиваться символом новой строки.
.Pp
Запрошенные функции применяются при создании пула с использованием
.Nm zpool Cm create Fl o Sy compatibility Ns = Ns Ar …
и управляет тем, какие функции включаются при использовании
.Nm zpool Cm upgrade .
.Nm zpool Cm status
не будет отображаться предупреждение об отключенных функциях, которые не входят
в запрошенный набор функций.
.Pp
Особое значение
.Sy legacy
предотвращает включение каких-либо функций либо с помощью
.Nm zpool Cm upgrade
или
.Nm zpool Cm set Sy feature Ns @ Ns Ar feature-name Ns = Ns Sy enabled .
Этот параметр также предотвращает обновление пулов до более новых версий на диске.
Это мера предосторожности, позволяющая предотвратить
случайное включение новых функций, нарушающих совместимость.
.Pp
По соглашению, файлы совместимости в
.Pa /usr/share/zfs/compatibility.d
предоставляются дистрибутивом и включают в себя наборы функций,
поддерживаемые важными версиями популярных дистрибутивов, а
также наборы функций, обычно поддерживаемые в начале каждого года.
Compatibility files in
.Pa /etc/zfs/compatibility.d ,
если присутствует, будет иметь приоритет над файлами с таким же именем в
.Pa /usr/share/zfs/compatibility.d .
.Pp
Если в этих файлах обнаружен нераспознанный объект, будет показано сообщение об ошибке.
Если нераспознанный объект находится в файле в
.Pa /etc/zfs/compatibility.d ,
это будет расценено как ошибка, и обработка будет остановлена.
Если нераспознанный объект находится под
.Pa /usr/share/zfs/compatibility.d ,
это расценивается как предупреждение, и обработка будет продолжена.
Это отличие заключается в том, что дистрибутивы могут включать функции,
которые могут быть не распознаны установленными в данный момент двоичными файлами.
.Pp
Файлы совместимости могут содержать комментарии:
любое сообщение от
.Sq #
до конца строки игнорируется.
.Pp
.Sy Пример :
.Bd -literal -compact -offset 4n
.No example# Nm cat Pa /usr/share/zfs/compatibility.d/grub2
# Функции, которые поддерживаются GRUB2
allocation_classes
async_destroy
block_cloning
bookmarks
device_rebuild
embedded_data
empty_bpobj
enabled_txg
extensible_dataset
filesystem_limits
hole_birth
large_blocks
livelist
log_spacemap
lz4_compress
project_quota
resilver_defer
spacemap_histogram
spacemap_v2
userobj_accounting
zilsaxattr
zpool_checkpoint

.No example# Nm zpool Cm create Fl o Sy compatibility Ns = Ns Ar grub2 Ar bootpool Ar vdev
.Ed
.Pp
Смотрите
.Xr zpool-create 8
и
.Xr zpool-upgrade 8
для получения дополнительной информации о том, как наборы функций влияют на эти команды.
.
.de функция
.It Sy \\$2
.Bl -tag -compact -width "READ-ONLY COMPATIBLE"
.It GUID
.Sy \\$1:\\$2
.if !"\\$4"" \{\
.It ЗАВИСИМОСТИ
\fB\\$4\fP\c
.if !"\\$5"" , \fB\\$5\fP\c
.if !"\\$6"" , \fB\\$6\fP\c
.if !"\\$7"" , \fB\\$7\fP\c
.if !"\\$8"" , \fB\\$8\fP\c
.if !"\\$9"" , \fB\\$9\fP\c
.\}
.It READ-ONLY COMPATIBLE
\\$3
.El
.Pp
..
.
.ds instant-never \
.No Эта функция становится активной, как только она включена \
и никогда не вернется к включенному Sy .
.
.ds remount-upgrade \
.No Каждая файловая система будет автоматически обновлена при повторном монтаже, \
или когда в этой файловой системе создается новый файл. \
Обновление также может быть запущено в файловых системах с помощью \
Nm zfs Cm set Sy version Ns = Ns Sy current Ar fs . \
No Процесс обновления выполняется в фоновом режиме и может занять некоторое время \
для файловых систем, содержащих большие объемы файлов .
.
.de checksum-spiel
Когда функция
.Sy \\$1
установлена на
.Sy enabled ,
администратор может включить
.Sy \\$1
checksum для любого набора данных с использованием
.Nm zfs Cm set Sy checksum Ns = Ns Sy \\$1 Ar dset
.Po смотрите Xr zfs-set 8 Pc .
Эта функция становится
.Sy active
один раз, когда для свойства
.Sy checksum
было установлено значение
.Sy \\$1 ,
и вернется к
.Sy enabled
как только для всех файловых систем, checksum которых когда-либо была установлена на
.Sy \\$1 ,
уничтожится.
..
.
.Sh ФУНКЦИИ
В этой системе поддерживаются следующие функции:
.Bl -tag -width Ds
.feature org.zfsonlinux allocation_classes yes
Эта функция обеспечивает поддержку отдельных классов распределения.
.Pp
Эта функция становится
.Sy active
когда выделенный класс распределения vdev
.Pq дедупликация или специальное
создастся с помощью
.Nm zpool Cm create No или Nm zpool Cm add No commands .
После извлечения устройства оно может быть возвращено в состояние
.Sy enabled ,
если все vdevs выделенного класса распределения будут удалены.
.
.feature com.delphix async_destroy yes
Для уничтожения файловой системы требуется просмотреть все ее данные, чтобы
вернуть использованное пространство в пул.
Без
.Sy async_destroy ,
файловая система не удаляется полностью, пока не будет освобождено все пространство.
Если операция удаления прерывается из-за перезагрузки или отключения питания,
при следующей попытке открыть пул потребуется выполнить
операцию удаления синхронно.
.Pp
Когда
.Sy async_destroy
включен, данные файловой системы будут восстановлены фоновым процессом,
что позволит завершить операцию уничтожения
без обхода всей файловой системы.
Фоновый процесс может возобновить
прерванное удаление данных после открытия пула, что устраняет необходимость
завершать прерванное удаление данных в рамках операции открытия.
Объем пространства, оставшийся для использования фоновым процессом,
доступен через свойство
.Sy freeing .
.Pp
Эта функция может быть только
.Sy active ,
пока
.Sy freeing
является ненулевым.
.
.feature org.openzfs blake3 no extensible_dataset
Эта функция позволяет использовать алгоритм хэширования BLAKE 3 для определения контрольной суммы и
дедупликации.
BLAKE 3 - это безопасный алгоритм хэширования, ориентированный на высокую производительность.
.Pp
.checksum-spiel blake3
.
.feature com.fudosecurity block_cloning yes
Когда эта функция включена, ZFS будет использовать клонирование блоков для таких операций, как
.Fn copy_file_range 2 .
Клонирование блоков позволяет создавать несколько ссылок на один блок.
Это намного быстрее, чем копирование данных (поскольку фактические данные не считываются и не
записываются), и не занимает дополнительного места.
Блоки могут быть клонированы в наборах данных при определенных условиях (например, при равенстве
.Nm recordsize ,
тот же главный ключ шифрования и т.д.).
ZFS делает все возможное для клонирования наборов данных, включая зашифрованные.
Это ограничено по различным (нетривиальным) причинам, зависящим от операционной
системы и/или внутренних компонентов ZFS.
.Pp
Эта функция становится
.Sy active
когда будет клонирован первый блок.
Когда последний клонированный блок освобождается, он возвращается во включенное состояние.
.feature com.delphix bookmarks yes extensible_dataset
Эта функция позволяет использовать команду
.Nm zfs Cm bookmark .
.Pp
Эта функция является
.Sy active ,
пока в пуле есть какие-либо закладки.
Все закладки в пуле можно просмотреть, выполнив
.Nm zfs Cm list Fl t Sy bookmark Fl r Ar poolname .
.
.feature com.datto bookmark_v2 no bookmark extensible_dataset
Эта функция позволяет создавать закладки большего размера и управлять ими, которые
необходимы для других функций ZFS.
.Pp
Эта функция становится
.Sy active
когда закладка версии 2 будет создана и будет возвращена в исходное состояние
.Sy enabled
когда все закладки версии 2 будут уничтожены.
.
.feature com.delphix bookmark_written no bookmark extensible_dataset bookmark_v2
Эта функция включает дополнительные поля учета закладок, позволяя использовать свойство
.Sy written Ns # Ns Ar bookmark

.Pq пробел, оставленный после закладки
и оценки размеров потока отправки для добавочных закладок from.
.Pp
Эта функция становится
.Sy active
когда закладка будет создана и будет
возвращена в состояние
.Sy enabled
когда все закладки с этими полями будут уничтожены.
.
.feature org.openzfs device_rebuild yes
Эта функция обеспечивает возможность для команд
.Nm zpool Cm attach
и
.Nm zpool Cm replace
для выполнения последовательной реконструкции
.Pq вместо исцеляющей реконструкции
при восстановлении.
.Pp
Последовательное восстановление восстанавливает устройство в порядке LBA без немедленной
проверки контрольных сумм.
После завершения запускается очистка, которая затем проверяет контрольные суммы.
Такой подход позволяет восстановить полную избыточность в пуле
за минимальное время.
Этот двухэтапный подход займет больше времени, чем восстановление серебра,
если учесть время проверки контрольных сумм.
Однако, если нет дополнительного повреждения пула, проверка не
должна сообщать об ошибках контрольной суммы.
Эта функция несовместима с конфигурациями raid.
.
Эта функция становится
.Sy active
во время выполнения последовательного восстановления и возвращается к
.Sy enabled
когда завершится восстановление.
.
.feature com.delphix device_removal no
Эта функция позволяет выполнять команду
.Nm zpool Cm remove
удалить vdevs верхнего уровня,
удалив их, чтобы уменьшить общий размер пула.
.Pp
Эта функция становится
.Sy active
когда команда
.Nm zpool Cm remove
используется
в vdev верхнего уровня и никогда не вернется к состоянию
.Sy enabled .
.
.feature org.openzfs draid no
Эта функция позволяет использовать тип
.Sy draid 
vdev.
dRAID - это вариант RAID-Z, который обеспечивает интегрированное распределенное
резервное копирование, позволяющее ускорить восстановление при сохранении преимуществ RAID-Z.
Данные, контроль четности и свободное пространство организованы в группы резервирования
и равномерно распределены по всем устройствам.
.Pp
Эта функция становится
.Sy active
при создании пула, использующего тип
.Sy draid 
vdev,
или при добавлении нового
.Sy draid
vdev в существующий пул.
.
.feature org.illumos edonr no extensible_dataset
Эта функция позволяет использовать алгоритм хэширования Edon-R для определения контрольной суммы,
в том числе для записи nop
.Po если сжатие также включено, перезапись
блока, контрольная сумма которого совпадает с записываемыми данными, будет проигнорирована
.Pc .
С особой осторожностью Edon-R требует проверки при использовании с
dedup:
.Nm zfs Cm set Sy dedup Ns = Ns Sy edonr , Ns Sy verify
.Po смотрите Xr zfs-set 8 Pc .
.Pp
Edon-R - это очень высокопроизводительный алгоритм хэширования, который участвовал
в конкурсе NIST SHA-3.
Он обеспечивает чрезвычайно высокую производительность хэширования
.Pq более чем на 350% быстрее, чем SHA-256 ,
но не был выбран из-за его непригодности
в качестве алгоритма безопасного хэширования общего назначения.
В этой реализации используется новая функция вычисления контрольной
суммы в ZFS, которая означает, что контрольная сумма предварительно вводится с помощью секретного ключа
256-битный случайный ключ
.Pq хранится в пуле
перед отправкой блок данных обрабатывается с контрольной суммой.
Таким образом, полученные контрольные суммы уникальны для данного пула,
что предотвращает атаки на коллизию хэшей в системах с дедупликацией.
.Pp
.checksum-spiel edonr
.
.feature com.delphix embedded_data no
Эта функция повышает производительность и
степень сжатия блоков с высокой степенью сжатия.
Блоки, содержимое которых может быть сжато до 112 байт
или меньше, могут воспользоваться преимуществами этой функции.
.Pp
Когда эта функция включена, содержимое блоков с высокой степенью сжатия
сохраняется в блоке
.Dq pointer
само
.Po в данном случае это неправильное название, поскольку оно содержит
сжатые данные, а не указатель на их расположение на диске
.Pc .
Таким образом, пространство блока
.Pq один сектор, обычно размером 512 Б или 4 КБ
сохраняется, и для чтения и записи блока данных не требуется никакого дополнительного ввода-вывода.
.
\*[instant-never]
.
.feature com.delphix empty_bpobj yes
Эта функция повышает производительность при создании и использовании большого
количества моментальных снимков одной файловой системы или тома, а также сокращает
объем требуемого дискового пространства.
.Pp
Когда снимков много, в каждом снимке используется множество объектов-указателей блоков
.Pq bpobjs
для отслеживания блоков, связанных с этим снимком.
Однако в обычных случаях большинство этих объектов-указателей пусты.
Эта функция позволяет нам создавать каждый bpobj по запросу,
тем самым устраняя пустые bpobj.
.Pp
Эта функция остается
.Sy active
пока есть какие-либо файловые системы, тома
или моментальные снимки, которые были созданы после включения этой функции.
.
.feature com.delphix enabled_txg yes
Как только эта функция включена, ZFS записывает номер группы транзакций,
в которой включены новые функции.
Это не оказывает заметного влияния на пользователя, но другие функции могут зависеть от этой функции.
.Pp
Эта функция становится
.Sy active
как только он будет включен и никогда не вернется к состоянию
.Sy enabled .
.
.feature com.datto encryption no bookmark_v2 extensible_dataset
Эта функция позволяет создавать наборы данных, зашифрованные изначально, и управлять ими.
.Pp
Эта функция становится
.Sy active
когда зашифрованный набор данных будет создан и будет возвращен в исходное состояние
.Sy enabled
когда все наборы данных, использующие эту функцию, будут уничтожены.
.
.feature com.delphix extensible_dataset no
Эта функция позволяет более гибко использовать внутренние структуры данных ZFS
и существует для того, чтобы от нее зависели другие функции.
.Pp
Эта функция будет
.Sy active
когда первая зависимая функция использует его, и будет возвращена в состояние
.Sy enabled
когда все наборы данных, использующие эту функцию, будут уничтожены.
.
.feature com.joyent filesystem_limits yes extensible_dataset
Эта функция позволяет устанавливать ограничения для файловой системы и моментальных снимков.
Эти ограничения можно использовать для управления количеством файловых систем и/или моментальных
снимков, которые могут быть созданы в той точке дерева, для которой установлены ограничения.
.Pp
Эта функция становится
.Sy active
после установки любого из предельных свойств для набора данных
и никогда не вернется к значению
.Sy enabled .
.
.feature com.delphix head_errlog no
Эта функция позволяет использовать обновленную версию errlog, которая требовала
изменения формата журнала ошибок на диске.
Теперь журнал ошибок каждого набора данных head хранится отдельно в объекте zap
и определяется идентификатором head.
При включенной этой функции каждый набор данных, на который повлиял блок ошибок, отображается
в выходных данных
.Nm zpool Cm status .
В случае зашифрованных файловых систем с незагруженными ключами мы не сможем проверить
их снимки или клоны на наличие ошибок, и о них не будет сообщено.
Будет сообщено об ошибке "доступ запрещен".
.Pp
\*[instant-never]
.
.feature com.delphix hole_birth no enabled_txg
В этой функции есть / были ошибки, результатом которых является то, что, если вы выполните
.Nm zfs Cm send Fl i
.Pq или Fl R , No поскольку он использует Fl i
из поврежденного набора данных принимающая сторона не увидит никакой контрольной
суммы или других ошибок, но результирующий целевой снимок
не будет соответствовать исходному.
Его использование
.Nm zfs Cm send Fl i
по умолчанию было отключено
.Po
смотрите
.Sy send_holes_without_birth_time
в
.Xr zfs 4
.Pc .
.Pp
Эта функция повышает производительность инкрементных отправок
.Pq Nm zfs Cm send Fl i
и принимает для объектов с большим количеством отверстий.
Наиболее распространенным случаем объектов, заполненных отверстиями, является zvols.
.Pp
Инкрементный поток отправки из снапшота
.Sy A No в снапшот Sy B
содержит информацию о каждом блоке, который изменился между
.Sy A No и Sy B .
Блоки, которые не менялись между этими моментальными снимками, могут быть
идентифицированы и исключены из потока с помощью фрагмента метаданных,
называемого
.Dq block birth time ,
но время появления отверстий не фиксируется
.Pq блоки, заполненные только нулями .
Поскольку отверстия, созданные после
.Sy A No невозможно отличить от дыр, созданных до Sy A,
информация о каждой дыре во всей файловой системе или zvol
включается в поток отправки.
.Pp
Для рабочих нагрузок, где отверстия встречаются редко, это не проблема.
Однако при постепенной репликации файловых систем или ZVOL с большим количеством отверстий
.Pq например, файл zvol, отформатированный с помощью другой файловой системы
много времени будет потрачено на отправку и получение ненужной информации
о дырах, которые уже существуют на принимающей стороне.
.Pp
Как только функция
.Sy hole_birth
при включении блокировки
будет записываться время появления всех новых отверстий.
При добавочной отправке между снимками, созданными после включения этой функции,
будут использоваться эти новые метаданные, чтобы избежать отправки информации о отверстиях, которые
уже существуют на принимающей стороне.
.Pp
\*[instant-never]
.
.feature org.open-zfs large_blocks no extensible_dataset
Эта функция позволяет установить размер записи в наборе данных, превышающий 128 Кбайт.
.Pp
Эта функция становится
.Sy active
как только набор данных будет содержать файл с размером блока более 128 КБ,
он снова станет
.Sy enabled
как только все файловые системы, размер записей в которых когда-либо превышал 128 КБ,
будут уничтожены.
.
.feature org.zfsonlinux large_dnode no extensible_dataset
Эта функция позволяет задать размер узлов в наборе данных, превышающий 512 байт.
.
Эта функция становится
.Sy active
как только набор данных содержит объект с dnode размером более 512 B, 
что происходит в результате установки свойству 
.Sy dnodesize
набора значений, отличного от
.Sy legacy .
Функция вернется в состояние
.Sy enabled
как только все файловые системы, которые когда-либо содержали узел размером более 512 байт,
будут уничтожены.
Большие узлы позволяют хранить больше данных в дополнительном буфере,
что потенциально повышает производительность за счет исключения использования дополнительных блоков.
.
.feature com.delphix livelist yes
Эта функция позволяет удалять клоны быстрее, чем традиционным способом,
когда в клон выполняется большое количество случайных/разреженных записей.
Все блоки, выделенные и освобожденные после создания клона, отслеживаются
в оперативном списке клона, на который ссылаются при удалении клона.
Функция активируется при создании клона и остается
.Sy active
пока все клоны не будут уничтожены.
.
.feature com.delphix log_spacemap yes com.delphix:spacemap_v2
Эта функция повышает производительность сильно фрагментированных пулов,
особенно при высокой рабочей нагрузке при случайной записи.
Это достигается путем регистрации всех изменений metaslab на одной пространственной карте каждый TXG
вместо того, чтобы выполнять множественные записи на все пространственные карты metaslab.
.Pp
\*[instant-never]
.
.feature org.illumos lz4_compress no
.Sy lz4
это высокопроизводительный алгоритм сжатия в реальном времени, который
обеспечивает значительно более быстрое сжатие и распаковку, а также более
высокую степень сжатия по сравнению с более старыми версиями сжатия
.Sy lzjb .
Типично,
.Sy lz4
сжатие сжимаемых данных происходит примерно на 50% быстрее, а
несжимаемых - на 200% быстрее, чем
.Sy lzjb .
Это также примерно на 80% ускоряет распаковку,
обеспечивая при этом примерно на 10% лучшую степень сжатия.
.Pp
Когда функция
.Sy lz4_compress
установлена на
.Sy enabled ,
администратор может включить сжатие
.Sy lz4
любого набора данных в пуле используя команду
.Xr zfs-set 8 .
Все вновь записанные метаданные будут сжаты с помощью алгоритма
.Sy lz4 .
.Pp
\*[instant-never]
.
.feature com.joyent multi_vdev_crash_dump no
Эта функция позволяет сконфигурировать дамп-устройство с пулом, состоящим
из нескольких vdevs.
Эти vdevs могут быть расположены в любой зеркальной конфигурации или конфигурации raidz.
.Pp
Когда функция
.Sy multi_vdev_crash_dump
установлена на
.Sy enabled ,
администратор может использовать
.Xr dumpadm 8
чтобы настроить дамп-устройство в пуле, состоящем из нескольких vdevs.
.Pp
Под
.Fx
в Linux эта функция не используется, но зарегистрирована для обеспечения совместимости.
Новые пулы, созданные в этих системах, будут иметь эту функцию
.Sy enabled
но никогда не перейдут к
.Sy active ,
поскольку эта функция не требуется для поддержки аварийного сброса данных.
Существующие пулы, в которых эта функция
.Sy active
может быть импортирована.
.
.feature com.delphix obsolete_counts yes device_removal
Эта функция является усовершенствованием
.Sy device_removal ,
что со временем сократит объем памяти, используемой для отслеживания удаленных устройств.
Когда косвенные блоки освобождаются или переназначаются,
мы отмечаем, что их часть косвенного отображения
.Dq устарела
– больше не нужна.
.Pp
Эта функция становится
.Sy active
когда команда
.Nm zpool Cm remove
используется в vdev верхнего уровня и никогда не вернется к состоянию
.Sy enabled .
.
.feature org.zfsonlinux project_quota yes extensible_dataset
Эта функция позволяет администраторам учитывать информацию об использовании пространств и объектов
в соответствии с идентификатором проекта
.Pq ID .
.Pp
Идентификатор проекта - это атрибут, основанный на объекте.
При обновлении существующей файловой
системы объектам без идентификатора проекта будет присвоен нулевой идентификатор проекта.
Когда эта функция включена, вновь созданные объекты наследуют
идентификатор проекта своих родительских каталогов, если установлен флаг наследования родительского каталога
.Pq via Nm chattr Sy [+-]P No или Nm zfs Cm project Fl s Ns | Ns Fl C .
В противном случае идентификатор проекта нового объекта будет равен нулю.
Идентификатор проекта объекта может быть изменен владельцем в любое время
.Pq или привилегированный пользователь
через
.Nm chattr Fl p Ar prjid
или
.Nm zfs Cm project Fl p Ar prjid .
.Pp
Эта функция станет
.Sy active
как только он будет включен и никогда не вернется к состоянию
.Sy disabled .
\*[remount-upgrade]
.
.feature com.delphix redaction_bookmarks no bookmarks extensible_dataset
Эта функция позволяет использовать отредактированные
.Nm zfs Cm send Ns s ,
которые создают закладки редактирования, хранящие список блоков,
отредактированных создавшим их пользователем.
Дополнительные сведения об отредактированных отправлениях смотрите в разделе
.Xr zfs-send 8 .
.
.feature com.delphix redacted_datasets no extensible_dataset
Эта функция позволяет получать отредактированные потоки
.Nm zfs Cm send ,
которые при получении создают отредактированные наборы данных.
В этих наборах данных отсутствуют некоторые блоки,
поэтому их невозможно безопасно подключить, а их содержимое невозможно безопасно прочитать.
Дополнительные сведения об отредактированных получениях смотрите в разделе
.Xr zfs-send 8 .
.
.feature com.datto resilver_defer yes
Эта функция позволяет ZFS отложить запуск новых распознавателей, если уже
выполняется существующий.
Без этой функции любые новые распознаватели приведут
к немедленному перезапуску запущенного в данный момент распознавателя с самого начала.
.Pp
Эта функция становится
.Sy active
после того, как восстановление было отложено, и оно возвращается в состояние
.Sy enabled
когда начнется отложенный распознаватель.
.
.feature org.illumos sha512 no extensible_dataset
Эта функция позволяет использовать алгоритм усеченного хэширования SHA-512/256
.Pq FIPS 180-4
для получения контрольной суммы и дедупликации.
Встроенная 64-разрядная арифметика SHA-512 обеспечивает
повышение производительности примерно на 50% по сравнению с SHA-256 на 64-разрядном оборудовании
и, таким образом, является хорошим кандидатом на замену с минимальными изменениями
для систем, где важна производительность хэширования,
но эти системы по какой-либо причине не могут использовать более быстрые алгоритмы
.Sy skein No и Sy edonr .
.Pp
.checksum-spiel sha512
.
.feature org.illumos skein no extensible_dataset
Эта функция позволяет использовать алгоритм хэширования Skein для определения контрольной суммы и дедупликации.
Skein - это высокопроизводительный алгоритм безопасного хэширования, который стал
финалистом конкурса NIST SHA-3.
Он обеспечивает очень высокий уровень безопасности и высокую производительность на 64-разрядном оборудовании
.Pq на 80% быстрее, чем SHA-256.
В этой реализации также используется новая
функция вычисления контрольной суммы в ZFS, которая означает, что контрольная сумма предварительно вводится с
помощью секретного 256-битного случайного ключа
.Pq хранится в пуле
перед отправкой блок данных обрабатывается с контрольной суммой.
Таким образом, полученные контрольные суммы уникальны для данного пула,
что предотвращает атаки на коллизию хэшей в системах с дедупликацией.
.Pp
.checksum-spiel skein
.
.feature com.delphix spacemap_histogram yes
Эта функция позволяет ZFS сохранять больше информации о том, как организовано свободное пространство
в пуле.
Если функция
.Sy enabled ,
он будет активирован при создании нового объекта космической карты или
обновлении существующей космической карты до нового формата
и никогда не вернется к состоянию
.Sy enabled .
.
.feature com.delphix spacemap_v2 yes
Эта функция позволяет использовать новую кодировку космической карты, состоящую из двух слов
.Pq вместо одного
всякий раз, когда это выгодно.
Новая кодировка позволяет картам пространства более эффективно отображать большие области
пространства на диске, одновременно увеличивая их максимальное
адресуемое смещение.
.Pp
Эта функция становится
.Sy active
как только она будет
.Sy enabled ,
и никогда не вернется обратно в состояние
.Sy enabled .
.
.feature org.zfsonlinux userobj_accounting yes extensible_dataset
Эта функция позволяет администраторам учитывать информацию об использовании объекта
пользователями и группами.
.Pp
\*[instant-never]
\*[remount-upgrade]
.
.feature com.klarasystems vdev_zaps_v2 no
Эта функция создает объект ZAP для корневого vdev.
.Pp
Эта функция становится активной после следующего
.Nm zpool Cm import
или
.Nm zpool reguid .
.
Свойства могут быть извлечены или установлены в корневом vdev с помощью
.Nm zpool Cm get
и
.Nm zpool Cm set
с
.Sy root
как имя vdev, которое является псевдонимом для
.Sy root-0 .
.feature org.openzfs zilsaxattr yes extensible_dataset
Эта функция позволяет вести журнал расширенных атрибутов
.Sy xattr Ns = Ns Sy sa
в ZIL.
Если этот параметр включен, расширенные изменения атрибутов
.Pq как Sy xattrdir Ns = Ns Sy dir No , так и Sy xattr Ns = Ns Sy sa
гарантированно будут долговременными, если либо в наборе данных на момент внесения изменений было установлено значение 
.Sy sync Ns = Ns Sy always ,
или
.Xr sync 2
вызывается для набора данных после внесения изменений.
.Pp
Эта функция становится
.Sy active
когда ZIL будет создан хотя бы для одного набора данных и будет возвращен в состояние
.Sy enabled
когда он будет уничтожен для всех наборов данных, использующих эту функцию.
.
.feature com.delphix zpool_checkpoint yes
Эта функция позволяет выполнять команду
.Nm zpool Cm checkpoint ,
которая позволяет отслеживать состояние пула
на момент его создания, а затем вернуться к нему или отменить его.
.Pp
Эта функция становится
.Sy active
когда команда
.Nm zpool Cm checkpoint
используется для проверки пула.
Функция вернется в состояние
.Sy enabled
когда пул будет перемотан назад или контрольная точка будет удалена.
.
.feature org.freebsd zstd_compress no extensible_dataset
.Sy zstd
это высокопроизводительный алгоритм сжатия
, который сочетает в себе высокую степень сжатия и высокую скорость.
По сравнению с
.Sy gzip ,
.Sy zstd
обеспечивает несколько лучшую компрессию при гораздо более высоких скоростях.
По сравнению с
.Sy lz4 ,
.Sy zstd
обеспечивает гораздо лучшее сжатие при незначительном замедлении.
Типично, скорость сжатия
.Sy zstd
колеблется от 250 до 500 МБ/с на поток,
а скорость распаковки составляет более 1 ГБ/с на поток.
.Pp
Когда функция
.Sy zstd
установлена на
.Sy enabled ,
администратор может включить сжатие
.Sy zstd
любого набора данных с использованием
.Nm zfs Cm set Sy compress Ns = Ns Sy zstd Ar dset
.Po see Xr zfs-set 8 Pc .
Эта функция становится
.Sy active
когда параметру
.Sy compress
было установлено значение
.Sy zstd ,
и вернется к
.Sy enabled
как только все файловые системы, которые когда-либо обладали своим свойством
.Sy compress
установленные в
.Sy zstd
будут уничтожены.
.El
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs 8 ,
.Xr zpool 8
