melkorbsd/ru-freebsd-man/man8/bhyvectl.8
.\" Copyright (c) 2015 Christian Brueffer
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 4, 2020
.Dt BHYVECTL 8
.Os
.Sh НАИМЕНОВАНИЕ
.Nm bhyvectl
.Nd "это утилита направленная на управление экземплярами bhyve"
.Sh СИНТАКСИС
.Nm
.Fl -vm= Ns Ar <vmname>
.Op Fl -create
.Op Fl -destroy
.Op Fl -get-stats
.Op Fl -inject-nmi
.Op Fl -force-reset
.Op Fl -force-poweroff
.Op Fl -checkpoint= Ns Ar <filename>
.Op Fl -suspend= Ns Ar <filename>
.Sh ОПИСАНИЕ
Команда
.Nm
это утилита управления активными
.Xr bhyve 8
экземплярами виртуальных машин.
.Pp
.Em Примечание :
Большинство флагов
.Nm
предназначены для запроса и установки состояния активного экземпляра.
Эти команды предназначены для разработки и здесь не документированы.
Полный список команд можно получить, выполнив
.Nm
без каких-либо аргументов.
.Pp
Параметры взаимодействия с пользователем следующие:
.Bl -tag -width ".Fl d Ar argument"
.It Fl -vm= Ns Ar <vmname>
Работать на виртуальной машине
.Ar <vmname> .
.It Fl -create
Создать указанную виртуальную машину VM.
.It Fl -destroy
Уничтожить указанную виртуальную машину VM.
.It Fl -get-stats
Получить статистику для указанной виртуальной машины VM.
.It Fl -inject-nmi
Внедрите немаскируемое прерывание (NMI) в виртуальную машину.
.It Fl -force-reset
Принудительно перезагрузить виртуальную машину.
.It Fl -force-poweroff
Принудительно выключите виртуальную машину.
.It Fl -checkpoint= Ns Ar <filename>
Сохраните текущее состояние виртуальной машины (снимок).
Содержимое гостевой памяти сохраняется в файле, указанном в
.Ar <filename> .
Состояние гостевого устройства и виртуального ЦП сохраняются в файле
.Ar <filename>.kern .
.It Fl -suspend= Ns Ar <filename>
Сохраните снимок виртуальной машины, аналогичный
.Fl -checkpoint .
Работа виртуальной машины завершится после сохранения моментального
снимка.
.El
.Sh ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
.Ex -std
.Sh ПРИМЕРЫ
Уничтожьте виртуальную машину под названием fbsd10:
.Pp
.Dl "bhyvectl --vm=fbsd10 --destroy"
.Sh СОВМЕСТИМОСТЬ
Формат файла моментального снимка еще не стабилен и может быть изменен в будущем.
Поддержка обратной совместимости для текущего формата файла моментального снимка
не гарантируется при внесении будущих изменений.
.Sh СМОТРИ ТАКЖЕ
.Xr bhyve 8 ,
.Xr bhyveload 8
.Sh ИСТОРИЯ
Команда
.Nm
впервые появилась в
.Fx 10.1 .
.Sh АВТОРЫ 
.An -nosplit
Утилита
.Nm
была написана
.An Peter Grehan
и
.An Neel Natu .
