melkorbsd/ru-freebsd-man/man8/bhyve.8
.\" Copyright (c) 2013 Peter Grehan
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 20, 2023
.Dt BHYVE 8
.Os
.Sh НАИМЕНОВАНИЕ
.Nm bhyve
.Nd "запуск гостевой операционной системы внутри виртуальной машины"
.Sh СИНТАКСИС
.Nm
.Op Fl AaCDeHhPSuWwxY
.Oo
.Sm off
.Fl c\~
.Oo
.Op Cm cpus=
.Ar numcpus
.Oc
.Op Cm ,sockets= Ar n
.Op Cm ,cores= Ar n
.Op Cm ,threads= Ar n
.Oc
.Sm on
.Oo Fl f
.Sm off
.Ar name Cm \&,
.Oo
.Cm string No | Cm file
.Oc
.Cm \&= Ar data
.Sm on
.Oc
.Oo
.Sm off
.Fl G\~
.Oo Ar w Oc
.Oo Ar bind_address Cm \&: Oc
.Ar port
.Sm on
.Oc
.Op Fl k Ar config_file
.Op Fl K Ar layout
.Oo Fl l
.Sm off
.Ar lpcdev Op Cm \&, Ar conf
.Sm on
.Oc
.Sm off
.Oo Fl m\~
.Ar memsize
.Oo
.Cm K | Cm k | Cm M | Cm m | Cm G | Cm g | Cm T | Cm t
.Oc
.Sm on
.Oc
.Op Fl o Ar var Ns Cm = Ns Ar value
.Op Fl p Ar vcpu Ns Cm \&: Ns Ar hostcpu
.Op Fl r Ar file
.Sm off
.Oo Fl s\~
.Ar slot Cm \&, Ar emulation Op Cm \&, Ar conf
.Sm on
.Oc
.Op Fl U Ar uuid
.Ar vmname
.Nm
.Fl l Cm help
.Nm
.Fl s Cm help
.Sh ОПИСАНИЕ
.Nm
это гипервизор, который запускает гостевые операционные системы внутри
виртуальной машины.
.Pp
Такие параметры, как количество виртуальных процессоров, объем гостевой
памяти, и возможности ввода-вывода, могут быть заданы с помощью параметров
командной строки.
.Pp
Если не используется загрузочное ПЗУ, гостевая операционная система должна
быть загружена с помощью команды
.Xr bhyveload 8
или аналогичным загрузчиком перед запуском
.Nm ,
в противном случае, достаточно запустить
.Nm
с выбранным загрузочным ПЗУ.
.Pp
.Nm
работает до тех пор, пока гостевая операционная система не перезагрузится или
не будет обнаружен необработанный выход из гипервизора.
.Sh КЛЮЧИ
.Bl -tag -width 10n
.It Fl A
Генерировать таблицы ACPI.
Требуется для гостей
.Fx Ns /amd64 .
.It Fl a
Локальный APIC гостя настроен в режиме xAPIC.
На xAPIC является настройкой по умолчанию, поэтому эта опция является
избыточной.
В будущих версиях она будет упразднена.
.It Fl C
Включить гостевую память в файл ядра.
.It Fl c Op Ar setting ...
Количество гостевых виртуальных процессоров
и/или топология процессоров.
Значение значение по умолчанию для каждого из параметров
.Ar numcpus ,
.Ar sockets ,
.Ar cores ,
и
.Ar threads
равно 1.
Если значение
.Ar numcpus
не указано, то оно будет вычислено из других аргументов.
Топология должна быть последовательной, так как
.Ar numcpus
должно быть равно произведению
.Ar sockets ,
.Ar cores ,
и
.Ar threads .
Если
.Ar setting
указан более одного раза, приоритет имеет последний.
.Pp
Максимальное количество виртуальных процессоров по умолчанию равно количеству
активных физических процессоров в системе, доступных через переменную
.Va hw.vmm.maxcpu
.Xr sysctl 8 .
Ограничение можно настроить с помощью настраиваемой переменной загрузчика
.Va hw.vmm.maxcpu .
.It Fl D
Уничтожить виртуальную машину при выключении по инициативе гостя.
.It Fl e
Заставить
.Nm
завершать работу, когда гость обращается к порту ввода-вывода, который не эмулируется.
Это предназначено для целей отладки.
.It Fl f Ar name Ns Cm \&, Ns Oo Cm string Ns No | Ns Cm file Ns Oc Ns Cm \&= Ns Ar data
Добавляет файл fw_cfg
.Ar name
в интерфейс fw_cfg .
Если указано
.Cm string
то файл fw_cfg содержит строку в качестве данных.
Если указан
.Cm file
bhyve считывает файл и добавляет его содержимое в качестве данных fw_cfg.
.It Fl G Xo
.Sm off
.Oo Ar w Oc
.Oo Ar bind_address Cm \&: Oc
.Ar port
.Sm on
.Xc
Запускает отладочный сервер, использующий протокол GDB для экспорта состояния
гостя в отладчик.
Сокет IPv4 TCP будет привязан к указанному адресу
.Ar bind_address
и
.Ar port
для прослушивания соединений с отладчиком.
Одновременно к отладочному серверу может быть подключен только один отладчик.
Если опция начинается с
.Sq w ,
.Nm
приостановит выполнение на первой инструкции, ожидая подключения отладчика.
.It Fl H
Выводить виртуальный поток процессора при обнаружении инструкции HLT.
Если эта опция не указана, виртуальные процессоры будут использовать 100 %
процессора хоста.
.It Fl h
Вывести справочное сообщение и выйти.
.It Fl k Ar config_file
Установка переменных конфигурации из простого конфигурационного файла с
ключами-значениями файла.
Ожидается, что каждая строка конфигурационного файла будет состоять из из
имени переменной конфигурации, знака равенства
.It Fl K Ar layout
Укажите раскладку клавиатуры.
Значение, которое может быть указано, задает имя файла в
.Ar /usr/share/bhyve/kbdlayout .
Эта спецификация работает только при загрузке с UEFI mode для VNC.
При использовании VNC-клиента, поддерживающего QEMU Extended Key Event Message
(например, TigerVNC), этот параметр не нужен. 
При использовании VNC-клиента, не поддерживающего QEMU Extended Key Event 
Message (например, tightVNC), раскладка по умолчанию будет соответствовать 
клавиатуре США, если не указано иное.
.Pq Sq = ,
и значение.
Пробелы между именем переменной, знаком равенства или значением не допускаются.
Пустые строки и строки, начинающиеся с
.Sq #
игнорируются.
См. раздел
.Xr bhyve_config 5
для более подробной информации.
.It Fl l Cm help
Вывести список поддерживаемых устройств LPC.
.It Fl l Ar lpcdev Ns Op Cm \&, Ns Ar conf
Позволяет конфигурировать устройства за мостом LPC PCI-ISA.
Поддерживаются только устройства класса TTY
.Cm com1 , com2 , com3 ,
и
.Cm com4 ,
модуль TPM
.Cm tpm ,
устройство загрузочного ПЗУ
.Cm bootrom ,
тип
.Cm fwcfg
и устройство отладки/тестирования
.Cm pc-testdev .
.Pp
Возможные значения аргумента
.Ar conf
перечислены в описании флага
.Fl s .
.It Xo
.Fl m Ar memsize Ns Oo
.Sm off
.Cm K | k | M | m | G | g | T | t
.Sm on
.Oc
.Xc
Установка размера физической памяти гостя.
Это должен быть такой же размер, как и заданный c помощью
.Xr bhyveload 8 .
.Pp
Аргумент size может иметь суффикс
.Cm K , M , G
или
.Cm T
(в верхнем или нижнем регистре),
чтобы указать кратное число килобайт, мегабайт, гигабайт или терабайт.
Если суффикс не указан, предполагается, что значение будет в мегабайтах.
.Pp
По умолчанию используется значение 256M.
.It Fl o Ar var Ns Cm = Ns Ar value
 Установить переменную конфигурации
.Ar var
в значение
.Ar value .
.It Fl P
Заставить гостевой виртуальный процессор завершить работу при обнаружении 
инструкции PAUSE.
.It Fl p Ar vcpu Ns Cm \& : Ns Ar hostcpu
Привязать виртуальный процессор гостя
.Em vcpu
к
.Em hostcpu .
.It Fl r Ar file
Возобновление работы гостя из моментального снимка.
Содержимое памяти гостя восстанавливается из
.Ar file ,
а состояние гостевого устройства и vCPU - из файла
.Dq Ar file Ns .kern .
.Pp
Обратите внимание, что текущий формат файла снапшота требует, чтобы конфигурация устройств в новой виртуальной машине соответствовала конфигурации виртуальной машины, из которой был сделан снапшот, для чего необходимо указать те же опции
.Fl s
и
.Fl l .
Количество vCPU и конфигурация памяти считываются из моментального снимка.
.It Fl S
Проводка гостевой памяти.
.It Fl s Cm help
Вывод списка поддерживаемых PCI-устройств.
.It Fl s Ar slot Ns Cm \&, Ns Ar emulation Ns Op Cm \&, Ns Ar conf
Настройка виртуального слота PCI и его функций.
.Pp
.Nm
предоставляет эмуляцию шины PCI и виртуальные устройства, которые могут быть
подключены к слотам на шине.	
Имеется 32 доступных слота с возможностью предоставления до 8 функций на слот.
.Pp
.Ar Слот
может быть указан в одном из следующих форматов:
.Pp
.Bl -bullet -compact
.It
.Ar pcislot
.It
.Sm off
.Ar pcislot Cm \&: Ar function
.Sm on
.It
.Sm off
.Ar bus Cm \&: Ar pcislot Cm \&: Ar function
.Sm on
.El
.Pp
Значение
.Ar pcislot
от 0 до 31.
Необязательное значение
.Ar function
от 0 до 7.
Необязательное значение 
.Ar bus
от 0 до 255.
Если значение
.Ar function
не указано, по умолчанию принимается значение 0.
Если значение
.Ar bus
не указано, по умолчанию принимается значение 0.
.Pp
Аргумент
.Ar emulation
может быть одним из следующих:
.Bl -tag -width "amd_hostbridge"
.It Cm hostbridge
Простой хост-мост.
Обычно он настраивается в слоте 0 и требуется большинством гостевых
операционных систем.
.It Cm amd_hostbridge
Эмуляция, идентичная
.Cm hostbridge
с идентификатором производителя PCI - AMD.
.It Cm passthru
Проходное устройство PCI.
.It Cm virtio-net
Сетевой интерфейс Virtio.
.It Cm virtio-blk
Интерфейс блочного хранения данных Virtio.
.It Cm virtio-scsi
Интерфейс SCSI Virtio.
.It Cm virtio-9p
Интерфейс Virtio 9p (VirtFS).
.It Cm virtio-rnd
Интерфейс Virtio RNG.
.It Cm virtio-console
Консольный интерфейс Virtio, который предоставляет гостю несколько портов в 
виде простых char-устройств для простых операций ввода-вывода между 
пользовательскими пространствами гостя и хоста.
.It Cm virtio-input
Интерфейс ввода Virtio.
.It Cm ahci
AHCI-контроллер, подключаемый к произвольным устройствам.
.It Cm ahci-cd
AHCI-контроллер, подключенный к ATAPI CD/DVD.
.It Cm ahci-hd
AHCI-контроллер, подключенный к жесткому диску SATA.
.It Cm e1000
Сетевой интерфейс Intel e82545.
.It Cm uart
Последовательное устройство PCI 16550.
.It Cm lpc
LPC PCI-ISA мост с последовательными портами COM1, COM2, COM3, and COM4 16550,
загрузочным ПЗУ и, опционально, типом fwcfg и устройством отладки/тестирования.
Эмуляция моста LPC может быть настроена только на шину 0.
.It Cm fbuf
Необработанное устройство фреймбуфера, подключенное к VNC-серверу.
.It Cm xhci
eXtensible Host Controller Interface (xHCI) Контроллер USB.
.It Cm nvme
Контроллер NVM Express (NVMe).
.It Cm hda
High Definition Audio Controller.
.El
.Pp
Необязательный параметр
.Ar conf
описывает бэкэнд для эмуляции устройств.
Если
.Ar conf
не указан, эмуляция устройства не имеет бэкэнда и может считаться 
неподключенной.
.Pp
Бэкенды сетевых устройств:
.Sm off
.Bl -bullet
.It
.Xo
.Cm tap Ar N
.Op Cm \&,mac= Ar xx:xx:xx:xx:xx:xx
.Op Cm \&,mtu= Ar N
.Xc
.It
.Xo
.Cm vmnet Ar N
.Op Cm \&,mac= Ar xx:xx:xx:xx:xx:xx
.Op Cm \&,mtu= Ar N
.Xc
.It
.Xo
.Cm netgraph,path= Ar ADDRESS Cm \&,peerhook= Ar HOOK
.Op Cm \&,socket= Ar NAME
.Op Cm \&,hook= Ar HOOK
.Op Cm \&,mac= Ar xx:xx:xx:xx:xx:xx
.Op Cm \&,mtu= Ar N
.Xc
.It
.Xo
.Cm slirp,hostfwd= Ar proto : Ar hostaddr : Ar hostport - Ar guestaddr : Ar guestport
.Xc
.El
.Sm on
.Pp
Если
.Cm mac
не указан, MAC-адрес определяется из фиксированного OUI, а остальные байты -
из MD5-хэша номеров слота и функции, а также имени устройства.
.Pp
MAC-адрес представляет собой строку ASCII в формате
.Xr ethers 5 .
.Pp
Для устройств
.Cm virtio-net
можно указать параметр
.Cm mtu
чтобы сообщить гостю наибольший разрешенный MTU, выраженный в байтах.
.Pp
Для бэкенда
.Cm netgraph
необходимо указать параметры
.Cm path
и
.Cm peerhook
чтобы задать узел назначения и соответствующее исправление.
Необязательные параметры
.Cm socket
и
.Cm hook
могут использоваться для задания имени узла
.Xr ng_socket 4
и исправления исходных текстов.
Параметры
.Ar ADDRESS ,
.Ar HOOK ,
и
.Ar NAME
должны соответствовать правилам адресации 
.Xr netgraph 4 .
.Pp
The slirp backend can be used to provide a NATed network to the guest.
This backend has poor performance but does not require any network
configuration on the host system.
It depends on the
.Pa net/libslirp
port.
The
.Cm hostfwd
option takes a 5-tuple describing how connections from the host are to be
forwarded to the guest.
Multiple rules can be specified, separated by semicolons.
Note that semicolons must be escaped or quoted to prevent the shell from
interpreting them.
.Pp
Механизмы блочных устройств хранения:
.Sm off
.Bl -bullet
.It
.Ar /filename Op Cm \&, Ar block-device-options
.It
.Ar /dev/xxx Op Cm \&, Ar block-device-options
.El
.Sm on
.Pp
The
.Ar block-device-options
are:
.Bl -tag -width 10n
.It Cm nocache
Открыть файл с помощью
.Dv O_DIRECT .
.It Cm direct
Открыть файл с помощью
.Dv O_SYNC .
.It Cm ro
Принудительное открытие файла только для чтения.
.It Cm sectorsize= Ns Ar logical Ns Oo Cm \&/ Ns Ar physical Oc
Укажите логический и физический размеры секторов эмулируемого диска.
Размер физического сектора необязателен и равен размеру логического сектора,
если он не указан явно.
.It Cm nodelete
Отключить эмуляцию запросов на обрезку гостевого диска через запросы
.Dv DIOCGDELETE .
.It Li bootindex= Ns Ar index
Добавить устройство в загрузчик по
.Ar index .
Для указания порядка загрузки используется файл fwcfg.
Гостевая прошивка может игнорировать или не поддерживать этот файл fwcfg.
В этом случае данная функция не будет работать так, как ожидалось.
.El
.Pp
Бэкенды SCSI-устройств:
.Sm off
.Bl -bullet
.It
.Pa /dev/cam/ctl Oo Ar pp Cm \&. Ar vp Oc Oo Cm \&, Ar scsi-device-options Oc
.El
.Sm on
.Pp
The
.Ar scsi-device-options
are:
.Bl -tag -width 10n
.It Cm iid= Ns Ar IID
Идентификатор инициатора для использования при отправке запросов на указанный
порт CTL.
По умолчанию значение равно 0.
.It Li bootindex= Ns Ar index
Добавить устройство в порядок загрузки по
.Ar index .
Для указания порядка загрузки используется файл fwcfg.
Гостевая прошивка может игнорировать или не поддерживать этот файл fwcfg.
В этом случае данная функция не будет работать так, как ожидалось.
.El
.Pp
Бэкенды устройств 9P:
.Sm off
.Bl -bullet
.It
.Ar sharename Cm = Ar /path/to/share Op Cm \&, Ar 9p-device-options
.El
.Sm on
.Pp
Параметры
.Ar 9p-device-options :
.Bl -tag -width 10n
.It Cm ro
Открыть общий ресурс в режиме только для чтения.
.El
.Pp
Бэкенды устройств TTY:
.Bl -tag -width 10n
.It Cm stdio
Подключить последовательный порт к стандартному вводу и выводу процесса
.Nm .
.It Ar /dev/xxx
Используйте TTY-устройство хоста для ввода/вывода через последовательный порт.
.El
.Pp
Бэкенды TPM-устройств:
.Bl -tag -width 10n
.It Ar type Ns \&, Ns Ar path Ns Op Cm \&, Ns Ar tpm-device-options
Эмуляция устройства TPM.
.El
.Pp
Параметры 
.Ar tpm-device-options
следующие:
.Bl -tag -width 10n
.It Cm version= Ns Ar version
Версия устройства TPM в соответствии со спецификацией TCG.
По умолчанию
.Cm 2.0
.El
.El
.Pp
Бэкенды для загрузки ROM-устройств:
.Bl -tag -width 10n
.It Ar romfile Ns Op Cm \&, Ns Ar varfile
Сопоставление
.Ar romfile
в гостевом адресном пространстве, зарезервированном для загрузочной
микропрограммы.
Если указан
.Ar varfile
этот файл также отображается в гостевом адресном пространстве загрузочной
микропрограммы, и все изменения, вносимые гостем, будут сохранены в этом файле.
.El
.Pp
Типы Fwcfg:
.Bl -tag -width 10n
.It Ar fwcfg
Интерфейс fwcfg используется для передачи гостевой микропрограмме такой
информации, как количество CPU или таблицы ACPI.
Поддерживаются следующие значения
.Ql bhyve
и
.Ql qemu .
По соображениям обратной совместимости,
.Ql bhyve
является опцией по умолчанию.
Когда используется
.Ql bhyve
применяется интерфейс fwctl от bhyve.
В настоящее время он сообщает гостевой микропрограмме только количество
процессоров.
Опция
.Ql qemu
использует интерфейс fwcfg QEMU.
Этот интерфейс широко используется и позволяет передавать гостю информацию,
заданную пользователем.
Он используется для передачи гостю количества процессоров, таблиц ACPI, порядка загрузки и многого другого.
Некоторые операционные системы, такие как Fedora CoreOS, также могут быть настроены с помощью интерфейса fwcfg в qemu.
.El
.Pp
Бэкенды проходных устройств:
.Sm off
.Bl -bullet
.It
.Cm ppt Ar N Oo , Ar passthru-device-options Oc
.It
.Ns Ar bus Cm \&/ Ar slot Cm \&/ Ar function
.Op , Ar passthru-device-options
.It
.Cm pci Ar bus Cm : Ar slot Cm : Ns Ar function
.Op , Ar passthru-device-options
.El
.Sm on
.Pp
Подключение к PCI-устройству на хосте либо с именем ppt
.Ns Ar N
либо с селектором, описанным номерами
.Ar slot ,
.Ar bus ,
и
.Ar function .
.Pp
Параметры
.Ar passthru-device-options
следующие:
.Bl -tag -width 10n
.It Cm rom= Ns Ar romfile
Добавить
.Ar romfile
в качестве дополнительного ПЗУ к PCI-устройству.
ПЗУ будет загружаться микропрограммой и должно быть способно инициализировать устройства.
.It Li bootindex= Ns Ar index
Добавить устройство в загрузчик по
.Ar index .
Для указания порядка загрузки используется файл fwcfg.
Гостевая прошивка может игнорировать или не поддерживать этот файл fwcfg.
В этом случае данная функция не будет работать так, как ожидается.
.El
.Pp
Гостевая память должна быть подключена с помощью опции
.Fl S
если настроено сквозное устройство.
.Pp
Хост-устройство должно быть зарезервировано во время загрузки с помощью
переменной загрузчика
.Va pptdevs
как описано в
.Xr vmm 4 .
.Pp
Устройства TPM:
.Bl -tag -width 10n
.It Ns Ar type
Указывает тип устройства TPM.
.Pp
Поддерживаемые типы:
.Bl -tag -width 10n
.It Cm passthru
.El
.It Cm version= Ns Ar version
Версия эмулируемого TPM-устройства в соответствии со спецификацией TCG
спецификации.
.Pp
Поддерживаемые версии:
.Bl -tag -width 10n
.It Cm 2.0
.El
.El
.Pp
Бэкенды консольных устройств Virtio:
.Bl -bullet
.Sm off
.It
.Cm port1= Ns Ar /path/to/port1.sock Ns Op Cm ,port Ns Ar N Cm \&= Ns Ar /path/to/port2.sock No \~ Ar ...
.Sm on
.El
.Pp
На одно устройство может быть создано не более 16 портов.
Каждый порт имеет имя и соответствует сокету домена Unix, созданному
.Nm .
.Nm
принимает не более одного соединения на порт одновременно.
.Pp
Ограничения:
.Bl -bullet
.It
Из-за отсутствия деструкторов в
.Nm ,
сокеты на файловой системе должны должны быть очищены вручную после выхода
.Nm .
.It
В настоящее время нет возможности использовать функцию
.Dq console port
а также функцию ни изменения размера порта.
.It
Объявлена аварийная запись, но на данный момент она не работает.
.El
.Pp
Бэкенды устройств ввода Virtio:
.Bl -tag -width 10n
.It Ar /dev/input/eventX
Передача событий ввода
.Ar /dev/input/eventX
гостю через интерфейс ввода VirtIO.
.El
.Pp
Бэкенды устройств фреймбуфера:
.Bl -bullet
.Sm off
.It
.Op Cm rfb= Ar ip-and-port
.Op Cm ,w= Ar width
.Op Cm ,h= Ar height
.Op Cm ,vga= Ar vgaconf
.Op Cm ,wait
.Op Cm ,password= Ar password
.Sm on
.El
.Pp
Параметры конфигурации определяются следующим образом:
.Bl -tag -width 10n
.It Cm rfb= Ns Ar ip-and-port Pq or Cm tcp= Ns Ar ip-and-port
IP-адрес и порт, на котором должен прослушиваться VNC.
Существует два формата:
.Pp
.Bl -bullet -compact
.It
.Sm off
.Op Ar IPv4 Cm \&:
.Ar port
.Sm on
.It
.Sm off
.Cm \&[ Ar IPv6%zone Cm \&] Cm \&: Ar port
.Sm on
.El
.Pp
По умолчанию прослушивается IPv4-адрес localhost и стандартный порт VNC 5900.
IPv6-адрес должен быть заключен в квадратные скобки и может содержать
необязательный идентификатор зоны.
.It Cm w= Ns Ar width No and Cm h= Ns Ar height
Разрешение дисплея, ширина и высота соответственно.
Если не указано, то по умолчанию будет использоваться разрешение 1024x768
пикселей.
Минимальное поддерживаемое разрешение - 640x480 пикселей, максимальное -
1920x1200 пикселей.
.It Cm vga= Ns Ar vgaconf
Возможные значения этой опции
.Cm io
(default),
.Cm on
, и
.Cm off .
PCI-графические карты имеют двойственный характер: они являются стандартными
PCI-устройствами с BAR-адресацией, но также могут неявно декодировать
устаревшее пространство ввода-вывода VGA
.Pq Ad 0x3c0-3df
и пространство памяти
.Pq 64KB at Ad 0xA0000 .
Опция
.Cm io
по умолчанию должна использоваться для гостей, которые пытаются выполнить
вызовы BIOS, приводящие к запросам портов ввода-вывода, и не могут
загрузиться, если декодирование ввода-вывода отключено.
.Pp
Параметр
.Cm on
следует использовать вместе с возможностью CSM BIOS в UEFI для загрузки гостей
с традиционным BIOS, которым требуется доступ к традиционным областям
ввода-вывода и памяти VGA.
.Pp
Опцию 
.Cm off
следует использовать для гостей UEFI, которые предполагают наличие
VGA-адаптера при обнаружении портов ввода/вывода.
Примером такого гостя является
.Ox
в режиме UEFI.
.Pp
Обратитесь к вики-странице
.Nm
.Fx
.Pq Lk https://wiki.freebsd.org/bhyve
для получения информации о конфигурации конкретных гостей.
.It Cm wait
Укажите
.Nm
загружаться только при инициировании VNC-соединения, что упростит установку
операционных систем, требующих немедленного ввода с клавиатуры.
Эта опция может быть удалена для использования после установки.
.It Cm password= Ns Ar password
Этот тип аутентификации известен как криптографически слабый и не предназначен
для использования в ненадежных сетях.
Многие реализации захотят использовать более надежную защиту, например, запуск
сессии по зашифрованному каналу, обеспечиваемому IPsec или SSH.
.El
.Pp
Бэкенды USB-устройств xHCI:
.Bl -tag -width 10n
.It Cm tablet
Планшетное USB-устройство, обеспечивающее точную синхронизацию курсора при
использовании VNC.
.El
.Pp
Бэкенды устройств NVMe:
.Bl -bullet
.Sm off
.It
.Ar devpath
.Op Cm ,maxq= Ar #
.Op Cm ,qsz= Ar #
.Op Cm ,ioslots= Ar #
.Op Cm ,sectsz= Ar #
.Op Cm ,ser= Ar #
.Op Cm ,eui64= Ar #
.Op Cm ,dsm= Ar opt
.Sm on
.El
.Pp
Параметры конфигурации определяются следующим образом:
.Bl -tag -width 10n
.It Ar devpath
Допустимыми путями устройств являются:
.Ar /dev/blockdev
или
.Ar /path/to/image
или
.Cm ram= Ns Ar size_in_MiB .
.It Cm maxq
Максимальное количество очередей.
.It Cm qsz
Максимальное количество элементов в каждой очереди.
.It Cm ioslots
Максимальное количество одновременных запросов ввода-вывода.
.It Cm sectsz
Размер сектора (по умолчанию - размер сектора blockif).
.It Cm ser
Серийный номер, содержащий не более 20 символов.
.It Cm eui64
Расширенный уникальный идентификатор IEEE (8-байтовое значение).
.It Cm dsm
Поддержка управления наборами данных.
Поддерживаются следующие значения:
.Cm auto , enable ,
и
.Cm disable .
.El
.Pp
Бэкенды устройств AHCI:
.Bl -bullet
.It
.Sm off
.Op Oo Cm hd\&: | cd\&: Oc Ar path
.Op Cm ,nmrr= Ar nmrr
.Op Cm ,ser= Ar #
.Op Cm ,rev= Ar #
.Op Cm ,model= Ar #
.Sm on
.El
.Pp
Параметры конфигурации определяются следующим образом:
.Bl -tag -width 10n
.It Cm nmrr
оминальная скорость вращения носителя, известная как RPM.
Значение 1 указывает на то, что устройство является твердотельным диском.
Значение по умолчанию - 0, не сообщать.
.It Cm ser
Серийный номер, содержащий не более 20 символов.
.It Cm rev
Номер ревизии максимум 8 символов.
.It Cm model
Номер модели, содержащий не более 40 символов.
.El
.Pp
Бэкенды устройств HD Audio:
.Bl -bullet
.It
.Sm off
.Op Cm play= Ar playback
.Op Cm ,rec= Ar recording
.Sm on
.El
.Pp
Параметры конфигурации определяются следующим образом:
.Bl -tag -width 10n
.It Cm play
Устройство воспроизведения, обычно
.Ar /dev/dsp0 .
.It Cm rec
Устройство записи, обычно
.Ar /dev/dsp0 .
.El
.It Fl U Ar uuid
Установка универсального уникального идентификатора
.Pq UUID
в структуре System Management BIOS System Information гостевой системы.
По умолчанию UUID генерируется из имени хоста и имени 
.Ar vmname .
.It Fl u
RTC поддерживает время UTC.
.It Fl W
Заставить эмуляцию PCI-устройств virtio использовать прерывания MSI вместо
прерываний MSI-X.
.It Fl w
Игнорировать обращения к нереализованным регистрам Model Specific Registers (MSRs).
Это предназначено для целей отладки.
.It Fl x
Локальный APIC гостя настроен в режиме x2APIC.
.It Fl Y
Отключить генерацию MPtable.
.It Ar vmname
Буквенно-цифровое имя гостя.
Оно должно быть таким же, как и созданное командой
.Xr bhyveload 8 .
.El
.Sh Переменные настройки
.Nm
использует внутреннее дерево конфигурационных переменных для описания
глобальных и индивидуальных настроек устройства.
Когда
.Nm
запускается, он анализирует опции командной строки (включая файлы
конфигурации) в порядке, указанном в командной строке.
Каждый параметр командной строки задает одну или несколько конфигурационных переменных.
Например,
опция
.Fl s
создает новый узел дерева для PCI-устройства и устанавливает одну или
несколько переменных в этом узле, включая модель устройства и переменные,
специфичные для модели устройства.
Переменные могут быть заданы несколько раз на этапе разбора, при этом
окончательное значение отменяет предыдущие.
.Pp
После обработки всех параметров командной строки значения конфигурации
замораживаются.
.Nm
использует значения конфигурации для инициализации моделей устройств
и глобальных настроек.
.Pp
Более подробную информацию о конфигурационных переменных можно найти в разделе
.Xr bhyve_config 5 .
.Sh Сервер отладки
Текущий отладочный сервер обеспечивает ограниченную поддержку отладчиков.
.Ss Регистры
Каждый виртуальный процессор доступен отладчику как поток.
.Pp
Регистры общего назначения могут быть запрошены для каждого виртуального
процессора, но другие регистры, такие как регистры с плавающей точкой и
системные регистры, запрашивать нельзя.
.Ss Память
Отладчик может считывать и записывать данные из памяти (включая регионы
ввода/вывода, отображенные на память).
Операции с памятью используют виртуальные адреса, которые преобразуются в
физические адреса с помощью активной трансляции адресов текущего виртуального
процессора.
.Ss Управление
Работающий гость может быть прерван отладчиком в любой момент
.Pq for например, нажав Ctrl-C в отладчике .
.Pp
Одиночный шаг поддерживается только на процессорах Intel, поддерживающих MTRAP
VM выход.
.Pp
Точки останова поддерживаются на процессорах Intel, поддерживающих одиночный шаг.
Обратите внимание, что продолжение работы с точки останова при включенных
прерываниях в гостя может работать не так, как ожидалось, из-за срабатывания
прерываний таймера во время прерываний таймера при одиночном переходе через
точку останова.
.Sh Обработка сигналов
.Nm
работает со следующими сигналами:
.Pp
.Bl -tag -width SIGTERM -compact
.It SIGTERM
Триггер выключения питания ACPI для виртуальной машины
.El
.Sh ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
Статус выхода указывает, как была завершена работа виртуальной машины:
.Pp
.Bl -tag -width indent -compact
.It 0
перезагружена
.It 1
выключено питание
.It 2
остановлена
.It 3
тройная ошибка
.It 4
завершилась из-за ошибки
.El
.Sh ПРИМЕРЫ
Если не используется загрузочное ПЗУ, то перед запуском
.Xr bhyve 4
гостевая операционная система должна быть загружена с помощью
.Xr bhyveload 8
или аналогичного загрузчика.
В противном случае загрузчик не нужен.
.Pp
Чтобы запустить виртуальную машину с 1 ГБ памяти, двумя виртуальными
процессорами, блочным устройством virtio с образом файловой системы
.Pa /my/image
и последовательным портом для консоли:
.Bd -literal -offset indent
bhyve -c 2 -s 0,hostbridge -s 1,lpc -s 2,virtio-blk,/my/image \\
  -l com1,stdio -A -H -P -m 1G vm1
.Ed
.Pp
Запустите виртуальную машину с одним процессором и 24 ГБ памяти с тремя
сетевыми портами, один из которых которых указан MAC-адрес:
.Bd -literal -offset indent
bhyve -s 0,hostbridge -s 1,lpc -s 2:0,virtio-net,tap0 \\
  -s 2:1,virtio-net,tap1 \\
  -s 2:2,virtio-net,tap2,mac=00:be:fa:76:45:00 \\
  -s 3,virtio-blk,/my/image -l com1,stdio \\
  -A -H -P -m 24G bigvm
.Ed
.Pp
Запустите виртуальную машину с четырьмя процессорами по 8 ГБ, 8 дисками AHCI
SATA, CD-ROM AHCI ATAPI, одним сетевым портом virtio, хостбриджем AMD и
консольным портом, подключенным к нуль-модему
.Xr nmdm 4 .
.Bd -literal -offset indent
bhyve -c 4 \\
  -s 0,amd_hostbridge -s 1,lpc \\
  -s 1:0,ahci,hd:/images/disk.1,hd:/images/disk.2,\\
hd:/images/disk.3,hd:/images/disk.4,\\
hd:/images/disk.5,hd:/images/disk.6,\\
hd:/images/disk.7,hd:/images/disk.8,\\
cd:/images/install.iso \\
  -s 3,virtio-net,tap0 \\
  -l com1,/dev/nmdm0A \\
  -A -H -P -m 8G
.Ed
.Pp
Запустите виртуальную машину UEFI с разрешением экрана 800 на 600 пикселей,
доступ к которой можно получить через VNC по адресу: 0.0.0.0:5900.
.Bd -literal -offset indent
bhyve -c 2 -m 4G -w -H \\
  -s 0,hostbridge \\
  -s 3,ahci-cd,/path/to/uefi-OS-install.iso \\
  -s 4,ahci-hd,disk.img \\
  -s 5,virtio-net,tap0 \\
  -s 29,fbuf,tcp=0.0.0.0:5900,w=800,h=600,wait \\
  -s 30,xhci,tablet \\
  -s 31,lpc -l com1,stdio \\
  -l bootrom,/usr/local/share/uefi-firmware/BHYVE_UEFI.fd \\
   uefivm
.Ed
.Pp
Запустите виртуальную машину UEFI с VNC-дисплеем, который привязан ко всем IPv6 адресам на порту 5900.
.Bd -literal -offset indent
bhyve -c 2 -m 4G -w -H \\
  -s 0,hostbridge \\
  -s 4,ahci-hd,disk.img \\
  -s 5,virtio-net,tap0 \\
  -s 29,fbuf,tcp=[::]:5900,w=800,h=600 \\
  -s 30,xhci,tablet \\
  -s 31,lpc -l com1,stdio \\
  -l bootrom,/usr/local/share/uefi-firmware/BHYVE_UEFI.fd \\
   uefivm
.Ed
.Pp
Запустите виртуальную машину UEFI с файлом VARS для сохранения переменных
EFI.
Обратите внимание, что
.Nm
будет записывать модификации гостя в заданный файл VARS.
Обязательно создайте для каждого гостя копию шаблонного VARS-файла из
.Pa /usr .
.Bd -literal -offset indent
bhyve -c 2 -m 4g -w -H \\
  -s 0,hostbridge \\
  -s 31,lpc -l com1,stdio \\
  -l bootrom,/usr/local/share/uefi-firmware/BHYVE_UEFI_CODE.fd,BHYVE_UEFI_VARS.fd
   uefivm
.Ed
.Sh СМОТРИ ТАКЖЕ
.Xr bhyve 4 ,
.Xr netgraph 4 ,
.Xr ng_socket 4 ,
.Xr nmdm 4 ,
.Xr vmm 4 ,
.Xr bhyve_config 5 ,
.Xr ethers 5 ,
.Xr bhyvectl 8 ,
.Xr bhyveload 8
.Pp
.Rs
.%A Intel
.%B 64 and IA-32 Architectures Software Developer’s Manual
.%V Volume 3
.Re
.Sh ИСТОРИЯ
Впервые
.Nm
появился во
.Fx 10.0 .
.Sh АВТОРЫ 
.An Neel Natu Aq Mt neel@freebsd.org
.An Peter Grehan Aq Mt grehan@freebsd.org
