melkorbsd/ru-freebsd-man/man8/bhyveload.8
.\"
.\" Copyright (c) 2012 NetApp Inc
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 12, 2024
.Dt BHYVELOAD 8
.Os
.Sh НАИМЕНОВАНИЕ
.Nm bhyveload
.Nd загрузить гостя
.Fx
в виртуальную машину bhyve
.Sh СИНТАКСИС
.Nm
.Op Fl C
.Op Fl S
.Op Fl c Ar cons-dev
.Op Fl d Ar disk-path
.Op Fl e Ar name=value
.Op Fl h Ar host-path
.Op Fl l Ar os-loader
.Op Fl m Ar memsize Ns Op Ar K|k|M|m|G|g|T|t
.Ar vmname
.Sh ОПИСАНИЕ
.Nm
используется для загрузки гостя
.Fx
внутри
.Xr bhyve 4
виртуальной машины.
.Pp
.Nm
основан на
.Xr loader 8
и предоставляет интерфейс, идентичный
.Fx
загрузчику, на пользовательском интерфейсе.
Это поведение можно изменить, указав другой загрузчик ОС.
.Pp
Виртуальная машина идентифицируется как
.Ar vmname
и будет создана, если она еще не существует.
.Sh КЛЮЧИ
Доступны следующие варианты:
.Bl -tag -width indent
.It Fl c Ar cons-dev
.Ar cons-dev
это
.Xr tty 4
устройство использумое для 
.Nm
терминального ввода-вывода.
.Pp
Текстовая строка "stdio" также принимается и выбирает использование
небуферизованного стандартного ввода-вывода. Это значение по умолчанию.
.It Fl d Ar disk-path
.Ar disk-path
это путь к образу загрузочного диска гостя.
.It Fl e Ar name=value
Установите переменную среды загрузчика 
.Fx
.Ar name
на
.Ar value .
.Pp
Эту опцию можно использовать несколько раз, чтобы установить более одной
переменной среды.
.It Fl h Ar host-path
.Ar host-path
это каталог в верхней части загрузочной файловой системы гостя.
.It Fl l Ar os-loader
Укажите другой загрузчик ОС.
По умолчанию
.Nm
будет использовать
.Pa /boot/userboot.so ,
представляющий стандартный загрузчик
.Fx
.It Fl m Ar memsize Ns Op Ar K|k|M|m|G|g|T|t
.Ar memsize
объем памяти, выделенный гостю.
.Pp
К аргументу
.Ar memsize
можно добавить один из суффиксов
.Cm K ,
.Cm M ,
.Cm G
или
.Cm T
(в верхнем или нижнем регистре) чтобы указать число, кратное
килобайтам, мегабайтам, гигабайтам или терабайтам соответственно.
.Pp
.Ar memsize
по умолчанию равен 256M.
.It Fl C
Включить гостевую память в файл ядра, когда
.Nm
выгружает ядро.
Это предназначено для отладки загрузчика ОС, поскольку позволяет
проверять гостевую память.
.It Fl S
Подключить гостевую память.
.El
.Sh ПРИМЕРЫ
Чтобы создать виртуальную машину с именем
.Ar freebsd-vm
которая загружается с образа ISO
.Pa /freebsd/release.iso
и имеет выделенный для нее 1 ГБ памяти:
.Pp
.Dl "bhyveload -m 1G -d /freebsd/release.iso freebsd-vm"
.Pp
Чтобы создать виртуальную машину с именем
.Ar test-vm
с выделенной памятью 256 МБ, гостевая корневая файловая система находится
в каталоге хоста
.Pa /user/images/test
и терминал ввода-вывода отправляются на
.Xr nmdm 4
устройство
.Pa /dev/nmdm1B
.Pp
.Dl "bhyveload -m 256MB -h /usr/images/test -c /dev/nmdm1B test-vm"
.Sh СМОТРИ ТАКЖЕ
.Xr bhyve 4 ,
.Xr nmdm 4 ,
.Xr vmm 4 ,
.Xr bhyve 8 ,
.Xr loader 8
.Sh ИСТОРИЯ
.Nm
впервые появился во
.Fx 10.0 ,
и был разработан в NetApp Inc.
.Sh АВТОРЫ
.Nm
был разработан
.An -nosplit
.An Neel Natu Aq Mt neel@FreeBSD.org
в NetApp Inc при огромной помощи
.An Doug Rabson Aq Mt dfr@FreeBSD.org .
.Sh ПРОБЛЕМЫ
.Nm
может загружать
.Fx
только в качестве гостя.
.Sh SECURITY CONSIDERATIONS
Note that in some configurations,
.Nm
will execute guest loader scripts in the context of the host machine.
Note, however, that
.Nm
will enter a
.Xr capsicum 4
sandbox before it loads the
.Ar os-loader
or executes any loader scripts.
On the host filesystem, the sandbox will only have access to the path specified
by the
.Fl h
flag, the contents of the
.Pa /boot
directory if
.Fl l
was not specified, and the chosen console device.
.Pp
Note that the guest loader scripts are already subject to some limitations that
are not relaxed simply because we are running in userland.
For instance, any I/O on the loader's
.Dq host
device that can be done in loader scripts is limited to the interface that
.Nm
provides, which itself will restrict paths that can be touched to those within
a specified
.Fl h
directory, if any.
Access to files within
.Pa /boot
inside the sandbox would require arbitrary code execution in userboot, and
userboot is usually provided by the host machine rather than anything that is
a part of the guest image.
All access to the
.Fl h
directory as well as
.Pa /boot
is strictly read-only in the sandbox.
