melkorbsd/ru-freebsd-man/man8/graid.8
.Dd 4 апреля 2013 года
.Dt GRAID 8
.Os
.Sh НАЗВАНИЕ
.Nm graid
.Nd "утилита управления для устройств программного RAID"
.Sh СИНТАКСИС
.Nm
.Cm label
.Op Fl f
.Op Fl o Ar fmtopt
.Op Fl S Ar size
.Op Fl s Ar strip
.Ar format
.Ar label
.Ar level
.Ar prov ...
.Nm
.Cm add
.Op Fl f
.Op Fl S Ar size
.Op Fl s Ar strip
.Ar name
.Ar label
.Ar level
.Nm
.Cm delete
.Op Fl f
.Ar name
.Op Ar label | Ar num
.Nm
.Cm insert
.Ar name
.Ar prov ...
.Nm
.Cm remove
.Ar name
.Ar prov ...
.Nm
.Cm fail
.Ar name
.Ar prov ...
.Nm
.Cm stop
.Op Fl fv
.Ar name ...
.Nm
.Cm list
.Nm
.Cm status
.Nm
.Cm load
.Nm
.Cm unload
.Sh ОПИСАНИЕ
Утилита
.Nm
используется для управления конфигурациями программного RAID, которые поддерживаются классом GEOM RAID.
Класс GEOM RAID использует метаданные на диске, чтобы предоставлять доступ к томам программного RAID, определенным различными RAID BIOS.
В зависимости от типа RAID BIOS и формата его метаданных поддерживаются различные подмножества конфигураций и функций.
Для возможности загрузки с тома RAID формат метаданных должен соответствовать типу RAID BIOS и его возможностям.
Чтобы гарантировать их соответствие, рекомендуется создавать тома через интерфейс RAID BIOS, хотя опытные пользователи могут делать это с помощью этой утилиты.
.Pp
Первый аргумент для
.Nm
указывает действие, которое должно быть выполнено:
.Bl -tag -width ".Cm destroy"
.It Cm label
Создать массив с одним томом.
Аргумент
.Ar format
указывает формат метаданных на диске, который будет использоваться для этого массива, такой как "Intel".
Аргумент
.Ar label
указывает метку созданного тома.
Аргумент
.Ar level
указывает уровень RAID созданного тома, такой как: "RAID0", "RAID1" и т.д.Следующий список перечисляет провайдеров для использования в качестве компонентов массива.
Особое имя "NONE" может использоваться для резервирования места для отсутствующих дисков.
Порядок компонентов может быть важен в зависимости от конкретного уровня RAID
и формата метаданных.
.Pp
Дополнительные параметры включают в себя:
.Bl -tag -width ".Fl s Ar strip"
.It Fl f
Принудительно создать указанную конфигурацию, если официально она не поддерживается,
но технически может быть создана.
.It Fl o Ar fmtopt
Указывает параметры формата метаданных.
.It Fl S Ar size
Использовать
.Ar size
байт на каждом компоненте для этого тома.
Следует использовать, если планируется несколько томов на массив или если позже будут добавлены более мелкие компоненты.
По умолчанию устанавливается размер наименьшего компонента.
.It Fl s Ar strip
Указывает размер полосы в байтах.
По умолчанию 131072.
.El
.It Cm add
Создать дополнительный том на существующем массиве.
Аргумент
.Ar name
- это имя существующего массива, указанное командой label.
Остальные аргументы такие же, как для команды label.
.It Cm delete
Удалить том(ы) из существующего массива.
Когда удаляется последний том, массив также удаляется и его метаданные
стираются.
Аргумент
.Ar name
- это имя существующего массива.
Необязательные аргументы
.Ar label
или
.Ar num
позволяют указать том для удаления.
.Pp
Дополнительные параметры включают в себя:
.Bl -tag -width ".Fl f"
.It Fl f
Удалить том(ы) даже если он все еще открыт.
.El
.It Cm insert
Вставить указанный провайдер(ы) в указанный массив вместо первого отсутствующего
или неисправного компонентов.
Если таких компонентов нет, отметить диск(и) как резервный(е).
.It Cm remove
Удалить указанный провайдер(ы) из указанного массива и стереть метаданные.Если имеются запасные диски, удаленные диск(и) будут заменены запасными.
.It Cm fail
Пометить указанные диск(и) как неисправные, исключив их из активного использования, если это не абсолютно необходимо из-за исчерпания резерва.
Если имеются запасные диски – неисправные диск(и) будут заменены одним из них.
.It Cm stop
Остановить указанный массив.
Метаданные не будут стерты.
.Pp
Дополнительные опции включают:
.Bl -tag -width ".Fl f"
.It Fl f
Остановить указанный массив, даже если некоторые из его томов открыты.
.El
.It Cm list
См.
.Xr geom 8 .
.It Cm status
См.
.Xr geom 8 .
.It Cm load
См.
.Xr geom 8 .
.It Cm unload
См.
.Xr geom 8 .
.El
.Pp
Дополнительные опции включают:
.Bl -tag -width ".Fl v"
.It Fl v
Более подробный вывод.
.El
.Sh ПОДДЕРЖИВАЕМЫЕ ФОРМАТЫ МЕТАДАННЫХ
Класс GEOM RAID следует модульному дизайну, позволяя использовать различные форматы метаданных.
На данный момент поддержка реализована для следующих форматов:
.Bl -tag -width "Intel"
.It DDF
Формат, определенный спецификацией SNIA Common RAID Disk Data Format v2.0.
Используется некоторыми BIOS Adaptec RAID и некоторыми аппаратными RAID-контроллерами.
Из-за высокой гибкости формата различные реализации поддерживают
разный набор функций и имеют различные разметки метаданных на диске.
Для обеспечения совместимости класс GEOM RAID имитирует возможности
первого обнаруженного массива DDF.
Учитывая это, он может поддерживать различное количество дисков на том,
томов на массив, разделов на диск и т. д.
Поддерживаются следующие конфигурации: RAID0 (2+ диска), RAID1 (2+ диска),
RAID1E (3+ диска), RAID3 (3+ диска), RAID4 (3+ диска), RAID5 (3+ диска),
RAID5E (4+ диска), RAID5EE (4+ диска), RAID5R (3+ диска), RAID6 (4+ диска),

RAIDMDF (4+ дисков), RAID10 (4+ дисков), SINGLE (1 диск), CONCAT (2+ дисков).
.Pp
Формат поддерживает две опции "BE" и "LE", что означает порядок байтов big-endian, который определен спецификацией (по умолчанию) и порядок байтов little-endian, используемый некоторыми контроллерами Adaptec.
.It Intel
Формат, используемый BIOS RAID от Intel.
Поддерживает до двух томов на массив.
Поддерживаемые конфигурации: RAID0 (2+ дисков), RAID1 (2 диска),
RAID5 (3+ дисков), RAID10 (4 диска).
Конфигурации, не поддерживаемые BIOS RAID от Intel, но возможные для самостоятельного использования на свой страх и риск: RAID1 (3+ дисков), RAID1E (3+ дисков), RAID10 (6+ дисков).
.It JMicron
Формат, используемый BIOS RAID от JMicron.
Поддерживает один том на массив.
Поддерживаемые конфигурации: RAID0 (2+ дисков), RAID1 (2 диска),
RAID10 (4 диска), CONCAT (2+ дисков).
Конфигурации, не поддерживаемые BIOS RAID от JMicron, но возможные для самостоятельного использования на свой страх и риск: RAID1 (3+ дисков), RAID1E (3+ дисков), RAID10 (6+ дисков), RAID5 (3+ дисков).
.It NVIDIA
Формат, используемый BIOS RAID от NVIDIA MediaShield.
Поддерживает один том на массив.
Поддерживаемые конфигурации: RAID0 (2+ дисков), RAID1 (2 диска),
RAID5 (3+ дисков), RAID10 (4+ дисков), SINGLE (1 диск), CONCAT (2+ дисков).
Конфигурации, не поддерживаемые BIOS RAID от NVIDIA MediaShield, но возможные для самостоятельного использования на свой страх и риск: RAID1 (3+ дисков).
.It Promise
Формат, используемый BIOS RAID от Promise и AMD/ATI.
Поддерживает несколько томов на массив.
Каждый диск может быть разделен для использования до двух произвольных томов.
Поддерживаемые конфигурации: RAID0 (2+ дисков), RAID1 (2 диска),
RAID5 (3+ дисков), RAID10 (4 диска), SINGLE (1 диск), CONCAT (2+ дисков).
Конфигурации, не поддерживаемые BIOS RAID, но возможные для самостоятельного использования на ваш страх и риск:Данный формат используется BIOS RAID от SiliconImage.
Поддерживает один том на массив.
Поддерживаются следующие конфигурации: RAID0 (2+ диска), RAID1 (2 диска),
RAID5 (3+ диска), RAID10 (4 диска), SINGLE (1 диск), CONCAT (2+ диска).
Конфигурации, не поддерживаемые BIOS RAID от SiliconImage, но применимые на ваш
собственный риск: RAID1 (3+ диска), RAID10 (6+ дисков).
.El
.Sh ПОДДЕРЖИВАЕМЫЕ УРОВНИ RAID
Класс GEOM RAID следует модульному дизайну, позволяющему использовать различные уровни RAID.
Полная поддержка следующих уровней RAID в настоящее время реализована:
RAID0, RAID1, RAID1E, RAID10, SINGLE, CONCAT.
Следующие уровни RAID поддерживаются только для чтения для томов в оптимальном
состоянии (без использования избыточности): RAID4, RAID5, RAID5E, RAID5EE, RAID5R,
RAID6, RAIDMDF.
.Sh МИГРАЦИЯ УРОВНЯ RAID
Класс GEOM RAID не поддерживает миграцию уровня RAID, разрешенную некоторыми
форматами метаданных.
Если вы начали миграцию с помощью BIOS или каким-либо другим способом, убедитесь, что
завершите ее там.
Не запускайте класс GEOM RAID на мигрирующих томах под угрозой возможной потери данных!
.Sh 2TiB ПРЕПЯТСТВИЯ
Формат метаданных NVIDIA не поддерживает тома свыше 2TiB.
.Sh ПЕРЕМЕННЫЕ SYSCTL
Следующие переменные
.Xr sysctl 8
могут быть использованы для управления поведением класса
.Nm RAID
GEOM.
.Bl -tag -width indent
.It Va kern.geom.raid.aggressive_spare : No 0
Используйте любые диски без метаданных, подключенные к контроллерам производителя,
соответствующего формату метаданных тома, в качестве запасных.
Используйте это с большой осторожностью, чтобы не потерять данные при подключении несвязанного диска!
.It Va kern.geom.raid.clean_time : No 5
Отметьте том как чистый при простое в течение указанного количества секунд..Va kern.geom.raid.debug : No 0
Уровень отладки для класса GEOM
.Nm RAID.
.Va kern.geom.raid.enable : No 1
Включение тестирования метаданных на диске.
.Va kern.geom.raid.idle_threshold : No 1000000
Время в микросекундах для определения простоя тома в целях перестройки.
.Va kern.geom.raid.name_format : No 0
Формат имени провайдера: 0 -- raid/r{num}, 1 -- raid/{label}.
.Va kern.geom.raid.read_err_thresh : No 10
Количество ошибок чтения равносильных отказу диска.
Ошибки записи всегда рассматриваются как отказы диска.
.Va kern.geom.raid.start_timeout : No 30
Время ожидания отсутствующих компонентов массива при запуске.
.Va kern.geom.raid. Ns Ar X Ns Va .enable : No 1
Включение тестирования для конкретных метаданных или модуля преобразования.
.El
.Sh СТАТУС ВЫХОДА
Статус выхода 0 при успешном выполнении и ненулевой, если команда завершилась с ошибкой.
.Sh СМ. ТАКЖЕ
.Xr geom 4,
.Xr geom 8,
.Xr gvinum 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Fx 9.0.
.Sh АВТОРЫ
.An Alexander Motin Aq Mt mav@FreeBSD.org
.An M. Warner Losh Aq Mt imp@FreeBSD.org