melkorbsd/ru-freebsd-man/man8/growfs.8
.\" Copyright (c) 2000 Christoph Herrmann, Thomas-Henning von Kamptz
.\" Copyright (c) 1980, 1989, 1993 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Christoph Herrmann and Thomas-Henning von Kamptz, Munich and Frankfurt.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors, as well as Christoph
.\"      Herrmann and Thomas-Henning von Kamptz.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $TSHeader: src/sbin/growfs/growfs.8,v 1.3 2000/12/12 19:31:00 tomsoft Exp $
.\"
.Dd October 3, 2023
.Dt GROWFS 8
.Os
.Sh НАЗВАНИЕ
.Nm growfs
.Nd расширение существующей файловой системы UFS
.Sh СИНТАКСИС
.Nm
.Op Fl Ny
.Op Fl s Ar размер
.Ar специальный | файловая_система
.Sh ОПИСАНИЕ
Утилита
.Nm
позволяет расширить файловую систему UFS.
Перед запуском
.Nm
раздел или слайс, содержащий файловую систему, должен быть расширен с помощью
.Xr gpart 8 .
Если вы используете тома, их необходимо увеличить с помощью
.Xr gvinum 8 .
Утилита
.Nm
расширяет размер файловой системы на указанном специальном файле.
Доступны следующие опции:
.Bl -tag -width indent
.It Fl N
.Dq Режим тестирования .
Позволяет выводить новые параметры файловой системы без фактического увеличения размера файловой системы.
.It Fl y
Заставляет
.Nm
предполагать да
в качестве ответа на все вопросы оператора.
.It Fl s Ar размер
Определяет
.Ar размер
файловой системы после увеличения в секторах.
.Ar Размер
является числом 512-байтных секторов, если не суффиксирован
.Cm b, k, m, g,
или
.Cm t,
что
обозначает байт, килобайт, мегабайт, гигабайт и терабайт соответственно.
Это значение по умолчанию равно размеру необработанного раздела, указанного в.Ar special
(другими словами,
.Nm
увеличивает файловую систему до размера всего раздела).
.El
.Sh EXIT STATUS
Exit status is 0 on success, and >= 1 on errors.
Errors recoverable by user action are indicated by 2.
OS errors, which are usually not recoverable, are indicated by 3 or greater.
.Sh ПРИМЕРЫ
Расширение корневой файловой системы для использования доступного пространства:
.Dl growfs /
.Pp
Обновление размера LUN, изменение размера раздела для использования всей доступной
ёмкости и соответствующее расширение файловой системы:
.Dl camcontrol reprobe da0
.Dl gpart recover da0
.Dl gpart resize -i 1 da0
.Dl growfs /dev/da0p1
.Sh СМОТРИ ТАКЖЕ
.Xr growfs 7 ,
.Xr camcontrol 8 ,
.Xr fsck 8 ,
.Xr gpart 8 ,
.Xr newfs 8 ,
.Xr tunefs 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 4.4 .
Возможность изменения размера смонтированных файловых систем была добавлена в
.Fx 10.0 .
.Sh АВТОРЫ
.An Christoph Herrmann Aq Mt chm@FreeBSD.org
.An Thomas-Henning von Kamptz Aq Mt tomsoft@FreeBSD.org
.An КОМАНДА GROWFS Aq Mt growfs@Tomsoft.COM
.An Edward Tomasz Napierala Aq Mt trasz@FreeBSD.org
.Sh ОСТОРОЖНО
При расширении файловой системы, смонтированной для чтения-записи, любые записи в эту файловую систему
будут временно приостановлены до завершения расширения.
.Sh ОШИБКИ
Обычно
.Nm
записывает сводку по группам цилиндров на диск и считывает её позже для дополнительных
обновлений.
Эта операция чтения предоставит неожиданные данные при использовании
.Fl N .
Следовательно, эту часть нельзя действительно симулировать, и она будет пропущена в тестовом режиме.
