melkorbsd/ru-freebsd-man/man8/growfs.8
.\"
.\" Авторское право (c) 2000 Кристоф Херрманн, Томас-Хеннинг фон Кампц
.\" Авторское право (c) 1980, 1989, 1993 Правительство Университета Калифорнии.
.\" Все права защищены.
.\"
.\" Этот код основан на программном обеспечении, предоставленном в Беркли
.\" Кристофом Херрманном и Томасом-Хеннингом фон Кампц, Мюнхен и Франкфурт.
.\"
.\" Распространение и использование в исходных и двоичных формах, с изменениями или без,
.\" разрешено при условии соблюдения следующих условий:
.\" 1. Распространение исходного кода должно сохранять вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Распространение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторском праве,
.\"    этот список условий и отказ от ответственности в
.\"    документации и/или других материалах, поставляемых с дистрибутивом.
.\" 3. Все рекламные материалы, упоминающие функции или использование этого программного обеспечения,
.\"    должны содержать следующее признание:
.\"      Этот продукт включает программное обеспечение, разработанное Университетом
.\"      Калифорния, Беркли и его участниками, а также Кристофом Херрманном и Томасом-Хеннингом фон Кампц.
.\" 4. Ни имя Университета, ни имена участников
.\"    не могут быть использованы для поддержки или продвижения продуктов, полученных из этого программного обеспечения,
.\"    без конкретного предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ПРАВЛЕНИЕМ И УЧАСТНИКАМИ «КАК ЕСТЬ» И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ,
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ
.\" ОТКЛЮЧЕНЫ. НИ В КОАКОМ СЛУЧАЕ ПРАВЛЕНИЕ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
(здесь текст обрывается, поскольку исходное сообщение было неполным).\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ШТРАФНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАТРАТАМИ НА ЗАМЕНУ ТОВАРОВ ИЛИ УСЛУГ,
.\" ПОТЕРЕЙ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ ИЛИ ПРЕРЫВАНИЕМ БИЗНЕСА),
.\" ПРИЧИНЕННЫЕ КАКИМ-ЛИБО ОБРАЗОМ И НА ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО
.\" В ДОГОВОРЕ, СТРОГОЙ ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ)
.\" ВОЗНИКШИЕ КАКИМ-ЛИБО ОБРАЗОМ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО
.\" ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.\" $TSHeader: src/sbin/growfs/growfs.8,v 1.3 2000/12/12 19:31:00 tomsoft Exp $
.\"
.Dd 13 декабря 2017
.Dt GROWFS 8
.Os
.Sh НАЗВАНИЕ
.Nm growfs
.Nd расширение существующей файловой системы UFS
.Sh СИНТАКСИС
.Nm
.Op Fl Ny
.Op Fl s Ar размер
.Ar специальный | файловая_система
.Sh ОПИСАНИЕ
Утилита
.Nm
позволяет расширить файловую систему UFS.
Перед запуском
.Nm
раздел или слайс, содержащий файловую систему, должен быть расширен с помощью
.Xr gpart 8 .
Если вы используете тома, их необходимо увеличить с помощью
.Xr gvinum 8 .
Утилита
.Nm
расширяет размер файловой системы на указанном специальном файле.
Доступны следующие опции:
.Bl -tag -width indent
.It Fl N
.Dq Режим тестирования .
Позволяет выводить новые параметры файловой системы без фактического увеличения размера файловой системы.
.It Fl y
Заставляет
.Nm
предполагать да
в качестве ответа на все вопросы оператора.
.It Fl s Ar размер
Определяет
.Ar размер
файловой системы после увеличения в секторах.
.Ar Размер
является числом 512-байтных секторов, если не суффиксирован
.Cm b, k, m, g,
или
.Cm t,
что
обозначает байт, килобайт, мегабайт, гигабайт и терабайт соответственно.
Это значение по умолчанию равно размеру необработанного раздела, указанного в.Ar special
(другими словами,
.Nm
увеличивает файловую систему до размера всего раздела).
.El
.Sh ПРИМЕРЫ
Расширение корневой файловой системы для использования доступного пространства:
.Dl growfs /
.Pp
Обновление размера LUN, изменение размера раздела для использования всей доступной
ёмкости и соответствующее расширение файловой системы:
.Dl camcontrol reprobe da0
.Dl gpart recover da0
.Dl gpart resize -i 1 da0
.Dl growfs /dev/da0p1
.Sh СМОТРИ ТАКЖЕ
.Xr growfs 7 ,
.Xr camcontrol 8 ,
.Xr fsck 8 ,
.Xr gpart 8 ,
.Xr newfs 8 ,
.Xr tunefs 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 4.4 .
Возможность изменения размера смонтированных файловых систем была добавлена в
.Fx 10.0 .
.Sh АВТОРЫ
.An Christoph Herrmann Aq Mt chm@FreeBSD.org
.An Thomas-Henning von Kamptz Aq Mt tomsoft@FreeBSD.org
.An КОМАНДА GROWFS Aq Mt growfs@Tomsoft.COM
.An Edward Tomasz Napierala Aq Mt trasz@FreeBSD.org
.Sh ОСТОРОЖНО
При расширении файловой системы, смонтированной для чтения-записи, любые записи в эту файловую систему
будут временно приостановлены до завершения расширения.
.Sh ОШИБКИ
Обычно
.Nm
записывает сводку по группам цилиндров на диск и считывает её позже для дополнительных
обновлений.
Эта операция чтения предоставит неожиданные данные при использовании
.Fl N .
Следовательно, эту часть нельзя действительно симулировать, и она будет пропущена в тестовом режиме.