melkorbsd/ru-freebsd-man/man8/gshsec.8
.\"
.\" Авторское право (c) 2005 Pawel Jakub Dawidek <pjd@FreeBSD.org>
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходных и двоичных формах, с изменениями или без,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от гарантий.
.\" 2. Перераспределения в двоичной форме должны воспроизводить вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от гарантий в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПО программное обеспечение предоставляется авторами и участниками «КАК ЕСТЬ» и
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ТЕМ,
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ
.\" ОТКАЗЫВАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ЭКЗЕМПЛЯРНЫЕ ИЛИ ПОСЛЕДОВАТЕЛЬНЫЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ЗАМЕНОЙ ТОВАРОВ ИЛИ УСЛУГ;
.\" ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ПРИЧИНЕННЫЕ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЕ В ЛЮБОМ СЛУЧАЕ
.\" ИЗ ИСПОЛЬЗОВАНИЯ ЭТОГО ПО, ДАЖЕ ЕСЛИ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd 1 октября 2013 г.
.Dt GSHSEC 8
.Os
.Sh ИМЯ
.Nm gshsec
.Nd "утилита управления для устройств с общим секретом"
.Sh СИНТАКСИС
.Nm
.Cm label
.Op Fl hv
.Ar имя
.Ar пров пров ...
.Nm
.Cm stop
.Op Fl fv
.Ar имя ....Nm
.Cm clear
.Op Fl v
.Ar prov ...
.Nm
.Cm dump
.Ar prov ...
.Nm
.Cm list
.Nm
.Cm status
.Nm
.Cm load
.Nm
.Cm unload
.Sh ОПИСАНИЕ
The
.Nm
утилита используется для настройки устройства, которое содержит общий секрет.
Секрет распределяется между указанными провайдерами.
Для сбора секрета необходимы все провайдеры.
Если один из компонентов отсутствует, нет возможности получить какие-либо полезные данные с
остальных.
Первым аргументом к
.Nm
указывается выполняемое действие:
.Bl -tag -width ".Cm destroy"
.It Cm label
Создать устройство с общим секретом из указанных компонентов с заданным
.Ar name .
Метаданные хранятся в последнем секторе каждого компонента.
.It Cm stop
Выключить существующее устройство с общим секретом по его
.Ar name .
Эта команда не затрагивает метаданные на диске!
.It Cm clear
Очистить метаданные на указанных провайдерах.
.It Cm dump
Выгрузить метаданные, хранящиеся на указанных провайдерах.
.It Cm list
Смотрите
.Xr geom 8 .
.It Cm status
Смотрите
.Xr geom 8 .
.It Cm load
Смотрите
.Xr geom 8 .
.It Cm unload
Смотрите
.Xr geom 8 .
.El
.Pp
Дополнительные опции:
.Bl -tag -width ".Fl f"
.It Fl f
Принудительно удалить указанное устройство с общим секретом.
.It Fl h
Захардкодить имена провайдеров в метаданных.
.It Fl v
Подробный вывод.
.El
.Sh СТАТУС ВЫХОДА
Статус выхода - 0 при успехе и 1, если команда не выполнена.
.Sh ПРИМЕРЫ
Следующий пример показывает, как создать устройство с общим секретом.
Секрет будет разделен между срезом на локальном диске и USB-флеш-накопителем.
.Bd -literal -offset indent
gshsec label -v secret /dev/ada0s1 /dev/da0
newfs /dev/shsec/secret
.Ed
.Pp
Теперь, когда USB-флеш-накопитель подключен, он будет автоматически обнаружен и подключен, делая секрет доступным через устройство
.Pa /dev/shsec/secret .
.Sh СМОТРИ ТАКЖЕ
.Xr geom 4 ,
.Xr gbde 8 ,
.Xr geom 8 ,
.Xr newfs 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Fx 5.4 .
.Sh АВТОРЫ
.An Pawel Jakub Dawidek Aq Mt pjd@FreeBSD.org