melkorbsd/ru-freebsd-man/man8/gssd.8
.\" Авторское право (c) 2008 Isilon Inc http://www.isilon.com/
.\" Авторы: Даг Рэбсон <dfr@rabson.org>
.\" Разработка в сотрудничестве с Red Inc: Альфред Перлстайн <alfred@FreeBSD.org>
.\"
.\" Перераспределение и использование в исходных и двоичных формах, с изменениями или без,
.\" разрешены при соблюдении следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять вышеуказанное уведомление об авторском праве,
.\"    данный список условий и следующее отказ от ответственности.
.\" 2. Перераспределения в двоичной форме должны воспроизводить вышеуказанное уведомление об авторском праве,
.\"    данный список условий и следующее отказ от ответственности в документации
.\"    и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ
.\" ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКЛОНЯЮТСЯ. НИ В КОЕМ СЛУЧАЕ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ИЛЛЮСТРАТИВНЫЙ ИЛИ ПОСЛЕДУЮЩИЙ УЩЕРБ
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАТРАТЫ НА ЗАМЕНУ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ
.\" ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА) ОДНАКО ВЫЗВАННЫЙ И НА КАКОЙ ЛИБО ТЕОРИИ ОТВЕТСТВЕННОСТИ,
.\" БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЙ В ЛЮБОМ СЛУЧАЕ
.\" ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ИЗВЕЩЕНО О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd 10 апреля 2020 года
.Dt GSSD 8
.Os
.Sh ИМЯ
.Nm gssd
.Nd "Демон Услуг Общей Безопасности"
.Sh СИНТАКСИС
.Nm
.Op Fl d
.Op Fl hОпции Fl v
Опции Fl s Ar dir-list
Опции Fl c Ar file-substring
Опции Fl r Ar preferred-realm
.Sh ОПИСАНИЕ
Программа
.Nm
обеспечивает поддержку реализации GSS-API ядра.
.Pp
Опции следующие:
.Bl -tag -width indent
.It Fl d
Работать в режиме отладки.
В этом режиме
.Nm
не будет создавать отдельный процесс при запуске.
.It Fl h
Включить поддержку инициаторских учетных данных на основе хоста.
Это позволяет использовать принципал сервиса в
стандартном файле Kerberos 5 keytab для доступа при керберизированном монтировании NFS.
Такой доступ включается через опцию
gssname
для команды
.Xr mount_nfs 8.
.It Fl v
Работать в подробном режиме.
В этом режиме
.Nm
будет записывать сообщения о деятельности в системный журнал с использованием LOG_INFO | LOG_DAEMON или в
stderr, если также указана опция
.Fl d.
Минорный статус записывается как десятичное число, поскольку это на самом деле статус возврата Kerberos, который является знаковым.
.It Fl s Ar dir-list
Искать подходящие файлы кэша учетных данных в этом списке каталогов.
Список должен содержать полные пути от корня, разделённые символами ':'.
Обычно в этом списке будет просто "/tmp".
Без этой опции
.Nm
предполагает, что файл кэша учетных данных называется /tmp/krb5cc_<uid>,
где <uid> - это действующий uid для вызывающего RPC.
.It Fl c Ar file-substring
Установить подстроку файла для имен файлов кэша учетных данных.
Будут выбраны только файлы, в имена которых встроена эта подстрока, когда была указана опция
.Fl s.
Если не указано, по умолчанию используется "krb5cc_".
.It Fl r Ar preferred-realm
Использовать учетные данные Kerberos для этой области при поиске
учетных данных в каталогах, указанных с помощью
.Fl s.
Если не указано, будет использована область Kerberos по умолчанию..El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/krb5.keytab" -compact
.It Pa /etc/krb5.keytab
Содержит принципалы служб Kerberos, которые могут быть использованы в качестве учетных данных
сервисами GSS-API ядра.
.El
.Sh СТАТУС ВЫХОДА
.Ex -std
.Sh СМОТРИ ТАКЖЕ
.Xr gssapi 3 ,
.Xr syslog 3 ,
.Xr mount_nfs 8
.Sh ИСТОРИЯ
Страница
.Nm
руководства впервые появилась в
.Fx 8.0 .
.Sh АВТОРЫ
Эту
страницу руководства написал
.An Doug Rabson Aq Mt dfr@FreeBSD.org .