melkorbsd/ru-freebsd-man/man8/gstripe.8
.\"
.\" Авторское право (c) 2004-2005 Павел Якуб Давидек <pjd@FreeBSD.org>
.\" Все права защищены.
.\"
.\" Распространение и использование в исходной и бинарной формах, с изменениями или без
.\" них, разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределение в бинарной форме должно воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, поставляемых с распределением.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРАМИ И УЧАСТНИКАМИ ``КАК ЕСТЬ'' И
.\" ВСЯКИЕ ЯВНО ВЫРАЖЕННЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ,
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ
.\" ОТКЛЮЧАЮТСЯ. НИ В КОАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА КАКОЙ-ЛИБО ПРЯМОЙ, КОСВЕННОЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ЭКЗЕМПЛЯРНЫЙ ИЛИ ПОСЛЕДОВАТЕЛЬНЫЙ
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАТРАТЫ НА ЗАМЕНУ ТОВАРОВ ИЛИ УСЛУГ,
.\" ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, ИЛИ ПРЕРЫВАНИЕ ДЕЛОВОЙ ДЕЯТЕЛЬНОСТИ)
.\" ОДНАКО ВЫЗВАННЫЙ И НА ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЙ ЛЮБЫМ СПОСОБОМ
.\" ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 21 мая 2004 г.
.Dt GSTRIPE 8
.Os
.Sh НАЗВАНИЕ
.Nm gstripe
.Nd "утилита управления для устройств с полосовой разметкой"
.Sh СИНТАКСИС
.Nm
.Cm create
.Op Fl v
.Op Fl s Ar размер полосы
.Ar имя
.Ar пров пров ...
.Nm
.Cm destroy
.Op Fl fv
.Ar имя ...
.Nm
.Cm метка
.Op Fl hv
.Op Fl s Ar размер полосы
.Ar имя
.Ar пров пров ...
.Nm
.Cm остановить
.Op Fl fv
.Ar имя ...
.Nm
.Cm очистить
.Op Fl v
.Ar пров ...
.Nm
.Cm выгрузить
.Ar пров ...
.Nm
.Cm список
.Nm
.Cm статус
.Nm
.Cm загрузить
.Nm
.Cm выгрузить
.Sh ОПИСАНИЕ
Утилита
.Nm
используется для настройки полосы на двух или более дисках.
Полосный устройство можно настроить двумя разными методами:
.Dq вручную
или
.Dq автоматически .
При использовании метода
.Dq вручную
метаданные на устройствах не хранятся, так что полосное
устройство придется настраивать вручную каждый раз, когда оно будет нужно.
Метод
.Dq автоматически
использует метаданные на диске для обнаружения устройств.
Как только устройства промаркированы, они будут автоматически обнаружены и
настроены.
.Pp
Первый аргумент к
.Nm
указывает действие, которое необходимо выполнить:
.Bl -tag -width ".Cm уничтожить"
.It Cm создать
Настроить полосное устройство из заданных устройств с указанным
.Ar имя .
Это метод
.Dq вручную
и полоса не будет существовать после перезагрузки (см.
.Sx ОПИСАНИЕ
выше).
Модуль ядра
.Pa geom_stripe.ko
будет загружен, если он еще не загружен.
.It Cm метка
Настройте полосное устройство из заданных устройств с указанным
.Ar имя .
Это метод
.Dq автоматически
, где метаданные хранятся в последнем секторе каждого устройства.
Модуль ядра
.Pa geom_stripe.ko
будет загружен, если он еще не загружен.
.It Cm остановить
Отключение существующего полосного устройства по его
.Ar имя .
Эта команда не затрагивает метаданные на диске!
.It Cm уничтожить
То же самое, что
.Cm остановить .
.It Cm очистить
Очистить метаданные на заданных устройствах.
.It Cm выгрузить
Выгрузить метаданные, хранящиеся на заданных устройствах.
.It Cm list
Смотрите
.Xr geom 8 .
.It Cm status
Смотрите
.Xr geom 8 .
.It Cm load
Смотрите
.Xr geom 8 .
.It Cm unload
Смотрите
.Xr geom 8 .
.El
.Pp
Дополнительные опции:
.Bl -tag -width ".Fl s Ar stripesize"
.It Fl f
Принудительное удаление указанного устройства со stripe.
.It Fl h
Запись имён поставщиков в метаданные.
.It Fl s Ar stripesize
Задаёт размер блока полосы в байтах.
.Ar stripesize
должен быть кратен наибольшему размеру сектора всех поставщиков.
.It Fl v
Вывод более детальной информации.
.El
.Sh ПЕРЕМЕННЫЕ SYSCTL
Следующие переменные
.Xr sysctl 8
могут использоваться для управления поведением класса
.Nm STRIPE
GEOM.
Рядом с каждой переменной показано её значение по умолчанию.
.Bl -tag -width indent
.It Va kern.geom.stripe.debug : No 0
Уровень отладки класса
.Nm STRIPE
GEOM.
Можно установить число от 0 до 3 включительно.
Если установлено в 0, выводится минимальное количество информации для отладки, а если установлено в 3, выводится максимальное количество информации для отладки.
.It Va kern.geom.stripe.fast : No 0
Если установлено ненулевое значение, включает
.Dq "быстрый режим"
вместо обычного
.Dq "экономичного режима".
По сравнению с
.Dq "экономичным режимом",
.Dq "быстрый режим"
использует больше памяти, но он намного быстрее для меньших размеров полос.
Если недостаточно памяти не может быть выделено,
.Nm STRIPE
переключится на
.Dq "экономичный режим".
.It Va kern.geom.stripe.maxmem : No 13107200
Максимальный объём памяти, который может быть использован
.Dq "быстрым режимом"
(в байтах).
Эта переменная
.Xr sysctl 8
доступна только для чтения и может быть установлена как настраиваемая в
.Xr loader.conf 5 .
.It Va kern.geom.stripe.fast_failed
Счётчик, сколько раз
.Dq "быстрый режим"
не удался из-за недостаточного количества памяти.
Если это значение большое, вам следует рассмотреть возможность увеличения
.Va kern.geom.stripe.maxmem
значения.
.El
.Sh СТАТУС ВЫХОДА
Статус выхода равен 0 при успехе и 1, если команда не выполнилась.
.Sh ПРИМЕРЫ
Следующий пример показывает, как настроить полосовое устройство из четырех дисков с
размером полосы 128КБ для автоматической конфигурации,
создать файловую систему на нем,
и смонтировать ее:
.Bd -literal -offset indent
gstripe label -v -s 131072 data /dev/da0 /dev/da1 /dev/da2 /dev/da3
newfs /dev/stripe/data
mount /dev/stripe/data /mnt
[...]
umount /mnt
gstripe stop data
gstripe unload
.Ed
.Sh СОВМЕСТИМОСТЬ
The
.Nm
чередование идет в байтах,
в отличие от
.Xr ccdconfig 8
где используется количество секторов.
A
.Xr ccdconfig 8
.Ar ileave
значение
.Ql 128
равняется 64 КБ (128 512B секторов).
То же самое чередование полос указывается как
.Ql 65536
для
.Nm .
.Sh СМОТРИ ТАКЖЕ
.Xr geom 4 ,
.Xr loader.conf 5 ,
.Xr ccdconfig 8 ,
.Xr geom 8 ,
.Xr gvinum 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr sysctl 8 ,
.Xr umount 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Fx 5.3 .
.Sh АВТОРЫ
.An Pawel Jakub Dawidek Aq Mt pjd@FreeBSD.org