melkorbsd/ru-freebsd-man/man8/gunion.8
.\"
.\" Авторское право (c) 2022 Marshall Kirk McKusick <mckusick@mckusick.com>
.\"
.\" Перераспределение и использование в исходных и бинарных формах, с изменениями или без,
.\" разрешены при условии соблюдения следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределения в бинарной форме должны воспроизводить вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распределением.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРАМИ И УЧАСТНИКАМИ "КАК ЕСТЬ" БЕЗ
.\" ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ ЛЮБОГО РОДА, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ
.\" ГАРАНТИЯМИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ.
.\" ОТКАЗЫВАЮТСЯ. В НИКАКОМ СЛУЧАЕ АВТОРЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТЬ
.\" ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ПРИМЕРНЫЙ ИЛИ ПОСЛЕДУЮЩИЙ
.\" УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАМЕЩЕНИЕ ТОВАРОВ ИЛИ УСЛУГ;
.\" ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ПРОИЗОШЛО И НА ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЕ В ЛЮБОМ СЛУЧАЕ
.\" ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 19 января 2022 года
.Dt GUNION 8
.Os
.Sh ИМЯ
.Nm gunion
.Nd "утилита управления для GEOM класса UNION"
.Sh СИНТАКСИС
.Nm
.Cm create
.Op Fl v
.Op Fl o Ar offset
.Op Fl s Ar size
.Op Fl S Ar secsize
.Op Fl Z Ar gunionname.Ar upperdev lowerdev
.Nm
.Cm уничтожить
.Op Fl fv
.Ar prov ...
.Nm
.Cm сброс
.Op Fl v
.Ar prov ...
.Nm
.Cm откат
.Op Fl v
.Ar prov ...
.Nm
.Cm подтвердить
.Op Fl frv
.Ar prov ...
.Nm
.Cm список
.Nm
.Cm статус
.Nm
.Cm загрузка
.Nm
.Cm выгрузка
.Sh ОПИСАНИЕ
The
.Nm
утилита используется для отслеживания изменений на диске только для чтения на записываемом диске.
Логически записываемый диск размещается поверх диска только для чтения.
Запросы на запись перехватываются и сохраняются на записываемом диске.
Запросы на чтение в первую очередь проверяются, были ли они записаны
на верхнем (записываемом) диске и, если найдены, возвращаются.
Если они не были записаны на верхнем диске,
то они считываются с нижнего диска.
.Pp
Утилита
.Nm
может быть особенно полезна, если у вас есть большой диск с
поврежденной файловой системой и вы не знаете, как её восстановить.
Вы можете использовать
.Nm
чтобы разместить другой диск поверх поврежденного диска и затем попытаться
восстановить файловую систему.
Если восстановление не удаётся, вы можете откатить все изменения на верхнем диске
и вернуться к неизменному состоянию нижнего диска, что позволит вам
попробовать другой подход к его восстановлению.
Если восстановление успешно, вы можете запросить, чтобы все записи, зафиксированные
на верхнем диске, были записаны на нижний диск.
.Pp
Другое использование утилиты
.Nm
- это попробовать обновления для вашей системы.
Разместите верхний диск над диском, на котором находится ваша файловая система, которая
должна быть обновлена, и затем выполните обновление на нём.
Если это работает, подтвердите его;
если это не удаётся, откатите обновление.
Пример приведен ниже.
.Pp
Верхний диск должен быть по крайней мере такого же размера, как диск, который он покрывает.
Метаданные объединения существуют только в течение
периода времени, когда объединение реализовано,


так что важно применить обновления перед удалением объединения.
Если верхний диск примерно на 2,5 процента больше для дисков с секторами 512 байт 
(или на 0,5 процента больше для дисков с секторами 4K), то это возможно (хотя и не реализовано на данный момент) сохранить метаданные объединения между инстанцированиями устройства объединения.
.Pp
Если у вас нет физических носителей, которые можно использовать для верхнего слоя, то вместо этого может быть использован
.Xr md 4
диск. Когда используется в
.Cm swap
режиме, все изменения хранятся в буферной памяти.
Страницы отправляются в своп, когда система испытывает нехватку памяти, в остальное время они остаются в оперативной памяти.
Если необходимо долгосрочное сохранение данных,
.Cm vnode
режим может быть использован, в котором обычный файл используется в качестве хранилища.
Используемое дисковое пространство файла основано на объеме данных, записанных на верхнее устройство.
.Pp
Первый аргумент к
.Nm
указывает на действие, которое должно быть выполнено:
.Bl -tag -width "destroy"
.It Cm create
Настройте провайдер объединения на двух данных устройствах.
Первое устройство используется в качестве верхнего устройства и должно быть доступно для записи.
Второе устройство используется в качестве нижнего устройства и должно быть только доступно для чтения.
Второе устройство может быть смонтировано только для чтения, но рекомендуется
чтобы его было размонтировано и доступно только через монтирование устройства объединения.
Если операция проходит успешно, новый провайдер должен появиться с именем
.Pa /dev/ Ns Ao Ar upperdev Ac Ns - Ns Ao Ar lowerdev Ac Ns Pa .union .
Альтернативное имя может быть указано с помощью
.Fl Z
флага.
Модуль ядра
.Pa geom_union.ko
будет загружен, если он уже не загружен.
.Pp
Дополнительные опции включают:
.Bl -tag -width "-Z gunionname"
.It Fl o Ar offset
С какого места начать на оригинальном носителе.
По умолчанию начало происходит с начала диска (то есть, с смещения 0).
Эту опцию можно использовать, чтобы пропустить информацию о разделении, хранящуюся
в начале диска.
Смещение должно быть кратно размеру сектора.
.It Fl s Ar size
Размер прозрачного носителя.
По умолчанию размер должен совпадать с размером нижнего диска.
Любое дополнительное пространство в конце верхнего диска может быть использовано для хранения
метаданных объединения.
.It Fl S Ar secsize
Размер сектора прозрачного носителя.
Стандартный размер сектора должен совпадать с размером сектора нижнего диска.
.It Fl v
Выводить более подробную информацию.
.It Fl Z Ar gunionname
Имя нового носителя.
Суффикс
.Dq .union
будет добавлен к имени носителя.
.El
.It Cm destroy
Выключить указанные объединенные носители.
.Pp
Дополнительные опции включают:
.Bl -tag -width "-f"
.It Fl f
Принудительно удалить указанный носитель.
.It Fl v
Выводить более подробную информацию.
.El
.It Cm revert
Отменить все изменения, сделанные в верхнем слое, тем самым возвращаясь к
исходному состоянию нижнего устройства.
Объединенное устройство не должно быть смонтировано или иным образом использоваться, когда
выполняется операция
.Cm revert.
.It Cm commit
Записать все изменения, сделанные в верхнем устройстве, на нижнее устройство,
тем самым подтверждая, что нижнее устройство будет иметь те же данные, что и объединение.
.Pp
Дополнительные опции включают:
.Bl -tag -width "-f"
.It Fl f
Команда
.Cm commit
не позволяет нижнему устройству быть смонтированным
или иным образом использоваться во время операции
.Cm commit.
Однако, флаг
.Fl f
может быть указан, чтобы разрешить нижнему устройству быть смонтированным только для чтения.
Чтобы предотвратить сбой файловой системы на смонтированном нижележащем устройстве,
сразу после завершения операции
.Cm commit
файловую систему нижележащего устройства следует размонтировать
и затем смонтировать снова, чтобы обновить состояние её метаданных.
Если файловая система нижележащего устройства в данный момент используется как корневая
файловая система, то должен быть указан флаг
.Fl r
чтобы перезагрузить систему по завершении операции
.Cm commit.
.It Fl r
Перезагрузить систему по завершении операции
.Cm commit.
.It Fl v
Выводить более подробную информацию.
.El
.It Cm reset
Сбросить статистику для указанных объединённых провайдеров.
.It Cm list
Смотрите
.Xr geom 8 .
.It Cm status
Смотрите
.Xr geom 8 .
.It Cm load
Смотрите
.Xr geom 8 .
.It Cm unload
Смотрите
.Xr geom 8 .
.El
.Sh EXIT STATUS
Статус выхода равен 0 в случае успеха и 1, если команда не выполнена.
.Sh EXAMPLES
Следующий пример показывает, как создать и уничтожить
объединённый провайдер с дисками
.Pa /dev/da0p1
как только для чтения диск снизу и
.Pa /dev/md0
как диск, доступный для записи, сверху.
.Bd -literal -offset indent
gunion create -v md0 da0p1
mount /dev/md0-da0p1.union /mnt
.Ed
.Pp
Произведите изменения в файловой системе /mnt.
Если они успешные и вы хотите их сохранить.
.Bd -literal -offset indent
umount /mnt
gunion commit -v md0-da0p1.union
.Ed
.Pp
Если изменения неудачные и вы хотите откатиться.
.Bd -literal -offset indent
umount /mnt
gunion revert -v md0-da0p1.union
.Ed
.Pp
По завершении удалите объединение.
.Bd -literal -offset indent
umount /mnt
gunion destroy -v md0-da0p1.union
.Ed
.Pp
Все неподтверждённые изменения будут отброшены при уничтожении объединения.
.Pp
Если вы используете имя полного диска, например.Pa da0
и он помечен,
то имя объединения будет отображаться для диска как
.Pa md0-da0.union
также как для каждого раздела на диске как
.Pa md0-da0p1.union ,
.Pa md0-da0p2.union ,
и т.д.
Операция принятия изменений может быть выполнена только на
.Pa md0-da0.union
и будет применять изменения ко всем разделам.
Если нужно применять изменения к определенному разделу,
то объединение должно быть создано для каждого раздела.
.Pp
Статистику трафика для указанных
провайдеров объединения можно получить с помощью
команды
.Cm list
Пример ниже показывает количество записанных байт с помощью
.Xr newfs 8 :
.Bd -literal -offset indent
gunion create md0 da0p1
newfs /dev/md0-da0p1.union
gunion list
.Ed
.Sh ПЕРЕМЕННЫЕ SYSCTL
Следующие переменные
.Xr sysctl 8
могут быть использованы для управления поведением класса
.Nm UNION
GEOM.
Рядом с каждой переменной показано значение по умолчанию.
.Bl -tag -width indent
.It Va kern.geom.union.debug : No 0
Уровень отладки класса
.Nm UNION
GEOM.
Может быть установлен в число от 0 до 4 включительно.
Если установлено в 0, информация об отладке не выводится.
Если установлено в 1, все подробные сообщения регистрируются.
Если установлено в 2, регистрируется дополнительная информация об ошибках.
Если установлено в 3, регистрируются операции отображения.
Если установлено в 4, выводится максимальное количество информации об отладке.
.El
.Sh СМОТРИ ТАКЖЕ
.Xr geom 4 ,
.Xr geom 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Fx 14.0 .
.Sh АВТОРЫ
.An Marshall Kirk McKusick Aq Mt mckusick@mckusick.com