melkorbsd/ru-freebsd-man/man8/gvinum.8
.\" Copyright (c) 2005 Chris Jones
.\" Все права защищены.
.\"
.\" Это программное обеспечение было разработано для проекта FreeBSD Chris Jones
.\" благодаря поддержке программы Google's Summer of Code и
.\" наставничеству Lukas Ertl.
.\"
.\" Распространение и использование в исходных и двоичных формах, с изменениями или без них,
.\" разрешены при условии соблюдения следующих условий:
.\" 1. Распространение исходного кода должно сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от гарантий.
.\" 2. Распространение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующий отказ от гарантий в документации
.\"    и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ВСЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, ПОДРАЗУМЕВАЕМЫЕ
.\" ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОЙ ЦЕЛИ ОТКЛОНЯЮТСЯ.
.\" НИ В КОЕМ СЛУЧАЕ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА
.\" ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПОСЛЕДСТВЕННЫЕ ИЛИ ИНЫЕ УБЫТКИ
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, ЗАМЕЩЕНИЕ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ
.\" ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА), ОДНАКО ПРОИЗОШЕДШИЕ СЛЕДСТВИЕМ ИЛИ В СВЯЗИ С
.\" ЛЮБОЙ ТЕОРИЕЙ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В РАМКАХ КОНТРАКТА, СТРОГОЙ ОТВЕТСТВЕННОСТИ
.\" ИЛИ ДЕЛИКТА (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ) В ЛЮБОМ СЛУЧАЕ, ВЫТЕКАЮЩЕМ ИЗ
.\" ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ ТАКОГО УБЫТКА.
.\"
.Dd 28 марта 2021 года
.Dt GVINUM 8
.Os
.Sh ИМЯ
.Nm gvinum
.Nd Программа управления Логическим ТомомResponse preparation time is too long, please simplify the question or use streaming.Ar description-file
не будет создан, если указан флаг
.Fl f
.
.It Ic detach Oo Fl f Oc Op Ar plex | subdisk
Отсоединение плекса или субдиска от тома или плекса, к которому он подключен.
.It Ic grow Ar plex device
Увеличение плекса путем создания диска gvinum и субдиска на устройстве и их присоединения к плексу.
Если это требуется организацией плекса, он будет переведен в состояние, доступное для увеличения.
.It Ic help
Предоставляет краткую сводку команд и аргументов
.Nm
.
.It Ic l | list Oo Fl rvV Oc Op Ar volume | plex | subdisk
.It Ic ld Oo Fl rvV Oc Op Ar drive ...
.It Ic ls Oo Fl rvV Oc Op Ar subdisk ...
.It Ic lp Oo Fl rvV Oc Op Ar plex ...
.It Ic lv Oo Fl rvV Oc Op Ar volume ...
Выводит информацию о соответствующем объекте(ах).
Флаг
.Fl r
предоставляет рекурсивное отображение, показывая объекты, подчиненные каждому, в правильной связи.
Флаги
.Fl v
и
.Fl V
предоставляют более детальный вывод постепенно.
.It Ic mirror Oo Fl fsv Oc Oo Fl n Ar name Oc Ar drives
Создает зеркальный том из указанных дисков.
Для этого требуется как минимум два диска.
Если имя не указано, уникальное имя будет установлено gvinum.
Если указан флаг
.Fl s
, будет создано зеркало со стрипингом, для чего потребуется четное кратное 4 дисков.
.It Ic move | mv Fl f Ar drive subdisk Op Ar ...
Перемещение субдиска(ов) на указанный диск.
Флаг
.Fl f
обязателен, так как все данные на указанном субдиске(ах) будут уничтожены в ходе перемещения.
На данный момент это может быть выполнено, только если субдиск не используется.
.Pp
Если перемещается один субдиск, и он является частью RAID-5 плекса, перемещенные субдиски нуждаются в установке в состояние
.Dq staleсостояние и плексу потребуется команда
.Ic start
.
Если перемещается несколько поддисков, и они являются частью RAID-5 плекса, перемещенные диски нужно будет установить в состояние
.Dq up
и плексу потребуется команда
.Ic rebuildparity
.
Если поддиски являются частью плекса, который зеркалирован с другими плексами, плекс потребуется перезапустить, и он синхронизируется после перезапуска.
Перемещение
более одного поддиска в RAID-5 плексе или поддисков с обеих сторон зеркального плекса объема уничтожит данные.
Обратите внимание, что восстановление четности и синхронизация
должны быть начаты вручную после перемещения.
.It Ic printconfig
Записать копию текущей конфигурации на стандартный вывод.
.It Ic quit
Выход
.Nm
при работе в интерактивном режиме.
Обычно это делается путем ввода символа
EOF
.
.It Ic raid5 Oo Fl fv Oc Oo Fl s Ar размер_полосы Oc Oo Fl n Ar имя Oc Ar диски
Создать RAID-5 том из указанных дисков.
Если имя не указано, уникальное имя будет установлено командой
.Ic gvinum
.
Для данной организации требуется как минимум три диска.
.It Ic rename Oo Fl r Oc Ar диск | поддиск | плекс | том новое_имя
Изменить имя указанного объекта.
Флаг
.Fl r
будет рекурсивно переименовывать подчиненные объекты.
.Pp
Обратите внимание, что узлы устройств не будут переименованы до перезапуска
.Nm
.
.It Ic rebuildparity Oo Fl f Oc Ar плекс
Перестроить блоки четности RAID-5 плекса.
Перестроение четности начнется с
начала плекса, если указан флаг
.Fl f
, или в противном случае с местоположения указателя проверки четности.
Все поддиски в плексе должны быть в состоянии up для проверки четности.
.It Ic resetconfig Oo Fl f Oc
Сбросить полную конфигурацию
.Nm
.It Ic rm Oo Fl r Oc Ar объем | plex | subdisk
Удаляет объект и, если указан
.Fl r,
его подчиненные объекты.
.It Ic saveconfig
Сохраняет конфигурацию
.Nm
на диск после сбоев конфигурации.
.It Ic setstate Oo Fl f Oc Ar состояние объем | plex | subdisk | диск
Устанавливает состояние без влияния на другие объекты, только для диагностических целей.
Флаг
.Fl f
принудительно изменяет состояние независимо от того, являются ли изменения законными.
.It Ic start
Читает конфигурацию со всех дисков vinum.
.It Ic start Oo Fl S Ar размер Oc Ar объем | plex | subdisk
Позволяет системе получать доступ к объектам.
Если необходимо, plex будут синхронизированы и восстановлены.
Если subdisk был добавлен к работающему RAID-5 или striped plex, gvinum будет
расширяться на этот subdisk и увеличивать весь массив RAID-5.
Это можно сделать без размонтирования вашей файловой системы.
Флаг
.Fl S
в настоящее время игнорируется.
.It Ic stop Oo Fl f Oc Op Ar объем | plex | subdisk
Прекращает доступ к объектам или останавливает
.Nm,
если параметры не указаны.
.It Ic stripe Oo Fl fv Oc Oo Fl n Ar имя Oc Ar диски
Создает striped объем из указанных дисков.
Если имя не указано, уникальное имя будет установлено
.Ic gvinum.
Для этой организации требуется как минимум два диска.
.El
.Sh ОПИСАНИЕ
Утилита
.Nm
взаимодействует с компонентом ядра менеджера логических томов GVinum.
Она разработана для интерактивного использования, когда запущена без аргументов командной строки, или для выполнения одной команды, если команда предоставлена в командной строке.
В интерактивном режиме
.Nm
поддерживает историю команд.
.Sh ОПЦИИ
Командам
.Nm
могут следовать опции.
.Bl -tag -width indent
.It Fl f
Опция
.Fl f
.Pq Dq force
переопределяет проверки безопасности.
Следует использовать с особой осторожностью.
Эта
опция необходима для использования команды
.Ic move
.It Fl r
Опция
.Fl r
.Pq Dq recursive
применяет команду рекурсивно к подчиненным объектам.
Например, в
сочетании с командой
.Ic lv
опция
.Fl r
также покажет информацию о плексах и субдисках, принадлежащих
тому же тому.
Опция также используется командой
.Ic rename
для указания, что подчиненные объекты, такие как субдиски, должны быть переименованы
в соответствии с указанными объектами, и командой
.Ic rm
для удаления плексов, принадлежащих тому же.
.It Fl v
Опция
.Fl v
.Pq Dq verbose
предоставляет более детальный вывод.
.It Fl V
Опция
.Fl V
.Pq Dq "very verbose"
предоставляет еще более подробный вывод, чем
.Fl v .
.El
.Sh ENVIRONMENT
.Bl -tag -width ".Ev EDITOR"
.It Ev EDITOR
Название редактора для редактирования файлов конфигурации, по
умолчанию вызывается
.Xr vi 1
.El
.Sh FILES
.Bl -tag -width ".Pa /dev/gvinum/plex"
.It Pa /dev/gvinum
каталог с устройственными узлами для
.Nm
объектов
.El
.Sh EXAMPLES
Для создания зеркала на дисках /dev/ada1 и /dev/ada2, создания файловой системы,
монтирования, размонтирования и затем остановки
.Ic gvinum :
.Pp
.Dl "gvinum mirror /dev/ada1 /dev/ada2"
.Dl "newfs /dev/gvinum/gvinumvolume0"
.Dl "mount /dev/gvinum/gvinumvolume0 /mnt"
.Dl "..."
.Dl "unmount /mnt"
.Dl "gvinum stop"
.Pp
Для создания полосатого зеркала на дисках /dev/ada1 /dev/ada2 /dev/ada3 и
/dev/ada4 с именем "data" и создания файловой системы:
.Pp
.Dl "gvinum mirror -s -n data /dev/ada1 /dev/ada2 /dev/ada3 /dev/ada4"
.Dl "newfs /dev/gvinum/data"
.Pp
Для создания массива raid5 на дисках /dev/ada1 /dev/ada2 и /dev/ada3,
со значением размера полосы 493k, можно использовать команду raid5:
.Pp
.Dl "gvinum raid5 -s 493k /dev/ada1 /dev/ada2 /dev/ada3"
.Pp
Затем том будет создан автоматически.
После этого вам необходимо инициализировать том:
.Pp
.Dl "gvinum start myraid5vol"
.Pp
Инициализация начнется, и состояния будут обновлены после ее завершения.
Команда list предоставит вам информацию о ее прогрессе.
.Pp
Представьте, что один из дисков выходит из строя, и вывод 'printconfig' выглядит
примерно так:
.Pp
.Dl "drive gvinumdrive1 device /dev/ada2"
.Dl "drive gvinumdrive2 device /dev/???"
.Dl "drive gvinumdrive0 device /dev/ada1"
.Dl "volume myraid5vol"
.Dl "plex name myraid5vol.p0 org raid5 986s vol myraid5vol"
.Dl "sd name myraid5vol.p0.s2 drive gvinumdrive2 len 32538s driveoffset 265s"
.Dl "plex myraid5vol.p0 plexoffset 1972s"
.Dl "sd name myraid5vol.p0.s1 drive gvinumdrive1 len 32538s driveoffset 265s"
.Dl "plex myraid5vol.p0 plexoffset 986s"
.Dl "sd name myraid5vol.p0.s0 drive gvinumdrive0 len 32538s driveoffset 265s"
.Dl "plex myraid5vol.p0 plexoffset 0s"
.Pp
Создайте новый диск с этой конфигурацией:
.Pp
.Dl "drive gdrive4 device /dev/ada4"
.Pp
Затем переместите устаревший субдиск на новый диск:
.Pp
.Dl "gvinum move gdrive4 myraid5vol.p0.s2"
.Pp
После этого начните перестройку:
.Pp
.Dl "gvinum start myraid5vol.p0"
.Pp
Plex выйдет из состояния деградации после завершения перестройки.
Plex все еще можно использовать во время перестройки, хотя запросы
могут задерживаться.Увеличение массива выполняется с помощью команды grow:
.Pp
.Dl "gvinum grow myraid5vol.p0 /dev/ada4"
.Pp
Если всё прошло хорошо, то состояние плекса теперь должно быть установлено, как расширяемое.
Затем вы можете начать процесс увеличения с помощью команды
.Ic start
:
.Pp
.Dl "gvinum start myraid5vol.p0"
.Pp
Как и в случае с перестроением, вы можете следить за процессом с помощью команды
.Ic list
.
.Pp
Для более сложного использования и детального объяснения gvinum рекомендуется обратиться к руководству пользователя.
.Sh СМОТРИ ТАКЖЕ
.Xr geom 4 ,
.Xr geom 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 5.3 .
Утилита
.Nm vinum
, на которой основан
.Nm
, была написана
.An "Greg Lehey" .
.Pp
Утилита
.Nm
была написана
.An "Lukas Ertl" .
Команды
.Ic move
и
.Ic rename
, а также документация были добавлены
.An "Chris Jones"
в рамках программы Google Summer of Code 2005.
Частичная перепись gvinum была выполнена
.An "Lukas Ertl"
и
.An "Ulf Lilleengen"
в рамках программы Google Summer of Code 2007.
Документация была обновлена, чтобы отразить новые функции.
.Sh АВТОРЫ
.An Lukas Ertl Aq Mt le@FreeBSD.org
.An Chris Jones Aq Mt soc-cjones@FreeBSD.org
.An Ulf Lilleengen Aq Mt lulf@FreeBSD.org
.Sh ОШИБКИ
На данный момент
.Nm
не переименовывает устройства в
.Pa /dev/gvinum
до их перезагрузки.
.Pp
Флаг
.Fl S
initsize для команды
.Ic start
игнорируется.
.Pp
Перемещение поддисков, которые не являются частью зеркального или RAID-5 тома, приведёт к уничтожению данных.
Возможно, это следует считать ошибкой.
.Pp
Плексы, в которых поддиски были перемещены, не синхронизируются автоматически и не восстанавливают паритет.
Это может оставить данные без защиты и, возможно, нецелесообразно.
.Pp
В настоящее время
.Nm
ещё не полностью реализует все функции, найденные в
.Nm vinum .
В частности, следующие команды из
.Nm vinum
не поддерживаются:
.Bl -tag -width indent
.It Ic debug
Заставить менеджер томов войти в отладчик ядра.
.It Ic debug Ar flags
Установить флаги отладки.
.It Ic dumpconfig Op Ar drive ...
Показать информацию о конфигурации, сохранённой на указанных дисках или на всех
дисках в системе, если имена дисков не указаны.
.It Ic info Op Fl vV
Показать информацию о состоянии менеджера томов.
.It Ic label Ar volume
Создать метку тома.
.It Ic resetstats Oo Fl r Oc Op Ar volume | plex | subdisk
Сбросить счётчики статистики для указанных объектов или для всех объектов, если
они не указаны.
.It Ic setdaemon Op Ar value
Настроить конфигурацию daemon.
.El