melkorbsd/ru-freebsd-man/man8/halt.8
.\"
.\" Авторские права (c) 1990, 1991, 1993
.\" Регенты Университета Калифорнии. Все права защищены.
.\"
.\" Перераспределение и использование в исходных и двоичных формах, с изменениями или без,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять приведенное выше уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределения в двоичной форме должны воспроизводить приведенное выше уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\" 3. Ни имя Университета, ни имена его участников
.\"    не могут быть использованы для одобрения или продвижения продуктов, производных от этого программного обеспечения,
.\"    без специального предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ РЕГЕНТАМИ И УЧАСТНИКАМИ ``КАК ЕСТЬ'' И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ,
.\" ОТКАЗЫВАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ РЕГЕНТЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТЬ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПРИМЕРНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ЗАМЕНЫ ТОВАРОВ
.\" ИЛИ УСЛУГ; ПОТЕРЕЙ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕМ БИЗНЕСА)
.\" ОДНАКО ВЫЗВАННЫЕ И НА ОСНОВЕ ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКШИЕ КАКИМ-ЛИБО ОБРАЗОМ
.\" В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\" SUCH DAMAGE.
.\"
.\" @(#)reboot.8 8.1 (Berkeley) 6/9/93
.\"
.Dd 20 декабря 2017 года
.Dt ПЕРЕЗАГРУЗКА 8
.Os
.Sh НАЗВАНИЕ
.Nm перезагрузка ,
.Nm выключение ,
.Nm быстрая перезагрузка ,
.Nm быстрое выключение
.Nd остановка и перезапуск системы
.Sh СИНТАКСИС
.Nm выключение
.Op Fl lNnpq
.Op Fl k Ar ядро
.Nm
.Op Fl cdlNnpqr
.Op Fl k Ar ядро
.Nm быстрое выключение
.Op Fl lNnpq
.Op Fl k Ar ядро
.Nm быстрая перезагрузка
.Op Fl dlNnpq
.Op Fl k Ar ядро
.Sh ОПИСАНИЕ
Команды
.Nm выключение
и
.Nm
очищают кэш файловой системы на диск, отправляют всем запущенным процессам
сигнал
.Dv SIGTERM
(а затем
.Dv SIGKILL)
и, соответственно, останавливают или перезагружают систему.
Действие регистрируется, включая ввод записи о выключении в базу данных учета пользователей.
.Pp
Опции следующие:
.Bl -tag -width indent
.It Fl c
Система выключит питание и затем включит его обратно, если она сможет.
Если действие выключения питания не удастся, система
выключится или перезагрузится нормально, в зависимости от того,
была ли вызвана команда
.Nm выключение
или
.Nm
На текущий момент только драйвер
.Xr ipmi 4
реализует функциональность переключения питания только на оборудовании
с BMC, поддерживающим переключение питания.
В отличие от выключения, количество оборудования, поддерживающего переключение питания, мало.
.It Fl d
Системе предлагается создать дамп памяти при сбое.
Эта опция
поддерживается только при перезагрузке и не имеет эффекта, если устройство для дампа
не было заранее указано с помощью
.Xr dumpon 8 .
.It Fl k Ar ядро
Загружает указанное
.Ar ядро
при следующей загрузке системы.
Если ядро загрузится успешно, то
.Em по умолчанию
ядра будут загружаться при последующих запусках, это опция одноразового действия.
Если загрузка не удастся, система будет продолжать пытаться загрузить.Ar ядро
до тех пор, пока процесс загрузки не будет прерван и не будет загружено действительное ядро.
Это может измениться в будущем.
.It Fl l
Остановка или перезагрузка
.Em не
регистрируются в системном журнале.
Эта опция предназначена для приложений, таких как
.Xr shutdown 8 ,
которые вызывают
.Nm
или
.Nm halt
и регистрируют это самостоятельно.
.It Fl N
Кэш файловой системы не очищается во время начальной очистки процесса,
однако уровень ядра
.Xr reboot 2
всё ещё обрабатывается с синхронизацией.
Эта опция может быть полезна для выполнения
.Dq максимально возможной
перезагрузки, когда устройства могут быть недоступны.
Это может произойти, когда устройства были отключены, например с
.Xr iscsi 4 .
.It Fl n
Кэш файловой системы не очищается.
Вероятно, этой опцией не следует пользоваться.
.It Fl p
Система отключит питание, если сможет.
Если действие по выключению питания не удаётся, система
остановится или перезагрузится нормально, в зависимости от того,
была ли вызвана
.Nm halt
или
.Nm .
.It Fl q
Система останавливается или перезагружается быстро и некорректно, и выполняется только
очистка кэша файловой системы (если
.Fl n
опция не указана).
Вероятно, этой опцией не следует пользоваться.
.It Fl r
Система завершает работу всех процессов, размонтирует все файловые системы, монтирует новую
корневую файловую систему и начинает обычную последовательность запуска.
После изменения vfs.root.mountfrom командой
.Xr kenv 1 ,
.Nm Fl r
может быть использован для смены корневой файловой системы при сохранении состояния ядра.
Это требует загруженного модуля ядра
.Xr tmpfs 5 ,
поскольку
.Xr init 8
нуждается в месте для хранения после размонтирования старого корня, но
до того, как на месте будет новый корень.
.El
.Pp
Утилиты
.Nm fasthalt
и
.Nm fastboot
не что иное, как алиасы для.Nm halt
и
.Nm
утилиты.
.Pp
Обычно, утилита
.Xr shutdown 8
используется, когда системе необходимо быть остановленной или перезагруженной, предоставляя
пользователям предварительное предупреждение о их надвигающейся беде и аккуратно завершая
специфические программы.
.Sh ПРИМЕРЫ
Заменить текущую корневую файловую систему на UFS, смонтированную с
.Pa /dev/ada0s1a :
.Bd -literal -offset indent
kenv vfs.root.mountfrom=ufs:/dev/ada0s1a
reboot -r
.Ed
.Pp
Этот механизм также может быть использован с NFS, с оговоркой, что
он работает только с NFSv4, и требует числового IPv4 адреса:
.Bd -literal -offset indent
kenv vfs.root.mountfrom=nfs:192.168.1.1:/share/name
reboot -r
.Ed
.Sh СМОТРИ ТАКЖЕ
.Xr kenv 1 ,
.Xr getutxent 3 ,
.Xr ipmi 4 ,
.Xr boot 8 ,
.Xr dumpon 8 ,
.Xr nextboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8 ,
.Xr sync 8
.Sh ИСТОРИЯ
A
.Nm
утилита появилась в
.Bx 4.0 .