melkorbsd/ru-freebsd-man/man8/hastctl.8
.\" Copyright (c) 2010 The FreeBSD Foundation
.\" Все права защищены.
.\"
.\" Это программное обеспечение было разработано Павелом Якубом Давидеком при спонсорстве
.\" Фонда FreeBSD.
.\"
.\" Перераспределение и использование в исходном и бинарном виде, с изменениями или без,
.\" разрешено при условии соблюдения следующих условий:
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление о авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределение в бинарной форме должно воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, распространяемых с дистрибутивом.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРАМИ И УЧАСТНИКАМИ «КАК ЕСТЬ» БЕЗ
.\" КАКИХ-ЛИБО ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ,
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ.
.\" ОТКАЗ ОТ ОТВЕТСТВЕННОСТИ. НИ ПРИ КАКИХ УСЛОВИЯХ АВТОРЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ЭКЗЕМПЛЯРНЫЕ ИЛИ КОСВЕННЫЕ УЩЕРБЫ
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, ЗАТРАТЫ НА ЗАМЕНУ ТОВАРОВ И УСЛУГ,
.\" ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" В ЛЮБОМ СЛУЧАЕ, ВОЗНИКШЕМ ИЗ ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 8 сентября 2016 года
.Dt HASTCTL 8
.Os
.Sh ИМЯ
.Nm hastctl
.Nd "Утилита управления высокодоступным хранением данных"

.Sh СИНТАКСИС
.Nm
.Cm create
.Op Fl d
.Op Fl c Ar config
.Op Fl e Ar extentsize
.Op Fl k Ar keepdirty
.Op Fl m Ar mediasize
.Ar name ...
.Nm
.Cm role
.Op Fl d
.Op Fl c Ar config
.Aq init | primary | secondary
.Ar all | name ...
.Nm
.Cm list
.Op Fl d
.Op Fl c Ar config
.Op Ar all | name ...
.Nm
.Cm status
.Op Fl d
.Op Fl c Ar config
.Op Ar all | name ...
.Nm
.Cm dump
.Op Fl d
.Op Fl c Ar config
.Op Ar all | name ...
.Sh ОПИСАНИЕ
The
.Nm
утилита используется для управления поведением демона
.Xr hastd 8
.Pp
Эта утилита должна использоваться программным обеспечением высокой доступности, таким как
.Nm heartbeat
или
.Nm ucarp
для настройки роли ресурсов HAST при переключении с основного режима на запасной или наоборот.
Обратите внимание, что если файловая система вроде UFS существует на провайдере HAST и основной узел выходит из строя, файловую систему необходимо проверить на наличие несоответствий
с помощью утилиты
.Xr fsck 8
после переключения запасного узла в основной режим.
.Pp
Первый аргумент для
.Nm
указывает действие, которое необходимо выполнить:
.Bl -tag -width ".Cm create"
.It Cm create
Инициализация локального провайдера, настроенного для данного ресурса.
Дополнительные опции включают:
.Bl -tag -width ".Fl e Ar extentsize"
.It Fl e Ar extentsize
Размер экстента.
Экстент — это блок, который используется для синхронизации.
.Xr hastd 8
поддерживает карту грязных экстентов и экстент — это наименьшая область, которая может быть отмечена как грязная.
Если какая-либо часть экстента изменена, весь экстент будет синхронизирован
при соединении узлов.
Если размер экстента слишком мал, это приведёт к слишком большой дисковой активности
связанной с обновлениями карты грязных, что снизит производительность
данного ресурса.
Если размер экстента слишком велик, синхронизация, даже в случае короткого
сбой в работе, может занять длительное время, что увеличивает риск потери актуальной информации.
узел до завершения процесса синхронизации.

Размер блока по умолчанию составляет
.Va 2MB .
.It Fl k Ar keepdirty
Максимальное количество "грязных" блоков, которые всегда остаются "грязными".
Самые недавно использованные блоки остаются "грязными", чтобы уменьшить количество обновлений метаданных.
По умолчанию количество самых недавно использованных блоков, которые будут оставаться "грязными", составляет
.Va 64 .
.It Fl m Ar mediasize
Размер меньшего носителя, используемого в качестве хранилища на обоих узлах.
Эту опцию можно опустить, если носители узлов одинакового размера с обеих сторон.
.El
.Pp
Если размер сопровождается суффиксом k, M, G или T, то он расценивается соответственно как килобайт, мегабайт, гигабайт или терабайт.
.It Cm role
Изменить роль данного ресурса.
Роль может быть одной из следующих:
.Bl -tag -width ".Cm secondary"
.It Cm init
Ресурс выключен.
.It Cm primary
Локальный
.Xr hastd 8
демон будет действовать как основной узел для данного ресурса.
Система, в которой роль ресурса установлена как основная, может использовать
.Pa /dev/hast/<name>
GEOM-провайдер.
.It Cm secondary
Локальный
.Xr hastd 8
демон будет действовать как вторичный узел для данного ресурса - он будет ожидать соединения от основного узла и обрабатывать запросы ввода-вывода, полученные от него.
GEOM-провайдер
.Pa /dev/hast/<name>
не будет создан на вторичном узле.
.El
.It Cm list
Представить подробный статус настроенных ресурсов.
.It Cm status
Представить краткий (и более легко машинно-разбираемый) статус настроенных ресурсов.
.It Cm dump
Выгрузить метаданные, сохранённые на локальном компоненте для настроенных ресурсов.
.El
.Pp
Кроме того, каждую подкоманду можно следовать следующими опциями:.Bl -tag -width ".Fl c Ar config"
.It Fl c Ar config
Укажите альтернативное расположение файла конфигурации.
По умолчанию это
.Pa /etc/hast.conf .
.It Fl d
Выводить отладочную информацию.
Эту опцию можно указать несколько раз для увеличения уровня подробности.
.El
.Sh FILES
.Bl -tag -width ".Pa /var/run/hastctl" -compact
.It Pa /etc/hast.conf
Файл конфигурации для
.Nm
и
.Xr hastd 8 .
.It Pa /var/run/hastctl
Контрольный сокет, используемый
.Nm
для связи с демоном
.Xr hastd 8 .
.El
.Sh EXIT STATUS
Код выхода 0 в случае успеха, или одно из значений, описанных в
.Xr sysexits 3
в случае ошибки.
.Sh EXAMPLES
Инициализация ресурса HAST, создание файловой системы на нём и её монтирование.
.Bd -literal -offset indent
nodeB# hastctl create shared
nodeB# hastd
nodeB# hastctl role secondary shared

nodeA# hastctl create shared
nodeA# hastd
nodeA# hastctl role primary shared
nodeA# newfs -U /dev/hast/shared
nodeA# mount -o noatime /dev/hast/shared /shared
nodeA# application_start
.Ed
.Pp
Переключение ролей для ресурса HAST
.Nm shared .
.Bd -literal -offset indent
nodeA# application_stop
nodeA# umount -f /shared
nodeA# hastctl role secondary shared

nodeB# hastctl role primary shared
nodeB# fsck -t ufs /dev/hast/shared
nodeB# mount -o noatime /dev/hast/shared /shared
nodeB# application_start
.Ed
.Sh SEE ALSO
.Xr sysexits 3 ,
.Xr geom 4 ,
.Xr hast.conf 5 ,
.Xr fsck 8 ,
.Xr ggatec 8 ,
.Xr ggatel 8 ,
.Xr hastd 8 ,
.Xr mount 8 ,
.Xr newfs 8
.Sh HISTORY
Утилита
.Nm
появилась в
.Fx 8.1 .
.Sh AUTHORS
Утилиту
.Nm
разработал
.An Pawel Jakub Dawidek Aq Mt pjd@FreeBSD.org
при поддержке Фонда FreeBSD.