melkorbsd/ru-freebsd-man/man8/hcsecd.8
.\"
.\" Copyright (c) 2001-2002 Максим Евменкин <m_evmenkin@yahoo.com>
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходном и двоичном формах, с изменениями или без,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределенный исходный код должен сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределенные в двоичной форме данные должны воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ОТКАЗ ОТ ВСЕХ ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ
.\" ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКЛОНЕНЫ. НИ В КОЕМ СЛУЧАЕ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ
.\" ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПРИМЕРНЫЕ ИЛИ ПОСЛЕДОВАТЕЛЬНЫЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ЗАМЕНЯЮЩИХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ,
.\" ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ВЫЗВАННЫЕ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНЫЙ) ВОЗНИКШИЕ ЛЮБЫМ ОБРАЗОМ
.\" ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ИЗВЕЩЕН О ВОЗМОЖНОСТИ ТАКОГО
.\" УЩЕРБА.
.\"
.\" $Id: hcsecd.8,v 1.8 2003/09/08 18:54:20 max Exp $
.\"
.Dd 16 ноября 2002
.Dt HCSECD 8
.Os
.Sh НАЗВАНИЕ
.Nm hcsecd
.Nd управление ключами связи и PIN-кодами для устройств Bluetooth
.Sh СИНТАКСИС
.Nm
.Op Fl dh
.Fl f Ar файл_конфигурации
.Sh ОПИСАНИЕ
Демон
.Nm
управляет ключами связи и PIN-кодами для Bluetooth-устройств.
Он открывает сырой HCI сокет и прослушивает
.Dv Link_Key_Request,
.Dv PIN_Code_Request
и
.Dv Link_Key_Notification
HCI события.
.Pp
Как только событие HCI
.Dv Link_Key_Request
или
.Dv PIN_Code_Request
получено, демон сканирует файл конфигурации на предмет соответствующей записи.
Адрес BD_ADDR удалённого устройства используется как ключ.
Если соответствующая запись не найдена, будет использоваться запись по умолчанию.
Если запись по умолчанию не найдена, предполагается, что ключ связи и PIN-код отсутствуют.
Для любой заданной записи ключ связи имеет приоритет над PIN-кодом.
Если ключ связи не был указан, устройство должно генерировать ключ связи из PIN-кода.
Если запись была найдена и ключ связи (или PIN-код) существует, будет отправлена команда
.Dv Link_Key_Request_Reply
(или
.Dv PIN_Code_Request_Reply)
обратно устройству.
В противном случае будет отправлена команда
.Dv Link_Key_Request_Negative_Reply
(или
.Dv PIN_Code_Request_Negative_Reply)
обратно устройству.
.Pp
Демон
.Nm
также обрабатывает события HCI
.Dv Link_Key_Notification
и кэширует ключи связи, созданные из PIN-кодов в памяти.
Чтобы сохранить ключи связи между перезапусками, демон
.Nm
выгружает ключи связи для всех записей в файл ключей связи
.Pa /var/db/hcsecd.keys.
Если файл ключей связи существует, демон
.Nm
обрабатывает его после обработки своего основного файла конфигурации.
Файл ключей связи записывается каждый раз, когда демон
.Nm
завершает работу корректно.
Можно принудительно заставить демон
.Nm
перечитать свой основной файл конфигурации и выгрузить файл ключей связи, отправив
.Dv HUP
сигнал для
.Nm
процесса.
От пользователя ожидается, что он не будет вручную изменять файл ключей связи.
.Pp
Опции командной строки следующие:
.Bl -tag -width indent
.It Fl d
Не отключаться от управляющего терминала.
.It Fl f Ar configfile
Указать имя файла конфигурации.
Значение по умолчанию —
.Pa /etc/bluetooth/hcsecd.conf .
.It Fl h
Показать сообщение о помощи и выйти.
.El
.Sh FILES
.Bl -tag -width ".Pa /etc/bluetooth/hcsecd.conf" -compact
.It Pa /etc/bluetooth/hcsecd.conf
.It Pa /var/db/hcsecd.keys
.It Pa /var/run/hcsecd.pid
.El
.Sh SEE ALSO
.Xr ng_btsocket 4 ,
.Xr ng_hci 4 ,
.Xr hcsecd.conf 5 ,
.Xr hccontrol 8
.Sh AUTHORS
.An Максим Евменкин Aq Mt m_evmenkin@yahoo.com
.Sh BUGS
На данный момент нет возможности выбора ключа связи или PIN-кода на основе
того, какое локальное устройство получило запрос.
Всё основано на удалённом устройстве BD_ADDR.
Отсутствует интерфейс для внешних помощников для получения ключей связи и PIN-кодов.