melkorbsd/ru-freebsd-man/man8/hostapd.8
.\" Copyright (c) 2005 Sam Leffler <sam@errno.com>
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходном и двоичном формах, с изменениями или без,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределенный исходный код должен сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределенные в двоичной форме данные должны воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ОТКАЗ ОТ ВСЕХ ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ
.\" ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКЛОНЕНЫ. НИ В КОЕМ СЛУЧАЕ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ
.\" ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПРИМЕРНЫЕ ИЛИ ПОСЛЕДОВАТЕЛЬНЫЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ЗАМЕНЯЮЩИХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ,
.\" ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ВЫЗВАННЫЕ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНЫЙ) ВОЗНИКШИЕ ЛЮБЫМ ОБРАЗОМ
.\" ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ИЗВЕЩЕН О ВОЗМОЖНОСТИ ТАКОГО
.\" УЩЕРБА.
.\"
.Dd 18 июля 2012
.Dt HOSTAPD 8
.Os
.Sh НАЗВАНИЕ
.Nm hostapd
.Nd "аутентификатор для сетей IEEE 802.11"
.Sh СИНТАКСИС
.Nm
.Op Fl BdhKtv
.Op Fl P Ar pidfile
.Ar файл-конфигурации ...
.Sh ОПИСАНИЕ
Утилита
.Nm
является аутентификатором для сетей IEEE 802.11.
Он обеспечивает полную поддержку WPA/IEEE 802.11i и
также может выступать в качестве IEEE 802.1X Аутентификатора с соответствующим
сервером аутентификации на бэкенде (обычно
.Tn FreeRADIUS ).
Утилита
.Nm
реализует протоколы аутентификации, которые используются поверх
стандартных механизмов протокола IEEE 802.11.
Для использования
.Nm
в качестве аутентификатора, базовое устройство должно поддерживать некоторые
базовые функции, такие как возможность настройки информации о безопасности
в управляющих кадрах 802.11.
Учтите, что не все устройства поддерживают это.
.Pp
Утилита
.Nm
разработана для работы в качестве
.Dq демона,
который выполняется в фоновом режиме и действует как бэкенд компонент,
управляющий беспроводным подключением.
Он поддерживает отдельные программы фронтенда, такие как
текстовый фронтенд,
.Xr hostapd_cli 8 .
.Pp
Следующие аргументы должны быть указаны в командной строке:
.Bl -tag -width indent
.It Ar файл-конфигурации
Использовать настройки в указанном конфигурационном файле; имя
указанного беспроводного интерфейса содержится в этом файле.
Смотрите
.Xr hostapd.conf 5
для описания синтаксиса конфигурационного файла.
.Pp
Изменения в конфигурационном файле могут быть перезагружены отправкой сигнала
.Dv SIGHUP
процессору
.Nm
или с помощью утилиты
.Xr hostapd_cli 8,
используя
.Dq Li "hostapd_cli reconfigure" .
.El
.Sh ОПЦИИ
Опции следующие:
.Bl -tag -width indent
.It Fl d
Включить сообщения отладки.
Если эта опция указана дважды, отображаются более подробные сообщения.
.It Fl h
Показать текст помощи.
.It Fl t
Включить временные метки в вывод отладки.
.It Fl v
Отобразить информацию о версии в терминале и выйти.
.It Fl B
Отсоединиться от управляющего терминала и запустить процесс в качестве демонаКонечно, вот перевод страницы с сохранением форматирования и техническими терминами:

```
.in the background.
.It Fl K
Включить ключевую информацию в вывод отладки.
.It Fl P Ar pidfile
Хранить PID в
.Ar pidfile .
.El
.Sh СМОТРИ ТАКЖЕ
.Xr ath 4 ,
.Xr ipw 4 ,
.Xr iwi 4 ,
.Xr mwl 4 ,
.Xr ral 4 ,
.Xr rum 4 ,
.Xr run 4 ,
.Xr ural 4 ,
.Xr hostapd.conf 5 ,
.Xr hostapd_cli 8 ,
.Xr ifconfig 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 6.0 .
.Sh АВТОРЫ
Утилиту
.Nm
написал
.An Jouni Malinen Aq Mt j@w1.fi .
Эта страница руководства произведена из
.Pa README
файла, включенного в дистрибутив
.Nm.
```

Обратите внимание, что некоторые части, такие как имена команд и файлов, остаются без перевода, поскольку они являются частью стандартного технического словаря, и перевод этих терминов может привести к путанице.