melkorbsd/ru-freebsd-man/man8/hostapd_cli.8
.\" Copyright (c) 2005 Sam Leffler <sam@errno.com>
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходном и двоичном формах, с изменениями или без,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределенный исходный код должен сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределенные в двоичной форме данные должны воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ОТКАЗ ОТ ВСЕХ ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ
.\" ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКЛОНЕНЫ. НИ В КОЕМ СЛУЧАЕ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ
.\" ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПРИМЕРНЫЕ ИЛИ ПОСЛЕДОВАТЕЛЬНЫЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ЗАМЕНЯЮЩИХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ,
.\" ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ВЫЗВАННЫЕ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНЫЙ) ВОЗНИКШИЕ ЛЮБЫМ ОБРАЗОМ
.\" ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ИЗВЕЩЕН О ВОЗМОЖНОСТИ ТАКОГО
.\" УЩЕРБА.
.\"
.Dd 16 июня 2005
.Dt HOSTAPD_CLI 8
.Os
.Sh НАЗВАНИЕ
.Nm hostapd_cli
.Nd текстовая программа для взаимодействия с
.Xr hostapd 8
.Sh СИНТАКСИС
.Nm
.Op Ar команды
.Sh ОПИСАНИЕ
Утилита
.Nm
является текстовой программой для взаимодействия с
.Xr hostapd 8 .
Она используется для запроса текущего состояния.
.Pp
Утилита
.Nm
может показать
текущий статус аутентификации,
MIB dot11 и dot1x и т.д.
.Pp
Утилита
.Nm
поддерживает два режима: интерактивный и командной строки.
Оба режима используют один и тот же набор команд.
.Pp
Интерактивный режим запускается, когда
.Nm
выполняется без каких-либо параметров в командной строке.
Команды вводятся с контролирующего терминала в
ответ на приглашение
.Nm
промпт.
В режиме командной строки те же команды вводятся
как аргументы командной строки.
.Sh КОМАНДЫ
Следующие команды могут быть использованы в командной строке
или при интерактивной работе.
.Bl -tag -width indent
.It Ic mib
Сообщить переменные MIB (dot1x, dot11) для текущего интерфейса.
.It Ic sta Ar addr
Сообщить переменные MIB для ассоциированной станции с MAC-адресом
.Ar addr .
.It Ic all_sta
Сообщить переменные MIB для всех ассоциированных станций.
.It Ic help
Показать справку по использованию.
.It Ic interface Op Ar ifname
Показать доступные интерфейсы и/или установить текущий интерфейс,
когда доступно несколько.
.It Ic level Ar debug_level
Изменить уровень отладки в
.Xr hostapd 8 .
Большие числа генерируют больше сообщений.
.It Ic license
Отобразить полную
лицензию для
.Nm .
.It Ic quit
Выйти из
.Nm .
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr hostapd.conf 5 ,
.Xr hostapd 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 6.0 .
.Sh АВТОРЫ
Утилиту
.Nm
написал
.An Jouni Malinen Aq Mt j@w1.fi .
Эта страница руководства произведена на основе
.Pa README
файла, включенного в дистрибутив
.Nm hostapd
распределение.