melkorbsd/ru-freebsd-man/man8/hprop.8
.\" Copyright (c) 2000 - 2004 Королевский Технологический Институт
.\" (Kungliga Tekniska Högskolan, Стокгольм, Швеция).
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходных и двоичных формах, с изменениями или без,
.\" разрешено при условии соблюдения следующих условий:
.\"
.\" 1. Перераспределенный исходный код должен сохранять вышеуказанное уведомление о copyright,
.\"    данный список условий и следующее отказ от ответственности.
.\"
.\" 2. Перераспределенные в двоичной форме данные должны воспроизводить вышеуказанное уведомление о copyright,
.\"    данный список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\"
.\" 3. Ни имя Института, ни имена его участников
.\"    не могут быть использованы для подтверждения или рекламы продуктов, произведенных на основе этого программного обеспечения
.\"    без специального предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ИНСТИТУТОМ И УЧАСТНИКАМИ «КАК ЕСТЬ», И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ
.\" ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ ОТКЛОНЯЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ИНСТИТУТ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ПРИМЕРНЫЙ, ИЛИ ПОСЛЕДОВАТЕЛЬНЫЙ УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ЗАМЕНЯЮЩИХ ТОВАРОВ
.\" ИЛИ УСЛУГ; ПОТЕРЕЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" КАКИМ ЛИБО ОБРАЗОМ ВОЗНИКШИМ И НА ОСНОВАНИИ ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ ОТВЕТСТВЕННОСТИ,
.\" ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНЫЕ) ВОЗНИКШИМИ ЛЮБЫМ СПОСОБОМ
.\" ИЗ ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.\" $Id$
.\"
.Dd 8 декабря 2004
.Dt HPROP 8
.Os HEIMDAL
.Sh ИМЯ
.Nm hprop
.Nd распространение базы данных KDC
.Sh СИНТАКСИС
.Nm
.Bk -words
.Oo Fl m Ar файл \*(Ba Xo
.Fl Fl master-key= Ns Pa файл
.Xc
.Oc
.Oo Fl d Ar файл \*(Ba Xo
.Fl Fl database= Ns Pa файл
.Xc
.Oc
.Op Fl Fl source= Ns Ar heimdal|mit-dump
.Oo Fl r Ar строка \*(Ba Xo
.Fl Fl v4-realm= Ns Ar строка
.Xc
.Oc
.Oo Fl c Ar cell \*(Ba Xo
.Fl Fl cell= Ns Ar cell
.Xc
.Oc
.Oo Fl k Ar keytab \*(Ba Xo
.Fl Fl keytab= Ns Ar keytab
.Xc
.Oc
.Oo Fl R Ar строка \*(Ba Xo
.Fl Fl v5-realm= Ns Ar строка
.Xc
.Oc
.Op Fl D | Fl Fl decrypt
.Op Fl E | Fl Fl encrypt
.Op Fl n | Fl Fl stdout
.Op Fl v | Fl Fl verbose
.Op Fl Fl version
.Op Fl h | Fl Fl help
.Op Ar хост Ns Op : Ns Ar порт
.Ar ...
.Ek
.Sh ОПИСАНИЕ
.Nm
принимает базу данных принципалов в указанном формате и преобразует ее в
поток записей базы данных Heimdal. Этот поток может быть написан
на стандартный вывод или (чаще) распространен на
.Xr hpropd 8
сервер, работающий на другой машине.
.Pp
Если распространяется, он подключается ко всем
.Ar хостам
указаны в команде, открывая TCP-соединение с портом 754
(служба hprop) и отправляет базу данных в зашифрованной форме.
.Pp
Поддерживаемые опции:
.Bl -tag -width Ds
.It Fl m Ar файл , Fl Fl master-key= Ns Pa файл
Где найти мастер-ключ для шифрования или дешифрования ключей.
.It Fl d Ar файл , Fl Fl database= Ns Pa файл
База данных для распространения.
.It Fl Fl source= Ns Ar heimdal|mit-dump|krb4-dump|kaserver
Указывает тип исходной базы данных. Альтернативы включают:
.Pp
.Bl -tag -width mit-dump -compact -offset indent
.It heimdal
База данных Heimdal
.It mit-dump
Файл дампа MIT Kerberos 5
.El
+.It Fl k Ar keytab , Fl Fl keytab= Ns Ar keytab
Используемый keytab для извлечения ключа для аутентификации
перед демонами репликации. Используется ключ
.Pa hprop/hostname
из этого keytab. По умолчанию ключ извлекается из
базы данных KDC.
.It Fl R Ar string , Fl Fl v5-realm= Ns Ar string
Перекрытие локального домена.
.It Fl D , Fl Fl decrypt
Ключи шифрования в базе данных могут быть как в открытом виде, так и
зашифрованы мастер-ключом. Эта опция передает базу данных с
незашифрованными ключами.
.It Fl E , Fl Fl encrypt
Эта опция передает базу данных с зашифрованными ключами.
.It Fl n , Fl Fl stdout
Выгружает базу данных на stdout в формате, который может быть
передан hpropd.
.El
.Sh EXAMPLES
Следующее команда передаст базу данных на другую машину (на которой
должен работать
.Xr hpropd 8 ):
.Bd -literal -offset indent
$ hprop slave-1 slave-2
.Ed
.Sh SEE ALSO
.Xr hpropd 8