melkorbsd/ru-freebsd-man/man8/hpropd.8
.\" Авторское право (c) 1997, 2000 - 2003 Королевский технологический институт
.\" (Kungliga Tekniska Högskolan, Стокгольм, Швеция).
.\" Все права защищены.
.\"
.\" Распространение и использование в исходных и бинарных формах, с изменениями или без,
.\" разрешается при условии соблюдения следующих условий:
.\"
.\" 1. Перераспределение исходного кода должно сохранять вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности.
.\"
.\" 2. Перераспределение в бинарной форме должно воспроизводить вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\"
.\" 3. Ни имя Института, ни имена его участников
.\"    не могут быть использованы для поддержки или продвижения продуктов, произведенных на основе этого программного обеспечения
.\"    без конкретного предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ИНСТИТУТОМ И ЕГО УЧАСТНИКАМИ ``КАК ЕСТЬ'' И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ
.\" КОММЕРЧЕСКОЙ ПРИГОДНОСТИ И ПРИСПОСОБЛЕННОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКАЗЫВАЮТСЯ ОТ ОТВЕТСТВЕННОСТИ.
.\" НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ИНСТИТУТ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА КАКИЕ-ЛИБО ПРЯМЫЕ, КОСВЕННЫЕ, ИНЦИДЕНТНЫЕ, ОСОБЫЕ, ЭКЗЕМПЛЯРНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, ПРИОБРЕТЕНИЕ ЗАМЕНЯЮЩИХ ТОВАРОВ
.\" ИЛИ УСЛУГ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ВОЗНИКШИЕ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРНЫХ ОБЯЗАТЕЛЬСТВАХ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ В ДЕЛИКТЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНОЕ) ВОЗНИКШИЕ В ЛЮБОМ СЛУЧАЕ
.\" В СЛЕДСТВИЕ ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.
.\" SUCH DAMAGE.
.\"
.\" $Id$
.\"
.Dd 27 августа 1997 года
.Dt HPROPD 8
.Os HEIMDAL
.Sh ИМЯ
.Nm hpropd
.Nd принимать распространяемую базу данных
.Sh СИНТАКСИС
.Nm
.Bk -words
.Oo Fl d Ar файл \*(Ba Xo
.Fl Fl database= Ns Ar файл
.Xc
.Oc
.Op Fl n | Fl Fl stdin
.Op Fl Fl print
.Op Fl i | Fl Fl no-inetd
.Oo Fl k Ar keytab \*(Ba Xo
.Fl Fl keytab= Ns Ar keytab
.Xc
.Oc
.Op Fl 4 | Fl Fl v4dump
.Ek
.Sh ОПИСАНИЕ
.Nm
принимает базу данных, отправленную
.Nm hprop .
и записывает ее как локальную базу данных.
.Pp
По умолчанию,
.Nm
ожидает запуска от
.Nm inetd
если stdin является сокетом и ожидает получения дампа базы данных через
stdin в противном случае.
Если база данных передается по сети, она аутентифицируется и
шифруется.
Принимаются только соединения, аутентифицированные с помощью принципала
.Nm kadmin Ns / Ns Nm hprop
.Pp
Поддерживаемые опции:
.Bl -tag -width Ds
.It Fl d Ar файл , Fl Fl database= Ns Ar файл
база данных
.It Fl n , Fl Fl stdin
читать из stdin
.It Fl Fl print
печатать дамп в stdout
.It Fl i , Fl Fl no-inetd
не запускаться от inetd
.It Fl k Ar keytab , Fl Fl keytab= Ns Ar keytab
keytab для использования при аутентификации
.It Fl 4 , Fl Fl v4dump
создать базу данных типа v4
.El
.Sh СМОТРИ ТАКЖЕ
.Xr hprop 8