melkorbsd/ru-freebsd-man/man8/hv_kvp_daemon.8
.\" Авторское право (c) 2014 корпорация Майкрософт.
.\" Все права защищены.
.\"
.\" Распространение и использование в исходном и двоичном виде, с изменениями или без них,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Распространение исходного кода должно сохранять вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от гарантий.
.\" 2. Распространение в двоичной форме должно воспроизводить вышеуказанное уведомление об авторском праве,
.\"    этот список условий и следующее отказ от гарантий в
.\"    документации и/или других материалах, прилагаемых к распространению.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ВСЯКИЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ
.\" ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ,
.\" ОТКЛЮЧАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ПРИМЕРНЫЙ ИЛИ ПОСЛЕДОВАТЕЛЬНЫЙ УЩЕРБ
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАТРАТЫ НА ЗАМЕНУ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРИ
.\" ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ВЫЗВАННЫЙ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ,
.\" СТРОГОЙ ОТВЕТСТВЕННОСТИ, ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЙ В ЛЮБОМ СЛУЧАЕ
.\" ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНИЕ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.\" $FreeBSD$
.Dd 27 октября 2014 года
.Dt HV_KVP_DAEMON 8
.Os
.Sh ИМЯ
.Nm hv_kvp_daemon
.Nd Демон пар ключ-значение Hyper-V
.Sh СИНТАКСИС
.Nm
.Op Fl dn
.Sh ОПИСАНИЕ
Демон
.Nm
обеспечивает возможность хранения, извлечения, изменения и удаления 

(Продолжение следует...)Ключевые пары для
.Fx
гостевых разделов, работающих на Hyper-V.
.Pp
Hyper-V позволяет администраторам хранить пользовательские метаданные в виде
ключевых пар внутри
.Fx
гостевого раздела.
Администраторы могут
использовать скрипты Windows Powershell для добавления, чтения, изменения и удаления таких
ключевых пар.
.Pp
Демон
.Nm
принимает запросы на управление ключевыми парами от
.Xr hv_utils 4
драйвера и выполняет фактическое управление метаданными в файловой системе.
.Pp
Та же комбинация демона и драйвера также используется для установки и получения
IP-адресов от
.Fx
гостя.
.Pp
Функционал установки особенно
полезен, когда
.Fx
гостевой раздел назначен статический IP-адрес и он переведен
с одного хоста Hyper-V на другой.
После переноса, Hyper-V использует функционал установки IP
для автоматического
обновления IP-адреса
.Fx
гостя до его первоначального статического значения.
.Pp
С другой стороны, функционал получения IP используется для обновления гостевого IP-адреса
в окне консоли управления Hyper-V.
.Pp
Опции следующие:
.Bl -tag -width indent
.It Fl d
Запускать как обычный процесс вместо демона для отладки.
.It Fl n
Генерировать вывод отладки.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr hv_vmbus 4 ,
.Xr hv_utils 4 ,
.Xr hv_netvsc 4 ,
.Xr hv_storvsc 4 ,
.Xr hv_ata_pci_disengage 4 ,
.Xr hv_kvp 4
.Sh ИСТОРИЯ
Поддержка Hyper-V в виде портов была впервые выпущена в сентябре 2013 года.
Демон был разработан совместными усилиями Citrix Inc.,
Microsoft Corp. и Network Appliance Inc..
.Sh АВТОРЫ
.An -nosplit
Поддержка
.Fx
для
.Nm
была впервые добавлена командой Microsoft BSD Integration Services Aq Mt bsdic@microsoft.com .