melkorbsd/ru-freebsd-man/man8/hv_vss_daemon.8
.\" Copyright (c) 2016 Microsoft Corp.
.\" Все права защищены.
.\"
.\" Распространение и использование в исходном и двоичном виде, с изменениями или без них,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределения в двоичной форме должны воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, распространяемых в комплекте.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРАМИ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ
.\" ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ, ОТКЛОНЯЮТСЯ. НИ В КОЕМ СЛУЧАЕ АВТОРЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ
.\" ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ЭКЗЕМПЛЯРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕМ ЗАМЕНЯЕМЫХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЕЙ
.\" ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕМ БИЗНЕСА)
.\" ТЕМ НЕ МЕНЕЕ ВЫЗВАННЫЕ И КАКИМ ЛИБО ОБРАЗОМ СВЯЗАННЫЕ С ЛЮБОЙ ТЕОРИЕЙ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЕ В ЛЮБОМ СЛУЧАЕ
.\" В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.\" $FreeBSD$
.Dd 12 октября 2016 года
.Dt HV_VSS_DAEMON 8
.Os
.Sh НАЗВАНИЕ
.Nm hv_vss_daemon
.Nd Hyper-V Volume Shadow Copy Service Daemon
.Sh СИНТАКСИС
.Nm
.Op Fl dn
.Sh ОПИСАНИЕ
Демон
.Nm
обеспечивает возможность замораживания и размораживания файловой системы для
.Fx
гостевые разделы, работающие на Hyper-V.
.Pp
Hyper-V позволяет администраторам выполнять резервное копирование или восстановление
.Fx
гостевого раздела.
Администраторы могут
использовать скрипты Windows Powershell для резервного копирования или восстановления
.Fx
VM.
.Pp
The
.Nm
принимает запросы на заморозку и разморозку файловой системы от
.Xr hv_utils 4
драйвера и выполняет фактическую операцию с файловой системой.
.Pp
Функциональность заморозки и разморозки файловой системы полезна, когда хост Hyper-V хочет выполнить живое резервное копирование
.Fx
гостя. Хост Hyper-V отправляет запрос на заморозку файловой системы к
.Nm
который проводит реальную операцию. После успешной заморозки файловой системы хост Hyper-V создает снимок VM. В будущем,
хост Hyper-V может восстановить
.Fx
VM через этот снимок.
.Pp
Варианты следующие:
.Bl -tag -width indent
.It Fl d
Запускать как обычный процесс вместо демона для отладки.
.It Fl n
Генерировать отладочный вывод.
.El
.Sh СМОТРИ ТАКЖЕ
.Xr hv_vmbus 4 ,
.Xr hv_utils 4 ,
.Xr hv_netvsc 4 ,
.Xr hv_storvsc 4 ,
.Xr hv_kvp 4
.Sh ИСТОРИЯ
Демон был представлен в октябре 2016 года и разработан корпорацией Microsoft.
.Sh АВТОРЫ
.An -nosplit
.Fx
поддержка для
.Nm
впервые была добавлена
.An командой Microsoft BSD Integration Services Aq Mt bsdic@microsoft.com.