melkorbsd/ru-freebsd-man/man8/i2c.8
.\"
.\" Авторское право (C) 2008-2009 Semihalf, Михал Хайдук и Бартломей Сика
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходных и бинарных формах, с изменениями или без них,
.\" разрешается при соблюдении следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределения в бинарной форме должны воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в документации
.\"    и/или других материалах, предоставляемых с распространением.
.\"
.\" ЭТО ПО программное обеспечение ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ "КАК ЕСТЬ" И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ
.\" КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ ОТКЛОНЯЮТСЯ. АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ
.\" ОТВЕТСТВЕННОСТИ ЗА КАКОЙ-ЛИБО ПРЯМОЙ, НЕПРЯМОЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ЭКЗЕМПЛЯРНЫЙ ИЛИ КОСВЕННЫЙ УЩЕРБ
.\" (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПО ЗАМЕЩЕНИЕ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ
.\" ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ ДЕЯТЕЛЬНОСТИ БИЗНЕСА) В ЛЮБОМ СЛУЧАЕ ИЗ-ЗА ИСПОЛЬЗОВАНИЯ
.\" ЭТОГО ПО, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd 22 мая 2019 года
.Dt I2C 8
.Os
.Sh НАИМЕНОВАНИЕ
.Nm i2c
.Nd тестирование шины I2C и подчинённых устройств
.Sh СИНТАКСИС
.Nm
.Cm -а Ar адрес
.Op Fl f Ar устройство
.Op Fl d Ar r|w
.Op Fl w Ar 0|8|16|16LE|16BE
.Op Fl o Ar смещение.Op Fl c Ar количество
.Op Fl m Ar tr|ss|rs|no
.Op Fl b
.Op Fl v
.Nm
.Cm -h
.Nm
.Cm -i
.Op Fl v
.Op Ar команда ...
.Op Ar -
.Nm
.Cm -r
.Op Fl f Ar устройство
.Op Fl v
.Nm
.Cm -s
.Op Fl f Ar устройство
.Op Fl n Ar skip_addr
.Op Fl v
.Sh ОПИСАНИЕ
Утилита 
.Nm
может быть использована для выполнения передачи необработанных данных (чтение или запись) устройствам
на шине I2C.
Также она может сканировать шину на предмет доступных устройств и сбросить контроллер I2C.
.Pp
Опции следующие:
.Bl -tag -width ".Fl d Ar направление"
.It Fl a Ar адрес
7-битный адрес на устройстве I2C, с которым производится работа (в шестнадцатеричной системе).
.It Fl b
бинарный режим - при выполнении операции чтения, данные, считанные с устройства,
выводятся в бинарном формате на стандартный вывод.
.It Fl c Ar количество
количество байт для передачи (в десятичной системе).
.It Fl d Ar r|w
направление передачи: r - чтение, w - запись.
Данные для записи считываются со стандартного ввода как бинарные байты.
.It Fl f Ar устройство
Использовать шину I2C (по умолчанию /dev/iic0).
.It Fl i
Интерпретируемый режим
.It Fl h
Помощь
.It Fl m Ar tr|ss|rs|no
режим адресации, то есть операции шины I2C, выполняемые после того, как смещение для
передачи записано в устройство и до фактической операции чтения/записи.
.Bl -tag -compact -offset indent
.It Va tr
полная передача
.It Va ss
остановка затем старт
.It Va rs
повторный старт
.It Va no
нет
.El
Некоторое оборудование шины I2C не предоставляет контроля над отдельными операциями старт,
повторный старт и стоп.
Такое оборудование может выполнять только полную передачу смещения и данных
как единую операцию.
Режим 
.Va tr 
создает структуры управления, описывающие передачу и подает их
драйверу как единую полную транзакцию.
Этот режим работает со всеми типами оборудования I2C..It Fl n Ar skip_addr
адреса, которые следует пропустить во время сканирования шины.
Один или несколько адресов ([0x]xx) или диапазонов адресов
([0x]xx-[0x]xx или [0x]xx..[0x]xx), разделённые запятыми или двоеточиями.
.It Fl o Ar offset
смещение в устройстве для передачи данных (шестнадцатеричное).
По умолчанию равно нулю.
Использовать
.Dq -w 0
чтобы отключить запись смещения в подчинённое устройство.
.It Fl r
сбросить контроллер.
.It Fl s
сканировать шину на наличие устройств.
.It Fl v
подробный вывод.
.It Fl w Ar 0|8|16|16LE|16BE
ширина смещения устройства (в битах).
Используется для определения способа передачи
.Ar offset
указанного с
.Fl o
в подчинённое устройство.
Ноль означает, что смещение игнорируется и в подчинённое устройство не передаётся вовсе.
По умолчанию используется порядок байтов от младшего к старшему.
.El
.Sh РЕЖИМ ИНТЕРПРЕТАЦИИ
При запуске с
.Fl i
любые оставшиеся аргументы интерпретируются как команды, и
если последний аргумент '-', или аргументов нет,
команды будут (также) считываться со стандартного ввода.
.Pp
Доступные команды:
.Bl -tag -compact
.It 'r' bus address [0|8|16|16LE|16BE] offset count
Команда чтения, считывает указанное количество байт и выводит их в шестнадцатеричном виде на стандартный вывод.
.It 'w' bus address [0|8|16|16LE|16BE] offset hexstring
Команда записи, hexstring (разрешены пробелы) записывается в устройство.
.It 'p' anything
Команда печати, вся строка печатается на стандартный вывод. (Может использоваться
для синхронизации.)
.El
.Pp
Все числовые поля принимают каноническую десятичную/восьмеричную/шестнадцатеричную нотацию.
.Pp
Без опции
.Fl v
все ошибки считаются критическими с ненулевым статусом завершения.
.Pp
С опцией
.Fl v
ошибки не считаются критическими, и все команды будут возвращать
либо "OK\en", либо "ERROR\en" на стандартном выводе.
В случае ошибки, подробная диагностика будет предшествовать этому на стандартном потоке ошибок..Pp
Пустые строки и строки, начинающиеся с '#', игнорируются.
.Sh ПРИМЕРЫ
.Bl -bullet
.It
Сканирование стандартной шины (/dev/iic0) на наличие устройств:
.Pp
i2c -s
.It
Сканирование стандартной шины (/dev/iic0) на наличие устройств и пропуск адресов
0x45 до 0x47 (включительно) и 0x56.
.Pp
i2c -s -n 0x56,45-47
.It
Чтение 8 байт данных с устройства по адресу 0x56 (например, EEPROM):
.Pp
i2c -a 0x56 -d r -c 8
.It
Запись 16 байт данных из файла data.bin на устройство 0x56 смещением 0x10:
.Pp
i2c -a 0x56 -d w -c 16 -o 0x10 -b < data.bin
.It
Копирование 4 байт между двумя EEPROM (0x56 на /dev/iic1 до 0x57 на /dev/iic0):
.Pp
i2c -a 0x56 -f /dev/iic1 -d r -c 0x4 -b | i2c -a 0x57 -f /dev/iic0 -d w -c 4 -b
.It
Сброс контроллера:
.Pp
i2c -f /dev/iic1 -r
.It
Чтение 8 байт по адресу 24 в EEPROM:
.Pp
i2c -i 'r 0 0x50 16BE 24 8'
.It
Чтение 2x8 байт по адресам 24 и 48 в EEPROM:
.Pp
echo 'r 0 0x50 16BE 48 8' | i2c -i 'r 0 0x50 16BE 24 8' -
.El
.Sh ВНИМАНИЕ
Многие системы хранят критически важную низкоуровневую информацию в памяти I2C, и
могут содержать другие устройства I2C, такие как датчики температуры или напряжения.
Чтение таких данных может нарушить работу прошивки, а запись может "вывести из строя" оборудование.
.Sh СМ. ТАКЖЕ
.Xr iic 4 ,
.Xr iicbus 4
.Xr smbus 4
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 8.0 .
.Sh АВТОРЫ
.An -nosplit
Утилиту
.Nm
и эту страницу руководства написали
.An Bartlomiej Sieka Aq Mt tur@semihalf.com
и
.An Michal Hajduk Aq Mt mih@semihalf.com .
.Pp
.An Poul-Henning Kamp Aq Mt phk@FreeBSD.org
добавил интерпретируемый режим.