melkorbsd/ru-freebsd-man/man8/iasl.8
.\"
.\" Copyright (c) 2003 Nate Lawson
.\" Все права защищены.
.\"
.\" Распространение и использование в исходных и двоичных формах, с изменениями или без них,
.\" разрешается при условии соблюдения следующих условий:
.\" 1. Распространяемый исходный код должен сохранять указанное выше уведомление об авторских правах,
.\"    этот список условий и следующее отказ от гарантий
.\"    в этой позиции и без изменений.
.\" 2. Распространения в двоичной форме должны воспроизводить указанное выше уведомление об авторских правах,
.\"    этот список условий и следующее отказ от гарантий в документации
.\"    и/или других материалах, предоставляемых с распространением.
.\" 3. Имя автора не может быть использовано для поддержки или продвижения продуктов,
.\"    производных от этого программного обеспечения без конкретного предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ ``КАК ЕСТЬ'' И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ,
.\" ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ
.\" ДЛЯ КОНКРЕТНОЙ ЦЕЛИ ОТКЛЮЧАЮТСЯ.
.\" НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ,
.\" СЛУЧАЙНЫЙ, ОСОБЫЙ, ЭКЗЕМПЛЯРНЫЙ ИЛИ КОСВЕННЫЙ УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАМЕЩЕНИЕМ ТОВАРОВ ИЛИ УСЛУГ;
.\" ПОТЕРЕЙ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕМ ДЕЛОВОЙ АКТИВНОСТИ) ТЕМ НЕ МЕНЕЕ ВЫЗВАННОГО И ПО
.\" ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ
.\" (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКШЕГО В ЛЮБОМ СЛУЧАЕ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ
.\" ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd 20 мая 2008 года
.Dt IASL 8
.Os
.Sh НАЗВАНИЕ
.Nm iasl
.Nd Компилятор/декомпилятор Intel ACPI
.Sh СИНТАКСИС
.Nm
.Op Fl 2cefghl
.Op Fl b Ar тип
.Op Fl d Ar файл
.Op Fl dc Ar файл
.Op Fl hc
.Op Fl hr
.Op Fl i Ar тип
.Op Fl ln
.Op Fl ls
.Op Fl oa
.Op Fl of
.Op Fl oi
.Op Fl on
.Op Fl ot
.Op Fl p Ar префикс
.Op Fl s Ar тип
.Op Fl t Ar тип
.Op Fl vi
.Op Fl vo
.Op Fl vr
.Op Fl vs
.Op Fl x Ar уровень
.Op Fl w Ar уровень
.Ar входной-файл
.Sh ОПИСАНИЕ
Программа
.Nm
— это компилятор/декомпилятор для ACPI Исходного Языка (ASL)
и ACPI Машинного Языка (AML).
Основные возможности
.Nm
включают:
.Bl -bullet -offset indent
.It
Полная поддержка спецификации ACPI 3.0b, включая элементы грамматики ASL
и операторы.
.It
Обширная проверка синтаксиса и семантики компилятора, особенно в
области методов управления.
Это снижает количество ошибок, которые
обнаруживаются не до того, как код AML фактически интерпретируется (то есть
проверка ошибок на этапе компиляции сокращает количество ошибок выполнения).
.It
Множество типов выходных файлов, включая отформатированные файлы листингов с
перемешанным исходным кодом, несколько типов файлов AML и сообщения об ошибках.
.El
.Sh ОПЦИИ
.Bl -tag -width indent
.It Fl 2
Генерировать совместимый с ACPI 2.0 код ASL.
.It Fl b Sm Cm p | t | b Sm
Создать файл отладки/трассировки компилятора
.Pq Pa *.txt .
Типы: Парсинг/Дерево/Оба.
.It Fl c
Только парсинг, без создания выходного файла.
.It Fl d Ar файл
Декомпилировать AML в исходный код ASL
.Pq Pa *.dsl .
.It Fl dc Ar файл
Декомпилировать AML и немедленно скомпилировать его.
(Получать DSDT из текущей системы, если нет входного файла.)
.It Fl e
Генерировать
.Fn Внешние
указания для неразрешенных символов.
.It Fl f
Игнорировать ошибки, принудительно создавать файл(ы) AML.
.It Fl g
Получать таблицы ACPI и записывать в файлы

.Pq Pa *.dat .
.It Fl h
Дополнительная помощь и опции отладки компилятора.
.It Fl hc
Показывает операторы, разрешенные в константных выражениях.
.It Fl hr
Показывает зарезервированные методы имена ACPI.
.It Fl i Sm Cm a | c Sm
Создание файла ассемблера или файла включения C
.Pa ( *.inc
или
.Pa *.h ) .
.It Fl l
Создание смешанного файла листинга (исходный код ASL и AML)
.Pq Pa *.lst .
.It Fl ln
Создание файла пространства имен
.Pq Pa *.nsp .
.It Fl ls
Создание объединенного исходного файла (расширенные включения)
.Pq Pa *.src .
.It Fl oa
Отключение всех оптимизаций (режим совместимости).
.It Fl of
Отключение сворачивания констант.
.It Fl oi
Отключение оптимизации целых чисел в Ноль/Один/Единицы.
.It Fl on
Отключение оптимизации строковых ссылок по имени.
.It Fl ot
Показ времени компиляции.
.It Fl p Ar prefix
Определение префикса имени файла для всех выходных файлов (включая
.Pa .aml ) .
.It Fl s Sm Cm a | c Sm
Создание AML в файле исходного кода ассемблера или C
.Pa ( *.asm
или
.Pa *.c ) .
.It Fl t Ar a|c
Создание AML в таблице шестнадцатеричных кодов ассемблера или C
.Pq Pa *.hex .
.It Fl vi
Менее подробные ошибки и предупреждения для использования с IDE.
.It Fl vo
Включение комментариев оптимизации.
.It Fl vr
Отключение замечаний.
.It Fl vs
Отключение приветствия.
.It Fl x Ar level
Установка уровня отладки для трассировки вывода.
.It Fl w Ar level
Установка уровня предупреждений.
.El
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr acpidump 8
.Sh HISTORY
Утилита
.Nm
поставляется вместе с Intel ACPI-CA.
Впервые появилась в
.Fx 5.2 .
.Sh AUTHORS
.An -nosplit
Утилиту
.Nm
написал
.An Intel .
Эту страницу руководства написал
.An Nate Lawson .