melkorbsd/ru-freebsd-man/man8/ifconfig.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Распространение и использование в виде исходного кода и бинарных форм, с или без
.\" изменений, разрешается при соблюдении следующих условий:
.\" 1. При повторном распространении исходного кода необходимо сохранять вышеуказанные авторские права,
.\"    список условий и следующий отказ от ответственности.
.\" 2. При распространении в двоичной форме необходимо воспроизводить вышеуказанные авторские права,
.\"    список условий и следующий отказ от ответственности в
.\"    документации и/или других материалах, прилагаемых к дистрибутиву.
.\" 3. Ни название университета, ни имена его сотрудников,
.\"    не могут использоваться для одобрения или продвижения продуктов, созданных на основе этого программного обеспечения,
.\"    без специального предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ РЕГЕНТАМИ И УЧАСТНИКАМИ  ``AS IS'' И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ,
.\" ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ ТОВАРНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ
.\" НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ РЕГЕНТЫ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ ИЛИ ТИПОВЫЕ
.\" УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯ, ЗАКУПКУ ЗАМЕНЯЮЩИХ ТОВАРОВ
.\" ИЛИ УСЛУГ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ БИЗНЕСА),
.\" В ЛЮБОМ СЛУЧАЕ И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО ДОГОВОР, СТРОГАЯ 
.\" ОТВЕТСТВЕННОСТЬ ИЛИ ПРАВОНАРУШЕНИЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ДРУГИЕ ОБРАЗЫ), ВОЗНИКАЮЩИЕ ЛЮБЫМ СПОСОБОМ
.\" ЛЮБЫМ СПОСОБОМ ИСПОЛЬЗОВАНИЯ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ УВЕДОМЛЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.\"     From: @(#)ifconfig.8	8.3 (Berkeley) 1/5/94
.\"
.Dd June 20, 2023
.Dt IFCONFIG 8
.Os
.Sh ИМЯ
.Nm ifconfig
.Nd configure network interface parameters
.Sh СИНОПСИС
.Nm
.Op Fl j Ar jail
.Op Fl kLmn
.Op Fl f Ar type Ns Cm \&: Ns Ar format
.Ar interface
.Op Cm create
.Oo
.Ar address_family
.Oo
.Ar address
.Op Ar dest_address
.Oc
.Oc
.Op Ar parameters
.Nm
.Op Fl j Ar jail
.Ar interface
.Cm destroy
.Nm
.Op Fl j Ar jail
.Fl a
.Op Fl dkLmuv
.Op Fl f Ar type Ns Cm \&: Ns Ar format
.Op Fl G Ar groupname
.Op Fl g Ar groupname
.Op Ar address_family
.Nm
.Fl C
.Nm
.Op Fl j Ar jail
.Fl g Ar groupname
.Nm
.Op Fl j Ar jail
.Fl l
.Op Fl du
.Op Fl g Ar groupname
.Op Ar address_family
.Nm
.Op Fl j Ar jail
.Op Fl dkLmuv
.Op Fl f Ar type Ns Cm \&: Ns Ar format
.Sh ОПИСАНИЕ
.Nm
Утилита используется для назначения адреса
к сетевому интерфейсу и/или настройки
параметров сетевого интерфейса.
.Nm
Утилита должна использоваться во время загрузки для определения сетевого адреса
каждого интерфейса, присутствующего на машине; его также можно использовать
позднее, чтобы переопределить адрес интерфейса
или другие рабочие параметры.
.Pp
Доступны следующие варианты:
.Bl -tag -width indent
.It Fl a
Отображение информации обо всех интерфейсах в системе.
.Pp
.Fl a
вместо флага можно использовать
.Ar interface
аргумент.
.It Fl C
Перечисление всех клонеров интерфейса, доступных в системе,
без дополнительной информации.
Использование этого флага является взаимоисключающим со всеми другими флагами и командами.
.It Fl d
Отображение только тех интерфейсов, которые не работают.
.It Fl f Xo
.Ar type Ns Cm \&: Ns Ar format Ns
.Op Cm \&, Ns Ar type Ns Cm \&: Ns Ar format Ar ...
.Xc
Управление выходным форматом
.Nm .
Формат указывается как список разделенных запятыми
.Ar type Ns Cm \&: Ns Ar format
pairs
.Po see the
.Sx ПРИМЕРЫ
раздел для получения дополнительной информации
.Pc .
.Pp
Выходной формат также можно указать с помощью
.Ev IFCONFIG_FORMAT
переменной среды.
.Fl f
флаг можно указывать несколько раз.
.Pp
.Ar type Ns s
и связанные с ними
.Ar format
строки:
.Pp
.Bl -tag -width ether
.It Cm addr
Настройка отображения адресов inet и inet6:
.Pp
.Bl -tag -width default -compact
.It Cm default
Формат по умолчанию,
.Cm numeric
.It Cm fqdn
Полные доменные имена
.Pq FQDN
.It Cm host
Неполные имена хостов
.It Cm numeric
Числовой формат
.El
.It Cm ether
Настройка отображения адресов Ethernet (MAC) на уровне канала:
.Pp
.Bl -tag -width default -compact
.It Cm colon
Разделение сегментов адреса с двоеточием
.It Cm dash
Разделение сегментов адреса с тире
.It Cm dotted
Обозначение через точку, например:
.Ql 5254.0015.4a3b
.It Cm default
Формат по умолчанию,
.Cm colon
.El
.It Cm inet
Настройка отображения масок подсети inet-адресов:
.Pp
.Bl -tag -width default -compact
.It Cm cidr
Обозначение CIDR, например:
.Ql 203.0.113.224/26
.It Cm default
Формат по умолчанию,
.Cm hex
.It Cm dotted
Квадратное обозначение с точками, например:
.Ql 255.255.255.192
.It Cm hex
Шестнадцатеричный формат, пример:
.Ql 0xffffffc0
.El
.It Cm inet6
Настройка отображения префиксов адресов inet6 (масок подсети):
.Pp
.Bl -tag -width default -compact
.It Cm cidr
Обозначение CIDR, пример:
.Ql ::1/128
или
.Ql fe80::1%lo0/64
.It Cm default
Формат по умолчанию,
.Cm numeric
.It Cm numeric
Целочисленный формат, пример:
.Ql prefixlen 64
.El
.El
.It Fl G Ar groupname
Исключение членов указанных
.Ar groupname
из вывода.
.Ar groupname .
.Pp
Только один вариант
.Fl G
следует указать как более поздние, предыдущие
.Ar groupname
могут содержать шаблоны оболочки, и в этом случае его следует заключить в кавычки.
.Pp
Параметр
.Ar groupname
к
.Cm all
выбору всех интерфейсов
.It Fl g Ar groupname
Ограничить вывод членами указанного
.Ar groupname .
.Pp
Если
.Fl g
указывается перед другими важными флагами, например,
.Fl a ,
.Fl l ,
или
.Fl C ,
затем
.Nm
перечисляет имена интерфейсов.
.Ar groupname .
Любые другие флаги и аргументы в этом случае игнорируются.
.Pp
Только один вариант
.Fl g
следует указать как более поздние, предыдущие
.Ar groupname
могут содержать шаблоны оболочки, и в этом случае его следует заключить в кавычки.
.Pp
Параметр
.Ar groupname
К
.Cm all
выбирает все интерфейсы.
.It Fl j Ar jail
Выполните действия внутри
.Ar jail .
.Pp
.Cm ifconfig
сначала прикрепится к
.Ar jail
(по идентификатору или названию тюрьмы) перед выполнением эффектов.
.Pp
Это позволяет сетевым интерфейсам
.Ar jail
необходимую настройку, даже если
.Cm ifconfig
двоичный файл недоступен в
.Ar jail .
.It Fl k
Распечайте ключевую информацию для
.Ar interface ,
если это доступно.
.Pp
Например, значения ключей 802.11 WEP и
.Xr carp 4
парольные фразы будут напечатаны, если они доступны текущему пользователю.
.Pp
Эта информация не выводится по умолчанию, так как ее можно считать
чувствительный.
.It Fl L
Отображение времени жизни адреса для адресов IPv6 в виде строки смещения времени.
.It Fl l
Перечислите все доступные интерфейсы в системе,
без какой-либо другой дополнительной информации.
.Pp
Если
.Ar address_family
указан, будут перечислены только интерфейсы этого типа.
.Pp
Если
.Ar address_family
установлен на
.Cm ether ,
то он
.Fl l
исключит интерфейсы обратной связи из списка интерфейсов Ethernet.
Это особый случай, поскольку все остальные синонимы
.Cm link
Семейство адресов будет входить в список интерфейсов обратной связи.
.Pp
Использование этого флага является взаимоисключающим.
со всеми остальными флагами и командами, кроме
.Fl d ,
.Fl g ,
и
.Fl u .
.It Fl m
Отобразите список возможностей и всех
поддерживаемых носителей для указанного интерфейса.
.It Fl n
Отключите автоматическую загрузку драйверов сетевого интерфейса.
.Pp
По умолчанию, если драйвер сетевого интерфейса отсутствует в ядре
Затем
.Nm
попытйтесь загрузить его.
.It Fl u
Отображайте только те интерфейсы, которые работают.
.It Fl v
Получите более подробный статус для интерфейса.
.It Ar address
Для семьи Интернет,
адрес является либо именем хоста, присутствующим в данных имени хоста
базы,
.Xr hosts 5 ,
или адрес IPv4, выраженный в стандарте Интернета.
.Dq dot notation .
.Pp
Также возможно использовать нотацию CIDR (также известную как
обозначение косой черты), чтобы включить сетевую маску.
То есть можно указать адрес как
.Li 192.168.0.1/16 .
.Pp
для
.Cm inet6
семейства, длину префикса также можно указать с помощью косой черты
обозначение, как
.Li ::1/128 .
смотрите
.Cm prefixlen
параметр ниже для получения дополнительной информации.
.Pp
Канальный уровень
.Pq Cm link
адрес
указывается как серия шестнадцатеричных цифр, разделенных двоеточиями.
Это можно использовать, например, для
установки нового MAC-адреса на интерфейсе Ethernet, хотя
используемый механизм не является специфичным для Ethernet.
.Pp
Используйте
.Cm random
ключевое слово для установки случайно сгенерированного MAC-адреса.
Случайно сгенерированный MAC-адрес может совпадать с уже используемым.
в сети.
Такое совпадение крайне маловероятно.
.Pp
Если интерфейс уже
включается при изменении адреса канального уровня,
он будет ненадолго сбит и
затем снова вернется, чтобы гарантировать получение
Фильтра в базовом оборудовании Ethernet при правильном перепрограммировании.
.It Ar address_family
Указание
адреса семьи
влияет на интерпретацию остальных параметров.
Поскольку интерфейс может принимать передачи по разным протоколам
при различных схемах именования рекомендуется указывать семейство адресов.
Семейства адресов или протоколов в настоящее время
поддерживаются:
.Bl -tag
.It Cm ether
Синоним с
.Cm link
.Po with some exceptions, see
.Fl l
.Pc .
.It Cm inet
По умолчанию, если доступно.
.It Cm inet6
.It Cm link
По умолчанию, если
.Cm inet
не доступен.
.It Cm lladdr
Синоним с
.Cm link .
.El
.It Ar dest_address
Указание адреса корреспондента на другом конце
связи «точка-точка».
.It Ar interface
Этот
параметр представляет собой строку вида
.Dq name unit ,
например,
.Dq Li em0 .
.El
.Pp
.Nm
утилита отображает текущую конфигурацию сетевого интерфейса
когда не указаны дополнительные параметры.
Если указано семейство протоколов,
.Nm
сообщит только подробности, относящиеся к этому семейству протоколов.
.Pp
Когда аргументы не приведены,
.Fl a
подразумевается.
.Pp
Только суперпользователь может изменять конфигурацию сетевого интерфейса.
.Sh Параметры
Следующий
.Ar parameter Ns s
может быть установлен с помощью
.Nm :
.Bl -tag -width indent
.It Cm add
Другое название для
.Cm alias
Параметра.
Введено для совместимости
С
.Bsx .
.It Cm alias
Установка дополнительного сетевого адреса для этого интерфейса.
Иногда полезна при изменении номеров сети, и когда
пользователь хочет принимать пакеты, адресованные старому интерфейсу.
Если адрес находится в той же подсети, что и первый сетевой адрес
для этого интерфейса должна быть задана неконфликтующая сетевая маска.
Обычно
.Li 0xffffffff
является наиболее подходящим.
.It Fl alias
Удаление указанного сетевого адреса.
Будет использоваться, если вы неправильно указали псевдоним или в не
больше не было необходимости.
Если вы неправильно установили адрес NS, имеющий побочный эффект
указания части хоста, удаление всех адресов NS будет
позволять вам переопределить часть хоста.
.It Cm anycast
(Inet6 only.)
Укажите, что настроенный адрес является адресом произвольной рассылки.
Согласно действующей спецификации,
только маршрутизаторы могут настраивать произвольные адреса.
Адрес Anycast не будет использоваться в качестве адреса источника любого из исходящих сообщений.
IPv6-пакеты.
.It Cm arp
Включение использования протокола разрешения адресов
.Pq Xr arp 4
в картографии
между адресами сетевого уровня и адресами канального уровня (по умолчанию).
В настоящее время это реализовано для сопоставления адресов интернет-протокола.
и 48-битные MAC-адреса IEEE 802 (адреса Ethernet).
.It Fl arp
Отключение использования протокола разрешения адресов
.Pq Xr arp 4 .
.It Cm staticarp
Если протокол разрешения адресов включен,
хост будет отвечать только на запросы своих адресов,
и никогда не будет отправлять никаких запросов.
.It Fl staticarp
Если протокол разрешения адресов включен,
хост будет работать нормально,
отправка запросов и прослушивание ответов.
.It Cm stickyarp
Включените для интерфейса так называемого режима липкого ARP.
Если эта опция включена на данном интерфейсе, любой разрешенный адрес
помечен как статический и не имеет срока действия. Это можно использовать для увеличения
безопасности сети за счет предотвращения подмены ARP или уменьшения задержки для
высокопроизводительных сетей Ethernet, в которых время, необходимое для разрешения ARP,
слишком высоко. Обратите внимание, что аналогичная функция предусмотрена и для мостов.
.Sx Bridge Interface Parameters
section. Включение этой
опции может повлиять на методы, основанные на функции истечения срока действия/перезаписи ARP.
таких как балансировщики нагрузки или решение высокой доступности, такие как
.Xr carp 4 .
.It Fl stickyarp
Отключение для интерфейса так называемого режима липкого ARP (по умолчанию).
Срок действия разрешенных адресов истекает в обычном режиме с соблюдением ARP ядра.
конфигурации.
.It Cm broadcast
(Inet only.)
Указание адреса, который будет использоваться для представления широковещательных сообщений на
сеть.
Широковещательный адрес по умолчанию — это адрес, в котором часть хоста состоит из единиц.
.It Cm debug
Включение кода отладки, зависящего от драйвера; обычно это включает
дополнительная регистрация ошибок консоли.
.It Fl debug
Отключение кода отладки, зависящего от драйвера.
.It Cm promisc
Перевод интерфейса в постоянно неразборчивый режим.
.It Fl promisc
Отключите навсегда беспорядочный режим.
.It Cm delete
Другое название для
.Fl alias
параметра
.It Cm description Ar value , Cm descr Ar value
Указание описания интерфейса.
Это можно использовать для маркировки интерфейсов в ситуациях, когда их может быть будет трудно отличить.
.It Cm -description , Cm -descr
Очистите описание интерфейса.
.It Cm down
Отметьте интерфейс
.Dq down .
Когда интерфейс помечен
.Dq down ,
система не будет пытаться
передавать сообщения через этот интерфейс.
Если возможно, интерфейс будет сброшен, чтобы отключить прием. 
Это действие не отключает автоматически маршруты, использующие интерфейс.
.It Cm group Ar groupname
Назначение интерфейса
.Dq group .
.Ar groupname
не может быть длиннее 15 символов и не должно заканчиваться цифрой.
Любой интерфейс может находиться в нескольких группах.
.Pp
Клонированные интерфейсы по умолчанию являются членами своей группы семейства интерфейсов.
Например, интерфейс VLAN, такой как
.Em vlan10
является членом группы семейства интерфейсов VLAN,
.Em vlan .
.It Cm -group Ar groupname
Удаление интерфейса из данного
.Dq group .
.It Cm eui64
(Inet6 only.)
Заполнение индекса интерфейса
(самые младшие 64 бита адреса IPv6)
автоматически
.It Cm fib Ar fib_number
Указание интерфейса FIB.
FIB
.Ar fib_number
назначается всем кадрам или пакетам, полученным на этом интерфейсе.
FIB не наследуется, например, виртуальные локальные сети или другие субинтерфейсы будут использовать
FIB по умолчанию (0) независимо от FIB родительского интерфейса.
Ядро необходимо настроить для поддержки большего, чем FIB.
используя
.Va ROUTETABLES
параметр конфигурации ядра или
.Va net.fibs
настраиваемый.
.It Cm tunnelfib Ar fib_number
Указание туннеля FIB.
FIB
.Ar fib_number
назначается всем пакетам, инкапсулированным туннельным интерфейсом, например,
.Xr gif 4 ,
.Xr gre 4
и
.Xr vxlan 4 .
.It Cm maclabel Ar label
Если в ядре включена поддержка обязательного контроля доступа,
установите метку MAC на
.Ar label .
.\" (see
.\" .Xr maclabel 7 ) .
.It Cm media Ar type
Если драйвер поддерживает систему выбора носителя, установите тип носителя
интерфейса для
.Ar type .
Некоторые интерфейсы поддерживают взаимоисключающее использование одного из нескольких
различных разъемов физических носителей.
Например, Ethernet 10 Мбит/с.
интерфейс может поддерживать использование любого AUI
или разъемы витой пары.
Установка типа носителя на
.Cm 10base5/AUI
изменит текущий активный разъем на порт AUI.
Установка его на
.Cm 10baseT/UTP
активирует витую пару.
Обратитесь к драйверу интерфейсов
конкретной документации или справочной страницы с полным списком
доступных типов.
.It Cm mediaopt Ar opts
Если драйвер поддерживает систему выбора носителя, установите указанные
параметры мультимедиа в интерфейсе.
.Ar opts
Аргумент
— список параметров, разделенных запятыми, которые можно применить к интерфейсу.
Полную информацию см. на странице руководства по драйверам интерфейсов.
список доступных опций.
.It Fl mediaopt Ar opts
Если драйвер поддерживает систему выбора носителя, отключите
указанные параметры мультимедиа в интерфейсе.
.It Cm mode Ar mode
Если драйвер поддерживает систему выбора носителя, установите указанный
режим работы на интерфейсе
.Ar mode .
Для беспроводных интерфейсов IEEE 802.11, поддерживающих несколько режимов работы.
эта директива используется для выбора между 802.11a
.Pq Cm 11a ,
802.11b
.Pq Cm 11b ,
и 802.11g
.Pq Cm 11g
режимы работы.
.It Cm txrtlmt
Установка, если драйвер поддерживает ограничение скорости передачи.
.It Cm inst Ar minst , Cm instance Ar minst
Установите экземпляр носителя на
.Ar minst .
Это полезно для устройств, которые имеют несколько интерфейсов физического уровня.
.Pq PHYs .
.It Cm name Ar name
Установка имени интерфейса на
.Ar name .
.It Cm rxcsum , txcsum , rxcsum6 , txcsum6
Если драйвер поддерживает настраиваемую пользователем разгрузку контрольной суммы,
включите разгрузку контрольной суммы приема (или передачи) на интерфейсе.
Эту функцию можно включить выборочно для каждого семейства протоколов.
Используйте
.Cm rxcsum6 , txcsum6
для
.Xr ip6 4
или
.Cm rxcsum , txcsum
в противном случае.
Некоторые драйверы не смогут включить эти флаги независимо.
друг от друга, поэтому установка одного может также установить и другой.
Драйвер надежно разгрузит столько работы по контрольной сумме, сколько сможет.
поддержка, точный уровень разгрузки варьируется в зависимости от драйвера.
.It Fl rxcsum, txcsum, rxcsum6, txcsum6
Если драйвер поддерживает настраиваемую пользователем разгрузку контрольной суммы,
отключите разгрузку контрольной суммы приема (или передачи) на интерфейсе.
Эту функцию можно отключить выборочно для каждого семейства протоколов.
Используйте
.Fl rxcsum6 , txcsum6
для
.Xr ip6 4
или
.Fl rxcsum , txcsum
в противном случае.
Эти настройки не всегда могут быть независимыми друг от друга.
.It Cm tso
Если драйвер поддерживает
.Xr tcp 4
разгрузку сегментации, включите TSO на интерфейсе.
Некоторые драйверы могут не поддерживать TSO для
.Xr ip 4
и
.Xr ip6 4
пакеты, поэтому они могут включить только один из них.
.It Fl tso
Если драйвер поддерживает
.Xr tcp 4
разгрузку сегментации, отключите TSO на интерфейсе.
Он всегда будет отключать TSO для
.Xr ip 4
и
.Xr ip6 4 .
.It Cm tso6 , tso4
Если драйвер поддерживает
.Xr tcp 4
разгрузку сегментации для
.Xr ip6 4
или
.Xr ip 4
используйте один из них, чтобы выборочно включить его только для одного семейства протоколов.
.It Fl tso6 , tso4
Если драйвер поддерживает
.Xr tcp 4
разгрузку сегментации для
.Xr ip6 4
или
.Xr ip 4
используйте один из них, чтобы выборочно отключить его только для одного семейства протоколов.
.It Cm lro
Если драйвер поддерживает
.Xr tcp 4
большой прием разгрузки, включите LRO на интерфейсе.
.It Fl lro
Если драйвер поддерживает
.Xr tcp 4
большой прием разгрузки, отключите LRO на интерфейсе.
.It Cm txtls
Разгрузка TLS при передаче шифрует записи TLS и
сегментирует зашифрованную запись на одну или несколько
.Xr tcp 4
сегментов по 
.Xr ip 4
или
.Xr ip6 4 .
Если драйвер поддерживает разгрузку TLS при передаче,
включите разгрузку TLS при передаче на интерфейсе.
Некоторые драйверы могут не поддерживать разгрузку TLS при передаче для
.Xr ip 4
и
.Xr ip6 4
пакетов, поэтому они могут включить только один из них.
.It Fl txtls
Если драйвер поддерживает разгрузку TLS при передаче,
отключите разгрузку TLS при передаче на интерфейсе.
Он всегда будет отключать TLS для
.Xr ip 4
и
.Xr ip6 4 .
.It Cm txtlsrtlmt
Включение использования ограничения скорости (скорости передачи пакетов) для разгрузки TLS.
.It Fl txtlsrtlmt
Отключение использования ограничения скорости для разгрузки TLS.
.It Cm mextpg
Если драйвер поддерживает расширенные многостраничные
.Xr mbuf 9
буферы, включите их на интерфейсе.
.It Fl mextpg
Если драйвер поддерживает расширенные многостраничные
.Xr mbuf 9
буферы, отключите их на интерфейсе.
.It Cm wol , wol_ucast , wol_mcast , wol_magic
Включите поддержку Wake On Lan (WOL), если она доступна.
WOL — это средство, с помощью которого можно разбудить машину, находящуюся в состоянии низкого энергопотребления.
в ответ на полученный пакет.
Существует три типа пакетов, которые могут разбудить систему:
ucast (направленный исключительно на MAC-адрес машины),
mcast (направленный на широковещательный или многоадресный адрес),
или
magic
.Po unicast or multicast frames with a
.Dq magic contents
.Pc .
Не все устройства поддерживают WOL, те, которые поддерживают, указывают механизмы
поддержки в своих возможностях.
.Cm wol
является синонимом включения всех доступных механизмов WOL.
Чтобы отключить WOL, используйте
.Fl wol .
.It Cm vlanmtu , vlanhwtag , vlanhwfilter , vlanhwcsum , vlanhwtso
Если драйвер предлагает поддержку настраиваемой пользователем VLAN, включите
прием расширенных кадров, аппаратную обработку тегов,
аппаратную фильтрацию кадров, разгрузку контрольной суммы или TSO в VLAN,
соответственно.
Обратите внимание, что это необходимо настроить на физическом интерфейсе, связанном с
.Xr vlan 4 ,
не на
.Xr vlan 4
самом интерфейсе
.It Fl vlanmtu , vlanhwtag , vlanhwfilter , vlanhwcsum , vlanhwtso
Если драйвер предлагает поддержку настраиваемой пользователем VLAN, отключите
прием расширенных кадров, аппаратную обработку тегов,
аппаратную фильтрацию кадров, разгрузку контрольной суммы или TSO в VLAN,
соответственно.
.It Cm vxlanhwcsum , vxlanhwtso
Если драйвер предлагает настраиваемую пользователем поддержку VXLAN, включите внутреннюю контрольную сумму.
разгрузку (прием и передача) или TSO на VXLAN соответственно.
Обратите внимание, что это необходимо настроить на физическом интерфейсе, связанном с
.Xr vxlan 4 ,
не на
.Xr vxlan 4
самом интерфейсе.
Физический интерфейс — это либо интерфейс, указанный как vxlandev
или интерфейс, на котором размещен адрес vxlanlocal.
Драйвер надежно разгрузит столько работы по контрольной сумме и TSO, сколько сможет.
поддержка, точный уровень разгрузки может варьироваться в зависимости от драйвера.
.It Fl vxlanhwcsum , vxlanhwtso
Если драйвер предлагает настраиваемую пользователем поддержку VXLAN, отключите контрольную сумму.
разгрузку (прием и передача) или TSO на VXLAN соответственно.
.It Cm vnet Ar jail
Переместите интерфейс в
.Xr jail 8 ,
указывается по имени или JID.
Если в jail есть стек виртуальной сети, интерфейс исчезнет.
из текущей среды и станет видимыми для jail.
.It Fl vnet Ar jail
Переместите интерфейс в
.Xr jail 8 ,
указывается по имени или JID.
Если в jail есть стек виртуальной сети, интерфейс исчезнет.
из jail и станет видимыми для текущего сетевого окружения.
.It Cm polling
Включите
.Xr polling 4
функцию и отключите прерывания на интерфейсе, если драйвер поддерживает
этот режим.
.It Fl polling
Выключите
.Xr polling 4
функцию и включите режим прерывания на интерфейсе.
.It Cm create
Создайте указанное сетевое псевдоустройство.
Если интерфейс указан без номера устройства, попробуйте создать новое
устройство с произвольным номером устройства.
Если создание произвольного устройства прошло успешно, новое имя устройства будет
выводится на стандартный вывод, если интерфейс не переименован или не уничтожен
В тот же самый
.Nm
призыв.
.It Cm destroy
Уничтожение указанного сетевого псевдоустройства
.It Cm plumb
Другое название для
.Cm create
параметра.
Включено для совместимости с Solaris.
.It Cm unplumb
Другое название для
.Cm destroy
параметра.
Включено для совместимости с Solaris.
.It Cm metric Ar n
Установите метрику маршрутизации интерфейса 
.Ar n ,
по умолчанию на 0.
Метрика маршрутизации используется протоколом маршрутизации.
.Pq Xr routed 8 .
Более высокие показатели имеют эффект прокладывания маршрута через
менее благоприятный; метрики учитываются как дополнительные прыжки
к целевой сети или хосту.
.It Cm mtu Ar n
Установите максимальную единицу передачи интерфейса
.Ar n ,
по умолчанию зависящую от интерфейса.
MTU используется для ограничения размера пакетов, передаваемых по сети.
интерфейс.
Не все интерфейсы поддерживают настройку MTU, а некоторые интерфейсы имеют
ограничения по диапазону.
.It Cm netmask Ar mask
.\" (Inet and ISO.)
(Inet only.)
Укажите, какую часть адреса следует зарезервировать для разделения
сети на подсети.
Маска включает сетевую часть локального адреса.
и часть подсети, которая берется из поля хоста адреса.
Маска может быть указана как одно шестнадцатеричное число.
с ведущим
.Ql 0x ,
интернет-адресом в точечной записи,
или с именем псевдосети, указанным в сетевой таблице
.Xr networks 5 .
Маска содержит единицы для битовых позиций в 32-битном адресе.
которые будут использоваться для частей сети и подсети,
и нули для хостовой части.
Маска должна содержать как минимум стандартную сетевую часть,
и поле подсети должно совпадать с сетью.
.Pp
Сетевую маску также можно указать в нотации CIDR после адреса.
Смотрите
.Ar address
вариант выше для получения дополнительной информации.
.It Cm prefixlen Ar len
(Inet6 only.)
Укажите, что
.Ar len
биты зарезервированы для разделения сетей на подсети.
.Ar len
должно быть целым числом и по синтаксическим причинам должно находиться в диапазоне от 0 до 128.
Согласно текущему правилу назначения IPv6, оно почти всегда равно 64.
Если параметр опущен, используется 64.
.Pp
Префикс также можно указать, используя косую черту после адреса.
Смотрите
.Ar address
вариант выше для получения дополнительной информации.
.It Cm remove
Другое название для
.Fl alias
параметра.
Введено для совместимости
С
.Bsx .
.Sm off
.It Cm link Op Cm 0 No - Cm 2
.Sm on
Включение специальной обработки канального уровня интерфейса.
Эти три параметра на самом деле зависят от интерфейса, однако
они обычно используются для выбора специальных режимов работы.
Например
это значит включить сжатие SLIP или выбрать тип разъема
для некоторых карт Ethernet.
Обратитесь к странице руководства для конкретного драйвера.
Чтобы получить больше информации.
.Sm off
.It Fl link Op Cm 0 No - Cm 2
.Sm on
Отключените специальную обработку на уровне канала с указанным интерфейсом.
.It Cm monitor
Переведите интерфейс в режим монитора. 
Пакеты не передаются, а полученные пакеты отбрасываются после
.Xr bpf 4
обработки.
.It Fl monitor
Выведите интерфейс из режима монитора.
.It Cm pcp Ar priority_code_point
Код приоритета
.Pq Dv PCP
это 3-битное поле, которое относится к IEEE 802.1p.
классу обслуживания и соответствует уровню приоритета кадра.
.It Fl pcp
Прекратите пометки пакетов на интерфейсе кодовой точкой приоритета.
.It Cm up
Отметьте интерфейс
.Dq up .
Это можно использовать для включения интерфейса после
.Dq Nm Cm down .
Это происходит автоматически при установке первого адреса на интерфейсе.
Если интерфейс был сброшен, когда ранее был отмечен,
оборудование будет повторно инициализировано.
.El
.Ss ICMPv6 Neighbor Discovery Protocol Parameters
Следующие параметры предназначены для протокола обнаружения соседей ICMPv6.
Обратите внимание, что ключевое слово семейства адресов
.Dq Li inet6
для них необходимо:
.Bl -tag -width indent
.It Cm accept_rtadv
Установить флаг, позволяющий принимать сообщения объявления маршрутизатора ICMPv6.
.Xr sysctl 8
переменная
.Va net.inet6.ip6.accept_rtadv
контролирует, установлен ли этот флаг по умолчанию или нет.
.It Cm -accept_rtadv
Очистить флаг
.Cm accept_rtadv .
.It Cm no_radr
Установить флаг, чтобы контролировать, принимают ли маршрутизаторы, от которых система
Сообщения с рекламой маршрутизатора будут добавлены в список маршрутизаторов по умолчанию.
или нет.
Когда
.Cm accept_rtadv
флаг отключен, этот флаг не имеет никакого эффекта.
.Xr sysctl 8
переменная
.Va net.inet6.ip6.no_radr
контролирует, установлен ли этот флаг по умолчанию или нет.
.It Cm -no_radr
Очистить флаг
.Cm no_radr .
.It Cm auto_linklocal
Установить указанный интерфейс в качестве маршрута по умолчанию, когда нет
маршрутизатора по умолчанию.
.Xr sysctl 8
переменная
.Va net.inet6.ip6.auto_linklocal
контролирует, установлен ли этот флаг по умолчанию или нет.
.It Cm -auto_linklocal
Очистить флаг
.Cm auto_linklocal .
.It Cm defaultif
Установить указанный интерфейс в качестве маршрута по умолчанию, когда нет
маршрутизатора по умолчанию.
.It Cm -defaultif
Очистить флаг
.Cm defaultif .
.It Cm ifdisabled
Установить флаг, чтобы отключить все сетевые соединения IPv6 на
указанный интерфейс. 
Обратите внимание: если уже настроен IPv6
адреса на этом интерфейсе, все они помечены как
.Dq tentative
и DAD будет выполнен, когда этот флаг будет очищен.
.It Cm -ifdisabled
Очистить флаг
.Cm ifdisabled .
Когда этот флаг снят и
.Cm auto_linklocal
флаг включен, автоматическая настройка локального адреса канала включена.
выполненно.
.It Cm nud
Set a flag to enable Neighbor Unreachability Detection. Установить флаг, чтобы включить обнаружение недоступности соседа.
.It Cm -nud
Очистить флаг
.Cm nud .
.It Cm no_prefer_iface
Установить флаг, чтобы не соблюдать 5 правило выбора адреса источника в RFC 3484.
На практике это означает, что адрес на исходящем интерфейсе не будет
предпочтительный, что фактически приводит к выбору адреса
таблицы политики, настраиваемая с помощью
.Xr ip6addrctl 8 .
.It Cm -no_prefer_iface
Очистить флаг
.Cm no_prefer_iface .
.It Cm no_dad
Установить флаг, чтобы отключить обнаружение повторяющихся адресов.
.It Cm -no_dad
Clear a flag
.Cm no_dad .
.El
.Ss IPv6 Parameters
Следующие параметры относятся к адресам IPv6.
Обратите внимание, что ключевое слово семейства адресов
.Dq Li inet6
для них необходимо:
.Bl -tag -width indent
.It Cm autoconf
Установить бит автоконфигурируемого адреса IPv6.
.It Fl autoconf
Очистить бит автоконфигурируемого адреса IPv6.
.It Cm deprecated
Установить бит устаревшего адреса IPv6.
.It Fl deprecated
Очистить бит устаревшего адреса IPv6.
.It Cm pltime Ar n
Установить предпочтительный срок действия адреса.
.It Cm prefer_source
Установить флаг, чтобы предпочесть адрес в качестве кандидата исходного адреса для
исходящие пакеты.
.It Cm -prefer_source
Очистить флаг
.Cm prefer_source .
.It Cm vltime Ar n
Установить действительный срок действия адреса.
.El
.Ss IEEE 802.11 Параметры клонирования беспроводных интерфейсов
Следующие параметры относятся к клонированию.
Беспроводные интерфейсы IEEE 802.11 с
.Cm create
запрос:
.Bl -tag -width indent
.It Cm wlandev Ar device
Используйте
.Ar device
в качестве родителя для клонированного устройства.
.It Cm wlanmode Ar mode
Укажите режим работы этого клонированного устройства.
.Ar mode
один из
.Cm sta ,
.Cm ahdemo
(или
.Cm adhoc-demo ) ,
.Cm ibss
(или
.Cm adhoc ) ,
.Cm ap
(или
.Cm hostap ) ,
.Cm wds ,
.Cm tdma ,
.Cm mesh ,
и
.Cm monitor .
Режим работы клонированного интерфейса изменить нельзя.
.Cm tdma
режим фактически реализован как
.Cm adhoc-demo
интерфейс со специальными свойствами.
.It Cm wlanbssid Ar bssid
Mac-адрес 802.11, который будет использоваться для bssid.
Это необходимо указать во время создания наследства.
.Cm wds
устройства.
.It Cm wlanaddr Ar address
Локальный MAC-адрес.
Если это не указано, то MAC-адрес будет присвоен автоматически.
на клонированное устройство.
Обычно этот адрес совпадает с адресом родительского устройства.
но если
.Cm bssid
параметр указан, то драйвер создаст уникальный адрес для
устройства (если поддерживается).
.It Cm wdslegacy
Отметьте
.Cm wds
устройство, работающее в
.Dq legacy mode .
Наследия
.Cm wds
устройства имеют фиксированные одноранговые отношения и, например, не перемещаются
если их сверстник перестанет общаться.
Для полноты интерфейс Dynamic WDS (DWDS) может быть помечен как
.Fl wdslegacy .
.It Cm bssid
Запросите уникальный локальный MAC-адрес для клонированного устройства.
Это возможно только в том случае, если устройство поддерживает несколько MAC-адресов.
Чтобы принудительно использовать Mac-адрес родителя, используйте
.Fl bssid .
.It Cm beacons
Отметьте клонированный интерфейс как зависящий от аппаратной поддержки, чтобы
отслеживать полученные маяки.
Чтобы маяки отслеживались при использовании программного обеспечения
.Fl beacons .
Для
.Cm hostap
Режима
.Fl beacons
также может использоваться для указания того, что маяки не должны
передаваться; это может быть полезно при создании конфигурации WDS, но
.Cm wds
интерфейсы могут создаваться только как дополнение к точке доступа.
.El
.Ss Cloned IEEE 802.11 Wireless Interface Parameters
Следующие параметры относятся к беспроводным интерфейсам IEEE 802.11.
клонированым с помощью
.Cm create
операции:
.Bl -tag -width indent
.It Cm ampdu
Включите отправку и получение кадров AMPDU при использовании 802.11n (по умолчанию).
Спецификация 802.11n гласит, что совместимая станция должна быть способна
получать кадры AMPDU, но передача не является обязательной.
Используйте
.Fl ampdu
чтобы отключить любое использование AMPDU со стандартом 802.11n.
Для тестирования и/или решения проблем совместимости можно использовать
.Cm ampdutx
и
.Cm ampdurx
контроля использования AMPDU в одном направлении.
.It Cm ampdudensity Ar density
Установите параметр плотности AMPDU, используемый при работе с 802.11n.
Этот параметр управляет интервалом между пакетами для кадров AMPDU.
Обычно этим параметром управляет передающее устройство, но принимающей станции
могут потребоваться более широкие пробелы.
Юридические значения для
.Ar density
равны 0, 0,25, 0,5, 1, 2, 4, 8 и 16 (микросекунды).
Значение
.Cm -
рассматривается так же, как 0.
.It Cm ampdulimit Ar limit
Установите ограничение на размер пакета для приема кадров AMPDU при работе
с 802.11n.
Юридические значения для
.Ar limit
это 8192, 16384, 32768 и 65536, но можно также указать
просто уникальный префикс: 8, 16, 32, 64.
Обратите внимание, что отправитель может ограничить размер кадров AMPDU, чтобы он был меньше.
чем максимум, указанный принимающей станцией.
.It Cm amsdu
Включите отправку и получение кадров AMSDU при использовании 802.11n.
По умолчанию AMSDU принимается, но не передается.
Используйте
.Fl amsdu
чтобы отключить любое использование AMSDU со стандартом 802.11n.
Для тестирования и/или решения проблем совместимости можно использовать
.Cm amsdutx
и
.Cm amsdurx
контроля использованиея AMSDU в одном направлении.
.It Cm amsdulimit Ar limit
Установите ограничение на размер пакета для отправки и получения кадров AMSDU.
при работе с 802.11n.
Юридические значения для
.Ar limit
составляют 7935 и 3839 (байт).
Обратите внимание, что отправитель может ограничить размер кадров AMSDU меньшими значениями.
чем максимум, указанный принимающей станцией.
Также обратите внимание, что устройства не обязаны поддерживать ограничение 7935.
по спецификации требуется только 3839 и большее значение
может потребовать больше памяти для поддержки функций, 
что используется редко.
.It Cm apbridge
При работе в качестве точки доступа передавайте пакеты между
беспроводными клиентами напрямую (по умолчанию).
Вместо этого нужно позволить им пройти через
систему и пересылаться с использованием какого-либо другого механизма, используйте
.Fl apbridge .
Отключение внутреннего моста
полезно, когда трафик должен обрабатываться с помощью
фильтрации пакетов.
.It Cm authmode Ar mode
Установите желаемый режим аутентификации в режиме инфраструктуры.
Не все адаптеры поддерживают все режимы.
Наборы
допустимых режимов
.Cm none , open , shared
(shared key),
.Cm 8021x
(IEEE 802.1x),
и
.Cm wpa
(IEEE WPA/WPA2/802.11i).
.Cm 8021x
и
.Cm wpa
режимы полезны только при использовании службы аутентификации
(запрашивающий клиентской операции или аутентификатор, когда
работает как точка доступа).
Режимы нечувствительны к регистру.
.It Cm bgscan
Включите фоновое сканирование при работе в качестве станции.
Фоновое сканирование — это метод, при котором станция, связанная с
точкой доступа временно покинет канал для сканирования
соседних станций.
Это позволяет станции хранить кэш близлежащих точек доступа.
чтобы роуминг между точками доступа мог осуществляться без
длительной операции сканирования.
Фоновое сканирование выполняется только тогда, когда станция не занята и
любой исходящий трафик отменит операцию сканирования.
Однако фоновое сканирование никогда не должно приводить к потере пакетов 
может возникнуть небольшая задержка, если исходящий трафик прерывает
операцию сканирования.
По умолчанию фоновое сканирование включено, если устройство поддерживает эту функцию.
Чтобы отключить фоновое сканирование, используйте
.Fl bgscan .
Фоновое сканирование контролируется
.Cm bgscanidle
и
.Cm bgscanintvl
параметром.
Для роуминга необходимо включить фоновое сканирование; это артефакт
текущей реализации и может не потребоваться в будущем.
.It Cm bgscanidle Ar idletime
Установите минимальное время, в течение которого станция должна находиться в режиме ожидания (не вести передачу или
получение кадров) до начала фонового сканирования.
.Ar idletime
параметр указывается в миллисекундах.
По умолчанию станция должна простаивать не менее 250 миллисекунд перед
запуском фонового сканирования.
Время простоя не может быть установлено менее 100 миллисекунд.
.It Cm bgscanintvl Ar interval
Установите интервал, с которым будет выполняться фоновое сканирование.
.Ar interval
параметр указывается в секундах.
По умолчанию фоновое сканирование выполняется каждые 300 секунд (5 минут).
.Ar interval
не может быть установлено менее чем 15 секунд.
.It Cm bintval Ar interval
Установите интервал, с которым отправляются кадры маяка при работе в
режиме ad-hoc или ap.
.Ar interval
Параметр указывается в TU (1024 usecs).
По умолчанию кадры маяка передаются каждые 100 TU.
.It Cm bmissthreshold Ar count
Установите количество последовательных пропущенных маяков, при которых станция
попытается перейти в роуминг (т. е. выполнить поиск новой точки доступа).
.Ar count
параметр должен находиться в диапазоне от 1 до 255; хотя
верхняя граница может быть уменьшена в зависимости от возможностей устройства.
Порог по умолчанию — 7 последовательных пропущенных маяков; но
это может быть отменено драйвером устройства.
Другое название для
.Cm bmissthreshold
параметра это
.Cm bmiss .
.It Cm bssid Ar address
Укажите MAC-адрес точки доступа, которая будет использоваться при работе.
как станция в сети BSS.
Это отменяет любой автоматический выбор, сделанный системой.
Чтобы отключить ранее выбранную точку доступа, введите
.Cm any , none ,
или
.Cm -
for the address.
для адреса.
Эта опция полезна, когда несколько точек доступа используют один и тот же SSID.
Другое название для
.Cm bssid
параметра это
.Cm ap .
.It Cm burst
Включение пакетной передачи.
Пакетная передача — это метод передачи, при котором беспроводная связь
среды приобретается один раз для отправки нескольких кадров и межкадрове
расстояние уменьшается.
Этот метод может значительно увеличить пропускную способность за счет сокращения
накладных расходов на передачу.
Пакетная передача пакетов поддерживается спецификацией QoS 802.11e.
и некоторые устройства, которые не поддерживают QoS, могут по-прежнему поддерживать эту функцию.
По умолчанию пакетная передача пакетов включена, если устройство способно
делать это.
Чтобы отключить пакетную передачу, используйте
.Fl burst .
.It Cm chanlist Ar channels
Установите нужные каналы для использования при сканировании доступа
точек, соседей в сети IBSS или найдите незанятые
каналы при работе в качестве точки доступа.
Набор каналов указывается в виде списка, разделенного запятыми,
каждый элемент в списке представляет либо один номер канала, либо диапазон
формы
.Dq Li a-b .
Номера каналов должны находиться в диапазоне от 1 до 255 и быть допустимыми.
в зависимости от рабочих характеристик устройства.
.It Cm channel Ar number
Установите один желаемый канал.
Каналы варьируются от 1 до 255, но возможен точный выбор.
Это зависит от региона, для которого был изготовлен адаптер.
Параметр
канал для
.Cm any ,
или
.Dq Cm -
очистит любой желаемый канал и, если устройство размечено,
принудительно выполнит сканирование канала для работы.
Альтернативно можно указать частоту в мегагерцах.
вместо номера канала.
.Pp
Если существует несколько способов использования канала, канал
число/частота могут быть дополнены атрибутами для пояснения.
Например, если устройство способно работать на канале 6
с 802.11n и 802.11g, то можно указать, что следует использовать только g, указав
.Cm 6:g .
Аналогично ширину канала можно указать, добавив ее
С
.Dq Cm \&/ ;
например,
.Cm 6/40
определяет канал шириной 40 МГц.
Эти атрибуты можно комбинировать следующим образом:
.Cm 6:ht/40 .
.Pp
Полный набор флагов, указанный после
.Dq Cm \&:
является:
.Pp
.Bl -tag -compact
.It Cm a
802.11a
.It Cm b
802.11b
.It Cm d
с
.It Cm g
802.11g
.It Cm h
Такой же как
.Cm n
.It Cm n
802.11n aka HT
.It Cm s
с
.It Cm t
Режим Atheros Dynamic Turbo или добавлен к
.Cm st
и
.Cm dt
.El
.Pp
Полный набор ширины канала после
.Cm \&/
является:
.Pp
.Bl -tag -compact
.It Cm 5
5 МГц или четвертьскоростной канал
.It Cm 10
10 МГц, он же полускоростной канал
.It Cm 20
20 МГц в основном для использования при указании
.Cm ht20
.It Cm 40
40 МГц в основном для использования при указании
.Cm ht40
.El
.Pp
Кроме того,
спецификация HT-канала 40 МГц может включать местоположение
канала расширения, добавив
.Dq Cm \&+
или
.Dq Cm \&-
для верха и низа,
соответственно; например,
.Cm 2437:ht/40+
определяет работу HT в полосе 40 МГц
с центральным каналом на частоте 2437 и каналом расширения выше.
.It Cm страна Ar название
Установите код страны, который будет использоваться при расчете нормативных ограничений.
для эксплуатации.
В частности набор доступных каналов, как работает беспроводное устройство, как
будет работать на каналах, и максимальная мощность передачи, которые
могут использоваться на канале, определяются этой настройкой.
Коды стран/регионов указываются в виде двухсимвольной аббревиатуры.
определяется стандартом ISO 3166 или использует более длинное, но, возможно, неоднозначное написание;
например, «ES» и «Испания».
Набор кодов стран взят из
.Cm list countries
запроса.
Обратите внимание, что не все устройства поддерживают изменение кода страны по умолчанию.
параметр; обычно хранится в EEPROM.
Смотрите также
.Cm regdomain ,
.Cm indoor ,
.Cm outdoor ,
и
.Cm anywhere .
.It Cm dfs
Включите динамический выбор частоты (DFS), как указано в 802.11h.
DFS включает в себя несколько возможностей, включая обнаружение перекрытия.
радиолокационные сигналы, динамическое управление мощностью передачи и выбор канала
по критерию наименее перегруженности.
Поддержка DFS обязательна для некоторых частот 5 ГГц.
локально (например, ETSI).
По умолчанию DFS включен в соответствии с нормативными определениями.
указано в
.Pa /etc/regdomain.xml
и текущий код страны, рег.домен,
и канал.
Обратите внимание, что базовое устройство (и драйвер) должны поддерживать обнаружение радаров.
для полной поддержки DFS.
Чтобы полностью соответствовать частотам местных регулирующих органов, которые
требует DFS не следует использовать, если он не поддерживается полностью.
Используйте
.Fl dfs
чтобы отключить эту функцию для тестирования.
.It Cm dotd
Включите поддержку спецификации 802.11d (по умолчанию).
Когда эта поддержка включена в режиме станции, кадры маяка, рекламирующие
код страны, отличные от текущего настроенного кода страны, будут
вызвать отправку события пользовательским приложениям.
Это событие может быть использовано станцией для принятия кода страны и
действовать в соответствии с соответствующими нормативными ограничениями.
При работе в качестве точки доступа с 802.11d включается маяк и
Передаваемые кадры ответа на зонд будут сообщать о текущих нормативных
настройках домена.
Чтобы отключить 802.11d, используйте
.Fl dotd .
.It Cm doth
Включите поддержку 802.11h, включая управление спектром.
Когда 802.11h включен, кадры ответа маяка и зонда будут иметь
бит SpectrumMgt установленный в поле возможностей и
Будут присутствовать элементы информации об ограничениях по стране и мощности.
Поддержка 802.11h также включает обработку объявлений о переключении каналов (CSA).
которые представляют собой механизм координации изменений канала точкой доступа.
По умолчанию 802.11h включен, если устройство поддерживает его.
Чтобы отключить 802.11h, используйте
.Fl doth .
.It Cm deftxkey Ar index
Установите ключ по умолчанию, который будет использоваться для передачи.
Обычно этот параметр устанавливается только при использовании шифрования WEP.
Обратите внимание, что вы должны установить ключ передачи по умолчанию.
чтобы система знала, какой ключ использовать для шифрования исходящего трафика.
.Cm weptxkey
является псевдонимом для этого запроса; это предусмотрено для обратной совместимости.
.It Cm dtimperiod Ar period
Установите
DTIM
период для передачи буферизованных кадров многоадресной рассылки, когда
работаета идет в режиме ap.
.Ar period
указывает количество интервалов маяка между DTIM
и должно находиться в диапазоне от 1 до 15.
По умолчанию DTIM равен 1 (т. е. DTIM возникает в каждом маяке).
.It Cm quiet
Включите использование "тихого" (QUIET) IE.
Хост будет использовать это, чтобы заставить замолчать другие
станции для уменьшения помех при обнаружении радаров, когда
работает на частоте 5 ГГц, поддержка включена.
Используйте
.Fl quiet
чтобы отключить эту функцию.
.It Cm quiet_period Ar period
с
.Ar period
к количеству интервалов радиомаяка между стартами регулярных
запланированных интервалов тишины, определяемых элементом Quiet.
.It Cm quiet_count Ar count
Установите тихий (QUIET)
.Ar count
количеству TBTT до интервала передачи сигнала, в течение которого
должен начаться следующий интервал тишины.
Значение 1 указывает что тихий
интервал начнется в течение интервала передачи маяка, начиная со следующего
ТБТТ.
Значение 0 зарезервировано.
.It Cm quiet_offset Ar offset
Установите тихий QUIET
.Ar offset
для смещения начала интервала молчания от ТБТТ
определямым количеством тишины, выраженным в TU.
Ценность
.Ar offset
должна быть меньше одного интервала передачи маяка.
.It Cm quiet_duration Ar dur
Установите тихий QUIET
.Ar dur
к продолжительности интервала тишины, выраженной в ТЕ.
Значение должно быть меньше интервала маяка.
.It Cm dturbo
Включите использование режима Atheros Dynamic Turbo при общении с
еще одной станцией с поддержкой Dynamic Turbo.
Режим Dynamic Turbo — это специальный механизм Atheros, с помощью которого
станции переключаются между нормальной работой 802.11 и
.Dq boosted
режимом, в котором для связи используется канал шириной 40 МГц.
Станции, использующие режим Dynamic Turbo, работают с ускорением только тогда, когда
на канале нет станций, не относящихся к dturbo; когда станция без турбонаддува
идентифицированного на канале, все станции автоматически отключатся и
возвращаются к нормальной работе.
По умолчанию режим Dynamic Turbo не включен, даже если устройство поддерживает его.
Обратите внимание, что турбо-режим (динамический или статический) разрешен только на некоторых устройствах.
каналах в зависимости от нормативных ограничений; используйте
.Cm list chan
Команду для определения каналов, на которых можно использовать турборежим.
Чтобы отключить режим Dynamic Turbo, используйте
.Fl dturbo .
.It Cm dwds
Включите поддержку динамического WDS (DWDS).
DWDS — это средство, с помощью которого 4-адресный трафик может передаваться между
станциями, работающим в инфраструктурном режиме.
Станция сначала подключается к точке доступа и проходит аутентификацию, используя
обычные процедуры (например, WPA).
Затем передаются 4-адресные кадры для передачи трафика станциям.
работающим по обе стороны беспроводного канала.
DWDS расширяет обычный механизм WDS, используя существующую систему безопасности.
протоколов и устранение статической привязки.
.Pp
Когда DWDS включен на точке доступа, с полученными 4-адресными кадрами,
авторизованная станция сгенерирует
.Dq DWDS discovery
событие для пользователя
Приложения.
Это событие следует использовать для создания интерфейса WDS, привязанного
к удаленной станции (обычно подсоединенной к мосту).
Как только интерфейс WDS запущен и работает с 4-адресным трафиком, то логически
течет через этот интерфейс.
.Pp
Когда на станции включен DWDS, трафик с адресом назначения
отличного от одноранговой станции, инкапсулирется в 4-адресный кадр
и передается партнеру.
Весь 4-адресный трафик использует информацию безопасности станций.
(например, криптографические ключи).
Станция, связанная с использованием средств 802.11n, может передавать
4-адресный трафик с использованием тех же механизмов; это зависит от наличия
Ресурсов и возможностей устройства.
Реализация DWDS защищает от петель маршрутизации уровня 2
многоадресного трафика.
.It Cm ff
Включите использование Atheros Fast Frames при общении с
еще одной станцией с поддержкой Fast Frames.
Fast Frames — это метод инкапсуляции, при котором два 802.3
кадра передаются в одном кадре 802.11.
Это может заметно повысить пропускную способность, но требует, чтобы
принимающая станция понимала, как декапсулировать кадр.
Использование быстрых кадров согласовывается с использованием Atheros 802.11, зависящего от поставщика.
расширения протокола, поэтому использование безопасно при общении с
устройством, отличным от Atheros.
По умолчанию использование быстрых кадров включено, если устройство поддерживает эту функцию.
Чтобы отключить быстрые кадры, используйте
.Fl ff .
.It Cm fragthreshold Ar length
Установите порог, при котором передаваемые кадры разбиваются на фрагменты.
.Ar length
Аргумент — это размер кадра в байтах, который должен находиться в диапазоне от 256 до 2346.
Параметр
.Ar length
к
.Li 2346 ,
.Cm any ,
или
.Cm -
отключает фрагментацию передачи.
Не все адаптеры соблюдают порог фрагментации.
.It Cm hidessid
При работе в качестве точки доступа не передавайте SSID.
в кадрах маяка или отвечайте на кадры запроса зонда, если только
они направляются на точку доступа (т. е. включают в себя SSID точки доступа).
По умолчанию SSID включен в кадры маяка и
ненаправленные кадры запроса зонда получают ответ.
Чтобы снова включить трансляцию SSID и т. д., используйте
.Fl hidessid .
.It Cm ht
Включите использование высокой пропускной способности (HT) при использовании 802.11n (по умолчанию).
Спецификация 802.11n включает механизмы для работы
на каналах шириной 20 МГц и 40 МГц с использованием разных механизмов сигнализации
что указано в 802.11b, 802.11g и 802.11a.
Станции договариваются об использовании этих средств, называемых HT20 и HT40.
когда они общаются.
Чтобы отключить любое использование 802.11n, используйте
.Fl ht .
Чтобы отключить использование HT20 (например, принудительно использовать только HT40), используйте
.Fl ht20 .
Чтобы отключить использование HT40, используйте
.Fl ht40 .
.Pp
Конфигурация HT используется для
.Dq auto promote
операции
когда доступно несколько вариантов.
Например, если станция подключается к точке доступа с поддержкой 11n
она контролирует, использует ли станция устаревший режим, HT20 или HT40.
Если устройство с поддержкой 11n настроено в качестве точки доступа и
Автоматический выбор канала используется для определения канала для работы.
Конфигурация HT определяет, будет ли настроена работа устаревшего режима, HT20 или HT40.
на выбранном канале.
Если для станции указан фиксированный канал, то конфигурация HT может
быть задана как часть спецификации канала; например, 6:ht/20 для настройки
Работы HT20 на канале 6.
.It Cm htcompat
Включите использование поддержки совместимости для устройств до 802.11n (по умолчанию).
Спецификация протокола 802.11n претерпела несколько несовместимых итераций.
Некоторые поставщики реализовали поддержку 11n для старых спецификаций, которые
не будут взаимодействовать со станцией, полностью совместимой с 11n.
В частности, информационные элементы, включенные в кадры управления
для старых устройств и другие.
Если включена поддержка совместимости, как стандартные, так и совместимые данные.
будут обеспечены.
Станции, подключающиеся с использованием механизмов совместимости, помечаются как в
.Cm list sta .
Чтобы отключить поддержку совместимости, используйте
.Fl htcompat .
.It Cm htprotmode Ar technique
Для интерфейсов, работающих в стандарте 802.11n, используйте указанный
.Ar technique
для защиты кадров HT в смешанной сети Legacy/HT.
Набор действенных методик
.Cm off ,
и
.Cm rts
(RTS/CTS, по умолчанию).
Имена методов нечувствительны к регистру.
.It Cm inact
Включите обработку неактивности для станций, связанных с
точкой доступа (по умолчанию).
При работе в качестве точки доступа уровень 802.11 отслеживает
деятельность каждой связанной станции.
Если станция неактивна в течение 5 минут, она отправит несколько
.Dq probe frames
чтобы проверить, существует ли еще станция.
Если ответ не получен, станция деаутентифицируется.
Приложения, которые предпочитают выполнять эту работу, могут отключить эту функцию.
объекта с помощью
.Fl inact .
.It Cm indoor
Установите местоположение, которое будет использоваться при расчете нормативных ограничений.
Местоположение также объявляется в кадрах ответа маяка и зонда.
когда 802.11d включен с помощью
.Cm dotd .
Смотрите также
.Cm outdoor ,
.Cm anywhere ,
.Cm country ,
и
.Cm regdomain .
.It Cm list active
Отображение списка доступных для использования каналов с учетом
любых ограничений, установленных
.Cm chanlist
директивой.
Посмотрите описание
.Cm list chan
Чтобы получить больше информации.
.It Cm list caps
Отображение возможностей адаптера, включая эксплуатационные
поддерживаемые режимы.
.It Cm list chan
Отображение списка каналов, доступных для использования.
Каналы показаны с указанием их номеров каналов IEEE, эквивалентных
частоте и режиму использования.
Каналы идентифицированые как
.Ql 11g
также можно использовать в
.Ql 11b
режмие.
Каналы идентифицированые как
.Ql 11a Turbo
можно использовать только для режима Static Turbo Atheros.
(указывается с помощью mediaopt turbo ) .
Каналы, отмеченные значком
.Ql *
имеют нормативное ограничение, согласно которому они подлежат пассивному сканированию.
Это означает, что станции не разрешается вести передачу по каналу до тех пор, пока
он идентифицирует канал, используемый для связи 802.11;
обычно путем прослушивания кадра маяка от работающей точки доступа
на канале.
.Cm list freq
это еще один способ запроса этой информации.
По умолчанию отображается сжатый список каналов; если
.Fl v
указана опция, то отображаются все каналы.
.It Cm list countries
Отображение набора кодов стран и нормативных доменов, которые могут быть
использованы в нормативной конфигурации
.It Cm list mac
Отображение текущего состояния списка контроля доступа MAC.
Перед каждым адресом стоит символ, обозначающий, что
к нему применена текущая политика:
.Ql +
указывает, что к адресу разрешен доступ,
.Ql -
указывает на то, что к адресу запрещен доступ,
.Ql *
указывает, что адрес присутствует, но текущая политика открыта
(поэтому ACL не проверяется).
.It Cm list mesh
Отображает таблицу маршрутизации сети, используемую для пересылки пакетов в сети.
сеть.
.It Cm list regdomain
Отображение текущих нормативных настроек, включая доступные каналы
и ограничения мощности передачи.
.It Cm list roam
Отображение параметров, управляющих работой роуминга.
.It Cm list txparam
Отображение параметров, которые управляют операцией передачи.
.It Cm list txpower
Отображение ограничения мощности передачи для каждого канала.
.It Cm list scan
Display the access points and/or ad-hoc neighbors
located in the vicinity.
Отображение точек доступа и/или одноранговых соседей
расположенных в окрестностях.
Эта информация может автоматически обновляться адаптером.
с
.Cm scan
запросом или посредством фонового сканирования.
В зависимости от возможностей станций:
флаги (коды возможностей) могут быть включены в выходные данные:
.Bl -tag -width 3n
.It Li A
Гибкость канала.
.It Li B
PBCC-модуляция.
.It Li C
Возможность запроса опроса.
.It Li D
Возможность DSSS/OFDM.
.It Li E
Расширенный набор услуг (ESS).
Указывает, что станция является частью инфраструктурной сети.
а не сети IBSS/ad-hoc.
.It Li I
Независимый базовый набор услуг (IBSS).
Указывает, что станция является частью одноранговой сети.
а не сети ESS.
.It Li P
Возможность конфиденциальности.
Станция требует аутентификации и шифрования.
для всех кадров данных, которыми обмениваются внутри BSS с использованием криптографических средств
например WEP, TKIP или AES-CCMP.
.It Li R
Надежная безопасная сеть (RSN).
.It Li S
Краткая преамбула.
Указывает, что сеть использует короткие преамбулы.
определено в 802.11b High Speed/DSSS PHY,
и использует 56-битное поле синхронизации
а не 128-битное поле, используемое в режиме длинной преамбулы.
Короткие преамбулы используются для
улучшения производительность пропускной способности с помощью 802.11g и 802.11b.
.It Li c
Возможность опроса.
.It Li s
Возможность короткого интервала времени.
Указывает, что сеть 802.11g использует короткий интервал времени.
потому что нет устаревших станций (802.11b).
.El
.Pp
По умолчанию интересные элементы информации, захваченные из соседних
станций отображаются в конце каждой строки.
Возможные элементы включают в себя:
.Cm WME
(станция поддерживает WME),
.Cm WPA
(станция поддерживает WPА),
.Cm WPS
(станция поддерживает WPS),
.Cm RSN
(станция поддерживает 802.11i/RSN),
.Cm HTCAP
(станция поддерживает связь 802.11n/HT),
.Cm ATH
(станция поддерживает расширения протокола Atheros),
.Cm VEN
(станция поддерживает расширения неизвестных производителей).
Если
.Fl v
флаг использует все информационные элементы и их
содержимое.
Указание
.Fl v
Флаг также включает отображение длинных SSID.
.Cm list ap
команда — это еще один способ запроса этой информации.
.It Cm list sta
При работе в качестве точки доступа отображаются станции, которые
в настоящее время связаны.
При работе в режиме Ad-hoc станции отображения идентифицируются как
соседи по IBSS.
При работе в ячеистом режиме станции отображения обозначаются как
соседи по MBSS.
При работе в режиме станции отображается точка доступа.
Возможности, рекламируемые станциями, описаны в разделе
.Cm сканирование
запрос.
В вывод могут быть включены следующие флаги:
.Bl -tag -width 3n
.It Li A
Авторизованный.
Указывает, что станции разрешено отправлять/получать кадры данных.
.It Li E
Расширенная ставка Phy (ERP).
Указывает, что станция работает в сети 802.11g.
используя расширенные скорости передачи.
.It Li H
Высокая пропускная способность (HT).
Указывает, что станция использует скорость передачи HT.
Если
.Sq Li +
следует сразу за соответствующей станцией,
использование устаревших механизмов поддерживается только тогда, когда
.Cm htcompat
включен.
.It Li P
Энергосбережение.
Указывает, что станция работает в режиме энергосбережения.
.It Li Q
Качество обслуживания (QoS).
Указывает, что станция использует инкапсуляцию QoS для
кадр данных.
Инкапсуляция QoS включается только при включенном режиме WME.
.It Li S
Короткий GI в режиме HT 40 МГц включен.
Если
.Sq Li +
следует сразу после включения короткого GI в режиме HT 20 МГц.
.It Li T
Переходная сеть безопасности (TSN).
Указывает, что станция связана с использованием TSN; смотрите также
.Cm tsn
ниже.
.It Li W
Защищенная настройка Wi-Fi (WPS).
Указывает, что станция связана с использованием WPS.
.It Li s
Короткий GI в режиме HT 20 МГц включен.
.El
.Pp
По умолчанию элементы информации, полученные от связанных станций
отображаются в краткой форме; этот
.Fl v
Флаг заставляет эту информацию отображаться в символическом виде.
.It Cm list wme
Отображение текущих параметров канала, которые будут использоваться при работе в режиме WME.
Если
.Fl v
указана опция, и затем отображаются параметры канала и BSS
для каждого АС (первый канал, затем BSS).
Если для адаптера включен режим WME, эта информация будет
отображаться с обычным статусом; эта команда наиболее полезна
для проверки параметров при отключенном режиме WME.
Смотрите описание
.Cm wme
директива для получения информации о различных параметрах.
.It Cm maxretry Ar count
Установите максимальное количество попыток отправки одноадресных кадров.
По умолчанию установлено значение 6, но драйверы могут переопределить его выбранным значением..
.It Cm mcastrate Ar rate
Установите скорость передачи кадров многоадресной/широковещательной рассылки.
Скорость указывается в десятичных мегабитах в секунду; например,\& 5,5 для 5,5 Мбит/с.
Эта ставка должна быть действительна для текущих условий эксплуатации;
если указан неверный тариф, драйверы могут свободно выбрать
соответствующий тариф.
.It Cm mgtrate Ar rate
Установите скорость передачи кадров управления и/или контроля.
Скорость указывается в десятичных мегабитах в секунду; например,\& 5,5 для 5,5 Мбит/с.
.It Cm outdoor
Установите местоположение, которое будет использоваться при расчете нормативных ограничений.
Местоположение также объявляется в кадрах ответа маяка и зонда.
когда 802.11d включен с помощью
.Cm точка .
Смотрите также
.Cm в любом месте ,
.Cm страна ,
.Cm indoor ,
и
.Cm regdomain .
.It Cm энергосбережение
Включите режим энергосбережения.
Работая в качестве клиента, станция будет экономить электроэнергию за счет
периодического выключения радио и прослушивания
сообщения от точки доступа о том, что ожидаются пакеты.
Затем станция должна получить пакеты.
Не все устройства поддерживают режим энергосбережения в качестве клиента.
Спецификация 802.11 требует, чтобы все точки доступа поддерживали
энергосбережение, но некоторые драйверы этого не делают.
Используйте
.Fl powersave
для отключения режима энергосбережения при работе в качестве клиента.
.It Cm powersavesleep Ar sleep
Установите желаемое максимальное время энергосбережения в TU (1024 мкс).
По умолчанию максимальное время энергосбережения составляет 100 ТЕ.
.It Cm protmode Ar technique
Для интерфейсов, работающих в стандарте 802.11g, используйте указанный
.Ar technique
для защиты кадров OFDM в смешанной сети 11b/11g.
Набор действенных методик
.Cm off , cts
(CTS to self),
и
.Cm rtscts
(RTS/CTS).
Имена методов нечувствительны к регистру.
Не все устройства поддерживают
.Cm cts
как технику защиты.
.It Cm pureg
При работе в качестве точки доступа в режиме 802.11g разрешайте только
Станции с поддержкой 11g для подключения (станции, поддерживающие только 11b, не поддерживаются).
разрешено объединение).
Чтобы разрешить подключение станций только 11g и 11b, используйте
.Fl pureg .
.It Cm puren
При работе в качестве точки доступа в режиме 802.11n разрешайте только
Станции с поддержкой HT для подключения (устаревшим станциям не
разрешено объединение).
Чтобы разрешить связь как HT устаревшим станциям, используйте
.Fl puren .
.It Cm regdomain Ar sku
Установите нормативный домен, который будет использоваться при расчете нормативных ограничений.
для эксплуатации.
В частности набор доступных каналов, как работает беспроводное устройство,
будет работать на каналах, и максимальная мощность передачи, которая
может использоваться на канале, определяются этой настройкой.
Коды регдоменов (SKU) взяты из
.Pa /etc/regdomain.xml
а также могут
просматриваться с помощью
.Cm list country 
запрос.
Обратите внимание, что не все устройства поддерживают изменение регдомена по умолчанию.
параметр; обычно хранится в EEPROM.
Смотрите также
.Cm country ,
.Cm indoor ,
.Cm outdoor ,
и
.Cm anywhere .
.It Cm rifs
Включите использование уменьшенного межкадрового интервала (RIFS) при работе в 802.11n.
на канале HT.
Обратите внимание, что RIFS должен поддерживаться как станцией, так и точкой доступа.
чтобы его можно было использовать.
Чтобы отключить использование RIFS
.Fl rifs .
.It Cm roam:rate Ar rate
Установите порог контроля роуминга при работе в BSS.
.Ar rate
параметр определяет скорость передачи в мегабитах
при этом следует учитывать роуминг.
Если текущая скорость передачи упадет ниже этой настройки и включено фоновое сканирование, 
то система проверит, есть ли более желательная точка доступа.
и переключтся на него.
Текущее содержимое кэша сканирования используется, если оно считается
действительным в соответствии с
.Cm scanvalid
параметр; в противном случае операция фонового сканирования запускается раньше
происходит любой выбор.
Каждый тип канала имеет отдельный порог скорости; значения по умолчанию:
12 Мбит/с (11a), 2 Мбит/с (11b), 2 Мбит/с (11g), MCS 1 (11na, 11ng).
.It Cm roam:rssi Ar rssi
Установите порог контроля роуминга при работе в BSS.
.Ar rssi
параметр определяет мощность принимаемого сигнала в единицах dBm.
при этом следует учитывать роуминг.
Если текущий rssi упадет ниже этой настройки и фоновое сканирование
включено, то система проверит, есть ли более желательная точка доступа.
и переключится на нее.
Текущее содержимое кэша сканирования используется, если оно считается
действительным в соответствии с
.Cm scanvalid
параметр; в противном случае операция фонового сканирования запускается раньше и
происходит любой выбор.
Каждый тип канала имеет отдельный порог rssi; значения по умолчанию:
все 7 dBm.
.It Cm roaming Ar mode
При работе в качестве станции контролируйте, как система будет
вести себя при связи с текущей точкой доступа.
.Ar mode
аргумент может быть одним из
.Cm device
(оставьте это на усмотрение аппаратного устройства),
.Cm auto
(обрабатывать либо на устройстве, либо в операционной системе\[em]в зависимости от ситуации),
.Cm manual
(ничего не делать, пока не будет получено явное указание).
По умолчанию устройство может справиться с этим, если оно
способно; в противном случае операционная система автоматически
попытаться восстановить связь.
Ручной режим используется такими приложениями, как
.It Cm rtsthreshold Ar length
Установите порог, при котором
передаваемым кадрам предшествует передача
РТС
контрольный кадр.
.Ar length
аргумент
— размер кадра в байтах который должен находиться в диапазоне от 1 до 2346.
Параметр
.Ar length
к
.Li 2346 ,
.Cm any ,
или
.Cm -
Запустите сканирование соседних станций, дождитесь его завершения и
отобразите все найденные станции.
Только суперпользователь может инициировать сканирование.
Чтобы видеть
.It Cm scan
Запустите сканирование соседних станций, дождитесь его завершения и
отобразите все найденные станции.
Только суперпользователь может инициировать сканирование.
.Cm list scan
для получения информации на дисплее.
По умолчанию выполняется фоновое сканирование; иначе передний план
сканирования завершен, и станция может перейти к другой точке доступа.
.Cm list scan
запрос можно использовать для отображения последних результатов сканирования без
запуска нового сканирования.
.It Cm scanvalid Ar threshold
Установите максимальное время, в течение которого содержимое кэша сканирования считается действительным;
т. е. будет использоваться без предварительного запуска операции сканирования для
обновить данные.
.Ar threshold
Параметр указывается в секундах и по умолчанию равен 60 секундам.
Минимальная настройка для
.Ar threshold
составляет 10 секунд.
Следует позаботиться об установлении этого порога; если он установлен слишком низко
тогда попытки роуминга к другой точке доступа могут вызвать ненужные
операции фонового сканирования.
.It Cm shortgi
Включите использование короткого защитного интервала при работе в 802.11n.
на канале HT.
Примечание: в настоящее время Short GI включен как на каналах HT40, так и на HT20.
Чтобы отключить использование Short GI
.Fl shortgi .
.It Cm smps
Включите использование энергосбережения статического пространственного мультиплексирования (SMPS).
при работе в 802.11n.
Станция, работающая со статическим ИИП, поддерживает только один
получать цепочку активной (это позволяет существенно снизить энергопотребление).
Чтобы отключить SMPS, используйте
.Fl smps .
.It Cm smpsdyn
Включите использование энергосбережения динамического пространственного мультиплексирования (SMPS).
при работе в 802.11n.
Станция, работающая с динамическим ИИП, поддерживает только одина
цепочка приема активна, но переключается на несколько цепочек приема, когда она
получает кадр RTS (это позволяет существенно снизить энергопотребление).
Обратите внимание, что станции не могут различать RTS/CTS, предназначенные для
включить несколько цепочек приема и те, которые используются для других целей.
Чтобы отключить SMPS, используйте
.Fl smps .
.It Cm ssid Ar ssid
Установите желаемый идентификатор набора услуг (также известный как имя сети).
SSID представляет собой строку длиной до 32 символов.
по длине и может быть указан либо как обычная строка, либо в виде
шестнадцатеричный, если ему предшествует
.Ql 0x .
Кроме того, SSID можно очистить, установив для него значение
.Ql - .
.It Cm tdmaslot Ar slot
При работе с TDMA используйте указанный
.Ar slot
конфигурация.
.Ar slot
представляет собой число от 0 до максимального количества слотов в BSS.
Обратите внимание, что станция, настроенная как слот 0, является ведущей и
будет транслировать кадры маяка, рекламирующие BSS;
станции, настроенные на использование других слотов, всегда будут
сканируйте, чтобы найти мастера, прежде чем он начнет передачу.
По умолчанию
.Cm tdmaslot
установлено на 1.
.It Cm tdmaslotcnt Ar cnt
При работе с TDMA настройте BSS со
.Ar cnt
слотами
Количество слотов может быть не более 8.
Текущая реализация тестируется только на двух станциях.
(т.е. приложения «точка-точка»).
Эта настройка имеет смысл только в том случае, если станция настроена как слот 0;
другие станции перенимают эту настройку из BSS, к которому они присоединяются.
По умолчанию
.Cm tdmaslotcnt
установлено на 2.
.It Cm tdmaslotlen Ar len
При работе с TDMA настройте BSS так, чтобы каждая станция имела слот
.Ar len
длиной в микросекунды.
Длина слота должна быть не менее 150 микросекунд (1/8 TU).
и не более 65 миллисекунд.
Обратите внимание, что установка слишком маленькой длины слота может привести к ухудшению качества канала.
использование полосы пропускания из-за таких факторов, как степень детализации таймера и
время охраны.
Эта настройка имеет смысл только в том случае, если станция настроена как слот 0;
другие станции перенимают эту настройку из BSS, к которому они присоединяются.
По умолчанию
.Cm tdmaslotlen
установлено значение 10 миллисекунд.
.It Cm tdmabintval Ar intval
При работе с TDMA настройте BSS так, чтобы маяки передавались каждый раз.
.Ar intval
суперкадры для синхронизации времени слота TDMA.
Суперкадр определяется как количество слотов, умноженное на длину слота; например,
BSS с двумя слотами по 10 миллисекунд имеет суперкадр длительностью 20 миллисекунд.
Интервал маяка не может быть нулевым.
Более низкая настройка
приводит к более частой ресинхронизации таймеров; это может помочь, если
наблюдается значительный дрейф таймера.
По умолчанию
.Cm tdmabintval
установлено на 5.
.It Cm tsn
При работе в качестве точки доступа с WPA/802.11i разрешайте устаревшие
станции для связывания с использованием статического ключа WEP и открытой аутентификации.
Чтобы запретить устаревшей станции использовать WEP, используйте
.Fl tsn .
.It Cm txpower Ar power
Установите мощность, используемую для передачи кадров.
.Ar power
Аргумент указывается в единицах 0,5 дБм.
Значения, выходящие за пределы диапазона, обрезаются.
Обычно доступно только несколько дискретных настроек мощности.
драйвер будет использовать настройку, наиболее близкую к указанному значению.
Не все адаптеры поддерживают изменение мощности передачи.
.It Cm ucastrate Ar скорость
Установите фиксированную скорость для передачи одноадресных кадров.
Скорость указывается в десятичных мегабитах в секунду; например,\& 5,5 для 5,5 Мбит/с.
Эта ставка должна быть действительна для текущих условий эксплуатации;
если указан неверный тариф, водители могут свободно выбрать
соответствующий тариф.
.It Cm wepmode Ar mode
Установите желаемый режим WEP.
Не все адаптеры поддерживают все режимы.
Набор допустимых режимов
.Cm off , on ,
и
.Cm mixed .
.Cm mixed
режим явно сообщает адаптеру разрешить ассоциацию с доступом
точки, которые разрешают как зашифрованный, так и незашифрованный трафик.
На этих адаптерах
.Cm on
означает, что точка доступа должна разрешать только зашифрованные соединения.
На других адаптерах
.Cm on
вообще-то это другое название
.Cm mixed .
Режимы нечувствительны к регистру.
.It Cm weptxkey Ar index
Установите ключ WEP, который будет использоваться для передачи.
Это то же самое, что установить ключ передачи по умолчанию с помощью
.Cm deftxkey .
.It Cm wepkey Ar key Ns | Ns Ar index : Ns Ar key
Установите выбранный ключ WEP.
Если
.Ar index
не задан, установлен ключ 1.
Ключ WEP будет иметь номер 5 или 13.
символов (40 или 104 бита) в зависимости от локальной сети и
возможности адаптера.
Он может быть указан либо как простой
строка или строка шестнадцатеричных цифр, которым предшествует
.Ql 0x .
Для максимальной мобильности рекомендуется использовать шестигранные ключи;
Сопоставление текстовых ключей с WEP-шифрованием обычно зависит от драйвера.
В частности, драйверы Windows выполняют это сопоставление иначе, чем
.Fx .
Ключ можно очистить, установив для него значение
.Ql - .
Если поддерживается WEP, то имеется как минимум четыре ключа.
Некоторые адаптеры поддерживают более четырех клавиш.
Если это так, то первые четыре клавиши
(1-4) будут стандартными временными ключами, а все остальные будут адаптером.
определенные ключи, такие как постоянные ключи, хранящиеся в NVRAM.
.Pp
Обратите внимание, что вы должны установить ключ передачи по умолчанию с помощью
.Cm deftxkey
чтобы система знала, какой ключ использовать для шифрования исходящего трафика.
.It Cm wme
Включите поддержку беспроводных мультимедийных расширений (WME), если она доступна.
для указанного интерфейса.
WME — это подмножество стандарта IEEE 802.11e, поддерживающее
эффективная передача данных в реальном времени и мультимедийных данных.
Чтобы отключить поддержку WME, используйте
.Fl wme .
Другое название этого параметра:
.Cm wmm .
.Pp
Следующие параметры имеют смысл только при использовании поддержки WME.
Параметры указаны для каждого AC (Категория доступа) и
разделить на те, которые используются станцией при действии
в качестве точки доступа и для клиентских станций в BSS.
Последние принимаются от точки доступа и не могут быть изменены.
(на станции).
Распознаются следующие категории доступа:
.Pp
.Bl -tag -width ".Cm AC_BK" -compact
.It Cm AC_BE
(или
.Cm BE )
доставка изо всех сил,
.It Cm AC_BK
(или
.Cm BK )
фоновый трафик,
.It Cm AC_VI
(или
.Cm VI )
видео трафик,
.It Cm AC_VO
(или
.Cm VO )
голосовой трафик.
.El
.Pp
Параметры AC не чувствительны к регистру.
Классификация трафика осуществляется в операционной системе с помощью
приоритет vlan, связанный с кадрами данных или
Индикация ToS (типа услуги) в кадрах, инкапсулированных по IP.
Если ни одна информация отсутствует, трафику назначается
Категория Best Effort (BE).
.Bl -tag -width indent
.It Cm ack Ar ac
Установите политику ACK для передач QoS локальной станцией;
это контролирует, будут ли кадры данных передаваться станцией
требуют ответа ACK от принимающей станции.
Чтобы отключить ожидание ACK, используйте
.Fl ack .
Этот параметр применяется только к местной станции.
.It Cm acm Ar ac
Включите механизм обязательного контроля допуска (ACM).
для передач местной станции.
Чтобы отключить ACM, используйте
.Fl acm .
На станциях BSS этот параметр доступен только для чтения и указывает
настройку, полученную от точки доступа.
Примечание. ACM в настоящее время не поддерживается.
.It Cm aifs Ar ac Ar count
Установите арбитражный межкадровый интервал (AIFS)
параметр доступа к каналу, используемый для передач
у местной станции.
На станциях BSS этот параметр доступен только для чтения и указывает
настройку, полученную от точки доступа.
.It Cm cwmin Ar ac Ar count
Установите параметр доступа к каналу CWmin, который будет использоваться для передач.
у местной станции.
На станциях BSS этот параметр доступен только для чтения и указывает
настройку, полученную от точки доступа.
.It Cm cwmax Ar ac Ar count
Установите параметр доступа к каналу CWmax, который будет использоваться для передач.
у местной станции.
На станциях BSS этот параметр доступен только для чтения и указывает
настройку, полученную от точки доступа.
.It Cm txoplimit Ar ac Ar limit
Установите параметр доступа к каналу «Ограничение возможностей передачи»
использовать для передач местной станции.
Этот параметр определяет интервал времени, в течение которого станция WME
имеет право инициировать передачу по беспроводной среде.
На станциях BSS этот параметр доступен только для чтения и указывает
настройку, полученную от точки доступа.
.It Cm bss:aifs Ar ac Ar count
Установите параметр доступа к каналу AIFS для отправки на станции в BSS.
Этот параметр имеет смысл только при работе в режиме ap.
.It Cm bss:cwmin Ar ac Ar count
Установите параметр доступа к каналу CWmin для отправки на станции в BSS.
Этот параметр имеет смысл только при работе в режиме ap.
.It Cm bss:cwmax Ar ac Ar count
Установите параметр доступа к каналу CWmax для отправки на станции в BSS.
Этот параметр имеет смысл только при работе в режиме ap.
.It Cm bss:txoplimit Ar ac Ar limit
Установите параметр доступа к каналу TxOpLimit для отправки на станции в BSS.
Этот параметр имеет смысл только при работе в режиме ap.
.El
.It Cm wps
Включите поддержку  Wireless Privacy Subscriber.
Обратите внимание, что для поддержки WPS требуется соискатель с поддержкой WPS.
Чтобы отключить эту функцию, используйте
.Fl wps .
.El
.Ss MAC-Based Access Control List Parameters
Следующие параметры поддерживают дополнительный список контроля доступа.
функция доступна для некоторых адаптеров при работе в режиме ap; видеть
.Xr wlan_acl 4 .
Эта функция позволяет точке доступа принимать/отклонять ассоциацию.
запросы на основе MAC-адреса станции.
Обратите внимание, что эта функция существенно не повышает безопасность.
поскольку подделать MAC-адрес легко.
.Bl -tag -width indent
.It Cm mac:add Ar address
Добавьте указанный MAC-адрес в базу данных.
В зависимости от настроек политики запросы на ассоциацию от
указанная станция будет разрешена или запрещена.
.It Cm mac:allow
Установите политику ACL, чтобы разрешить ассоциацию только
станции, зарегистрированные в базе данных.
.It Cm mac:del Ar address
Удалите указанный MAC-адрес из базы данных.
.It Cm mac:deny
Установите политику ACL, чтобы запретить ассоциацию только
станции, зарегистрированные в базе данных.
.It Cm mac:kick Ar address
Принудительно проведите деаутентификацию указанной станции.
Обычно это делается для блокировки станции после обновления
база данных адресов.
.It Cm mac:open
Установите политику ACL, чтобы разрешить объединение всех станций.
.It Cm mac:flush
Удалите все записи в базе данных.
.It Cm mac:radius
Установите политику ACL, чтобы разрешить ассоциацию только
станции, одобренные сервером RADIUS.
Обратите внимание, что для этой функции требуется
.Xr hostapd 8
программа должна быть настроена на правильные действия
поскольку он обрабатывает RADIUS
(и помечает станции как авторизованные).
.El
.Ss Mesh Mode Wireless Interface Parameters
Следующие параметры относятся к беспроводному интерфейсу, работающему в ячеистой сети.
режим:
.Bl -tag -width indent
.It Cm meshid Ar meshid
Установите желаемый идентификатор сетки.
Mesh ID представляет собой строку длиной до 32 символов.
Для интерфейса сетки должен быть указан идентификатор сетки.
для достижения рабочего состояния.
.It Cm meshttl Ar ttl
Установите желаемый
.Dq time to live
для пересылаемых пакетов;
это количество прыжков, через которое пакет может быть перенаправлен
оно отбрасывается.
Настройка по умолчанию для
.Cm meshttl
это 31.
.It Cm meshpeering
Включите или отключите пиринг с соседними ячеистыми станциями.
Станции должны быть равноправными, прежде чем можно будет обмениваться пакетами данных.
По умолчанию
.Cm meshpeering
включен.
.It Cm meshforward
Включите или отключите пересылку пакетов через ячеистый интерфейс.
По умолчанию
.Cm meshforward
включен.
.It Cm meshgate
Этот атрибут определяет, активирует ли ячеистая STA ворота ячеистой сети.
объявления.
По умолчанию
.Cm meshgate
выключен.
.It Cm meshmetric Ar protocol
Установите указанный
.Ar protocol
в качестве протокола метрики канала, используемого в ячеистой сети.
Протокол по умолчанию называется
.Ar AIRTIME .
Интерфейс сетки перезапустится после изменения этого параметра.
.It Cm meshpath Ar protocol
Установите указанный
.Ar protocol
в качестве протокола выбора пути, используемого в ячеистой сети.
Единственный доступный протокол на данный момент называется
.Ar HWMP
(Гибридный протокол беспроводной сети).
Интерфейс сетки перезапустится после изменения этого параметра.
.It Cm hwmprootmode Ar mode
Станции в ячеистой сети могут работать как
.Dq root nodes .
Корневые узлы пытаются найти пути ко всем узлам сетки и рекламируют себя.
регулярно.
Если в сети есть корневой узел сетки, другие узлы сетки могут настроить
пути между собой быстрее, потому что они могут использовать корневой узел
чтобы найти пункт назначения.
Этот путь, возможно, не лучший, но по требованию
маршрутизация в конечном итоге найдет лучший путь.
Распознаются следующие режимы:
.Pp
.Bl -tag -width ".Cm PROACTIVE" -compact
.It Cm DISABLED
Отключите корневой режим.
.It Cm NORMAL
Отправляйте запросы широковещательного пути каждые две секунды.
Узлы сетки без пути к этой корневой станции сетки с попыткой
открой путь к нам.
.It Cm PROACTIVE
Отправляйте запросы широковещательного пути каждые две секунды, и каждый узел должен ответить.
с ответом о пути, даже если у него уже есть путь к этой корневой станции сети.
.It Cm RANN
Отправка кадров широковещательного корневого объявления (RANN).
Узлы сетки без пути к этой корневой станции сетки с попыткой
открой путь к нам.
.El
По умолчанию
.Cm hwmprootmode
установлено на
.Ar DISABLED .
.It Cm hwmpmaxhops Ar cnt
Установите максимальное количество прыжков, разрешенное в пути HMWP, на
.Ar cnt .
Настройка по умолчанию для
.Cm hwmpmaxhops
31.
.El
.Ss Compatibility Parameters
Следующие параметры предназначены для совместимости с другими системами:
.Bl -tag -width indent
.It Cm nwid Ar ssid
Другое название для
.Cm ssid
параметр.
Включено для
.Nx
совместимость.
.It Cm stationname Ar name
Установите имя этой станции.
Название станции не является частью IEEE 802.11.
протокол, хотя некоторые интерфейсы его поддерживают.
Как таковое это только
кажется значимым для идентичного или практически идентичного оборудования.
Установка имени станции по синтаксису идентична настройке SSID.
Можно также использовать
.Cm station
для
.Bsx
совместимость.
.It Cm wep
Другой способ сказать
.Cm wepmode on .
Включено для
.Bsx
совместимость.
.It Fl wep
Другой способ сказать
.Cm wepmode off .
Включено для
.Bsx
совместимость.
.It Cm nwkey key
Другой способ сказать:
.Dq Li "wepmode on weptxkey 1 wepkey 1:key wepkey 2:- wepkey 3:- wepkey 4:-" .
Включено для
.Nx
совместимость.
.It Cm nwkey Xo
.Sm off
.Ar n : k1 , k2 , k3 , k4
.Sm on
.Xc
Другой способ сказать:
.Dq Li "wepmode on weptxkey n wepkey 1:k1 wepkey 2:k2 wepkey 3:k3 wepkey 4:k4" .
Включено для
.Nx
совместимость.
.It Fl nwkey
Другой способ сказать:
.Cm wepmode off .
Включено для
.Nx
совместимость.
.El
.Ss Bridge Interface Parameters
Следующие параметры являются специфичными для мостовых интерфейсов:
.Bl -tag -width indent
.It Cm addm Ar interface
Добавьте интерфейс с именем
.Ar interface
как участник моста.
Интерфейс переведен в беспорядочный режим
чтобы он мог получать каждый пакет, отправленный в сеть.
.It Cm deletem Ar interface
Удалите интерфейс, названный
.Ar interface
с моста.
Неразборчивый режим отключается на интерфейсе, когда
его снимают с моста.
.It Cm maxaddr Ar size
Установите размер кэша адресов моста на
.Ar size .
По умолчанию — 2000 записей.
.It Cm timeout Ar seconds
Установите тайм-аут записей кэша адресов на
.Ar seconds
секунды.
Если

.Ar seconds
равно нулю, то записи кэша адресов не будут просрочены.
Значение по умолчанию — 1200 секунд.
.It Cm addr
Отображение адресов, полученных мостом.
.It Cm static Ar interface-name Ar address
Добавьте статическую запись в кэш адресов, указывающую на
.Ar interface-name .
Статические записи никогда не удаляются из кэша и не перемещаются, даже если
адрес виден на другом интерфейсе.

.It Cm deladdr Ar address
Удалить
.Ar address
из кэша адресов.
.It Cm flush
Удалите все динамически полученные адреса из кэша адресов.
.It Cm flushall
Удалите все адреса, включая статические, из кэша адресов.
.It Cm discover Ar interface
Отметить интерфейс как
.Dq discovering
интерфейс.
Когда у моста нет записи в кэше адресов
(либо динамический, либо статический)
для адреса назначения пакета,
мост перешлет пакет всем
интерфейсы-члены, помеченные как
.Dq discovering .
Это значение по умолчанию для всех интерфейсов, добавленных к мосту.
.It Cm -discover Ar interface
Очистить
.Dq discovering
атрибут в интерфейсе участника.
Для пакетов без
.Dq discovering
атрибут, только пакеты, пересылаемые на интерфейс, являются широковещательными
или многоадресные пакеты и пакеты, для которых адрес назначения
известно, что он находится в сегменте интерфейса.
.It Cm learn Ar interface
Отметить интерфейс как
.Dq learning
интерфейс.
Когда пакет поступает на такой интерфейс, источник
адрес пакета вводится в кэш адресов как
адрес назначения в сегменте интерфейса.
Это значение по умолчанию для всех интерфейсов, добавленных к мосту.
.It Cm -learn Ar interface
Очистить
.Dq learning
атрибут в интерфейсе участника.
.It Cm sticky Ar interface
Отметить интерфейс как
.Dq sticky
interface.
интерфейс.
Записи динамически полученных адресов обрабатываются как статические после их ввода.
кэш.
Прикрепленные записи никогда не удаляются из кэша и не заменяются, даже если
адрес виден на другом интерфейсе.
.It Cm -sticky Ar interface
Очистить
.Dq sticky
атрибут в интерфейсе участника.
.It Cm private Ar interface
Отметить интерфейс как
.Dq private
interface.
интерфейс.
Частный интерфейс не перенаправляет трафик на другой порт, который также
частный интерфейс.
.It Cm -private Ar interface
Очистить
.Dq private
атрибут в интерфейсе участника.
.It Cm span Ar interface
Добавьте интерфейс с именем
.Ar interface
как пролетный порт на мосту.
Порты Span передают копию каждого кадра, полученного мостом.
Это наиболее полезно для пассивного слежения за мостовой сетью.
другой хост, подключенный к одному из портов моста.
.It Cm -span Ar interface
Удалить интерфейс, названный
.Ar interface
из списка пролетных портов моста.
.It Cm stp Ar interface
Включить протокол связующего дерева
.Ar interface .
.Xr if_bridge 4
Драйвер поддерживает протокол связующего дерева IEEE 802.1D (STP).
Spanning Tree используется для обнаружения и устранения петель в топологии сети.
.It Cm -stp Ar interface
Отключить протокол связующего дерева на
.Ar interface .
Это значение по умолчанию для всех интерфейсов, добавленных к мосту.
.It Cm edge Ar interface
Набор
.Ar interface
в качестве пограничного порта.
Граничный порт подключается напрямую к конечным станциям и не может создать мост.
петель в сети, это позволяет сразу перейти к пересылке.
.It Cm-edge Ar интерфейс
Отключить статус Edge вкл.
.Ar interface .
.It Cm autoedge Ar interface
Позволять
.Ar interface
для автоматического определения состояния края.
Это значение по умолчанию для всех интерфейсов, добавленных к мосту.
.It Cm -autoedge Ar interface
Отключить автоматический статус края
.Ar interface .
.It Cm ptp Ar interface
Установить
.Ar interface
как ссылка «точка-точка».
Это необходимо для прямых переходов к пересылке и
должен быть включен при прямом соединении с другим коммутатором с поддержкой RSTP.
.It Cm -ptp Ar interface
Отключить статус соединения «точка-точка»
.Ar interface .
Это должно быть отключено для полудуплексного канала и для интерфейса.
подключен к общему сегменту сети,
например, концентратор или беспроводная сеть.
.It Cm autoptp Ar interface
Автоматическое определение состояния точки-точки
.Ar interface
проверив состояние полнодуплексного соединения.
Это значение по умолчанию для интерфейсов, добавленных к мосту.
.It Cm -autoptp Ar interface
Отключить автоматическое обнаружение соединения «точка-точка» на
.Ar interface .
.It Cm maxage Ar seconds
Установите время, в течение которого конфигурация протокола связующего дерева действительна.
Значение по умолчанию — 20 секунд.
Минимальное значение — 6 секунд, максимальное — 40 секунд.
.It Cm fwddelay Ar seconds
Установите время, которое должно пройти, прежде чем интерфейс начнет пересылку
пакеты, когда включено связующее дерево.
По умолчанию — 15 секунд.
Минимум — 4 секунды, максимум — 30 секунд.
.It Cm hellotime Ar seconds
Установите время между трансляциями протокола Spanning Tree.
сообщения конфигурации.
Время приветствия можно изменить только при работе в устаревшем режиме stp.
По умолчанию — 2 секунды.
Минимальное значение — 1 секунда, максимальное — 2 секунды.
.It Cm priority Ar value
Установите приоритет моста для связующего дерева.
По умолчанию — 32768.
Минимальное значение — 0, максимальное — 61440.
.It Cm proto Ar value
Установите протокол связующего дерева.
По умолчанию — рстп.
Доступные варианты: stp и rstp.
.It Cm holdcnt Ar value
Установите счетчик удержания передачи для связующего дерева.
Это количество пакетов, переданных до ограничения скорости.
По умолчанию — 6.
Минимум — 1, максимум — 10.
.It Cm ifpriority Ar interface Ar value
Установите приоритет связующего дерева
.Ar interface
к
.Ar value .
По умолчанию — 128.
Минимальное значение — 0, максимальное — 240.
.It Cm ifpathcost Ar interface Ar value
Установите стоимость пути связующего дерева
.Ar interface
К
.Ar value .
Значение по умолчанию рассчитывается на основе скорости соединения.
Чтобы вернуть ранее выбранную стоимость пути на автоматическую, установите
стоимость до 0.
Минимум — 1, максимум — 200000000.
.It Cm ifmaxaddr Ar interface Ar size
Установите максимальное количество хостов, разрешенных для интерфейса, пакеты с неизвестными
исходные адреса удаляются до тех пор, пока не истечет срок действия существующей записи кэша хоста или не будет
удаленный.
Установите значение 0, чтобы отключить.
.El
.Ss Link Aggregation and Link Failover Parameters
Следующие параметры специфичны для лаговых интерфейсов:
.Bl -tag -width indent
.It Cm laggtype Ar type
При создании лагг-интерфейса тип может быть указан как
.Cm ethernet
или
.Cm infiniband .
Если не указано иное, Ethernet является типом задержки по умолчанию.
.It Cm laggport Ar interface
Добавьте интерфейс с именем
.Ar interface
в качестве порта интерфейса агрегации.
.It Cm -laggport Ar interface
Удалите интерфейс, названный
.Ar interface
из интерфейса агрегации.
.It Cm laggproto Ar proto
Установите протокол агрегации.
Значение по умолчанию:
.Li failover .
Доступные варианты:
.Li failover ,
.Li lacp ,
.Li loadbalance ,
.Li roundrobin ,
.Li broadcast
и
.Li none .
.It Cm lagghash Ar option Ns Oo , Ns Ar option Oc
Установите для уровней пакетов хеширование для протоколов агрегации, которые балансируют нагрузку.
Значение по умолчанию:
.Dq l2,l3,l4 .
Опции можно объединять запятыми.
.Pp
.Bl -tag -width ".Cm l2" -compact
.It Cm l2
Mac-адрес src/dst и дополнительный номер виртуальной локальной сети.
.It Cm l3
src/dst address for IPv4 or IPv6.
.It Cm l4
порт src/dst для TCP/UDP/SCTP.
.El
.It Cm -use_flowid
Включите локальное вычисление хеша для хэша RSS на интерфейсе.
.Li loadbalance
и
.Li lacp
режимы будут использовать хэш RSS с сетевой карты, если он доступен.
чтобы избежать вычисления, это может привести к плохому распределению трафика
если хэш недействителен или использует меньше информации заголовка протокола.
.Cm -use_flowid
отключает использование хеша RSS с сетевой карты.
Значение по умолчанию можно установить с помощью
.Va net.link.lagg.default_use_flowid
.Xr sysctl 8
переменная.
.Li 0
Означает
.Dq disabled
и
.Li 1
Означает
.Dq enabled .
.It Cm use_flowid
Используйте хэш RSS с сетевой карты, если он доступен.
.It Cm flowid_shift Ar number
Установите параметр сдвига для вычисления локального хэша RSS.
Хэш рассчитывается с использованием битов flowid в заголовке пакета mbuf.
которые сдвинуты на номер этого параметра.
.It Cm use_numa
Включить выбор выходных портов на основе собственных
.Xr numa 4
домен для передаваемых пакетов.
В настоящее время это реализовано только для режима lacp.
Это работает только на
.Xr numa 4
аппаратное обеспечение, работающее на ядре, скомпилированном с помощью
.Xr numa 4
вариант, и когда интерфейсы из нескольких
.Xr numa 4
домены — это порты интерфейса агрегации.
.It Cm -use_numa
Отключить выбор выходных портов на основе родного
.Xr numa 4
домен для передаваемых пакетов.
.It Cm lacp_fast_timeout
Включите быстрый таймаут lacp на интерфейсе.
.It Cm -lacp_fast_timeout
Отключите быстрый тайм-аут lacp на интерфейсе.
.It Cm lacp_strict
Включите строгое соответствие lacp на интерфейсе.
Значение по умолчанию можно установить с помощью
.Va net.link.lagg.lacp.default_strict_mode
.Xr sysctl 8
переменная.
.Li 0
Означает
.Dq disabled
и
.Li 1
Означает
.Dq enabled .
.It Cm -lacp_strict
Отключите строгое соответствие lacp на интерфейсе.
.It Cm rr_limit Ar number
Настройте шаг для интерфейса в циклическом режиме.
Шаг по умолчанию равен 1.
.El
.Ss Generic IP Tunnel Parameters
Следующие параметры применяются к интерфейсам IP-туннеля:
.Xr gif 4 :
.Bl -tag -width indent
.It Cm tunnel Ar src_addr dest_addr
Настройте физический адрес источника и назначения для IP-туннеля.
интерфейсы.
Аргументы
.Ar src_addr
и
.Ar dest_addr
интерпретируются как внешний источник/назначение для инкапсулирующей
Заголовок IPv4/IPv6.
.It Fl tunnel
Отмените настройку физического адреса источника и назначения для IP-туннеля.
интерфейсы, ранее настроенные с помощью
.Cm tunnel .
.It Cm deletetunnel
Другое название для
.Fl tunnel
параметр.
.It Cm accept_rev_ethip_ver
Установите флаг для приема как правильных пакетов EtherIP, так и пакетов EtherIP.
с перевернутым полем версии.
Включено по умолчанию.
Это для обратной совместимости с
.Fx 6.1 ,
6.2, 6.3, 7.0, и 7.1.
.It Cm -accept_rev_ethip_ver
Очистить флаг
.Cm accept_rev_ethip_ver .
.It Cm ignore_source
Установите флаг для приема инкапсулированных пакетов, предназначенных для этого хоста.
независимо от адреса источника.
Это может быть полезно для хостов, которые получают инкапсулированные пакеты.
от балансировщиков нагрузки.
.It Cm -ignore_source
Очистить флаг
.Cm ignore_source .
.It Cm send_rev_ethip_ver
Установите флаг для отправки пакетов EtherIP с обратной версией.
поле намеренно.
По умолчанию отключено.
Это для обратной совместимости с
.Fx 6.1 ,
6.2, 6.3, 7.0, и 7.1.
.It Cm -send_rev_ethip_ver
Очистить флаг
.Cm send_rev_ethip_ver .
.El
.Ss GRE Tunnel Parameters
Следующие параметры применяются к туннельным интерфейсам GRE:
.Xr gre 4 :
.Bl -tag -width indent
.It Cm tunnel Ar src_addr dest_addr
Настройте физический адрес источника и назначения для туннеля GRE.
интерфейсы.
Аргументы
.Ar src_addr
и
.Ar dest_addr
интерпретируются как внешний источник/назначение для инкапсулирующей
Заголовок IPv4/IPv6.
.It Fl tunnel
Отмените настройку физического адреса источника и назначения для туннеля GRE.
интерфейсы, ранее настроенные с помощью
.Cm tunnel .
.It Cm deletetunnel
Другое название для
.Fl tunnel
параметр.
.It Cm grekey Ar key
Настройте ключ GRE, который будет использоваться для исходящих пакетов.
Обратите внимание, что
.Xr gre 4 всегда будет принимать пакеты GRE с недействительными или отсутствующими ключами.
Эта команда приведет к уменьшению MTU на интерфейсе на четыре байта.
.El
.Ss Параметры синхронизации таблицы состояний фильтра пакетов
Следующие параметры специфичны для
.Xr pfsync 4
интерфейсы:
.Bl -tag -width indent
.It Cm syncdev Ar iface
Использовать указанный интерфейс
для отправки и получения сообщений синхронизации состояния pfsync.
.It Fl syncdev
Прекратите отправку сообщений синхронизации состояния pfsync по сети.
.It Cm syncpeer Ar peer_address
Сделайте ссылку pfsync «точка-точка», а не используйте
многоадресная рассылка для трансляции сообщений синхронизации состояния.
Peer_address — это IP-адрес другого хоста, участвующего в
кластер pfsync.
.It Fl syncpeer
Широковещательная рассылка пакетов с использованием многоадресной рассылки.
.It Cm maxupd Ar n
Установите максимальное количество обновлений для одного состояния, которое
можно свернуть в один.
Это 8-битное число; значение по умолчанию — 128.
.It Cm defer
Отложить передачу первого пакета в состоянии до тех пор, пока партнер не
подтвердил, что связанное состояние было вставлено.
.It Fl defer
Не откладывайте первый пакет в состоянии.
Это значение по умолчанию.
.El
.Ss VLAN Parameters
Следующие параметры специфичны для
.Xr vlan 4
интерфейсы:
.Bl -tag -width indent
.It Cm vlan Ar vlan_tag
Установите значение тега VLAN на
.Ar vlan_tag .
Это значение представляет собой 12-битный идентификатор VLAN (VID), который используется для создания сети 802.1Q.
или заголовок VLAN 802.1ad для пакетов, отправленных из
.Xr vlan 4
интерфейс.
Обратите внимание, что
.Cm vlan
и
.Cm vlandev
оба должны быть установлены одновременно.
.It Cm vlanproto Ar vlan_proto
Установите протокол инкапсуляции VLAN на
.Ar vlan_proto .
Supported encapsulation protocols are currently:
.Bl -tag
.It Cm 802.1Q
По умолчанию.
.It Cm 802.1ad
.It Cm QinQ
Такой же как
.Cm 802.1ad .
.El
.It Cm vlanpcp Ar priority_code_point
Код приоритета
.Pq Dv PCP
это 3-битное поле, которое относится к IEEE 802.1p.
класс обслуживания и соответствует уровню приоритета кадра.
.Pp
Values in order of priority are:
.Cm 1
.Pq Dv Background (lowest) ,
.Cm 0
.Pq Dv Best effort (default) ,
.Cm 2
.Pq Dv Excellent effort ,
.Cm 3
.Pq Dv Critical applications ,
.Cm 4
.Pq Dv Video, < 100ms latency and jitter ,
.Cm 5
.Pq Dv Voice, < 10ms latency and jitter ,
.Cm 6
.Pq Dv Internetwork control ,
.Cm 7
.Pq Dv Network control (highest) .
.It Cm vlandev Ar iface
Свяжите физический интерфейс
.Ar iface
с
.Xr vlan 4
интерфейсом.
Пакеты, передаваемые через
.Xr vlan 4
с
.Ar iface
с инкапсуляцией VLAN 802.1Q.
Получены пакеты с инкапсуляцией 802.1Q
родительским интерфейсом с правильным идентификатором VLAN будет перенаправлено на
связанный
.Xr vlan 4
псевдоинтерфейс.
.Xr vlan 4
интерфейсу присвоен
копия флагов родительского интерфейса и родительского адреса Ethernet.
.Cm vlandev
и
.Cm vlan
оба должны быть установлены одновременно.
Если
.Xr vlan 4
интерфейс уже есть
связанный с ним физический интерфейс, эта команда завершится неудачно.
К
изменить ассоциацию на другой физический интерфейс, существующий
ассоциацию необходимо сначала очистить.
.Pp
Примечание. Если возможность аппаратной маркировки
устанавливается на родительском интерфейсе,
.Xr vlan 4
псевдо
меняется поведение интерфейса:
.Xr vlan 4
интерфейс распознает, что
родительский интерфейс поддерживает вставку и извлечение тегов VLAN на своем
собственный (обычно в прошивке) и что он должен передавать пакеты туда и обратно
родитель без изменений.
.It Fl vlandev Op Ar iface
Если драйвер является
.Xr vlan 4
псевдоустройство, отключите от него родительский интерфейс.
Это разрывает связь между
.Xr vlan 4
с
.Ar iface
аргумент бесполезен и, следовательно, устарел.
.El
.Ss Virtual eXtensible LAN Parameters
Следующие параметры используются для настройки
.Xr vxlan 4
интерфейсы.
.Bl -tag -width indent
.It Cm vxlanid Ar identifier
Это значение представляет собой 24-битный идентификатор сети VXLAN (VNI), который идентифицирует
принадлежность интерфейса к сегменту виртуальной сети.
.It Cm vxlanremote Ar address
Интерфейс можно настроить в одноадресном или двухточечном режиме.
создать туннель между двумя хостами.
Это IP-адрес удаленного конца туннеля.
.It Cm vxlangroup Ar address
Интерфейс можно настроить в многоадресном режиме.
создать виртуальную сеть хостов.
Это адрес группы многоадресной IP-рассылки, к которой будет присоединен интерфейс.
.It Cm vxlanlocalport Ar port
Номер порта, который интерфейс будет прослушивать.
Номер порта по умолчанию — 4789.
.It Cm vxlanremoteport Ar port
Номер порта назначения, используемый в инкапсулирующем заголовке IPv4/IPv6.
Удаленный хост должен прослушивать этот порт.
Номер порта по умолчанию — 4789.
Обратите внимание на некоторые другие реализации, такие как Linux,
не используйте по умолчанию порт, назначенный IANA,
но вместо этого слушайте порт 8472.
.It Cm vxlanportrange Ar low high
Диапазон исходных портов, используемых в инкапсулирующем заголовке IPv4/IPv6.
Порт, выбранный в диапазоне, основан на хеше внутреннего фрейма.
Диапазон полезен для обеспечения энтропии во внешнем заголовке IP.
для более эффективной балансировки нагрузки.
Диапазон по умолчанию находится между
.Xr sysctl 8
Переменные
.Va net.inet.ip.portrange.first
и
.Va net.inet.ip.portrange.last
.It Cm vxlantimeout Ar timeout
Максимальное время в секундах до записи в таблице переадресации.
обрезается.
Значение по умолчанию — 1200 секунд (20 минут).
.It Cm vxlanmaxaddr Ar max
Максимальное количество записей в таблице пересылки.
По умолчанию — 2000.
.It Cm vxlandev Ar dev
Когда интерфейс настроен в многоадресном режиме,
.Cm dev
Интерфейс используется для передачи многоадресных IP-пакетов.
.It Cm vxlanttl Ar ttl
TTL, используемый в инкапсулирующем заголовке IPv4/IPv6.
По умолчанию — 64.
.It Cm vxlanlearn
IP-адрес источника и внутренний MAC-адрес источника Ethernet
полученные пакеты используются для динамического заполнения таблицы пересылки.
В режиме многоадресной рассылки запись в таблице пересылки позволяет
интерфейс для отправки кадра непосредственно на удаленный хост вместо
трансляция кадра в группу многоадресной рассылки.
Это значение по умолчанию.
.It Fl vxlanlearn
Таблица пересылки не заполняется полученными пакетами.
.It Cm vxlanflush
Удалите все динамически полученные адреса из таблицы пересылки.
.It Cm vxlanflushall
Удалите все адреса, включая статические, из таблицы пересылки.
.El
.Ss CARP Parameters
Следующие параметры используются для настройки
.Xr carp 4
протокол на интерфейсе:
.Bl -tag -width indent
.It Cm vhid Ar n
Установите идентификатор виртуального хоста.
Это обязательная настройка для запуска
.Xr carp 4 .
Если идентификатор виртуального хоста еще не существует, он создается и прикрепляется к
интерфейс, в противном случае конфигурация существующего VID будет изменена.
Если
.Cm vhid
Ключевое слово предоставляется вместе с
.Dq inet6
или
.Dq inet
адрес, то этот адрес настроен для работы под управлением
указан видид.
Всякий раз, когда последний адрес, ссылающийся на конкретный VID, удаляется из
интерфейс, VID автоматически удаляется из интерфейса и уничтожается.
Любые другие параметры конфигурации для
.Xr carp 4
протокол должен быть предоставлен вместе с
.Cm vhid
ключевое слово.
Допустимые значения vhid — от 1 до 255.
.It Cm advbase Ar seconds
Указывает базовый интервал объявления в секундах.
Допустимые значения: от 1 до 255.
Значение по умолчанию — 1.
.It Cm advskew Ar interval
Указывает сдвиг, добавляемый к базовому интервалу объявлений, чтобы
заставить один хост рекламировать медленнее, чем другой хост.
Указывается в 1/256 секунды.
Допустимые значения: от 1 до 254.
Значение по умолчанию — 0.
.It Cm pass Ar phrase
Установите ключ аутентификации на
.Ar phrase .
.It Cm state Ar state
Принудительно изменить состояние данного VID.
Признаются следующие государства:
.Cm MASTER
и
.Cm BACKUP .
.It Cm peer Ar address
Установите адрес для отправки (IPv4)
.Xr carp 4
объявления для.
.It Cm mcast
Восстановите адрес назначения по умолчанию для (IPv4)
.Xr carp 4
объявления, то есть 224.0.0.18.
.It Cm peer6 Ar address
Установите адрес для отправки (IPv6)
.Xr carp 4
объявления для.
.It Cm mcast6
Восстановите адрес назначения по умолчанию для (IPv4)
.Xr carp 4
объявления, то есть ff02::12.
.El
.Sh Среда
Следующие переменные среды влияют на выполнение
.Nm :
.Bl -tag -width IFCONFIG_FORMAT
.It Ev IFCONFIG_FORMAT
Эта переменная может содержать спецификацию выходного формата.
Смотрите описание
.Fl f
флаг для более подробной информации.
.El
.Sh Примеры
Назначьте адрес IPv4
.Li 192.0.2.10 ,
с сетевой маской
.Li 255.255.255.0 ,
к интерфейсу
.Li em0 :
.Dl # ifconfig em0 inet 192.0.2.10 netmask 255.255.255.0
.Pp
Добавьте IPv4-адрес
.Li 192.0.2.45 ,
с сетевым префиксом CIDR
.Li /28 ,
к интерфейсу
.Li em0 :
.Dl # ifconfig em0 inet 192.0.2.45/28 alias
.Pp
Удалить IPv4-адрес
.Li 192.0.2.45
из интерфейса
.Li em0 :
.Dl # ifconfig em0 inet 192.0.2.45 -alias
.Pp
Включите функциональность IPv6 интерфейса:
.Dl # ifconfig em0 inet6 -ifdisabled
.Pp
Добавьте IPv6-адрес
.Li 2001:DB8:DBDB::123/48
к интерфейсу
.Li em0 :
.Dl # ifconfig em0 inet6 2001:db8:bdbd::123 prefixlen 48 alias
Обратите внимание, что шестнадцатеричные адреса IPv6 в нижнем регистре допускаются.
.Pp
Удалите адрес IPv6, добавленный в приведенном выше примере.
используя
.Li /
символ как сокращение префикса сети:
.Dl # ifconfig em0 inet6 2001:db8:bdbd::123/48 -alias
.Pp
Настройте один резервный адрес CARP на igb0, а затем переключите его.
быть хозяином:
.Bd -literal -offset indent -compact
# ifconfig igb0 vhid 1 10.0.0.1/24 pass foobar up
# ifconfig igb0 vhid 1 state master
.Ed
.Pp
Настройка интерфейса
.Li xl0 ,
Чтобы использовать 100baseTX, варианты полнодуплексной среды Ethernet:
.Dl # ifconfig xl0 media 100baseTX mediaopt full-duplex
.Pp
Пометьте интерфейс em0 как восходящий канал:
.Dl # ifconfig em0 description \&"Uplink to Gigabit Switch 2\&"
.Pp
Создайте сетевой интерфейс программного обеспечения
.Li gif1 :
.Dl # ifconfig gif1 create
.Pp
Уничтожить сетевой интерфейс программного обеспечения
.Li gif1 :
.Dl # ifconfig gif1 destroy
.Pp
Отображение доступных беспроводных сетей с помощью
.Li wlan0 :
.Dl # ifconfig wlan0 list scan
.Pp
Отображение масок подсети адресов inet и inet6 в нотации CIDR.
.Dl # ifconfig -f inet:cidr,inet6:cidr
.Pp
Отображать работающие интерфейсы, за исключением шлейфа.
.Dl # ifconfig -a -u -G lo
.Pp
Отобразите список имен интерфейсов, принадлежащих группе wlan:
.Bd -literal -offset indent -compact
# ifconfig -g wlan
wlan0
wlan1
.Ed
.Pp
Отобразить подробную информацию об интерфейсах, принадлежащих группе wlan:
.Bd -literal -offset indent -compact
# ifconfig -a -g wlan
wlan0: flags=8843<UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> metric 0 mtu 1500
        ether 75:4c:61:6b:7a:73
        inet6 fe80::4c75:636a:616e:ffd8%wlan0 prefixlen 64 scopeid 0x3
        inet6 2001:5761:6e64:6152:6f6d:616e:fea4:ffe2 prefixlen 64 autoconf
        inet 192.168.10.5 netmask 0xffffff00 broadcast 192.168.10.255
        groups: wlan
        ssid "Hotspot" channel 11 (2462 MHz 11g) bssid 12:34:ff:ff:43:21
        regdomain ETSI country DE authmode WPA2/802.11i privacy ON
        deftxkey UNDEF AES-CCM 2:128-bit AES-CCM 3:128-bit txpower 30 bmiss 10
        scanvalid 60 protmode CTS wme roaming MANUAL
        parent interface: iwm0
        media: IEEE 802.11 Wireless Ethernet DS/2Mbps mode 11g
        status: associated
        nd6 options=23<PERFORMNUD,ACCEPT_RTADV,AUTO_LINKLOCAL>
wlan1: flags=8843<UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> metric 0 mtu 1500
        ether 00:50:69:6f:74:72
        groups: wlan
        ssid "" channel 2 (2417 MHz 11g)
        regdomain FCC country US authmode OPEN privacy OFF txpower 30 bmiss 7
        scanvalid 60 bgscan bgscanintvl 300 bgscanidle 250 roam:rssi 7
        roam:rate 5 protmode CTS wme bintval 0
        parent interface: rum0
        media: IEEE 802.11 Wireless Ethernet autoselect (autoselect)
        status: no carrier
        nd6 options=29<PERFORMNUD,IFDISABLED,AUTO_LINKLOCAL>
.Ed
.Pp
Установите случайно сгенерированный MAC-адрес на Tap0:
.Dl # ifconfig tap0 ether random
.Sh ДИАГНОСТИКА
Сообщения о том, что указанный интерфейс не существует,
запрошенный адрес неизвестен, или пользователь не имеет привилегий и
попытался изменить конфигурацию интерфейса.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr netstat 1 ,
.Xr carp 4 ,
.Xr gif 4 ,
.Xr netintro 4 ,
.Xr pfsync 4 ,
.Xr polling 4 ,
.Xr vlan 4 ,
.Xr vxlan 4 ,
.Xr devd.conf 5 ,
.Xr devd 8 ,
.Xr jail 8 ,
.Xr rc 8 ,
.Xr routed 8 ,
.Xr sysctl 8
.Sh ИСТОРИЯ
.Nm
утилита появилась в
.Bx 4.2 .
.Sh ОШИБКИ
Для базовой работы узла IPv6 требуется локальный адрес канала на каждом
интерфейс настроен для IPv6.
Обычно такой адрес автоматически настраивается
ядро на каждом интерфейсе, добавленном в систему или включенном; такое поведение может
отключить, установив флаг для каждого интерфейса
.Cm -auto_linklocal .
Значение этого флага по умолчанию — 1, и его можно отключить с помощью команды sysctl.
Переменная MIB
.Va net.inet6.ip6.auto_linklocal .
.Pp
Не настраивайте адреса IPv6 без локального адреса с помощью
.Nm .
Это может привести к неожиданному поведению ядра.
