melkorbsd/ru-freebsd-man/man8/ifmcstat.8
.\" Авторские права (c) 2007-2009 Брюс Симпсон.
.\" Авторские права (C) 1995, 1996, 1997, 1998 и 1999 Проект WIDE.
.\" Все права защищены.
.\"
.\" Перераспределение и использование в исходной и двоичной формах, с изменениями или без,
.\" разрешаются при условии соблюдения следующих условий:
.\" 1. Перераспределения исходного кода должны сохранять вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности.
.\" 2. Перераспределения в двоичной форме должны воспроизводить вышеуказанное уведомление об авторских правах,
.\"    этот список условий и следующее отказ от ответственности в
.\"    документации и/или других материалах, предоставляемых с распространением.
.\" 3. Название проекта и имена его участников
.\"    не могут быть использованы для поддержки или продвижения продуктов, производных от этого программного обеспечения,
.\"    без специального предварительного письменного разрешения.
.\"
.\" ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ПРОЕКТОМ И УЧАСТНИКАМИ «КАК ЕСТЬ» И
.\" ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ
.\" ТОВАРНОЙ ПРИГОДНОСТИ И ПРИСПОСОБЛЕННОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКЛОНЯЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ПРОЕКТ
.\" ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ,
.\" ЭКЗЕМПЛЯРНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ УЩЕРБЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПРИОБРЕТЕНИЕ ЗАМЕСТИТЕЛЬНЫХ ТОВАРОВ
.\" ИЛИ УСЛУГ; ПОТЕРЮ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПРЕРЫВАНИЕ БИЗНЕСА)
.\" ОДНАКО ВЫЗВАННЫЕ И НА ОСНОВАНИИ ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В ДОГОВОРЕ, СТРОГОЙ
.\" ОТВЕТСТВЕННОСТИ ИЛИ ДЕЛИКТЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ИНАЧЕ) ВОЗНИКАЮЩИЕ ЛЮБЫМ ОБРАЗОМ
.\" ИСПОЛЬЗОВАНИЕ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.Dd 27 мая 2009 года
.Dt IFMCSTAT 8
.Os
.Sh ИМЯ
.Nm ifmcstat
.Nd вывод статистики управления группами многоадресной рассылки по интерфейсу
.Sh СИНТАКСИС
.Nm
.Op Fl i Ar интерфейс
.Op Fl f Ar семейство-адресов
.Op Fl v
.Op Fl K
.Op Fl M Ar ядро
.Op Fl N Ar система
.\"
.Sh ОПИСАНИЕ
Команда
.Nm
выводит информацию о группах многоадресной рассылки из ядра.
.Pp
Поддерживаются следующие опции:
.Bl -tag -width Fl
.It Fl i Ar интерфейс
указывает интерфейс для отображения.
.It Fl f Ar семейство-адресов
указывает семейство адресов для отображения;
.Ar inet ,
.Ar inet6
и
.Ar link
поддерживаются.
.It Fl v
указывает, что членства на уровне канального слоя должны быть напечатаны;
по умолчанию они подавляются.
Не может быть указан для
.Fl f Ar link .
Также будут напечатаны списки источников для каждой группы.
.Pp
Если указано дважды, и используется
.Xr kvm 3,
также будут напечатаны таймеры управления для каждого интерфейса
и счетчики списков источников для каждой группы.
.El
.Pp
Следующие опции доступны только если
.Nm
был собран с поддержкой
.Xr kvm 3 :
.Bl -tag -width Fl
.It Fl K
пытается использовать
.Xr kvm 3
для извлечения информации о группах многоадресной рассылки.
.It Fl M Ar ядро
извлекает значения, связанные с именным списком, из указанного ядра,
вместо значения по умолчанию
.Pa /dev/kmem .
.It Fl N Ar система
извлекает именной список из указанного ядра вместо
значения по умолчанию, которое является образом ядра, с которого система была загружена.
.El
.Sh ЗАМЕТКИ О РЕАЛИЗАЦИИ
.Nm
всегда будет печатать встроенные идентификаторы области действия IPv6 для членства в группах многоадресной рассылки.Этот фрагмент описывает поведение какой-то программы или команды при использовании с определенными опциями. 
.Pp
Так как членство всегда ограничено интерфейсом.
.Pp
При запуске с опцией
.Fl v,
.Nm
может дважды печатать мультикастовые MAC-адреса, если они используются протоколом уровня 3.
.Pp
При запуске с поддержкой
.Xr kvm 3,
в первом столбце вывода будут напечатаны названия всех интерфейсов, настроенных в системе, даже если на этих интерфейсах нет членства в мультикастовых группах.
Вывод также может немного отличаться, поскольку структуры данных ядра обходятся с минимальной послепроцессингом вывода.
.Pp
Когда собран без поддержки
.Xr kvm 3,
информация, отображаемая
.Nm,
более ограничена.
Эта поддержка рекомендуется для целей отладки.
Для просмотра работающего ядра требуются права суперпользователя.
.Sh СМОТРИ ТАКЖЕ
.Xr netstat 1,
.Xr getifaddrs 3,
.Xr getifmaddrs 3,
.Xr kvm 3