melkorbsd/ru-freebsd-man/man8/intro.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)intro.8	8.2 (Berkeley) 12/11/93
.\"
.Dd Октябрь 22, 2006
.Dt INTRO 8
.Os
.Sh ИМЯ
.Nm intro
.Nd "введение в процедуры и команды обслуживания системы"
.Sh ОПИСАНИЕ
Этот раздел содержит информацию, связанную с эксплуатацией 
и обслуживанием системы.
.Pp
В нем описаны команды, используемые для создания новых файловых систем
.Pq Xr newfs 8 ,
проверки целостности файловых систем
.Pq Xr fsck 8 ,
контроля использования дискового пространства
.Pq Xr edquota 8 ,
создания резервных копий
.Pq Xr dump 8 ,
и восстанавления файлов в ситуациях, когда диски преждевременно выходят из строя 
.Pq Xr restore 8 .
.\" The
.\" .Xr format 8
.\" manual
.\" for the specific architecture the system is running on should be
.\" consulted when formatting disks and tapes.
Сетевые службы, такие как
.Xr inetd 8
and
.Xr ftpd 8
также рассмотрены.
.Pp
Все команды устанавливают статус завершения.
Его значение может проверяться, 
чтобы убедиться в правильном выполнении команды.
Если не указано иное (редко), значение 0 означает успешное
выполнение команды, а значения >0 обозначают ошибку.
Некоторые командаы пытаются описать природу сбоя, используя
коды ошибки, описанные в 
.Xr sysexits 3 ,
или устанавливают в качестве статуса произвольные значения >0 (обычно 1), но многие
такие значения не описываются в руководстве.
.Pp
A number of pages in this section describe general system
management topics.
Некоторые страницы этого раздела описывают общие темы,
связанные с управлением системой.
.Pp

Например, на странице руководства по загрузке(8) описывается загрузка системы
процедуры, а на странице руководства по бездисковой системе(8) описано, как загрузить
системы по сети. Чтобы понять, как интерпретировать сообщения о сбоях системы, следует ознакомиться со страницей руководства по сбою(8)
.


Например, страница руководства
.Xr boot 8
описывает процесс загрузки системы,
а страница
.Xr diskless 8
описывает загрузку системы по сети.
Чтобы понять, как интерпретировать снимки, создаваемые при сбоях системы,
следует ознакомиться со страницей
.Xr crash 8 .
.Sh ИСТОРИЯ
Страница руководства
.Nm
впервые появилась в 
.Bx 4.2 .
