melkorbsd/ru-freebsd-man/man8/route.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Распространение и использование в исходной и двоичной формах, с или без
.\" модификации, допускаются при соблюдении следующих условий:
.\" 
.\" 1. При повторном распространении исходного кода должно сохраняться вышеуказанное уведомление
.\"    об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. При распространении в двоичной форме в документации и/или других материалах, прилагаемых к дистрибутиву,
.\"    должны быть воспроизведены вышеуказанное уведомление об авторских правах,
.\"    этот список условий и нижеследующий отказ от ответственности.
.\" 3. Ни название университета, ни имена его сотрудников
.\"    не могут быть использованы для рекламы или продвижения продуктов, созданных на основе данного программного обеспечения,
.\"    без специального предварительного письменного разрешения.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ РЕГЕНТАМИ И АВТОРАМИ `КАК ЕСТЬ", И
.\" И МЫ ОТКАЗЫВАЕМСЯ ОТ ЛЮБЫХ ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ,
.\" ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ.
.\" НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ УПРАВЛЯЮЩИЕ ИЛИ СПОНСОРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА КАКИЕ-ЛИБО ПРЯМЫЕ,
.\" КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПОКАЗАТЕЛЬНЫЕ ИЛИ КОСВЕННОПОСЛЕДОВАТЕЛЬНЫЕ УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ,
.\" ПРИОБРЕТЕНИЕМ ЗАМЕНЯЮЩИХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЕЙ ВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ,
.\" ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ В РАБОТЕ), НЕЗАВИСИМО ОТ ПРИЧИНЫ И НА ОСНОВАНИИ ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ,
.\" БУДЬ ТО В РАМКАХ КОНТРАКТА, СТРОГОЙ ОТВЕТСТВЕННОСТИ ИЛИ ПРАВОНАРУШЕНИЯ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ НАРУШЕНИЕ),
.\" ВОЗНИКШЕГО КАКИМ-ЛИБО ОБРАЗОМ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ,
.\" ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ
.\" ТАКОГО УЩЕРБА.
.\"
.\"     @(#)route.8	8.3 (Berkeley) 3/19/94
.\"
.Dd Июнь 16, 2023
.Dt ROUTE 8
.Os
.Sh НАИМЕНОВАНИЕ
.Nm route
.Nd ручное управление таблицами маршрутизации
.Sh КРАТКИЙ ОБЗОР
.Nm
.Op Fl j Ar jail
.Op Fl dnqtv
.Ar command
.Oo
.Op Ar modifiers
.Ar args
.Oc
.Sh ОПИСАНИЕ

.Nm
утилита используется для ручного управления таблицами
сетевой маршрутизации.
Обычно он не требуется в качестве
даемона управления системной таблицей маршрутизации, такого как
.Xr routed 8 ,
следует позаботиться об этой задаче.
.Pp

.Nm
утилита поддерживает ограниченное количество общих параметров,
но богатый командный язык, позволяющий пользователю задать
любой произвольный запрос, который может быть отправлен через
программный интерфейс, описанный в
.Xr route 4 .
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl 4
Указать
.Cm inet
семейство адресов в качестве подсказки для подкомманд.
.It Fl 6
Указать
.Cm inet6
семейство адресов в качестве семейтва подсказки для подкомманд.
.It Fl d
Запустить только в режиме отладки, т.е. фактически не изменяя таблицу маршрутизации.
.It Fl n
Обходите попытки символической печати имен хостов и сетей
при составлении отчетов о действиях.
(Процесс перевода символьных
имен в цифровые эквиваленты может занимать довольно много времени и
может потребовать корректной работы сети; поэтому может оказаться целесообразным
забыть об этом, особенно при попытке восстановить работу сети).
.It Fl t
Запускается только в тестовом режиме.
.Pa /dev/null
используется вместо сокета.
.It Fl v
(подробно) Напечатать дополнительные сведения.
.It Fl q
Подавить все выходные данные из
.Cm add , change , delete ,
и
.Cm flush
комманды.
.It Fl j Ar jail
Запустить внутри jail.
.El
.Pp

.Nm
утилита предоставляет следующие команды:
.Pp
.Bl -tag -width Fl -compact
.It Cm add
Добавить маршрут.
.It Cm flush
Удалить все маршруты.
.It Cm delete
Удалить определенный маршрут.
.It Cm del
Другое название для этой
.Cm delete
комманды.
.It Cm change
Изменить аспекты маршрута (например, его шлюз).
.It Cm get
Выполнить поиск и отобразить маршрут для пункта назначения.
.It Cm monitor
Постоянно сообщает о любых изменениях в базе маршрутной информации,
ошибках при поиске маршрутов или подозрительных разделениях сети.
.It Cm show
Другое название для этой
.Cm get
комманды.
.El
.Pp
Команда monitor имеет следующий синтаксис:
.Pp
.Bd -ragged -offset indent -compact
.Nm
.Op Fl n
.Cm monitor Op Fl fib Ar number
.Ed
.Pp
Команда flush имеет следующий синтаксис:
.Pp
.Bd -ragged -offset indent -compact
.Nm
.Op Fl n
.Cm flush Oo Ar family Oc Op Fl fib Ar number
.Ed
.Pp
Если эта
.Cm flush
комманда указана,
.Nm
приведет к `очистке" таблиц маршрутизации всех записей шлюза.
Если семейство адресов может быть указано любым из
.Fl inet6 ,
или
.Fl inet
модификаторы, будут удалены только маршруты, имеющие пункты назначения с адресами из
указанного семейства.
Дополнительно,
.Fl 4
или
.Fl 6
может использоваться в качестве псевдонимов для
.Fl inet
и
.Fl inet6
модификаторов
Когда
.Fl fib
если задана опция, операция будет применена к
указанному волокну
.Pq routing table .
.Pp
Команда add имеет следующий синтаксис:
.Pp
.Bd -ragged -offset indent -compact
.Nm
.Op Fl n
.Cm add
.Op Fl net No \&| Fl host
.Ar destination gateway
.Op Ar netmask
.Op Fl fib Ar number
.Ed
.Pp
а остальные команды имеют следующий синтаксис:
.Pp
.Bd -ragged -offset indent -compact
.Nm
.Op Fl n
.Ar command
.Op Fl net No \&| Fl host
.Ar destination
.Op Ar gateway Op Ar netmask
.Op Fl fib Ar number
.Ed
.Pp
когда
.Ar destination
это конечный узел или сеть,
.Ar gateway
является промежуточным звеном на следующем этапе, через которое должны направляться пакеты.
Маршруты к конкретному хосту можно отличить от маршрутов к
сети, интерпретируя интернет-адрес, указанный в качестве
.Ar destination
аргумента
Необязательные модификаторы
.Fl net
и
.Fl host
принудительно интерпретировать назначение как сеть или хост, соответственно.
В противном случае, если
.Ar destination
имеет
.Dq local address part
от
INADDR_ANY
.Pq Li 0.0.0.0 ,
или если бы
.Ar destination
если это символическое имя сети, то
предполагается, что маршрут ведет к сети; в противном случае предполагается, что это
маршрут к хосту.
При желании это
.Ar destination
также может быть указано в
.Ar net Ns / Ns Ar bits
формате.
.Pp
Например,
.Li 128.32
интерпретируется как
.Fl host Li 128.0.0.32 ;
.Li 128.32.130
интерпретируется как
.Fl host Li 128.32.0.130 ;
.Fl net Li 128.32
интерпретируется как
.Li 128.32.0.0 ;
.Fl net Li 128.32.130
интерпретируется как
.Li 128.32.130.0 ;
и
.Li 192.168.64/20
интерпретируется как
.Fl net Li 192.168.64 Fl netmask Li 255.255.240.0 .
.Pp

.Ar destination
от
.Ar default
является синонимом маршрута по умолчанию.
Для
.Li IPv4
это
.Fl net Fl inet Li 0.0.0.0 ,
и для
.Li IPv6
это
.Fl net Fl inet6 Li :: .
.Pp
Если пункт назначения доступен напрямую
через интерфейс,
не требующий использования промежуточной системы в качестве шлюза, то
.Fl interface
должен быть указан модификатор;
указанный шлюз - это адрес этого хоста в общей сети,
указывающий на интерфейс, который будет использоваться для передачи данных.
С другой стороны, если интерфейс работает от точки к точке,
может быть указано название самого интерфейса, и в этом случае маршрут остается действительным,
если меняются локальный или удаленный адреса.
.Pp
Необязательный
.Fl netmask
модификатор предназначен
для достижения эффекта перенаправления OSI ES IS
с помощью параметра netmask
или для ручного добавления маршрутов подсети с
сетевыми масками, отличающимися от сетевых масок
подразумеваемого сетевого интерфейса
(которые в противном случае передавались бы с использованием протоколов маршрутизации OSPF или ISIS).
В одном из них указывается дополнительный параметр address
(который следует интерпретировать как сетевую маску).
Неявную сетевую маску, сгенерированную в случае AF_INET,
можно переопределить, убедившись, что этот параметр соответствует параметру назначения.
.Pp
Для
.Dv AF_INET6 ,

.Fl prefixlen
квалификатора
доступен вместо 
.Fl mask
квалификатора, поскольку в IPv6 не разрешены непрерывные маски.
Например,
.Fl prefixlen Li 32
указывает, что сетевая маска из
.Li ffff:ffff:0000:0000:0000:0000:0000:0000
будет использоваться.
Префиксlen по умолчанию равен 64.
Однако предполагается, что он равен 0, если
.Cm default
указывается для
.Ar destination .
Обратите внимание, что квалификатор работает только для
.Dv AF_INET6
семейство адрессов.
.Pp
С маршрутами связаны флаги, которые влияют на работу протоколов
при отправке в пункты назначения, соответствующие маршрутам.
ти флаги можно установить (или иногда снять)
указав следующие соответствующие модификаторы:
.Bd -literal
-xresolve  RTF_XRESOLVE   - выдает сообщение при использовании (для внешнего поиска)
-iface    ~RTF_GATEWAY    - до пункта назначения можно добраться напрямую
-static    RTF_STATIC     - маршрут, добавленный вручную
-nostatic ~RTF_STATIC     - представьте, что маршрут добавлен ядром или демоном
-reject    RTF_REJECT     - выдает сообщение ICMP, недоступное при совпадении
-blackhole RTF_BLACKHOLE  - автоматически удаляет pkt (во время обновлений)
-proto1    RTF_PROTO1     - установите флаг маршрутизации для конкретного протокола #1
-proto2    RTF_PROTO2     - установите флаг маршрутизации для конкретного протокола #2
.Ed
.Pp
Необязательные модификаторы
.Fl rtt ,
.Fl rttvar ,
.Fl sendpipe ,
.Fl recvpipe ,
.Fl mtu ,
.Fl hopcount ,
.Fl expire ,
и
.Fl ssthresh
укажите начальные значения величин, поддерживаемых в записи маршрутизации
протоколами транспортного уровня, такими как TCP или TP4.
Они могут быть заблокированы индивидуально, предшествуя каждому такому модификатору, 
который должен быть заблокирован с помощью

.Fl lock
meta-modifier, или может
указать, что все последующие показатели могут быть заблокированы с помощью.
.Fl lockrest
meta-modifier.
.Pp
Обратите внимание, что
.Fl expire
принимает время истечения срока действия маршрута за количество секунд, прошедших с момента
начала маршрута.
.Pq see Xr time 3 .
Когда первый символ числа яыляется
.Dq +
или
.Dq - ,
это значение интерпретируется как значение, относящееся к текущему времени.
.Pp
Необязательный модификатор
.Fl fib Ar number
указывает, что команда будет применена к FIB, не используемому по умолчанию.

.Ar number
должно быть меньше чем
.Va net.fibs
.Xr sysctl 8
MIB.
Если этот модификатор не указан,
или указано отрицательное число,
значение FIB по умолчанию, показанное в
.Va net.my_fibnum
.Xr sysctl 8
MIB будет использовано.
.Pp

.Ar number
допускает несколько подтасовок с помощью списка, разделенного запятыми, и/или
спецификации диапазона.

.Qq Fl fib Li 2,4,6
означает ложь под номерами 2, 4 и 6.

.Qq Fl fib Li 1,3-5,6
означает 1, 3, 4, 5 и 6.
.Pp
В
.Cm change
или
.Cm add
команда, в которой назначения и шлюза недостаточно для указания
маршрута (как в случае ISO, когда несколько интерфейсов могут иметь один и тот
же адрес),
.Fl ifp
или
.Fl ifa
модификаторы могут использоваться для определения интерфейса или адреса интерфейса.
.Pp
Все символьные имена, указанные для
.Ar destination
или
.Ar gateway
сначала ищутся как имя хоста с помощью
.Xr gethostbyname 3 .
Если этот поиск завершится неудачей,
.Xr getnetbyname 3
затем используется для интерпретации имени как названия сети.
.Pp

.Nm
утилита использует маршрутизирующий сокет и новые типы сообщений
.Dv RTM_ADD , RTM_DELETE , RTM_GET ,
и
.Dv RTM_CHANGE .
Таким образом, только суперпользователь может изменять
таблицы маршрутизации.
.Pp
.Fx provides support for scalable multipath routing.
Он активирован по умолчанию, но может быть отключен, установив
.Va net.route.multipath
.Xr sysctl 8
Значение MIB равное 0.
.Pp
Доступно несколько алгоритмов поиска маршрутов.
Их можно настроить, установив
.Va net.route.algo.inet.algo
для IPv4 и
.Va net.route.algo.inet6.algo
для IPv6
.Xr sysctl 8
MIBы.
.Pp
Список доступных алгоритмов можно получить, обратившись к
следующему
.Xr sysctl 8
MIBы
.Va net.route.algo.inet.algo_list
для IPv4 и
.Va net.route.algo.inet6.algo_list
для IPv6.
.Pp
Доступны следующие алгоритмы:
.Bl -tag -width radix_lockless
.It radix
Серверная часть базовой системы radix.
.It bsearch
Бинарный поиск без блокировки в специальном IP-массиве, адаптированном для небольшого FIB
с менее чем 16 маршрутами.
Этот алгоритм доступен только для IPv4.
.It radix_lockless
Неизменяемая система счисления без блокировки, воссоздаваемая при каждом изменении таблицы,
адаптирована для небольшого FIB с <1000 маршрутами.
.It dpdk_lpm
Поиск на основе DPDK DIR 24-8, структура данных без блокировки, оптимизированная
для больших объемов данных.
DIR 24-8 использует большую плоскую таблицу поиска (64 МБ с IPv4), которая
напрямую индексируется по более значимой части ключа поиска.
Для использования алгоритма dpdk_lpm один или оба из
следующих модулей ядра должны быть загружены через
.Xr loader.conf 5 :
.Bl -tag -width dpdk_lpm6.ko -compact
.It dpdk_lpm4.ko
Реализация DPDK для IPv4.
.It dpdk_lpm6.ko
Реализация DPDK для IPv6.
.El
.It dxr
Только IPv4, безблокировочная, сжатая структура поиска
(менее 2,5 байт на префикс IPv4 для больших файлов BGP)
которая легко вписывается в современные иерархии кэша процессора,
а пропускная способность поиска линейно зависит от ядер процессора.
Загружаемый как модуль ядра во время выполнения или через
.Xr loader.conf 5 :
.Bl -tag -width fib_dxr.ko -compact
.It fib_dxr.ko
.El
.El
.Pp
Алгоритмы выбираются автоматически в зависимости от размера таблицы маршрутизации
системы.
Их можно изменить, но не каждый алгоритм работает наилучшим образом для каждого конкретного случая.
Размер фибрилляции предсердий.
.Sh ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ
.Ex -std
.Sh ПРИМЕРЫ
Добавить маршрут по умолчанию в сетевую таблицу маршрутизации.
Это приведет к отправке всех пакетов для адресатов, недоступных в таблице маршрутизации,
на шлюз по умолчанию по адресу 192.168.1.1:
.Pp
.Dl route add -net 0.0.0.0/0 192.168.1.1
.Pp
Более короткая версия добавления маршрута по умолчанию также может быть записана в виде:
.Pp
.Dl route add default 192.168.1.1
.Pp
Добавить статический маршрут к сети 172.16.10.0/24 через шлюз 172.16.1.1:
.Pp
.Dl route add -net 172.16.10.0/24 172.16.1.1
.Pp
Изменить шлюз уже установленного статического маршрута в таблице маршрутизации:
.Pp
.Dl route change -net 172.16.10.0/24 172.16.1.2
.Pp
Отображение маршрута для сети назначения:
.Pp
.Dl route show 172.16.10.0
.Pp
Удалить статический маршрут из таблицы маршрутизации:
.Pp
.Dl route delete -net 172.16.10.0/24 172.16.1.2
.Pp
Удалить все маршруты из таблицы маршрутизации:
.Pp
.Dl route flush
.Pp
Таблица маршрутизации может быть указана с помощью
.Xr netstat 1 .
.Sh ДИАГНОСТИКА
.Bl -diag
.It "add [host \&| network ] %s: gateway %s flags %x"
Указанный маршрут добавляется в таблицы.

выводимые значения взяты из записи таблицы маршрутизации, предоставленной
при 
.Xr ioctl 2
вызове.
Если используемый адрес шлюза не был основным адресом шлюза
(первый адрес, возвращаемый с помощью
.Xr gethostbyname 3 ),
адрес шлюза выводится как в цифровом, так и в символьном виде.
.It "delete [ host \&| network ] %s: gateway %s flags %x"
Как указано выше, но при удалении записи.
.It "%s %s done"
Когда
.Cm flush
команда указана, каждая удаленная запись в таблице маршрутизации
отображается сообщением такого вида.
.It "Network is unreachable"
Попытка добавить маршрут завершилась неудачей, поскольку указанный шлюз не
был подключен к сети с прямым подключением.
Необходимо указать шлюз следующего перехода.
.It "not in table"
Была предпринята попытка удалить запись, которой
не было в таблицах.
.It "routing table overflow"
Была предпринята попытка выполнить операцию добавления, но системе
не хватало ресурсов, и она не смогла выделить память
для создания новой записи.
.It "gateway uses the same route"

.Cm change
в результате операции был создан маршрут, шлюз которого использует тот
же маршрут, что и изменяемый.
Шлюз следующего перехода должен быть доступен по другому маршруту.
.El
.Sh СМОТРЕТЬ ТАКЖЕ
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr route 4 ,
.Xr loader.conf 5 ,
.Xr arp 8 ,
.Xr routed 8
.Sh ИСТОРИЯ

.Nm
полезность появилась в
.Bx 4.2 .
.Sh BUGS
В первом абзаце могут быть слегка преувеличены 
.Xr routed 8 Ns 's
способности.
.Pp
В настоящее время для маршрутов с 
.Dv RTF_BLACKHOLE
установленным флагом необходимо, чтобы шлюз был настроен на экземпляр
.Xr lo 4
драйвер, использующий эту
.Fl iface
опцию, чтобы флажок имел какой-либо эффект; если только не включена быстрая переадресация по IP,
в этом случае значение флажка всегда
будет соблюдаться.
