melkorbsd/ru-freebsd-man/man8/sync.8
.\"-
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)sync.8	8.1 (Berkeley) 5/31/93
.\"
.Dd April 25, 2024
.Dt SYNC 8
.Os
.Sh ИМЯ
.Nm sync
.Nd принудительное завершение отложенных операций записи на диск (очистка кэша)
.Sh СИНТАКСИС
.Nm
.Sh ОПИСАНИЕ
Утилита
.Nm
может быть вызвана для того, чтобы убедиться, что все операции записи на диск были завершены до
того, как процессор будет остановлен способом, который не подходит для
.Xr reboot 8
или
.Xr halt 8 .
Как правило, предпочтительнее использовать
.Xr reboot 8
или
.Xr halt 8
чтобы выключить систему,
поскольку они могут выполнить дополнительные действия,
такие как повторная синхронизация аппаратных часов
и очистка внутреннего кэша перед выполнением окончательной
.Nm .
.Pp
Утилита
.Nm
использует вызов функции
.Xr sync 2 .
.Sh СМОТРИТЕ ТАКЖЕ
.Xr fsync 2 ,
.Xr sync 2 ,
.Xr syncer 4 ,
.Xr halt 8 ,
.Xr reboot 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.At v4 .
.Pp
На системах старше
.Bx 4.0 ,
такие команды как
.Xr reboot 8
и
.Xr halt 8
были недоступны.
Процедура завершения работы включала в себя запуск
.Nm ,
в ожидании, когда погаснут огни
и будет выключена машина.
.Pp
Выпуск трех отдельных команд
.Nm
(по одной строке каждая) был плацебо, которого как правило было достаточно на машинах
.At v7 ,
которые иначе были бы отключены.
Они были заменены однострочным
.Nm
в качестве замены ожиданию.
.Pp
Введенные в
.Bx 4.0
.Xr reboot 2
и
.Xr sync 2
сделали этот трюк устаревшим.
