melkorbsd/ru-freebsd-man/man8/sysctl.8
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	From: @(#)sysctl.8	8.1 (Berkeley) 6/6/93
.\"
.Dd August 18, 2023
.Dt SYSCTL 8
.Os
.Sh ИМЯ
.Nm sysctl
.Nd получает или устанавливает значения переменных состояния ядра
.Sh СИНТАКСИС
.Nm
.Op Fl bdeFhilNnoTtqWx
.Op Fl B Ar bufsize
.Op Fl f Ar filename
.Ar name Ns Op = Ns Ar value Ns Op , Ns Ar value
.Ar ...
.Nm
.Op Fl bdeFhlNnoTtqWx
.Op Fl B Ar bufsize
.Fl a
.Sh ОПИСАНИЕ
Утилита
.Nm
извлекает переменные состояния ядра и позволяет процессам с соответствующими
привилегиями устанавливать значения переменных состояния ядра.
Переменная состояния, который необходимо извлечь или установить, описывается с помощью
.Dq Management Information Base
.Pq Dq MIB
название стиля, описываемое в виде точечного набора
компонентов.
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl A
Эквивалентно
.Fl o a
(для обеспечения совместимости).
.It Fl a
Перечислить все доступные в данный момент значения, за исключением тех, которые являются
непрозрачными или исключены из списка с помощью
.Dv CTLFLAG_SKIP
флага.
Этот параметр игнорируется, если в командной строке указаны имена одной или нескольких переменных.
.It Fl b
Принудительно выводить значения переменных в необработанном двоичном формате.
Имена не печатаются и новые строки в конце не выводятся.
В основном это полезно для одной переменной.
.It Fl B Ar bufsize
Установить размер буфера чтения
.Nm
в
.Ar bufsize .
Это необходимо для
.Nm ,
который имеет переменную длину, а значение датчика, равное 0, является допустимой длиной, например
.Va kern.arandom .
.It Fl d
Выводить описание переменной вместо ее значения.
.It Fl e
Разделять имя и значение переменной(переменных) символом
.Ql = .
Это полезно для получения выходных данных, которые могут быть переданы обратно в
.Nm
утилиту.
Этот параметр игнорируется, если
.Fl N
или
.Fl n
указываются, или устанавливается переменная.
.It Fl f Ar filename
Указать файл, который содержит пары имя-значение в каждой строке.
.Nm
сначала считывает и обрабатывает указанный файл, а затем обрабатывает пары имени
и значения в аргументе командной строки.
.It Fl F
Выводит формат переменной.
Это дополнительная информация для описания типа переменной,
которая наиболее полезна при работе с такими структурными типами, как clockinfo, timeval и loadavg.
.It Fl h
Форматирет выходные данные для удобства чтения человеком, а не машиной.
.It Fl i
Игнорировать неизвестные идентификаторы объектов (OID).
Цель состоит в том, чтобы использовать
.Nm
для упрощения сбора данных с различных компьютеров (не обязательно на всех из которых
установлено одинаковое программное обеспечение).
.It Fl l
Показывать длину переменных вместе с их значениями.
Этот параметр нельзя комбинировать с
.Fl N
параметром.
.It Fl N
Отображать только имена переменных, но не их значения.
Это особенно полезно для оболочек, которые предлагают программируемое
дополнение.
Чтобы включить дополнение имен переменных в
.Xr zsh 1 Pq Pa ports/shells/zsh ,
используйте следующий код:
.Bd -literal -offset indent
listsysctls () { set -A reply $(sysctl -AN ${1%.*}) }
compctl -K listsysctls sysctl
.Ed
.Pp
Чтобы включить заполнение имен переменных в
.Xr tcsh 1 ,
используйте:
.Pp
.Dl "complete sysctl 'n/*/`sysctl -Na`/'"
.It Fl n
Не отображать имена переменных.
Эта опция полезна для настройки переменных оболочки.
Например, для сохранения размера страницы в переменной
.Va psize ,
используется:
.Pp
.Dl "set psize=`sysctl -n hw.pagesize`"
.It Fl o
Отображать непрозрачные переменные (которые обычно не отображаются).
Выводятся формат и длина, а также шестнадцатеричный дамп первых
шестнадцати байт значения.
.It Fl q
Перенаправить некоторые предупреждения, формируемые
.Nm ,
в стандартный вывод ошибок.
.It Fl T
Отображать только те переменные, которые можно настроить с помощью загрузчика (CTLFLAG_TUN).
.It Fl t
Выводить тип переменной.
.It Fl W
Отображать только доступные для записи переменные, которые не являются статистическими.
Полезно для определения набора настраиваемых во время выполнения системных списков.
.It Fl X
Эквивалентно
.Fl x a
(для обеспечения совместимости).
.It Fl x
Как
.Fl o ,
но выводит шестнадцатеричный дамп всего значения, а не только первые
несколько байт.
.El
.Pp
Информация, доступная из
.Nm
состоит из целых чисел, строк и непрозрачных типов.
Утилита
.Nm
знает только несколько непрозрачных типов, а
для остальных использует шестнадцатеричные данные.
Непрозрачная информация гораздо полезнее, если
ее извлекают специальные программы, такие как
.Xr ps 1 ,
.Xr systat 1 ,
и
.Xr netstat 1 .
.Pp
Некоторые переменные, которые не могут быть изменены при нормальной
работе системы, могут быть инициализированы с помощью настроек
.Xr loader 8 .
Это можно, например, сделать, установив их в
.Xr loader.conf 5 .
Смотрите
.Xr loader.conf 5
для получения дополнительной информации о том, какие настраиваемые параметры доступны и как их настроить.
.Pp
Информация о строках и целых числах приведена ниже.
Подробное описание этих переменных смотрите в
.Xr sysctl 3
и
.Xr security 7 .
.Pp
Изменяемый столбец указывает, может ли процесс с соответствующими
привилегиями изменять значение.
Строковые и целые значения можно задать с помощью
.Nm .
.Bl -column security.bsd.unprivileged_read_msgbuf integerxxx
.It Sy "Имя	Тип	Изменяемость"
.It "kern.ostype	string	no"
.It "kern.osrelease	string	no"
.It "kern.osrevision	integer	no"
.It "kern.version	string	no"
.It "kern.maxvnodes	integer	yes"
.It "kern.maxproc	integer	no"
.It "kern.maxprocperuid	integer	yes"
.It "kern.maxfiles	integer	yes"
.It "kern.maxfilesperproc	integer	yes"
.It "kern.argmax	integer	no"
.It "kern.securelevel	integer	raise only"
.It "kern.hostname	string	yes"
.It "kern.hostid	integer	yes"
.It "kern.clockrate	struct	no"
.It "kern.posix1version	integer	no"
.It "kern.ngroups	integer	no"
.It "kern.job_control	integer	no"
.It "kern.saved_ids	integer	no"
.It "kern.boottime	struct	no"
.It "kern.domainname	string	yes"
.It "kern.filedelay	integer	yes"
.It "kern.dirdelay	integer	yes"
.It "kern.metadelay	integer	yes"
.It "kern.osreldate	integer	no"
.It "kern.bootfile	string	yes"
.It "kern.corefile	string	yes"
.It "kern.logsigexit	integer	yes"
.It "security.bsd.suser_enabled	integer	yes"
.It "security.bsd.see_other_uids	integer	yes"
.It "security.bsd.see_other_gids	integer	yes"
.It "security.bsd.see_jail_proc	integer	yes"
.It "security.bsd.unprivileged_proc_debug	integer	yes"
.It "security.bsd.unprivileged_read_msgbuf	integer	yes"
.It "vm.loadavg	struct	no"
.It "hw.machine	string	no"
.It "hw.model	string	no"
.It "hw.ncpu	integer	no"
.It "hw.byteorder	integer	no"
.It "hw.physmem	integer	no"
.It "hw.usermem	integer	no"
.It "hw.pagesize	integer	no"
.It "hw.floatingpoint	integer	no"
.It "hw.machine_arch	string	no"
.It "hw.realmem	integer	no"
.It "machdep.adjkerntz	integer	yes"
.It "machdep.disable_rtc_set	integer	yes"
.It "machdep.guessed_bootdev	string	no"
.It "user.cs_path	string	no"
.It "user.bc_base_max	integer	no"
.It "user.bc_dim_max	integer	no"
.It "user.bc_scale_max	integer	no"
.It "user.bc_string_max	integer	no"
.It "user.coll_weights_max	integer	no"
.It "user.expr_nest_max	integer	no"
.It "user.line_max	integer	no"
.It "user.re_dup_max	integer	no"
.It "user.posix2_version	integer	no"
.It "user.posix2_c_bind	integer	no"
.It "user.posix2_c_dev	integer	no"
.It "user.posix2_char_term	integer	no"
.It "user.posix2_fort_dev	integer	no"
.It "user.posix2_fort_run	integer	no"
.It "user.posix2_localedef	integer	no"
.It "user.posix2_sw_dev	integer	no"
.It "user.posix2_upe	integer	no"
.It "user.stream_max	integer	no"
.It "user.tzname_max	integer	no"
.It "user.localbase	string	no"
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".In netinet/icmp_var.h" -compact
.It In sys/sysctl.h
определения идентификаторов верхнего уровня, идентификаторы второго уровня для ядра
и оборудования, а также идентификаторы пользовательского уровня
.It In sys/socket.h
определения сетевых идентификаторов второго уровня
.It In sys/gmon.h
определения идентификаторов профилирования третьего уровня
.It In vm/vm_param.h
определения идентификаторов виртуальной памяти второго уровня
.It In netinet/in.h
определения Интернет-идентификаторов третьего уровня и
IP-идентификаторов четвертого уровня
.It In netinet/icmp_var.h
определения для ICMP-идентификаторов четвертого уровня
.It In netinet/udp_var.h
определения для UDP-идентификаторов четвертого уровня
.El
.Sh ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
Утилита
.Nm
возвращает 0 при успешном завершении и число >0, если возникает ошибка.
.Ex -std
.Sh ПРИМЕРЫ
Например, чтобы получить максимальное количество процессов, разрешенных
в системе, можно было бы использовать следующий запрос:
.Pp
.Dl "sysctl kern.maxproc"
.Pp
Чтобы установить максимальное количество процессов, разрешенных
для каждого uid, равным 1000, можно было бы использовать следующий запрос:
.Pp
.Dl "sysctl kern.maxprocperuid=1000"
.Pp
Информацию о системной тактовой частоте можно получить с помощью:
.Pp
.Dl "sysctl kern.clockrate"
.Pp
Информацию о среднестатистической загрузке можно получить с помощью:
.Pp
.Dl "sysctl vm.loadavg"
.Pp
Существует гораздо больше переменных, и лучшим и, вероятно, единственным местом
для поиска их более глубокого значения, несомненно, является источник, в котором
они определены.
.Sh СОВМЕСТИМОСТЬ
Параметр
.Fl w
устарел и просто игнорируется.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr sysctl 3 ,
.Xr loader.conf 5 ,
.Xr sysctl.conf 5 ,
.Xr security 7,
.Xr loader 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Bx 4.4 .
.Pp
В
.Fx 2.2 ,
.Nm
был значительно переработан.
.Sh ПРОБЛЕМЫ
В настоящее время утилита
.Nm
использует недокументированный интерфейс ядра.
.Xr sysctl 9 ,
позволяющий просматривать дерево sysctl и извлекать информацию о формате
и названии.
В настоящее время разрабатывается правильный интерфейс.
