melkorbsd/ru-freebsd-man/man8/syslogd.8
.\" Copyright (c) 1983, 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)syslogd.8	8.1 (Berkeley) 6/6/93
.\"
.Dd July 2, 2018
.Dt SYSLOGD 8
.Os
.Sh ИМЯ
.Nm syslogd
.Nd регистрирует системные сообщения
.Sh СИНТАКСИС
.Nm
.Op Fl 468ACcdFHkNnosTuv
.Op Fl a Ar allowed_peer
.Op Fl b Ar bind_address
.Op Fl f Ar config_file
.Op Fl l Oo Ar mode Ns \&: Oc Ns Ar path
.Op Fl M Ar fwd_length
.Op Fl m Ar mark_interval
.Op Fl O Ar format
.Op Fl P Ar pid_file
.Op Fl p Ar log_socket
.Op Fl S Ar logpriv_socket
.Sh ОПИСАНИЕ
Утилита
.Nm
считывает и регистрирует сообщения в системной консоли,
в файлах журналов,
на других
компьютерах и/или у пользователей, как указано в ее конфигурационном файле.
.Pp
Возможны следующие параметры:
.Bl -tag -width indent
.It Fl 4
Принуждает
.Nm
использовать только IPv4-адреса.
.It Fl 6
Принуждает
.Nm
использовать только IPv6-адреса.
.It Fl 8
Указывает
.Nm
не вмешиваться в работу с 8-битными данными.
Обычно
.Nm
заменяет управляющие символы C1
.Pq ISO 8859 и символы Юникода
их
.Dq M- Ns Em x
эквивалентами.
Обратите внимание, что этот параметр не изменяет способ
.Nm
изменения управляющих символов
.Pq смотрите Xr iscntrl 3 .
Они всегда будут заменены на свои собственные
.Dq ^ Ns Em x
эквиваленты.
.It Fl A
Обычно,
.Nm
пытается отправить сообщение только на один адрес,
даже если хост имеет более одной записи A или AAAA.
Если задан этот параметр,
.Nm
пытается отправить сообщение по всем адресам.
.It Fl a Ar allowed_peer
Позволяет
.Ar allowed_peer
протоколирование через
.Nm
используя дейтаграммы UDP.
Может быть указано множество параметров
.Fl a .
.Pp
.Ar allowed_peer
параметром может быть любой из следующих:
.Bl -tag -width "ipaddr[/prefixlen][:service]XX"
.It Xo
.Sm off
.Ar ipaddr
.Op / Ar masklen
.Op \&: Ar service
.Pp
.Ar ipaddr
.Op / Ar prefixlen
.Op \&: Ar service
.Sm on
.Xc
Принимает дейтаграммы от
.Ar ipaddr ,
.Ar ipaddr
может быть указан как IPv4-адрес или как IPv6-адрес,
заключенный в
.Ql \&[
и
.Ql \&] .
Если указано,
.Ar service
- это имя или номер службы UDP (см.
.Xr services 5 ),
которой должен принадлежать исходный пакет.
Значение параметра
.Ar service
равное
.Ql \&*
позволяет принимать UDP-пакеты
с любого исходного порта.
По умолчанию
.Ar service
это
.Ql syslog .
Если
.Ar ipaddr
это IPv4-адрес, отсутствующий
.Ar masklen
будет заменен историческими сетевыми масками класса A или класса B, если
.Ar ipaddr
относится к диапазону адресов класса A или B,
соответственно,
или на маску 24 в иных случаях.
Если
.Ar ipaddr
это IPv6-адрес,
отсутствующий
.Ar masklen
будет заменен на 128.
.It Xo
.Sm off
.Ar domainname Op \&: Ar service
.Sm on
.Xc
Принимает дейтаграммы, в которых поиск обратного адреса приводит к
.Ar domainname
для адреса отправителя.
Значение этого
.Ar service
было объяснено выше.
.Ar domainname
может содержать специальные символы шаблона в стиле оболочки, такие как
.Ql Li \&* .
.El
.Pp
Параметры
.Fl a
игнорируются, если параметр
.Fl s
указан.
.It Xo
.Fl b
.Sm off
.Ar bind_address Op \&: Ar service
.Sm on
.Xc
.It Xo
.Fl b
.Sm off
.Li \&: Ar service
.Sm on
.Xc
Привязка к определенному адресу и/или порту.
Адрес может быть указан как имя хоста,
а порт - как имя службы.
Если указан IPv6-адрес, он должен быть заключен в
.Ql \&[
и
.Ql \&] .
По умолчанию
.Ar service
это
.Ql syslog .
Этот параметр можно задать несколько раз для привязки к
нескольким адресам и/или портам.
.It Fl C
Создать файлы журналов, если они не существуют
.Pq разрешение установливается на Ql Li 0600 .
.It Fl c
Отключить сжатие повторяющихся экземпляров одной и той же строки
в одну строку формы
.Dq Li "последнее сообщение повторено N раз" ,
когда выходные данные передаются в другую программу.
Если указано дважды,
отключает это сжатие во всех случаях.
.It Fl d
Включает режим отладки
.Nm .
Вероятно, это полезно только разработчикам, работающим над
.Nm .
.It Fl f Ar config_file
Указывает путь к альтернативному файлу конфигурации;
по умолчанию это
.Pa /etc/syslog.conf .
.It Fl F
Запустить
.Nm
в активном режиме,
вместо того, чтобы переходить в режим демона.
Это полезно, если какой-либо другой процесс использует
.Xr fork 2
и
.Xr exec 3
для запуска
.Nm ,
и хочет следить за тем, когда и как он завершится.
.It Fl H
При регистрации удаленных сообщений использовать имя хоста из сообщения (если оно указано)
вместо адреса, с которого было получено сообщение.
.It Fl k
Отключить преобразование
сообщений, полученных от объекта
.Dq kern
объектом
.Dq user .
Обычно
.Dq kern
объект зарезервирован для сообщений, считываемых непосредственно с
.Pa /dev/klog .
.It Fl M Ar fwd_length
Устанавливать ограничение на длину пересылаемых сообщений.
Минимальное значение - 480 байт.
Максимальное значение для выходного формата RFC 3164 - 1024 байта.
Значение по умолчанию - 1024 байта.
.It Fl m Ar mark_interval
Задать количество минут между сообщениями
.Dq mark ;
по умолчанию это 20 минут.
.It Fl N
Отключить привязку к UDP-сокетам.
В RFC 3164 рекомендуется, чтобы исходящие сообщения
.Nm
отправлялись с привилегированного порта,
этот параметр
.Em отключает
рекомендуемое поведение.
Этот параметр наследует
.Fl s .
.It Fl n
Отключить DNS-запрос для каждого запроса.
.It Fl O Ar format
Задать формат вывода генерируемых сообщений журнала.
Значения
.Ar bsd
и
.Ar rfc3164
используются для создания протоколируемых сообщений RFC 3164.
Значения
.Ar syslog
и
.Ar rfc5424
используются для формирования сообщений протоколирования RFC 5424,
содержащих временные метки RFC 3339 с точностью до микросекунды.
По умолчанию формируются сообщения протоколирования RFC 3164.
.It Fl o
Добавляет к сообщениям ядра префикс с полным загрузочным файлом ядра, как определяет
.Xr getbootfile 3 .
Без этого префикс сообщения ядра всегда будет
.Dq Li kernel: .
.It Fl p Ar log_socket
Указывает путь к альтернативному логическому сокету, который будет использоваться вместо него;
по умолчанию используется
.Pa /var/run/log .
Когда один-единственный параметр
.Fl p
указан,
путь по умолчанию заменяется указанным путем.
Когда два или более параметров
.Fl p
указаны,
остальные пути обрабатываются как дополнительные сокеты для протоколирования.
.It Fl P Ar pid_file
Указать альтернативный файл, в котором будет храниться идентификатор процесса.
По умолчанию используется
.Pa /var/run/syslog.pid .
.It Fl S Ar logpriv_socket
Указать путь к альтернативному сокету протоколирования для привилегированных
приложений, который будет использоваться вместо него;
по умолчанию используется
.Pa /var/run/logpriv .
Когда один-единственный параметр
.Fl S
указан,
путь по умолчанию заменяется указанным.
Когда два или более параметров
.Fl S
указаны,
остальные пути обрабатываются как дополнительные сокеты протоколирования.
.It Fl l Oo Ar mode Ns \&: Oc Ns Ar path
Указать местоположение, в котором
.Nm
следует разместить дополнительный сокет протоколирования.
Основное применение для этого заключается в размещении дополнительных сокетов протоколирования в
.Pa /var/run/log
из различных файловых пространств chroot.
Права доступа к файлам для сокета могут быть указаны в восьмеричном представлении в режиме
.Ar mode ,
разделенном двоеточием.
Местоположение сокета должно быть
указано как абсолютный путь в
.Ar path .
.It Fl s
Работать в безопасном режиме.
Не регистрировать сообщения с удаленных компьютеров.
Если указать это дважды,
сетевой сокет вообще не будет открыт,
что также отключит ведение журнала на удаленных компьютерах.
.It Fl T
Всегда использовать локальное время и дату для сообщений, получаемых из сети,
вместо поля временной метки, предоставляемого в сообщении удаленным хостом.
Это полезно, если некоторые из исходящих хостов не могут правильно отслеживать время
или не могут сгенерировать правильную временную метку.
.It Fl u
Регистрация с уникальным приоритетом.
Регистрируются только сообщения с указанным приоритетом.
Без этого параметра
сообщения регистрируются с указанным приоритетом или выше.
Этот параметр изменяет сравнение по умолчанию с
.Dq =>
на
.Dq = .
.It Fl v
Подробное ведение журнала.
Если указано один раз,
числовое значение объекта и приоритет
регистрируются для каждого локально записанного сообщения.
Если указано более одного раза,
названия объекта и приоритет регистрируются для каждого локально записанного
сообщения.
.Pp
Этот параметр влияет только на форматирование сообщений RFC 3164.
Сообщения, отформатированные в соответствии с RFC 5424, всегда содержат
номер объекта/приоритета.
.El
.Pp
Утилита
.Nm
читает свой файл конфигурации при запуске и всякий
раз, когда получает сигнал о зависании.
Информацию о формате файла конфигурации
смотрите в
.Xr syslog.conf 5 .
.Pp
Утилита
.Nm
читает сообщения с
.Ux
доменных сокетов
.Pa /var/run/log
и
.Pa /var/run/logpriv ,
из интернет-доменного сокета, указанного в
.Pa /etc/services ,
и из специального устройства
.Pa /dev/klog
.Pq to read kernel messages .
.Pp
Утилита
.Nm
создает свой файл идентификатора процесса,
по умолчанию
.Pa /var/run/syslog.pid ,
и сохраняет там свой идентификатор процесса.
Это может быть использовано для отключения или перенастройки
.Nm .
.Pp
Сообщение, отправленное
.Nm
должно состоять из одной строки.
Сообщение может содержать код приоритета,
который должен быть предшествующим
десятичным числом в угловых скобках,
например,
.Sq Aq 5 .
Этот код приоритета должен соответствовать приоритетам, определенным во
включенном файле
.In sys/syslog.h .
.Pp
По соображениям безопасности,
.Nm
не будет дописывать несуществующие файлы журналов
.Po если параметр Fl C
не задан
.Pc ;
поэтому перед запуском они должны быть созданы вручную
.Nm .
.Pp
Дата и время берутся из полученного сообщения.
Если формат поля timestamp неверен,
вместо него используется время, полученное с локального хоста.
Это может быть переопределено с помощью флага
.Fl T .
.Sh ФАЙЛЫ
.Bl -tag -width /var/run/syslog.pid -compact
.It Pa /etc/syslog.conf
файл конфигурации
.It Pa /var/run/syslog.pid
файл идентификатора процесса по умолчанию
.It Pa /var/run/log
название
.Ux
сокета журнала дейтаграмм домена
.It Pa /var/run/logpriv
.Ux
сокет для привилегированных приложений
.It Pa /dev/klog
устройство протоколирования ядра
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr logger 1 ,
.Xr syslog 3 ,
.Xr services 5 ,
.Xr syslog.conf 5 ,
.Xr newsyslog 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Bx 4.3 .
.Pp
Параметры
.Fl a ,
.Fl s ,
.Fl u ,
и
.Fl v
это расширения в версии
.Fx 2.2 .
.Sh НЕИСПРАВНОСТИ
Возможность регистрировать сообщения, полученные в пакетах UDP, эквивалентна
службе удаленного заполнения диска, не прошедшей проверку подлинности,
и, вероятно, должна быть отключена по умолчанию.
Разновидность механизма аутентификации
.No inter- Ns Nm syslogd
необходимо доработать.
Чтобы предотвратить злоупотребление,
настоятельно рекомендуется использовать параметр
.Fl a .
.Pp
Алгоритм сопоставления
.Fl a
не претендует на высокую эффективность;
использование числовых IP-адресов быстрее, чем сравнение доменных имен.
Поскольку список разрешенных одноранговых узлов просматривается линейно,
группы одноранговых узлов, от которых ожидается получение частых сообщений,
следует как можно раньше включать в список параметра
.Fl a .
.Pp
Сокет журнала был перемещен из
.Pa /dev ,
чтобы упростить использование корневой файловой системы, доступной только для чтения.
Это может привести к путанице
в некоторых старых двоичных файлах, поэтому на
переходный период может использоваться символическая ссылка.
