melkorbsd/ru-freebsd-man/man8/sysrc.8
.\" Copyright (c) 2011-2016 Devin Teske
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 3, 2022
.Dt SYSRC 8
.Os
.Sh ИМЯ
.Nm sysrc
.Nd безопасное редактирование системных rc-файлов
.Sh СИНТАКСИС
.Nm
.Op Fl cdDeEFhinNqvx
.Op Fl s Ar name
.Op Fl f Ar file
.Op Fl j Ar jail | Fl R Ar dir
.Ar name Ns Op Ns Oo +|- Oc Ns = Ns Ar value
.Ar ...
.Nm
.Op Fl cdDeEFhinNqvx
.Op Fl s Ar name
.Op Fl f Ar file
.Op Fl j Ar jail | Fl R Ar dir
.Fl a | A
.Nm
.Op Fl E
.Op Fl s Ar name
.Op Fl f Ar file
.Fl l
.Nm
.Op Fl eEqv
.Fl L
.Op Ar name ...
.Sh ОПИСАНИЕ
Утилита
.Nm
извлекает переменные
.Xr rc.conf 5
из коллекции системных rc-файлов и позволяет процессам с
соответствующими привилегиями изменять значения безопасным и эффективным способом.
.Pp
Доступны следующие параметры:
.Bl -tag -width indent+
.It Fl a
Вывести список всех переменных конфигурации, не используемых по умолчанию.
.It Fl A
Вывести список всех конфигурационных переменных
.Pq включая значения по умолчанию .
.It Fl c
Только проверка.
Для запроса возвращает значение success, если заданы все запрошенные переменные
.Pq даже если значение равно NULL ,
в противном случае возвращает статус ошибки.
Для назначений возвращает значение success, если изменения не требуются, в противном случае - failure.
В подробном режиме
.Pq see Dq Fl v
вывести сообщение о том, установлены ли переменные и/или требуются ли изменения.
.It Fl d
Вывести описание данной переменной.
.It Fl D
Показать только значения по умолчанию (это то же самое, что присвоить RC_CONFS значение NULL или
передать `-f' с NULLв качестве аргумента-файла).
.It Fl e
Вывести результаты запроса в виде
.Xr sh 1
совместимого синтаксиса,
.Pq например, Ql var=value .
Игнорируется, если указаны параметры
.Ql Fl n
или
.Ql Fl F .
.It Fl E
Если указан параметр
.Sq Fl l
или
.Sq Fl L
для отображения списка конфигурационных файлов, отображаются только существующие.
При изменении настроек предпочительнее изменять существующие файлы.
.It Fl f Ar file
Работает с указанными файлами вместо файлов, полученных при чтении параметра
.Sq rc_conf_files
в файле
.Ev RC_DEFAULTS .
Этот параметр может быть указан несколько раз для дополнительных файлов.
.It Fl F
Показать только последние директивы в файле
.Xr rc.conf 5 ,
в котором находится каждая директива.
.It Fl h
Вывести короткую справку по использованию в stderr и завершить работу.
.It Fl -help
Вывести полную справку по использованию в stderr и завершить работу.
.It Fl i
Игнорировать неизвестные переменные.
.It Fl j Ar jail
Действовать в пределах клетки
.Ar jail
согласно указанному имени или
.Ar jid
.Pq переопределяет So Fl R Ar dir Sc ; требует Xr jexec 8 .
.It Fl l
Вывести список конфигурационных файлов, используемых при запуске, в стандартный вывод и завершить работу.
.It Fl L
Вывести список всех конфигурационных файлов (включая rc.conf.d) в стандартный вывод и завершить работу.
Может сочетаться с
.Sq Fl v
или
.Sq Fl e ,
чтобы отображать названия служб.
.Nm
завершается успешно, если установлены все названные службы, в противном случае происходит сбой.
.It Fl n
Отображать только значения переменных, а не их имена.
.It Fl N
Отображать только имена переменных, но не их значения.
.It Fl q
Тихий режим.
Отключает детализацию и скрывает некоторые ошибки.
В сочетании с
.Sq Fl L
и одним или несколькими аргументами
.Ar name ,
укажет только статус выхода без вывода какой-либо информации.
.It Fl R Ar dir
Работать в корневом каталоге
.Sq Ar dir
вместо
.Sq / .
.It Fl s Ar name
Если существует скрипт в
.Li rc.d
с именем
.Ar name
.Po
в каталогах
.Dq /etc/rc.d
или
.Li local_startup
.Pc ,
обрабатывает его записи в
.Dq rc.conf.d
в качестве потенциальных заменителей для
.Sq rc_conf_files .
Смотрите
.Xr rc.subr 8
для получения дополнительной информации о
.Dq rc.conf.d .
Может сочетаться с
.Sq Fl l ,
чтобы отобразить список конфигурационных файлов, используемых службой при запуске.
.It Fl v
Подробный режим.
Выводить путь к конкретному файлу
.Xr rc.conf 5 ,
в котором была найдена директива.
.It Fl -version
Вывести информацию о версии в стандартный вывод и завершить работу.
.It Fl x
Удалить переменную(ые) из указанного файла(ов).
.El
.Pp
Эта утилита имеет синтаксис, аналогичный
.Xr sysctl 8 .
Она совместно использует параметры `-e" и `-n"
.Pq подробности выше
и также имеет тот же самый синтаксис
.Ql name[=value]
для выполнения запросов/назначений.
В дополнение
.Pq но в отличие от Xr sysctl 8 ,
.Ql name+=value
поддерживает добавление элементов к значениям
.Pq смотрите СЛОЖЕНИЕ ЗНАЧЕНИЙ
и
.Ql name-=value
поддерживает удаление элементов из значений
.Pq смотрите ВЫЧИТАНИЕ ЗНАЧЕНИЙ .
.Pp
Однако, в то время как
.Xr sysctl 8
служит для запроса/изменения переменных ядра,
.Nm
вместо этого работает со значениями в системных конфигурационных файлах
.Xr rc.conf 5 .
.Pp
Список файлов конфигурации системы настраивается в файле
.Ql /etc/defaults/rc.conf
внутри переменной
.Ql rc_conf_files ,
которая по умолчанию содержит список путей, разделенных пробелами.
На всех
.Fx
системах по умолчанию используется значение "/etc/rc.conf /etc/rc.conf.local".
Каждый
путь к файлу обрабатывается по порядку при запуске.
Таким же образом
.Nm
выполняет обработку конфигурационных файлов перед возвратом значения заданной
переменной.
.Pp
Если указано имя переменной,
.Nm
вернет значение переменной.
Если переменная не присутствует ни в одном
из заданных
.Ql rc_conf_files ,
выводится сообщение об ошибке и возвращается статус ошибки.
.Pp
При изменении значения заданной переменной не имеет значения, присутствует ли эта переменная
в каком-либо из
.Ql rc_conf_files
или нет.
Если переменная не присутствует ни в одном из файлов, она добавляется в
конец первого пути в переменной
.Ql rc_conf_files .
Иначе,
.Nm
заменит только последнее вхождение в последнем найденном файле, содержащем
переменную.
Это позволяет получить значение, которое вступит в силу при следующей загрузке без существенного
изменения встроенных файлов (тем не менее, следует позаботиться о том, чтобы файл не
стал громоздким при повторном вызове
.Nm ).
.Sh СЛОЖЕНИЕ ЗНАЧЕНИЙ
При использовании синтаксиса
.Ql key+=value
для добавления элементов к существующим значениям
первый символ значения должен быть символ-разделитель
.Pq обычно Qo " " Qc или Qo , Qc .
Например, в следующем выражении:
.Bl -item -offset indent
.It
.Nm
cloned_interfaces+=" gif0"
.El
.Pp
первый символ - это пробел, сообщающий
.Nm ,
что существующие значения следует рассматривать как разделенные пробелом.
Если
.Ql gif0
не присутствует в текущем значении параметра
.Va cloned_interfaces ,
он добавляется
.Pq с разделителем, если только существующее значение не является NULL .
.Pp
По соглашению, если первый символ является буквенно-цифровым
.Pq буквы A-Z, a-z, или цифры 0-9 ,
точка
.Pq Li \&. ,
или слэш
.Pq Li / ,
.Nm
использует значение пробела по умолчанию в качестве разделителя.
Например, приведенные выше и ниже инструкции эквивалентны, поскольку
.Dq gif0
начинается с буквенно-цифрового символа
.Pq буква Li g :
.Bl -item -offset indent
.It
.Nm
cloned_interfaces+=gif0
.El
.Pp
Возьмем, к примеру, следующую последовательность действий:
.Bl -item -offset indent
.It
.Nm
cloned_interfaces= # start with NULL
.It
.Nm
cloned_interfaces+=gif0
.Dl # NULL -> `gif0' Pq NB: no preceding delimiter
.It
.Nm
cloned_interfaces+=gif0 # no change
.It
.Nm
cloned_interfaces+="tun0 gif0"
.Dl # `gif0' -> `gif0 tun0' Pq NB: no duplication
.El
.Pp
.Nm
предотвращает добавление того же значения, если оно уже существует.
.Sh ВЫЧИТАНИЕ ЗНАЧЕНИЙ
При использовании
.Ql key-=value
синтаксиса для удаления элементов из существующих значений
в качестве разделителя между элементами используется первый символ значения
.Pq обычно Qo " " Qc или Qo , Qc .
Например, в следующем выражении:
.Pp
.Dl Nm cloned_interfaces-=" gif0"
.Pp
первый символ - это пробел, сообщающий
.Nm
что существующие значения следует рассматривать как разделенные пробелом.
Если
.Ql gif0
присутствует в текущем значении переменной
.Va cloned_interfaces ,
он удаляется
.Pq при этом удаляются и лишние разделители .
.Pp
По соглашению, если первый символ является буквенно-цифровым
.Pq буквы A-Z, a-z, или цифры 0-9 ,
точка
.Pq Li \&. ,
или слэш
.Pq Li / ,
.Nm
использует значение пробела по умолчанию в качестве разделителя.
Например, приведенные выше и ниже инструкции эквивалентны, поскольку
.Dq gif0
начинается с буквенно-цифрового символа
.Pq буквы Li g :
.Bl -item -offset indent
.It
.Nm
cloned_interfaces-=gif0
.El
.Pp
Возьмем, к примеру, следующую последовательность действий:
.Bl -item -offset indent
.It
.Nm
foo="bar baz" # start
.It
.Nm
foo-=bar # `bar baz' -> `baz'
.It
.Nm
foo-=baz # `baz' -> NULL
.El
.Pp
.Nm
удаляет все вхождения всех предоставленных элементов и удаляет дополнительные разделители между элементами.
.Sh ОКРУЖЕНИЕ
На следующие переменные среды ссылаются
.Nm :
.Bl -tag -width ".Ev RC_DEFAULTS"
.It Ev RC_CONFS
Переопределить значение по умолчанию
.Ql rc_conf_files
.Pq даже если установлено значение NULL .
.It Ev RC_DEFAULTS
Местонахождение файла
.Ql /etc/defaults/rc.conf .
.El
.Sh ЗАВИСИМОСТИ
Для работы
.Nm
требуются следующие стандартные команды:
.Pp
.Xr awk 1 ,
.Xr cat 1 ,
.Xr chmod 1 ,
.Xr env 1 ,
.Xr grep 1 ,
.Xr mktemp 1 ,
.Xr mv 1 ,
.Xr rm 1 ,
.Xr sh 1 ,
.Xr stat 1 ,
.Xr tail 1 ,
.Xr chown 8 ,
.Xr chroot 8 ,
.Xr jls 8 ,
and
.Xr jexec 8 .
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/defaults/rc.conf" -compact
.It Pa /etc/defaults/rc.conf
.It Pa /etc/rc.conf
.It Pa /etc/rc.conf.local
.It Pa /etc/rc.conf.d/name
.It Pa /etc/rc.conf.d/name/*
.It Pa /usr/local/etc/rc.conf.d/name
.It Pa /usr/local/etc/rc.conf.d/name/*
.El
.Sh ПРИМЕРЫ
Ниже приведены несколько простых примеров того, как
.Nm
может использоваться для запроса определенных значений из
коллекции системных конфигурационных файлов
.Xr rc.conf 5 :
.Pp
.Nm
sshd_enable
.Dl возвращает значение $sshd_enable, обычно YES или NO .
.Pp
.Nm
defaultrouter
.Dl возвращает IP-адрес шлюза по умолчанию Pq если настроен .
.Pp
Работа с другими файлами, такими как
.Xr crontab 5 :
.Pp
.Nm
-f /etc/crontab MAILTO
.Dl возвращает значение параметра MAILTO Pq если настроен .
.Pp
Добавление к существующим значениям:
.Pp
.Nm
\&cloned_interfaces+=gif0
.Dl добавляет Qo gif0 Qc к $cloned_interfaces Pq смотрите СЛОЖЕНИЕ ЗНАЧЕНИЙ .
.Pp
.Nm
\&cloned_interfaces-=gif0
.Dl удаляет Qo gif0 Qc из $cloned_interfaces Pq смотрите ВЫЧИТАНИЕ ЗНАЧЕНИЙ .
.Pp
В дополнение к приведенному выше синтаксису,
.Nm
также поддерживает встроенное в
.Xr sh 1
расширение параметров для изменения способа представления значений, показанное ниже:
.Pp
.Nm
\&'hostname%%.*'
.Dl возвращает $hostname вплоть до (но не включая) первой `.' .
.Pp
.Nm
\&'network_interfaces%%[$IFS]*'
.Dl возвращает первое слово из $network_interfaces .
.Pp
.Nm
\&'ntpdate_flags##*[$IFS]'
.Dl возвращает последнее слово из $ntpdate_flags (адрес сервера времени) .
.Pp
.Nm
usbd_flags-"default"
.Dl возвращает $usbd_flags или "default" если значение не задано или NULL .
.Pp
.Nm
cloned_interfaces+"alternate"
.Dl возвращает "alternate" если $cloned_interfaces установлен .
.Sh СМОТРИТЕ ТАКЖЕ
.Xr rc.conf 5 ,
.Xr jail 8 ,
.Xr jexec 8 ,
.Xr jls 8 ,
.Xr rc 8 ,
.Xr rc.subr 8 ,
.Xr sysctl 8
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 9.2 .
.Sh АВТОРЫ
.An Девин Теске Aq Mt dteske@FreeBSD.org
.Sh БЛАГОДАРНОСТИ
Брэндон Гуч, Энджи Купер, Джулиан Элишер, Павел Якуб Давидек,
Сирил Лефевр, Росс Уэст, Стефан Эссер, Марко Стейнбах, Жиль Тьелкер.,
Аллану Джуду и Ларсу Энгельсу за предложения, помощь и тестирование.
