melkorbsd/ru-freebsd-man/man8/talkd.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)talkd.8	8.2 (Berkeley) 12/11/93
.\"
.Dd December 11, 1993
.Dt TALKD 8
.Os
.Sh ИМЯ
.Nm talkd
.Nd сервер удаленной связи пользователей
.Sh СИНТАКСИС
.Nm
.Sh ОПИСАНИЕ
Утилита
.Nm
- это сервер, который уведомляет пользователя о том, что кто-то еще хочет
начать разговор.
Он действует как хранилище приглашений, отвечая на запросы
клиентов, желающих встретиться для проведения беседы.
При нормальной работе клиент, вызывающий абонент,
инициирует встречу, отправляя сообщение
.Tn CTL_MSG
на сервер
типа
.Tn LOOK_UP
(смотрите
.In protocols/talkd.h ) .
Это заставляет сервер выполнять поиск в своих
таблицах приглашений, чтобы проверить, существует ли в данный момент приглашение для вызывающего абонента
(для разговора с вызываемым абонентом, указанным в сообщении).
.Pp
Если поиск завершается неудачей,
вызывающий абонент отправляет сообщение
.Tn ANNOUNCE ,
сообщение, заставляющее сервер
транслировать объявление на порты входа вызываемого абонента с запросом контакта.
.Pp
Когда вызываемый абонент отвечает, локальный сервер использует
записанное приглашение для отправки соответствующего
адреса встречи, и клиентские программы вызывающего абонента и вызываемого абонента устанавливают
потоковое соединение, через которое происходит разговор.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr talk 1 ,
.Xr write 1
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.Bx 4.3 .
