melkorbsd/ru-freebsd-man/man8/tcpdrop.8
.\"	$OpenBSD: tcpdrop.8,v 1.5 2004/05/24 13:57:31 jmc Exp $
.\"
.\" Copyright (c) 2009 Juli Mallett <jmallett@FreeBSD.org>
.\" Copyright (c) 2004 Markus Friedl <markus@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 4, 2021
.Dt TCPDROP 8
.Os
.Sh ИМЯ
.Nm tcpdrop
.Nd удаляет TCP-соединения
.Sh КРАТКИЙ ОБЗОР
.Nm tcpdrop
.Ar local-address
.Ar local-port
.Ar foreign-address
.Ar foreign-port
.Nm tcpdrop
.Op Fl l
.Fl a
.Nm tcpdrop
.Op Fl l
.Fl C Ar cc-algo
.Op Fl S Ar stack
.Op Fl s Ar state
.Nm tcpdrop
.Op Fl l
.Op Fl C Ar cc-algo
.Fl S Ar stack
.Op Fl s Ar state
.Nm tcpdrop
.Op Fl l
.Op Fl C Ar cc-algo
.Op Fl S Ar stack
.Fl s Ar state
.Sh ОПИСАНИЕ
.Nm
команда может использоваться для удаления TCP-соединений из командной строки.
.Pp
Если
.Fl a
указывается, тогда
.Nm
попытается разорвать все TCP-соединения.
.Pp
Если
.Fl C Ar cc-algo
указывается, тогда
.Nm
попытается разорвать все соединения, используя алгоритм контроля перегрузки TCP
.Ar cc-algo .
.Pp
Если
.Fl S Ar stack
указывается, тогда
.Nm
попытается разорвать все соединения, используя стек TCP
.Ar stack .
.Pp
Если
.Fl s Ar state
указывается, тогда
.Nm
попытается разорвать все TCP-соединения, находящиеся в этом состоянии
.Ar state .
.Ar state
является одним из
.Dv SYN_SENT ,
.Dv SYN_RCVD ,
.Dv ESTABLISHED ,
.Dv CLOSE_WAIT ,
.Dv FIN_WAIT_1 ,
.Dv CLOSING ,
.Dv LAST_ACK ,
.Dv FIN_WAIT_2 , or
.Dv TIME_WAIT .
.Pp
Если несколько из
.Fl C Ar cc-algo ,
.Fl S Ar stack ,
и
.Fl s Ar state
указаны,
.Nm
попытается разорвать все TCP-соединения, используя алгоритм контроля перегрузки
.Ar cc-algo ,
находясь в состоянии
.Ar state ,
и используя стек TCP
.Ar stack ,
если указано.
Поскольку TCP-соединения в
.Dv TIME_WAIT
состоянии не привязаны ни к какому стеку TCP, используя опцию
.Fl s Dv TIME_WAIT
в сочетании с
.Fl S Ar stack
параметром приводит к тому, что
.Nm
не прерывает никакого TCP-соединения.
.Pp
.Fl l
флаг может быть присвоен в дополнение к
.Fl a ,
.Fl C ,
.Fl S ,
или
.Fl s
параметрам для перечисления вызова tcpdrop для удаления всех соответствующих TCP
-подключений по одному за раз.
.Pp
Если ни один из
.Fl a ,
.Fl C ,
.Fl S ,
или
.Fl s
параметров не указывается, только соединения между заданным локальным
адресом
.Ar local-address ,
портом
.Ar local-port ,
и сторонним адресом
.Ar foreign-address ,
портом
.Ar foreign-port ,
будут удалены.
.Pp
Адреса и порты могут быть указаны в виде имени или числового значения.
Поддерживаются форматы адресов IPv4 и IPv6.
.Pp
Адреса и порты могут быть разделены точками или двоеточиями
вместо пробелов.
.Sh СТАТУС ВЫХОДА
.Ex -std
.Sh ПРИМЕРЫ
Если соединение с
.Xr httpd 8
вызывает перегрузку на сетевом канале, можно прервать ответственный TCP-сеанс:
.Bd -literal -offset indent
# sockstat -c | grep httpd
www      httpd      16525 3  tcp4 \e
	192.168.5.41:80      192.168.5.1:26747
.Ed
.Pp
Следующая команда приведет к разрыву соединения:
.Bd -literal -offset indent
# tcpdrop 192.168.5.41 80 192.168.5.1 26747
.Ed
.Pp
Следующая команда приведет к разрыву всех подключений, кроме подключений к
порту 22, используемому
.Xr sshd 8 :
.Bd -literal -offset indent
# tcpdrop -l -a | grep -vw 22 | sh
.Ed
.Pp
Чтобы разорвать все TCP-соединения с помощью алгоритма контроля перегрузки new-reno, используйте:
.Bd -literal -offset indent
# tcpdrop -C new-reno
.Ed
.Pp
Следующая команда удалит все соединения, использующие стойку стека TCP:
.Bd -literal -offset indent
# tcpdrop -S rack
.Ed
.Pp
Чтобы разорвать все TCP-соединения в состоянии LAST_ACK, используйте:
.Bd -literal -offset indent
# tcpdrop -s LAST_ACK
.Ed
.Pp
Чтобы разорвать все TCP-соединения, используя алгоритм управления перегрузкой new-reno и
стойку стека TCP и находясь в состоянии LAST_ACK, используйте:
.Bd -literal -offset indent
# tcpdrop -C new-reno -S rack -s LAST_ACK
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr netstat 1 ,
.Xr sockstat 1 ,
.Xr tcp 4 ,
.Xr tcp_functions 9
.Sh АВТОРЫ
.An Маркус Фридль Aq Mt markus@openbsd.org
.An Джули Маллетт Aq Mt jmallett@FreeBSD.org
