melkorbsd/ru-freebsd-man/man8/tcpdchk.8
.TH TCPDCHK 8
.SH ИМЯ
tcpdchk \- средство проверки конфигурации оболочки tcp
.SH КРАТКИЙ ОБЗОР
tcpdchk [-a] [-d] [-i inet_conf] [-v]
.SH ОПИСАНИЕ
.PP
\fItcpdchk\fR проверяет конфигурацию вашей оболочки tcp и сообщает обо всех
потенциальных и реальных проблемах, которые может обнаружить. Программа проверяет
файлы управления доступом \fItcpd\fR (по умолчанию это
\fI/etc/hosts.allow\fR и \fI/etc/hosts.deny\fR) и сравнивает
записи в этих файлах с записями в файлах конфигурации сети \fIinetd\fR или \fItlid\fR.
.PP
\fItcpdchk\fR сообщает о таких проблемах, как несуществующие имена путей; службы,
которые отображаются в правилах контроля доступа \fItcpd\fR, но не контролируются
\fItcpd\fR; службы, которые не следует переносить; несуществующие
имена хостов или формы адресов, отличные от Интернет-адресов; использование псевдонимов хостов
вместо официальные имена хостов; хосты с конфликтом имени и адреса;
неправильное использование шаблонов подстановки; неправильное использование
сетевых групп NIS или ссылок на несуществующие сетевые группы NIS; ссылки на
несуществующие параметры; недопустимые аргументы для параметров; и так далее.
.PP
Там, где это возможно, \fItcpdchk\fR предоставляет полезные рекомендации по устранению
проблемы.
.SH ПАРАМЕТРЫ
.IP -a
Сообщайте о правилах управления доступом, которые разрешают доступ без явного ключевого слова
ALLOW. Это применимо только при включенном расширенном
языке управления доступом (построение с помощью -DPROCESS_OPTIONS).
.IP -d
Проверяет файлы \fIhosts.allow\fR и \fIhosts.deny\fR в текущем
каталоге вместо файлов по умолчанию.
.IP "-i inet_conf"
Укажите этот параметр, если \fItcpdchk\fR не может найти ваш файл конфигурации сети
\fIinetd.conf\fR или \fItlid.conf\fR, или если
вы подозреваете, что программа использует неправильный файл конфигурации.
.IP -v
Отображает содержимое каждого правила контроля доступа. Списки демонов,
списки клиентов, команды и параметры командной оболочки отображаются в удобном для просмотра виде;
это упрощает поиск любых несоответствий между тем, что вы
хотите, и тем, что понимает программа.
.SH ФАЙЛЫ
.PP
По умолчанию таблицы управления доступом \fItcpd\fR расположены следующим образом:
.PP
/etc/hosts.allow
.br
/etc/hosts.deny
.SH СМОТРИТЕ ТАКЖЕ
.na
.nf
tcpdmatch(8), объясняет, что будет делать tcpd в конкретных случаях.
hosts_access(5), формат таблиц контроля доступа tcpd.
hosts_options(5), формат языковых расширений.
inetd.conf(5), формат управляющего файла inetd.
tlid.conf(5), формат управляющего файла tlid.
.SH АВТОРЫ
.na
.nf
Виетсе Венема (wietse@wzv.win.tue.nl),
Факультет математики и вычислительной техники,
Технологический университет Эйндховена
Ден Долех, 2, почтовый ящик 513, 
5600 МБ Эйндховен, Нидерланды
\" @(#) tcpdchk.8 1.3 95/01/08 17:00:30
