melkorbsd/ru-freebsd-man/man8/tcpdmatch.8
.TH TCPDMATCH 8
.SH ИМЯ
tcpdmatch \- tcp-обертка oracle
.SH СИНТАКСИС
tcpdmatch [-d] [-i inet_conf] daemon client
.sp
tcpdmatch [-d] [-i inet_conf] daemon[@server] [user@]client
.SH ОПИСАНИЕ
.PP
\fItcpdmatch\fR предсказывает, как tcp-оболочка будет обрабатывать конкретный
запрос на обслуживание. Примеры приведены ниже.
.PP
Программа проверяет таблицы контроля доступа \fItcpd\fR (по умолчанию
\fI/etc/hosts.allow\fR и \fI/etc/hosts.deny\fR) и выводит свое
заключение. Для обеспечения максимальной точности он извлекает дополнительную информацию
из вашего файла конфигурации сети \fIinetd\fR или \fItlid\fR.
.PP
Когда \fItcpdmatch\fR находит совпадение в таблицах контроля доступа, он
идентифицирует соответствующее правило. Кроме того, он отображает необязательные
команды или параметры оболочки в удобном печатном виде; это
облегчает вам поиск любых расхождений между тем, что вы хотите, и тем, что
понимает программа.
.SH АРГУМЕНТЫ
Всегда требуются следующие два аргумента:
.IP daemon
Имя процесса-демона. Обычно это последний компонент
пути к исполняемому файлу-демону.
.IP client
Имя хоста или сетевой адрес, или один из шаблонов `unknown" или `paranoid".
.sp
Когда указано имя клиентского хоста, \fItcpdmatch\fR выдает
прогноз для каждого адреса, указанного для этого клиента.
.sp
Когда указан адрес клиента, \fItcpdmatch\fR предсказывает, что
будет делать \fItcpd\fR при сбое поиска имени клиента.
.PP
Дополнительная информация, указанная в форме \fIdaemon@server\fR:
.IP server
Имя хоста или сетевой адрес, или один из `unknown' или `paranoid'
шаблонов подстановки. По умолчанию имя сервера `unknown'.
.PP
Дополнительная информация, указанная в форме \fIuser@client\fR:
.IP user
Идентификатор пользователя клиента. Обычно это имя пользователя для входа в систему или цифровой идентификатор пользователя.
Имя пользователя по умолчанию `unknown'.
.SH ПАРАМЕТРЫ
.IP -d
Проверяет файлы \fIhosts.allow\fR и \fIhosts.deny\fR в текущем
каталоге вместо файлов по умолчанию.
.IP "-i inet_conf"
Укажите этот параметр, если в \fItcpdmatch\fR не удается найти ваш файл конфигурации сети
\fIinetd.conf\fR или \fItlid.conf\fR, или если
вы подозреваете, что программа использует неправильный файл конфигурации.
.SH ПРИМЕРЫ
Чтобы предсказать, как \fItcpd\fR будет обрабатывать запрос telnet из локальной
системы:
.sp
.ti +5
tcpdmatch in.telnetd localhost
.PP
Тот же запрос, делая вид, что поиск имени хоста завершился неудачей:
.sp
.ti +5
tcpdmatch in.telnetd 127.0.0.1
.PP
Чтобы предсказать, что будет делать tcpd, если имя клиента не совпадает
с адресом клиента:
.sp
.ti +5
tcpdmatch in.telnetd paranoid
.PP
В некоторых системах имена демонов не имеют префикса "in.", или \fItcpdmatch\fR,
может потребоваться некоторая помощь, чтобы найти файл конфигурации inetd.
.SH ФАЙЛЫ
.PP
По умолчанию таблицы управления доступом \fItcpd\fR расположены следующим образом:
.PP
/etc/hosts.allow
.br
/etc/hosts.deny
.SH СМОТРИТЕ ТАКЖЕ
.na
.nf
tcpdchk(8), средство проверки конфигурации tcpd
hosts_access(5), формат таблиц контроля доступа tcpd.
hosts_options(5), формат языковых расширений.
inetd.conf(5), формат управляющего файла inetd.
tlid.conf(5), формат управляющего файла tlid.
.SH АВТОРЫ
.na
.nf
Виетсе Венема (wietse@wzv.win.tue.nl),
Факультет математики и вычислительной техники,
Технологический университет Эйндховена
Ден Долех, 2, почтовый ящик 513, 
5600 МБ Эйндховен, Нидерланды
\" @(#) tcpdmatch.8 1.5 96/02/11 17:01:35
