melkorbsd/ru-freebsd-man/man8/tcpd.8
.TH TCPD 8
.SH ИМЯ
tcpd \- средство контроля доступа к интернет-сервисам
.SH ОПИСАНИЕ
.PP
Программа \fItcpd\fR может быть настроена для отслеживания входящих запросов на
\fItelnet\fR, \fIfinger\fR, \fIftp\fR, \fIexec\fR, \fIrsh\fR,
\fIrlogin\fR, \fItftp\fR, \fItalk\fR, \fIcomsat\fR и другие сервисы,
которые имеют взаимно однозначное отображение на исполняемые файлы.
.PP
Программа поддерживает как сокеты в стиле 4.3BSD, так и TLI в стиле System V.4.
Функциональность может быть ограничена, если протокол, лежащий в основе TLI,
не является интернет-протоколом.
.PP
Принцип работы заключается в следующем: всякий раз, когда поступает запрос на обслуживание,
демона \fIinetd\fP обманом заставляют запустить программу \fItcpd\fP
вместо нужного сервера. \fItcpd\fP регистрирует запрос и выполняет
некоторые дополнительные проверки. Если все хорошо, \fItcpd\fP запускает
соответствующую серверную программу и завершается.
.PP
Дополнительными функциями являются: управление доступом на основе шаблонов, поиск имени пользователя клиента
по протоколу RFC 931 и т.д., защита от хостов, которые
выдают себя за чужие имена хостов, и защита от хостов,
которые выдают себя за чужие сетевые адреса.
.SH ПРОТОКОЛИРОВАНИЕ
Соединения, которые отслеживаются
.I tcpd
отчитываются через \fIsyslog\fR(3) . Каждая запись содержит
отметку времени, имя хоста клиента и название запрашиваемой
службы. Эта информация может быть полезна для обнаружения нежелательных действий,
особенно при объединении информации из файлов журналов с нескольких хостов.
.PP
Чтобы узнать, куда ведется протоколирование в вашей системе, изучите
конфигурационный файл syslog, обычно /etc/syslog.conf.
.SH КОНТРОЛЬ ДОСТУПА
Выборочно,
.I tcpd
поддерживает простую форму контроля доступа, основанную на
сопоставлении с шаблоном. Программное обеспечение для контроля доступа предоставляет перехватчики для выполнения
команд оболочки при срабатывании шаблона.  Для получения более подробной информации смотрите
страницу руководства \fIhosts_access\fR(5) .
.SH ПРОВЕРКА ИМЕНИ ХОСТА
Схема аутентификации некоторых протоколов(\fIrlogin, rsh\fR) полагается
на имена хостов. Некоторые реализации считают, что имя хоста они получают
от любого случайного сервера имен; другие реализации более осторожны, но
используют ошибочный алгоритм.
.PP
.I tcpd
проверяет имя хоста клиента, возвращаемое DNS-сервером через address->name,
путем поиска имени хоста и адрес, возвращаемый DNS-сервером через name->address.
Если будет обнаружено какое-то несоответствие
.I tcpd
придет к выводу, что он имеет дело с хостом, который выдает себя за чье-то
чужое имя хоста.
.PP
Если исходные тексты скомпилированы с помощью -DPARANOID,
.I tcpd
разорвет соединение в случае несоответствия имени или адреса хоста.
В противном случае имя хоста может быть сопоставлено с подстановочным знаком \fIPARANOID\fR,
после чего можно предпринять соответствующие действия.
.SH ПОДМЕНА АДРЕСА ХОСТА
Выборочно,
.I tcpd
отключает параметры сокета маршрутизации источника при каждом подключении, с которым он
имеет дело. Это предотвратит большинство атак с хостов, которые выдают
себя за адрес, принадлежащий чужой сети. Службы UDP
не пользуются этой защитой. Эта функция должна быть включена во
время компиляции.
.SH RFC 931
Когда включен поиск в соответствии с RFC 931 (параметр времени компиляции) \fItcpd\fR,
будет предпринята попытка установить имя пользователя клиента. Это будет
выполнено успешно, только если на клиентском хосте запущен демон, совместимый с RFC 931.
Поиск имени пользователя клиента не будет работать
при подключениях, ориентированных на дейтаграммы, и может вызвать заметные задержки в случае подключений
с ПК.
.SH ПРИМЕРЫ
Подробности использования \fItcpd\fR зависят от информации о путевом имени, которая была
скомпилирована в программу.
.SH ПРИМЕР 1
Этот пример применим, когда \fItcpd\fR ожидает, что исходные сетевые
демоны будут перемещены в "другое" место.
.PP
Чтобы отслеживать доступ к службе \fIfinger\fR, переместите
исходного finger демона в "другое" место и установите tcpd на
место исходного finger демона. Никаких изменений
в файлах конфигурации не требуется.
.nf
.sp
.in +5
# mkdir /other/place
# mv /usr/etc/in.fingerd /other/place
# cp tcpd /usr/etc/in.fingerd
.fi
.PP
В примере предполагается, что сетевые демоны находятся в /usr/etc. В некоторых
системах сетевые демоны находятся в /usr/sbin или /usr/libexec или
не имеют префикса `in.\' в своем имени.
.SH ПРИМЕР 2
Этот пример применим, когда \fItcpd\fR ожидает, что сетевые демоны
останутся на своих прежних местах.
.PP
Чтобы отслеживать доступ к сервису \fIfinger\fR, внесите
следующие изменения в файл конфигурации \fIinetd\fR (обычно 
\fI/etc/inetd.conf\fR или \fI/etc/inet/inetd.conf\fR):
.nf
.sp
.ti +5
finger  stream  tcp  nowait  nobody  /usr/etc/in.fingerd  in.fingerd
.sp
становится:
.sp
.ti +5
finger  stream  tcp  nowait  nobody  /some/where/tcpd     in.fingerd
.sp
.fi
.PP
В примере предполагается, что сетевые демоны находятся в /usr/etc. В некоторых
системах сетевые демоны находятся в /usr/sbin или /usr/libexec, у
демонов нет `in.\' префикса к их имени, или
в файле конфигурации inetd отсутствует поле userid.
.PP
Аналогичные изменения потребуются и для других служб, на которые
распространяется действие программы \fItcpd\fR. Отправьте запрос на устранение неполадок в процесс \fIinetd\fR(8)
, чтобы изменения вступили в силу. Пользователям AIX также может
потребоваться выполнить команду 'inetimp\'.
.SH ПРИМЕР 3
В случае демонов, которые не находятся в общем каталоге ("секретном"
или ином), отредактируйте файл конфигурации \fIinetd\fR таким образом, чтобы в нем
был указан абсолютный путь к полю имени процесса. Например:
.nf
.sp
    ntalk  dgram  udp  wait  root  /some/where/tcpd  /usr/local/lib/ntalkd
.sp
.fi
.PP
Только последний компонент (ntalkd) имени пути будет использоваться для
контроля доступа и ведения журнала.
.SH ПРОБЛЕМЫ
Некоторые демоны UDP (и RPC) задерживаются на некоторое время после
завершения своей работы в случае поступления другого запроса. В
файле конфигурации inetd эти службы зарегистрированы с параметром \fIwait\fR
. В журнал будет записан только запрос, который запустил такой демон.
.PP
Программа не работает со службами RPC по протоколу TCP. Эти службы
зарегистрированы как \fIrpc/tcp\fR в файле конфигурации inetd. 
Единственным нетривиальным сервисом, на который распространяется это ограничение, является
\fIrexd\fR, который используется командой \fIon(1)\fR. Это не такая уж большая
потеря. В большинстве систем \fIrexd\fR менее безопасен, чем подстановочный знак в
файле /etc/hosts.equiv.
.PP
Широковещательные запросы RPC (например: \fIrwall, rup, rusers\fR) всегда
поступают от отвечающего хоста. Происходит то, что
клиент передает запрос всем демонам \fIportmap\fR в своей
сети; каждый демон \fIportmap\fR перенаправляет запрос локальному
демону. Насколько известно демонам \fIrwall\fR и т.д., запрос поступает
от локального хоста.
.SH ФАЙЛЫ
.PP
По умолчанию таблицы управления доступом к хосту расположены следующим образом:
.PP
/etc/hosts.allow
.br
/etc/hosts.deny
.SH СМОТРИТЕ ТАКЖЕ
.na
.nf
hosts_access(5), формат таблиц контроля доступа tcpd.
syslog.conf(5), формат управляющего файла syslogd.
inetd.conf(5), формат управляющего файла inetd.
.SH АВТОРЫ
.na
.nf
Виетсе Венема (wietse@wzv.win.tue.nl),
Факультет математики и вычислительной техники,
Технологический университет Эйндховена
Ден Долех, 2, почтовый ящик 513, 
5600 МБ Эйндховен, Нидерланды
\" @(#) tcpd.8 1.5 21.02.96 16:39:16
