melkorbsd/ru-freebsd-man/man8/tftpd.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)tftpd.8	8.1 (Berkeley) 6/4/93
.\"
.Dd July 20, 2023
.Dt TFTPD 8
.Os
.Sh ИМЯ
.Nm tftpd
.Nd сервер протокола тривиальной передачи файлов в Интернете
.Sh КРАТКИЙ ОБЗОР
.Nm tftpd
.Op Fl cdClnow
.Op Fl F Ar strftime-format
.Op Fl s Ar directory
.Op Fl u Ar user
.Op Fl U Ar umask
.Op Ar directory ...
.Sh ОПИСАНИЕ
.Nm
утилита представляет собой сервер, который поддерживает
тривиальную передачу файлов через Интернет
Протокол
.Pq Tn RFC 1350 .
.Tn TFTP
сервер работает
через порт, указанный в
.Ql tftp
описании услуги;
смотрите
.Xr services 5 .
Обычно сервер запускается с помощью
.Xr inetd 8 .
.Pp
Использование
.Xr tftp 1
не требует учетной записи или пароля в удаленной системе.
Из-за отсутствия аутентификационной информации,
.Nm
будет разрешен доступ только к общедоступным файлам.
Файлы, содержащие строку
.Dq Li "/../"
или начинающиеся с
.Dq Li "../"
не допускаются.
Файлы могут быть записаны только в том случае, если они уже существуют(если только
.Fl w
параметр используется) и доступны для публичной записи (если только он не будет удален с корнем и
.Fl S
параметр используется).
Обратите внимание, что это расширяет концепцию
.Dq общедоступности, включающию
всех пользователей на всех хостах, к которым можно получить доступ через сеть;
это может быть применимо не ко всем системам, и
следует учитывать последствия, прежде чем включать службу tftp.
Сервер должен иметь идентификатор пользователя с минимально возможными привилегиями.
.Pp
Доступ к файлам может быть ограничен путем вызова
.Nm
со списком каталогов, включив до 20 путей
в качестве аргументов серверной программы в
.Xr inetd.conf 5 .
В этом случае доступ ограничен к файлам,
имена которых начинаются с префикса одного из указанных каталогов.
Данные каталоги также рассматриваются как путь поиска для
соответствующих запросов имен файлов.
.Pp
.Fl s
параметр обеспечивает дополнительную безопасность за счет изменения
корневого каталога
.Nm ,
тем самым запрещая доступ за пределы указанного
.Ar каталога .
Потому что
.Xr chroot 2
требуются привилегии суперпользователя,
.Nm
должен быть запущен как
.Li root .
Однако после выполнения
.Xr chroot 2
вызова,
.Nm
установит свой идентификатор пользователя на указанный
.Ar user ,
или
.Dq Li nobody
если не указан
.Fl u
параметр.
.Pp
Параметрами являются:
.Bl -tag -width Ds
.It Fl c
Изменяет корневой каталог подключающегося хоста по умолчанию с помощью
.Xr chroot 2
на основе подключаемого IP-адреса.
Это предотвращает одновременную запись данных в один и тот же файл несколькими клиентами.
Если каталог не существует, клиентское соединение не будет установлено.
.Fl s
параметр необходима для
.Fl c
и указывает
.Ar каталог
используемый в качестве основы.
.It Fl C
Работает так же, как
.Fl c
за исключением того, что все возвращается к
.Ar каталогу
указанному с помощью
.Fl s
если для IP-адреса клиента не существует каталога.
.It Fl F
Использует 
.Xr strftime 3
строку совместимого формата для создания суффикса, если
.Fl W
указан.
По умолчанию используется строка "%Y%m%d".
.It Fl d, d Ar [value]
Включает отладочный вывод.
Если
.Ar значение
не указано, то уровень отладки увеличивается на единицу
для каждого экземпляра
.Fl d ,
который указан.
.Pp
Если
.Ar значение
указано, то уровень отладки устанавливается равным
.Ar значению .
Уровень отладки - это битовая маска, реализованная в
.Pa src/libexec/tftpd/tftp-utils.h .
Допустимые значения - 0 (DEBUG_NONE), 1 (DEBUG_PACKETS), 2, (DEBUG_SIMPLE),
4 (DEBUG_OPTIONS), и 8 (DEBUG_ACCESS).  В битовой маске можно объединить несколько значений для отладки
путем логического объединения значений. Например, указав
.Fl d
.Ar 15
включит все значения для отладки.
.It Fl l
Регистрирует все запросы использую
.Xr syslog 3
с помощью
.Dv LOG_FTP .
.Sy Примечание :
Ведение журнала
.Dv LOG_FTP
сообщений
также должно быть включено в файле конфигурации системного журнала,
.Xr syslog.conf 5 .
.It Fl n
Подавляет отрицательное подтверждение запросов на несуществующие
относительные имена файлов.
.It Fl o
Отключает поддержку параметров TFTP в стиле RFC2347.
.It Fl s Ar directory
Причина
.Nm
изменить его корневой каталог на
.Ar каталог .
После этого, но до принятия команд,
.Nm
переключит учетные данные на непривилегированного пользователя.
.It Fl S
Если
.Nm
запускается с правами chrooted, этот параметр разрешает запросы на запись в соответствии с общими
правами доступа к файлам, не требуя, чтобы файлы были общедоступными для записи.
При запуске без прав chrooted этот параметр игнорируется.
.It Fl u Ar user
Переключает учетные данные на
.Ar user
(по умолчанию
.Dq Li nobody ),
когда
.Fl s
параметр используется.
Пользователь должен быть указан по имени, а не по числовому идентификатору UID.
.It Fl U Ar umask
Устанавливает
.Ar umask
для вновь созданных файлов.
По умолчанию это 022
.Pq Dv S_IWGRP | S_IWOTH .
.It Fl w
Разрешает запросы на запись для создания новых файлов.
По умолчанию
.Nm
требуется, чтобы файл, указанный в запросе на запись, существовал.
Обратите внимание, что это работает только в каталогах, доступных для записи пользователем,
указанным с помощью
.Fl u
параметра.
.It Fl W
Тот же
.Fl w
но добавляет порядковый номер YYYYMMDD.nn в конец имени файла.
Обратите внимание, что строка YYYYMMDD может быть изменена с помощью
.Fl F
параметра.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr tftp 1 ,
.Xr chroot 2 ,
.Xr syslog 3 ,
.Xr inetd.conf 5 ,
.Xr services 5 ,
.Xr syslog.conf 5 ,
.Xr inetd 8
.Pp
Поддерживаются следующие RFC:
.Rs
.%T RFC 1350: The TFTP Protocol (Revision 2)
.Re
.Rs
.%T RFC 2347: TFTP Option Extension
.Re
.Rs
.%T RFC 2348: TFTP Blocksize Option
.Re
.Rs
.%T RFC 2349: TFTP Timeout Interval and Transfer Size Options
.Re
.Rs
.%T RFC 7440: TFTP Windowsize Option
.Re
.Pp
Нестандартные
.Cm rollover
и
.Cm blksize2
TFTP параметры упомянуты здесь:
.Rs
.%T Расширение TFTP
.%U http://www.compuphase.com/tftp.htm
.Re
.Sh ИСТОРИЯ
.Nm
утилита появилась в
.Bx 4.2 ;
.Fl s
параметр был представлен в
.Fx 2.2 ,
.Fl u
параметр был представлен в
.Fx 4.2 ,
.Fl c
параметр был представлен в
.Fx 4.3 ,
.Fl F
и
.Fl W
параметры были представлены в
.Fx 7.4 ,
и
.Fl S
параметр был представлен в
.Fx 13.3 .
.Pp
Поддержка параметров интервала ожидания и размера передачи (RFC2349)
была введена в
.Fx 5.0 ,
поддержка параметра размера блока TFTP (RFC2348) и параметра
blksize2 была введена в
.Fx 7.4 .
.Pp
Эдвин Гроотхейс <edwin@FreeBSD.org> полностью переписал
.Nm
и
.Xr tftp 1
код для поддержки RFC2348.
.Pp
Поддержка параметра windowsize (RFC7440) была введена в
.Fx 13.0 .
.Sh ПРИМЕЧАНИЯ
Файлы размером более 33 553 919 байт (65 535 блоков, последний из которых <512
байт) не могут быть корректно переданы без поддержки клиентом и сервером
согласования размера блока (RFC 2347 и 2348)
или нестандартного параметра переноса TFTP.
В качестве дополнения
.Nm
принимает последовательность номеров блоков, которые после 65535 обнуляются,
даже если опция переноса не указана.
.Pp
Многие клиенты tftp не будут передавать файлы длиной более 16 776 703 октетов
(32 767 блоков), поскольку они неправильно подсчитывают номер блока, используя
16-разрядное целое число со знаком, а не без знака.
