melkorbsd/ru-freebsd-man/man8/tftp-proxy.8
.\"	$OpenBSD: tftp-proxy.8,v 1.1 2005/12/28 19:07:07 jcs Exp $
.\"
.\" Copyright (c) 2005 joshua stein <jcs@openbsd.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 28, 2005
.Dt TFTP-PROXY 8
.Os
.Sh ИМЯ
.Nm tftp-proxy
.Nd прокси для Интернет-Протокола Простой Передачи Файлов (TFTP)
.Sh СИНТАКСИС
.Nm tftp-proxy
.Op Fl v
.Op Fl w Ar transwait
.Sh ОПИСАНИЕ
.Nm
это прокси-сервер для Интернет-Протокола Простой Передачи Файлов (TFTP), вызываемый
сервером
.Xr inetd 8.
TFTP-соединения должны быть перенаправлены на прокси-сервер с помощью
команды
.Xr pf 4
.Ar rdr ,
после выполнения которой прокси подключается к серверу от имени
клиента.
.Pp
Прокси устанавливает правило
.Xr pf 4
.Ar rdr ,
использующее объект
.Ar anchor
для перезаписи пакетов между клиентом и сервером.
Как только это правило будет установлено,
.Nm
пересылает первоначальный запрос от клиента на сервер, чтобы начать
передачу.
После нескольких секунд
.Ar ожидания ,
.Xr pf 4
устанавливает состояние NAT, и правило
.Ar rdr
удаляется, и программа завершает работу.
Как только передача данных между клиентом и сервером будет завершена, срок действия состояния 
NAT естественным образом истечет.
.Pp
Предполагая, что запрос команды TFTP поступает от $client к $server,
прокси-сервер подключается к серверу, используя исходный адрес $proxy, и
$port согласовывается,
.Nm
добавляет следующее правило к привязке:
.Bd -literal -offset indent
rdr proto udp from $server to $proxy port $port -\*(Gt $client
.Ed
.Pp
Возможны следующие параметры:
.Bl -tag -width Ds
.It Fl v
Регистрирует соединение и запрашивает информацию у
.Xr syslogd 8 .
.It Fl w Ar transwait
Количество секунд, в течение которых необходимо дождаться начала передачи данных, прежде
чем удалять правило
.Xr pf 4
.Ar rdr .
По умолчанию это 2 секунды.
.El
.Sh КОНФИГУРАЦИЯ
Чтобы воспользоваться прокси-сервером,
.Xr pf.conf 5
необходимы следующие правила.
Обязательными являются якоря (anchor).
Измените правила в соответствии с вашими требованиями к конфигурации.
.Pp
В секции NAT:
.Bd -literal -offset indent
nat on $ext_if from $int_if -\*(Gt ($ext_if:0)

no nat on $ext_if to port tftp

rdr-anchor "tftp-proxy/*"
rdr on $int_if proto udp from $lan to any port tftp -\*(Gt \e
    127.0.0.1 port 6969
.Ed
.Pp
В секции фильтрации необходимо добавить anchor для сохранения разрешающих правил:
.Bd -literal -offset indent
anchor "tftp-proxy/*"
.Ed
.Pp
.Xr inetd 8
должен быть настроен для запуска прокси-сервера на порту, на который
пересылаются пакеты
.Xr pf 4 .
Например следующая запись в
.Xr inetd.conf 5 :
.Bd -literal -offset indent
127.0.0.1:6969	dgram	udp	wait	root \e
	/usr/libexec/tftp-proxy	tftp-proxy
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr tftp 1 ,
.Xr pf 4 ,
.Xr pf.conf 5 ,
.Xr ftp-proxy 8 ,
.Xr inetd 8 ,
.Xr syslogd 8 ,
.Xr tftpd 8
.Sh ПРЕДУПРЕЖДЕНИЯ
.Nm
меняет корневой каталог (chroot) на
.Pa /var/empty
и меняет пользователя на
.Dq proxy ,
чтобы сбросить все привилегии.
