melkorbsd/ru-freebsd-man/man8/traceroute.8
.\" Copyright (c) 1989, 1995, 1996, 1997, 1999, 2000
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	$Id: traceroute.8,v 1.19 2000/09/21 08:44:19 leres Exp $
.\"	$FreeBSD$
.\"
.Dd November 25, 2020
.Dt TRACEROUTE 8
.Os
.Sh ИМЯ
.Nm traceroute
.Nd "печатает маршрут передачи пакетов на сетевой узел"
.Sh СИНТАКСИС
.Nm
.Bk -words
.Op Fl adDeFISnrvx
.Op Fl f Ar first_ttl
.Op Fl g Ar gateway
.Op Fl M Ar first_ttl
.Op Fl m Ar max_ttl
.Op Fl P Ar proto
.Op Fl p Ar port
.Op Fl q Ar nprobes
.Op Fl s Ar src_addr
.Op Fl t Ar tos
.Op Fl w Ar waittime
.Op Fl A Ar as_server
.Op Fl z Ar pausemsecs
.Ar host
.Op Ar packetlen
.Ek
.Sh ОПИСАНИЕ
Интернет представляет собой большое и сложное объединение
сетевого оборудования, соединенных между собой шлюзами.
Отследить маршрут, по которому проходят пакеты (или найти
шлюз-нарушитель, который отбрасывает ваши пакеты), может быть непросто.
.Nm
использует поле "время жизни" IP-протокола и пытается получить
ICMP TIME_EXCEEDED получил ответ от каждого шлюза на пути к некоторому
хосту.
.Pp
Единственным обязательным параметром является имя узла назначения или IP-адрес.
Длина датаграммы проверки по умолчанию составляет 40 байт, но ее можно увеличить,
указав длину пакета (в байтах) после
имени узла назначения.
.Pp
Другими параметрами являются:
.Bl -tag -width Ds
.It Fl a
Включает поиск AS# для каждого встреченного перехода.
.It Fl A Ar as_server
Включает AS# lookups и использует указанный сервер вместо сервера по
умолчанию.
.It Fl e
Режим обхода брандмауэра.
Использует фиксированные порты назначения для запросов UDP, UDP-Lite, TCP и SCTP.
Порт назначения не увеличивается с каждым отправленным пакетом.
.It Fl f Ar first_ttl
Устанавливает начальное время работы, используемое в первом исходящем контрольном пакете.
.It Fl F
Устанавливает бит "не фрагментировать".
.It Fl d
Включает отладку на уровне сокета.
.It Fl D
Когда будет получен ICMP-ответ на нашу пробную дейтаграмму,
выведет различия между переданным пакетом и
пакетом, указанным в ICMP-ответе.
Печатается ключ, показывающий расположение полей в передаваемом пакете,
за которым следует исходный пакет в шестнадцатеричном формате, а
затем пакет, заключенный в кавычки, в шестнадцатеричном формате.
Байты, которые не изменились в пакете, заключенном в кавычки, отображаются в виде подчеркиваний.
Обратите внимание,
что контрольная сумма IP и TTL указанного пакета не должны совпадать.
По умолчанию при использовании этой опции отправляется только один запрос за переход.
.It Fl g Ar gateway
Указывает свободный исходный шлюз маршрута (максимум 8).
.It Fl i Ar iface
Указывает сетевой интерфейс, чтобы получить исходный IP-адрес для
исходящих пробных пакетов. Обычно это полезно только для хостинга с несколькими домами.
(Смотрите флаг
.Fl s
для другого способа сделать это.)
.It Fl I
Использует ICMP ECHO вместо UDP-дейтаграмм. (Синоним "-P icmp").
.It Fl M Ar first_ttl
Устанавливает начальное значение времени ожидания, используемое в исходящих пробных пакетах.
Значение по умолчанию равно 1, т.е. начинается с первого перехода.
.It Fl m Ar max_ttl
Устанавливается максимальное время ожидания (максимальное количество переходов), используемое в исходящих пробных
пакетах. По умолчанию используется значение
.Va net.inet.ip.ttl
.Xr sysctl 8
(то же значение по умолчанию, что и для TCP
-соединений).
.It Fl n
Печатает адреса переходов в виде чисел, а не символов и цифр
(сохраняет поиск адреса сервера имен по имени для каждого шлюза, найденного на
пути).
.It Fl P Ar proto
Отправляетпакеты по указанному IP-протоколу. В настоящее время поддерживаются следующие протоколы
: UDP, UDP-Lite, TCP, SCTP, GRE и ICMP. Также могут быть
указаны другие протоколы (либо по имени, либо по номеру), хотя
.Nm
не реализует никаких специальных знаний о форматах пакетов. Эта
опция полезна для определения того, какой маршрутизатор на пути может
блокировать пакеты на основе номера IP-протокола. Но об ошибках смотрите ниже. Но смотрите НЕИСПРАВНОСТИ ниже.
.It Fl p Ar port
Зависит от конкретного протокола. Для UDP, UDP-Lite, TCP и SCTP задает
базовый номер
.Ar порта ,
используемый в тестах (по умолчанию - 33434).
Traceroute ожидает, что UDP-порты не прослушиваются(или порты UDP-Lite,
если они используются
.Nm
и поддерживаются сверстником)
.Em port + 1
в
.Em port + (max_ttl - first_ttl + 1) * nprobes
на узле назначения (таким
образом, будет возвращено сообщение ICMP PORT_UNREACHABLE для завершения трассировки маршрута). Если что-то
прослушивает порт в диапазоне по умолчанию, этот параметр можно использовать
для выбора неиспользуемого диапазона портов.
.It Fl q Ar nprobes
Устанавливает количество зондов за один переход (по умолчанию - 3,
если только
.Fl D
указан,
когда это 1).
.It Fl r
Обход обычных таблиц маршрутизации и отправка непосредственно на узел в подключенной
сети.
Если узел не подключен к сети напрямую,
возвращается сообщение об ошибке.
Этот параметр можно использовать для проверки связи с локальным хостом через интерфейс,
через который нет маршрута (например, после того, как интерфейс был удален
.Xr routed 8 ).
.It Fl s Ar src_addr
Использует следующий IP-адрес (который обычно указывается как IP-номер, а не
как имя хоста) в качестве адреса источника в исходящих контрольных пакетах. На
хостах с несколькими домами (имеющих более одного IP-адреса)
эта опция может быть использована для того, чтобы
заставить исходный адрес быть чем-то иным, чем IP-адрес
интерфейса, по которому отправляется пробный пакет. Если IP-адрес
не является одним из интерфейсных адресов этого компьютера,
возвращается сообщение об ошибке и ничего не отправляется. (Смотрите флаг
.Fl i
для другого способа сделать это.)
.It Fl S
Выводит сводную информацию о том, на сколько запросов не были получены ответы за каждый переход.
.It Fl t Ar tos
Устанавливает
.Em type-of-service
в пакетах проверки на следующее значение (по умолчанию ноль). Значение должно быть
десятичным целым числом в диапазоне от 0 до 255. Этот параметр можно использовать, чтобы
увидеть, приводят ли разные типы обслуживания к разным путям. Верхние шесть
битов представляют собой кодовую точку дифференцированных служб (RFC4594). Два нижних
бита представляют собой поле явного уведомления о перегрузке (RFC3168).
.It Fl v
Подробный вывод. Получает ICMP-пакеты, отличные от
.Dv TIME_EXCEEDED
и
.Dv UNREACHABLE Ns s
отображаемые в списке.
.It Fl w Ar waittime
Устанавливает время (в секундах) ожидания ответа на запрос (по умолчанию 5
секунд).
.It Fl x
Переключает контрольные суммы ip. Обычно это не позволяет traceroute вычислять
контрольные суммы ip. В некоторых случаях операционная система может перезаписывать части
исходящего пакета, но не пересчитывать контрольную сумму (поэтому в некоторых случаях
по умолчанию контрольные суммы не вычисляются, а используются
.Fl x
приводиящие к их вычислению). Обратите внимание, что контрольные суммы обычно требуются
для последнего перехода при использовании ECHO ICMP зондов
.Pq Fl I .
Таким образом, они всегда вычисляются при использовании ICMP.
.It Fl z Ar pausemsecs
Устанавливает время (в миллисекундах) паузы между запросами (по умолчанию 0).
Некоторые системы, такие как Solaris, и маршрутизаторы, такие как Cisco, ограничивают скорость
передачи icmp-сообщений. Оптимальное значение для этого параметра - 500 (например, 1/2 секунды).
.El
.Pp
Эта программа попытается проследить маршрут IP-пакет будет следить, чтобы некоторые
интернет-узел запуска зонда UDP
пакеты с небольшой TTL (время жить), то прослушивание
Протокол ICMP "превышение времени" ответ от шлюза. Мы начинаем наши проверки
с ttl, равным единице, и увеличиваем его на единицу, пока не получим ICMP-сообщение "порт
недоступен" (что означает, что мы добрались до "хоста") или не достигнем максимального значения (которое
по умолчанию равно количеству переходов, указанному
.Va net.inet.ip.ttl
.Xr sysctl 8
и может быть изменен с помощью флага
.Fl m ).
Три зонда (изменяемые с помощью флага
.Fl q )
отправляются при каждой настройке ttl, и
печатается строка, показывающая ttl, адрес шлюза и
время прохождения каждого запроса в оба конца. Если ответы на запросы поступают от
разных шлюзов, будет напечатан адрес каждой отвечающей системы.
Если в течение 5-секундного интервала ожидания ответа не будет
(изменяемое вместе с флагом
.Fl w ),
для этого зонда напечатан символ "*".
.Pp
Мы не хотим, чтобы хост назначения обрабатывал пакеты проверки UDP, поэтому для порта назначения задано
маловероятное значение (если какой-либо узел назначения использует это
значение, его можно изменить с помощью флага
.Fl p ).
.Pp
Примером использования и выходных данных может быть:
.Bd -literal -offset 4n
% traceroute nis.nsf.net.
traceroute to nis.nsf.net (35.1.1.48), 64 hops max, 38 byte packet
 1  helios.ee.lbl.gov (128.3.112.1)  19 ms  19 ms  0 ms
 2  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  39 ms  19 ms
 3  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  39 ms  19 ms
 4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  39 ms  40 ms  39 ms
 5  ccn-nerif22.Berkeley.EDU (128.32.168.22)  39 ms  39 ms  39 ms
 6  128.32.197.4 (128.32.197.4)  40 ms  59 ms  59 ms
 7  131.119.2.5 (131.119.2.5)  59 ms  59 ms  59 ms
 8  129.140.70.13 (129.140.70.13)  99 ms  99 ms  80 ms
 9  129.140.71.6 (129.140.71.6)  139 ms  239 ms  319 ms
10  129.140.81.7 (129.140.81.7)  220 ms  199 ms  199 ms
11  nic.merit.edu (35.1.1.48)  239 ms  239 ms  239 ms
.Ed
.Pp
Обратите внимание, что строки 2 и 3 совпадают. Это связано с ошибкой
ядра в системе 2-го перехода \- lilac-dmc.Berkeley.EDU\- который пересылает
пакеты с нулевым ttl (ошибка в распространяемой версии
4.3BSD). Обратите внимание, что вы должны угадать, какой путь
проходят пакеты через всю страну, поскольку сеть NSFNet (129.140)
не предоставляет преобразования адреса в имя для своих NSS.
.Pp
Более интересным примером является:
.Bd -literal -offset 4n
% traceroute allspice.lcs.mit.edu.
traceroute to allspice.lcs.mit.edu (18.26.0.115), 64 hops max
 1  helios.ee.lbl.gov (128.3.112.1)  0 ms  0 ms  0 ms
 2  lilac-dmc.Berkeley.EDU (128.32.216.1)  19 ms  19 ms  19 ms
 3  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  19 ms  19 ms
 4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  19 ms  39 ms  39 ms
 5  ccn-nerif22.Berkeley.EDU (128.32.168.22)  20 ms  39 ms  39 ms
 6  128.32.197.4 (128.32.197.4)  59 ms  119 ms  39 ms
 7  131.119.2.5 (131.119.2.5)  59 ms  59 ms  39 ms
 8  129.140.70.13 (129.140.70.13)  80 ms  79 ms  99 ms
 9  129.140.71.6 (129.140.71.6)  139 ms  139 ms  159 ms
10  129.140.81.7 (129.140.81.7)  199 ms  180 ms  300 ms
11  129.140.72.17 (129.140.72.17)  300 ms  239 ms  239 ms
12  * * *
13  128.121.54.72 (128.121.54.72)  259 ms  499 ms  279 ms
14  * * *
15  * * *
16  * * *
17  * * *
18  ALLSPICE.LCS.MIT.EDU (18.26.0.115)  339 ms  279 ms  279 ms
.Ed
.Pp
Обратите внимание, что удаленные шлюзы 12, 14, 15, 16 и 17
либо не отправляют ICMP-сообщения о превышении времени, либо отправляют их
со слишком малым ttl, чтобы достичь нас. 14 \- 17 используют
код шлюза MIT C, который не отправляет сообщения о превышении времени. Одному богу
известно, что происходит с 12-м номером.
.Pp
Отключенный шлюз 12, описанный выше, может быть результатом ошибки в
сетевом коде 4.[23]BSD (и его производных): 4.x (x <= 3),
отправляет сообщение о недоступности, используя любой ttl, оставшийся в
исходной дейтаграмме. Поскольку для шлюзов оставшийся ttl равен
нулю, сообщение ICMP "превышено время" гарантированно не вернется
к нам. Поведение этой ошибки немного интереснее,
когда она появляется в целевой системе:
.Bd -literal -offset 4n
 1  helios.ee.lbl.gov (128.3.112.1)  0 ms  0 ms  0 ms
 2  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  19 ms  39 ms
 3  lilac-dmc.Berkeley.EDU (128.32.216.1)  19 ms  39 ms  19 ms
 4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  39 ms  40 ms  19 ms
 5  ccn-nerif35.Berkeley.EDU (128.32.168.35)  39 ms  39 ms  39 ms
 6  csgw.Berkeley.EDU (128.32.133.254)  39 ms  59 ms  39 ms
 7  * * *
 8  * * *
 9  * * *
10  * * *
11  * * *
12  * * *
13  rip.Berkeley.EDU (128.32.131.22)  59 ms !  39 ms !  39 ms !
.Ed
.Pp
Обратите внимание, что существует 12 "шлюзов" (13 - это конечный
пункт назначения), и ровно половина из них "отсутствует".
Что на самом деле происходит, так это то, что rip (Sun-3 под управлением Sun OS3.5)
использует ttl из нашей поступающей дейтаграммы в качестве ttl в своем
ICMP-ответе. Таким образом, время ожидания ответа на обратном пути
истечет (без уведомления, отправленного кому-либо, поскольку ICMP-сообщения не отправляются для
ICMP), пока мы не проверим с помощью ttl, который, по крайней мере, вдвое
превышает длину пути. То есть rip на самом деле находится всего в 7 переходах. Ответ, который
возвращает значение ttl, равное 1, указывает на существование проблемы.
Traceroute выводит символ "!" после заданного времени, если значение ttl <= 1.
Поскольку поставщики поставляют много устаревших
.Pf ( Tn DEC Ns \'s
Ultrix, Sun 3.x) или
нестандартное
.Pq Tn HP-UX
программное обеспечение, ожидайте, что вы будете часто сталкиваться с этой проблемой,
и/или позаботьтесь о выборе целевого хоста для ваших
зондов.
.Pp
Другими возможными комментариями по истечении этого времени являются:
.Bl -hang -offset indent -width 12n
.It Sy !H
Хост недоступен.
.It Sy !N
Сеть недоступна.
.It Sy !P
Протокол недоступен.
.It Sy !S
Сбой исходного маршрута.
.It Sy !F\-<pmtu>
Необходима фрагментация.
Отображается значение обнаружения MTU пути RFC1191.
.It Sy !U
Конечная сеть неизвестна.
.It Sy !W
Конечный хост неизвестен.
.It Sy !I
Исходный хост изолирован.
.It Sy !A
Связь с целевой сетью запрещена в административном порядке.
.It Sy !Z
Связь с хостом назначения запрещена в административном порядке.
.It Sy !Q
Для этого ToS целевая сеть недоступна.
.It Sy !T
Для этого ToS конечный хост недоступен.
.It Sy !X
Общение запрещено в административном порядке.
.It Sy !V
Нарушение приоритета хоста.
.It Sy !C
Действует ограничение приоритета.
.It Sy !<num>
Недоступный код ICMP <num>.
.El
.Pp
Они определены в RFC1812 (который заменяет RFC1716).
Если почти все проверки приводят к каким-либо недостижимым результатам,
.Nm
сдастся и выйдет.
.Pp
Эта программа предназначена для тестирования, измерений
и управления сетью.
Ее следует использовать в первую очередь для ручной изоляции неисправностей.
Из-за возможной нагрузки на сеть использовать ее нецелесообразно
.Nm
во время обычных операций или из автоматизированных сценариев.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr netstat 1 ,
.Xr ping 8 ,
.Xr traceroute6 8 .
.Sh АВТОРЫ
Реализован Ван Джейкобсоном по предложению Стива Диринга. Отлажен
тысячами разработчиков с особенно убедительными предложениями или исправлениями от
К. Филипа Вуда, Тима Сивера и Кена Адельмана.
.Sh ПРОБЛЕМЫ
При использовании протоколов, отличных от UDP, функциональность снижается.
В частности, часто кажется, что последний пакет потерян, потому
что, даже если он достигает узла назначения, нет способа узнать
об этом, поскольку обратно не отправляется ICMP-сообщение.
В случае с TCP,,
.Nm
следует прослушивать RST от хоста назначения (или промежуточного
маршрутизатора, который фильтрует пакеты), но это еще не реализовано.
.Pp
Функция AS number предоставляет информацию, которая иногда может быть
неточной из-за несоответствий между содержимым
сервера базы данных маршрутизации и текущим состоянием Интернета.
