melkorbsd/ru-freebsd-man/man8/traceroute6.8
.\"	$KAME: traceroute6.8,v 1.10 2004/06/06 12:35:15 suz Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 25, 2020
.Dt TRACEROUTE6 8
.Os
.\"
.Sh ИМЯ
.Nm traceroute6
.Nd "выводит маршрут, по которому пакеты IPv6 будут поступать к сетевому узлу"
.\"
.Sh СИНТАКСИС
.Nm
.Bk -words
.Op Fl adIlnNrSTUv
.Ek
.Bk -words
.Op Fl f Ar firsthop
.Ek
.Bk -words
.Op Fl g Ar gateway
.Ek
.Bk -words
.Op Fl m Ar hoplimit
.Ek
.Bk -words
.Op Fl p Ar port
.Ek
.Bk -words
.Op Fl q Ar probes
.Ek
.Bk -words
.Op Fl s Ar src
.Ek
.Bk -words
.Op Fl t Ar tclass
.Ek
.Bk -words
.Op Fl w Ar waittime
.Ek
.Bk -words
.Op Fl A Ar as_server
.Ek
.Bk -words
.Ar target
.Op Ar datalen
.Ek
.\"
.Sh ОПИСАНИЕ
Утилита
.Nm
использует поле ограничения перехода по протоколу IPv6 для получения ответа ICMPv6 TIME_EXCEEDED
от каждого шлюза на пути к некоторому хосту.
.Pp
Единственным обязательным параметром является имя узла назначения или IPv6-адрес.
Датаграмма проверки по умолчанию содержит 20 байт полезной нагрузки
в дополнение к заголовку IPv6.
Размер полезной нагрузки можно указать, указав длину
(в байтах)
после имени целевого хоста.
.Pp
Другими параметрами являются:
.Bl -tag -width Ds
.It Fl a
Включает поиск AS# для каждого встреченного перехода.
.It Fl A Ar as_server
Включает AS# поиск и использует указанный сервер вместо сервера по умолчанию.
.It Fl d
Режим отладки.
.It Fl f Ar firsthop
Указывает, сколько переходов следует пропустить при трассировке.
.It Fl g Ar gateway
Указывает промежуточный шлюз.
Пожалуйста, обратите внимание, что
.Nm
пытается использовать заголовки маршрутизации.
.It Fl I
Использует ICMP6 ECHO вместо UDP-дейтаграмм.
.It Fl l
Печатает как имена хостов, так и цифровые адреса.
Обычно
.Nm
печатает только имена хостов, если
не указан 
.Fl n , 
и только цифровые адреса, если
указан 
.Fl n .
.It Fl m Ar hoplimit
Указывает максимальный hoplimit, не превышающий 255.
По умолчанию используется значение
.Va net.inet6.ip6.hlim
.Xr sysctl 8
(то же значение по умолчанию используется для TCP-соединений).
.It Fl n
Не преобразуtn числовой адрес в имя хоста.
.It Fl N
Использет пакет без заголовка верхнего уровня для зондов
вместо UDP-дейтаграмм.
.It Fl p Ar port
Устанавливает номер порта SCTP/TCP/UDP равным
.Ar port .
.It Fl q Ar probes
Устанавливает количество зондов на один переход равным
.Ar probes .
.It Fl r
Обход обычных таблиц маршрутизации и отправка непосредственно на узел
в подключенной сети.
Если узел не подключен к сети напрямую,
возвращается сообщение об ошибке.
Этот параметр соответствует параметру сокета
.Dv SO_DONTROUTE ;
он может быть использован для проверки связи с локальным хостом через интерфейс, 
через который нет маршрута
(например, после того, как интерфейс был удален демоном маршрутизации).
.It Fl s Ar src
.Ar Src
указывает исходный IPv6-адрес, который будет использоваться.
.It Fl S
Используйте SCTP-пакеты для зондирования.
Размер зондирующих пакетов должен быть кратен 4.
Если
.Ar datalen
поднимается до 28, пакеты проверки состоят из блока подтверждения завершения работы, возможно, связанного
с блоком PAD.
Для пакетов проверки большего размера используется блок инициализации.
.It Fl t Ar tclass
.Ar tclass
определяет
.Em класс трафика , 
используемый при отправке пробных пакетов.
Значение должно быть десятичным целым числом в диапазоне от 0 до 255.
Значение по умолчанию равно 0.
.It Fl T
Использует сегменты TCP для зондов.
.It Fl U
Используетдейтаграммы UDP для зондирования.
Это значение используется по умолчанию.
.It Fl v
Подробнее.
.It Fl w Ar waittime
Указывает время задержки между пробами.
.El
.Pp
Эта программа выводит маршрут до заданного пункта назначения и время в пути туда и обратно
до каждого шлюза таким же образом, как и traceroute.
.Pp
Ниже приведен список возможных аннотаций по истечении времени прохождения в оба конца для каждого шлюза:
.Bl -hang -offset indent
.It !N
Пункт назначения недостижим - Нет пути к хосту.
.It !P
Пункт назначения недостижим - В административном порядке запрещено.
.It !S
Пункт назначения недостижим - Не соседний.
.It !A
Пункт назначения недостижим - Адрес недоступен.
.It !H
Проблема с параметрами - Нераспознанный следующий тип заголовка.
.It !\&
Это значение выводится, если для сообщения о недоступности порта предел перехода <= 1.
Это означает, что пакет дошел до адресата,
но у ответа был предел перехода, который был достаточно велик, чтобы
позволить ему вернуться к источнику traceroute6.
Это было более интересно в случае с IPv4,
где по такому поведению можно было определить некоторые ошибки в стеке IP.
.El
.\"
.Sh ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
Утилита
.Nm
завершит работу с 0 в случае успеха и ненулевым значением в случае ошибок.
.\"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr ping 8 ,
.Xr traceroute 8
.\"
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в комплекте WIDE hydrangea IPv6 protocol stack kit.
