melkorbsd/ru-freebsd-man/man8/trim.8
.\"
.\" Copyright (c) 2019 Eugene Grosbein <eugen@FreeBSD.org>.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 18, 2019
.Dt TRIM 8
.Os
.Sh ИМЯ
.Nm trim
.Nd удаляет блоки устройства, которые не содержат необходимого содержимого
.Sh СИНТАКСИС
.Nm
.Op Fl Nfqv
.Fl [ [lo] Xo
.Bk -words
.Sm off
.Ar offset
.Op Cm K | k | M | m | G | g | T | t ]
.Sm on
.Xc
.Ek
.Bk -words
.Op Fl r Ar rfile
.Ek
.Ar device ...
.Sh ОПИСАНИЕ
Утилита
.Nm
стирает указанную область устройства.
В основном это актуально для хранилищ, в которых реализована функция trim (например, на основе флэш-памяти
или хранилища с тонкой настройкой).
.Sy Все удаленные данные будут потеряны.
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl N
На самом деле ничего не стирает, но показывает, что будет сделано (пробный запуск).
Подразумевает
.Fl v .
Это значение используется по умолчанию.
Переопределяет
.Fl f .
.It Fl f
Выполняет операцию.
Переопределяет
.Fl N .
.It Fl l Xo
.Sm off
.Ar offset
.Op Cm K | k | M | m | G | g | T | t
.Sm on
.Xc
.It Fl o Xo
.Sm off
.Ar offset
.Op Cm K | k | M | m | G | g | T | t
.Sm on
.Xc
Указывает длину области
.Fl l ,
подлежащей обрезке, или ее смещению
.Fl o
с самого начала работы устройства.
.Sy По умолчанию все данные с устройства удаляются ,
если не указан один или оба этих параметра.
.Pp
В качестве суффикса к аргументу может быть добавлен один из
.Cm K ,
.Cm M ,
.Cm G
или
.Cm T
(прописными или строчными буквами) для обозначения кратности
Килобайт, Мегабайт, Гигабайт или Терабайт
соответственно.
.It Fl q
Не выводит ничего, кроме возможных сообщений об ошибках (тихий режим).
Переопределяет
.Fl v .
.It Fl r Ar rfile
Использует длину заданного
.Ar rfile
как длину области, которую нужно стереть.
.Sy По умолчанию все данные с устройства удаляются.
.It Fl v
Показывает смещение и длину фактической удаляемой области в байтах.
.El
.Pp
Более поздние параметры переопределяют предыдущие.
.Pp
Обратите внимание, что фактический успех операции зависит от базового
драйвера устройства, такого как
.Xr ada 4 ,
.Xr da 4
и других.
Обратитесь к соответствующим страницам руководства для получения подробной информации о возможных недостатках
в низкоуровневой поддержке команд ATA TRIM или SCSI UNMAP.
.Sh ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
.Ex -std
Если окончательная операция удаления завершается неудачей для аргумента, то утилита
.Nm
возвращает код выхода 1.
Она также может возвращать один из кодов выхода, определенных в
.Xr sysexits 3 ,
следующим образом:
.Bl -tag -width ".Dv EX_UNAVAILABLE"
.It Dv EX_USAGE
Указанное смещение или длина области неверны.
.It Dv EX_OSERR
Для продолжения работы недостаточно памяти.
.It Dv EX_NOINPUT
Указанный
.Ar rfile
не может быть открыт (возможно, его просто не существует).
.It Dv EX_IOERR
Не удается определить размер указанного
.Ar rfile
из-за какой-либо системной ошибки ввода/вывода.
.It Dv EX_DATAERR
Указанный
.Ar rfile
не является обычным файлом, каталогом или специальным устройством, поэтому его размер
невозможно определить.
.It Dv EX_UNAVAILABLE
Указанный
.Ar rfile
это специальный файл устройства, не поддерживающий DIOCGMEDIASIZE
.Xr ioctl 2
(вероятно, это не диск), поэтому его размер невозможно определить.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr ioctl 2 ,
.Xr sysexits 3 ,
.Xr ada 4 ,
.Xr da 4 ,
.Xr nda 4
.Sh ИСТОРИЯ
Утилита
.Nm
впервые появилась в
.Fx 12.1 .
.Sh АВТОРЫ
Утилита
.Nm
была написана
.An Юджином Гросбейном Aq Mt eugen@FreeBSD.org .
