melkorbsd/ru-freebsd-man/man8/tunefs.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)tunefs.8	8.2 (Berkeley) 12/11/93
.\"
.Dd August 16, 2022
.Dt TUNEFS 8
.Os
.Sh ИМЯ
.Nm tunefs
.Nd настройка существующей файловой системы UFS
.Sh КРАТКИЙ ОБЗОР
.Nm
.Op Fl A
.Op Fl a Cm enable | disable
.Op Fl e Ar maxbpg
.Op Fl f Ar avgfilesize
.Op Fl j Cm enable | disable
.Op Fl J Cm enable | disable
.Op Fl k Ar held-for-metadata-blocks
.Op Fl L Ar volname
.Op Fl l Cm enable | disable
.Op Fl m Ar minfree
.Op Fl N Cm enable | disable
.Op Fl n Cm enable | disable
.Op Fl o Cm space | time
.Op Fl p
.Op Fl s Ar avgfpdir
.Op Fl S Ar size
.Op Fl t Cm enable | disable
.Ar special | filesystem
.Sh ОПИСАНИЕ
.Nm
утилита предназначена для изменения динамических параметров файловой системы UFS,
которые влияют на политику компоновки.
.Nm
утилита не может быть запущена в активной файловой системе.
Чтобы изменить активную файловую систему,
ее необходимо изменить на доступную только для чтения или размонтировать.
.Pp
Параметры, которые необходимо изменить, обозначены флагами,
приведенными ниже:
.Bl -tag -width indent
.It Fl A
В файловой системе имеется несколько резервных копий суперблока.
Указание
этого параметра приведет к изменению всех резервных копий, а также
основного суперблока.
Это потенциально опасно - используйте с осторожностью.
.It Fl a Cm enable | disable
Включает/выключает флаг административного списка управления доступом POSIX.1e.
.It Fl e Ar maxbpg
Указывает максимальное количество блоков, которые может выделить любой отдельный файл
из группы цилиндров, прежде чем он будет вынужден начать
выделение блоков из другой группы цилиндров.
Обычно это значение устанавливается равным примерно четверти от общего количества блоков
в группе цилиндров.
Цель состоит в том, чтобы предотвратить использование каким-либо отдельным файлом всех
блоков в одной группе цилиндров,
что приведет к сокращению времени доступа ко всем файлам, впоследствии размещенным
в этой группе цилиндров.
Это ограничение приводит к тому, что большие файлы выполняют длительный поиск
чаще, чем если бы им разрешалось размещать все блоки
в группе цилиндров, прежде чем выполнять поиск в другом месте.
Для файловых систем с исключительно большими файлами
этот параметр следует установить выше.
.It Fl f Ar avgfilesize
Указывает ожидаемый средний размер файла.
.It Fl j Cm enable | disable
Включает/выключает ведение журнала программных обновлений.
.Pp
Включение ведения журнала сокращает время, затрачиваемое
.Xr fsck_ffs 8
на очистку файловой системы после сбоя, с нескольких минут до нескольких часов.
Без ведения журнала время восстановления после сбоя зависит
от количества файлов в файловой системе и ее размера.
При ведении журнала время восстановления после сбоя зависит от
активности в файловой системе за минуту до сбоя.
Время восстановления, записанное в журнал, обычно составляет всего несколько секунд и никогда
не превышает минуты.
.Pp
Недостатком использования журналирования является то, что запись в журнал
приводит к дополнительной нагрузке на носитель, содержащий файловую систему.
Таким образом, нагрузка, связанная с интенсивной записью, приведет к снижению пропускной
способности файловой системы, работающей с журналированием.
.Pp
Как и во всех файловых системах ведения журнала, при восстановлении журнала будут устранены только
известные журналу проблемы.
В частности, если произойдет ошибка носителя,
журнал не узнает об этом и, следовательно, не исправит ее.
Таким образом, при использовании журналирования все равно необходимо запускать полную проверку fsck
каждые несколько месяцев или после сбоя файловой системы, чтобы проверить и исправить
любые ошибки, вызванные сбоем носителя.
Полная проверка fsck может быть выполнена путем запуска фоновой проверки fsck в действующей
файловой системе или с помощью
.Fl f
флага для немонтированной файловой системы.
При запуске
.Xr fsck_ffs 8
в фоновом режиме в работающей файловой системе производительность
файловой системы будет примерно вдвое ниже нормальной в течение того времени, пока в фоновом режиме 
.Xr fsck_ffs 8
работает.
Запуск полной проверки fsck в файловой системе UFS эквивалентен
запуску очистки в файловой системе ZFS.
.It Fl J Cm enable | disable
Включает/выключает флаг gjournal.
.It Fl k Ar held-for-metadata-blocks
Задает объем пространства, который будет выделен для блоков метаданных.
Если этот параметр установлен, процедуры настройки файловой системы попытаются сохранить
указанный объем пространства непосредственно после индексных блоков
в каждой группе цилиндров для использования блоками метаданных.
Кластеризация блоков метаданных ускоряет произвольный доступ к файлам
и сокращает время выполнения
.Xr fsck 8 .
Хотя этот параметр можно установить в любое время,
он наиболее эффективен, если его установить до загрузки каких-либо данных в файловую систему.
По умолчанию
.Xr newfs 8
устанавливает его равным половине пространства, зарезервированного для minfree.
.It Fl L Ar volname
Добавляет/изменяет необязательную метку тома файловой системы.
Допустимыми символами являются буквы и цифры, тире и подчеркивания.
.It Fl l Cm enable | disable
Включает/выключает флаг MAC multilabel.
.It Fl m Ar minfree
Указывает процент свободного места,
недоступного обычным пользователям; минимальный порог свободного места.
По умолчанию используется значение 8%.
Обратите внимание, что снижение порога может отрицательно сказаться на производительности:
.Bl -bullet
.It
Настройки, равные 5% и менее, заставляют
всегда использовать оптимизацию пространства, что значительно увеличивает затраты на
запись файлов.
.It
Способность файловой системы избегать фрагментации снижается,
когда общее количество свободного места, включая резервное, падает ниже 15%.
Когда количество свободного места приближается к нулю, пропускная
способность может снизиться в три раза по сравнению с производительностью, достигнутой при пороговом значении в 10%.
.El
.Pp
Если значение превысит текущий уровень использования,
пользователи не смогут распределять файлы до
тех пор, пока не будет удалено достаточное количество файлов, чтобы превысить более высокий порог.
.It Fl N Cm enable | disable
Включает/выключает флаг административного списка управления доступом NFSv4.
.It Fl n Cm enable | disable
Включает/выключает программные обновления.
.It Fl o Cm space | time
Файловая система может либо попытаться минимизировать время, затрачиваемое
на выделение блоков, либо попытаться минимизировать
фрагментацию пространства на диске.
Оптимизация пространства приводит к гораздо
большим затратам на запись файлов.
Ядро обычно автоматически изменяет настройки по мере
изменения процента фрагментации в файловой системе.
.It Fl p
Отображает сводную информацию о текущих настраиваемых параметрах
в выбранной файловой системе.
Более подробную информацию можно
получить в
.Xr dumpfs 8
утилите.
.It Fl s Ar avgfpdir
Указывает ожидаемое количество файлов в каждом каталоге.
.It Fl S Ar size
Указывает размер журнала softdep в байтах.
Минимальное значение - 4 миллиона.
.It Fl t Cm enable | disable
Включает/выключает флаг TRIM enable.
Если он включен и если базовое устройство поддерживает
команду BIO_DELETE, файловая система будет отправлять запрос на удаление базовому
устройству для каждого освобожденного блока.
Флаг trim enable обычно устанавливается, когда базовое устройство
использует флэш-память, поскольку устройство может использовать команду delete для
предварительного обнуления или, по крайней мере, для предотвращения копирования удаленных блоков.
.Pp
Обратите внимание, что при этом не обрезаются блоки, которые уже свободны.
Смотрите
.Xr fsck_ffs 8
.Fl E
флаг.
.El
.Pp
Необходим хотя бы один из этих флагов.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /etc/fstab"
.It Pa /etc/fstab
читается, чтобы определить файл устройства для
указанной точки подключения.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr fs 5 ,
.Xr dumpfs 8 ,
.Xr gjournal 8 ,
.Xr growfs 8 ,
.Xr newfs 8
.Rs
.%A М. Маккьюзик
.%A У. Джой
.%A С. Леффлер
.%A Р. Фабри
.%T "Быстрая файловая система для UNIX"
.%J "Транзакции ACM в компьютерных системах 2"
.%N 3
.%P стр. 181-197
.%D Август 1984
.%O "(перепечатано в Руководстве системного менеджера BSD, SMM:5)"
.Re
.Sh ИСТОРИЯ
.Nm
утилита появилась в
.Bx 4.2 .
.Sh НЕИСПРАВНОСТИ
Эта утилита не работает с активными файловыми системами.
Чтобы изменить корневую файловую систему, необходимо перезагрузить
систему после настройки файловой системы.
.\" Take this out and a Unix Daemon will dog your steps from now until
.\" the time_t's wrap around.
.Pp
Вы можете настроить файловую систему, но вы не можете настроить fish.
