melkorbsd/ru-freebsd-man/man8/tzsetup.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 18, 2023
.Dt TZSETUP 8
.Os
.Sh ИМЯ
.Nm tzsetup
.Nd устанавливает местный часовой пояс
.Sh КРАТКИЙ ОБЗОР
.Nm
.Op Fl nrs
.Op Fl C Ar chroot_directory
.Op Ar zoneinfo_file | zoneinfo_name
.Sh ОПИСАНИЕ
.Nm
утилита считывает информацию о часовых поясах из базы данных и отображает меню,
позволяющее пользователю выбрать конкретную зону, не зная деталей
расположения базы данных.
Выбранная зона устанавливается в качестве системной
зоны по умолчанию.
.Nm
утилита также определяет, требуется ли какая-либо настройка для систем, в которых
аппаратные часы не поддерживают UTC.
.Pp
Доступны следующие параметры:
.Bl -tag -offset indent -width Fl
.It Fl C Ar chroot_directory
Открывает все файлы и каталоги, относящиеся к
.Ar chroot_directory .
.It Fl n
Не создает и не копирует файлы.
.It Fl r
Переустанавливает файл zoneinfo, установленный в прошлый раз.
Имя получено из
.Pa /var/db/zoneinfo .
.It Fl s
Пропускает первоначальный вопрос о настройке часов, если они не установлены на UTC.
.El
.Pp
Можно закоротить систему меню, указав
местоположение
.Ar zoneinfo_file
или название
.Ar zoneinfo_name
в командной строке; это предназначено в основном для предварительно настроенных
сценариев установки или для людей, которые знают, какой zoneinfo они хотят установить.
.Sh БАЗА ДАННЫХ ЧАСОВЫХ ПОЯСОВ
Содержимое базы данных часовых поясов индексируется с помощью
.Pa /usr/share/zoneinfo/zone1970.tab .
В этом файле для каждого файла данных о часовом поясе указаны код территории по стандарту ISO 3166,
приблизительные географические координаты (в формате ISO 6709)
и местоположение в пределах территории.
.Pp
Разработчики базы данных придерживаются следующих политик:
.Bl -enum -offset indent
.It
По крайней мере, одна зона для каждой страны или населенной географической территории.
.It
Один пояс для каждой отдельной, документированной истории часовых поясов с
начала эпохи
.Ux
(1 января 1970 года по Гринвичу).
.It
Каждая зона названа в честь самого густонаселенного города в ней.
(По возможности,
база данных включает историю города до 1970 года).
.El
.Pp
Исходный код для базы данных
.Pq Pa /usr/src/contrib/tzdata/[a-z]*
содержит множество дополнительных комментариев и ссылок на документацию для тех,
кто интересуется историей.
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /usr/share/zoneinfo/zone1970.tab" -compact
.It Pa /etc/localtime
файл текущего часового пояса
.It Pa /etc/wall_cmos_clock
смотрите
.Xr adjkerntz 8
.It Pa /usr/share/misc/iso3166
сопоставление кодов территорий по стандарту ISO 3166 с названиями
.It Pa /usr/share/zoneinfo
каталог для файлов zoneinfo
.It Pa /usr/share/zoneinfo/zone1970.tab
привязка файла часового пояса к стране и местоположению
.It Pa /var/db/zoneinfo
сохранение имени файла часового пояса, установленного последним
.El
.Sh ПРИМЕРЫ
При обычном использовании, чтобы выбрать нужный файл zoneinfo через диалоговый
пользовательский интерфейс:
.Pp
.Dl # tzsetup
.Pp
Установите файл
.Pa /usr/share/zoneinfo/Australia/Sydney :
.Pp
.Dl "# tzsetup /usr/share/zoneinfo/Australia/Sydney"
.Pp
Установите файл zoneinfo для Australia/Sydney, предположительно расположенный в
.Pa /usr/share/zoneinfo :
.Pp
.Dl "# tzsetup Australia/Sydney"
.Pp
После переустановки файлов zoneinfo вы можете переустановить
последний установленный файл zoneinfo (как указано в
.Pa /var/db/zoneinfo ):
.Pp
.Dl "# tzsetup -r"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr ctime 3 ,
.Xr timezone 3 ,
.Xr tzfile 5 ,
.Xr adjkerntz 8 ,
.Xr zdump 8 ,
.Xr zic 8
.Sh ПРЕДУПРЕЖДЕНИЕ
Представление определенных населенных пунктов как связанных с определенными
странами и/или территориями предназначено исключительно для целей идентификации
и не подразумевает какого-либо одобрения или неприятия со стороны 
.Fx
Проект территориальных претензий любого субъекта.
.Sh НЕИСПРАВНОСТИ
Программы, которые уже запущены, когда
.Nm
создает или обновляет
.Pa /etc/localtime ,
не будут отражать обновленный часовой пояс.
При первой настройке системы на
аппаратные часы, отличные от UTC, необходимо запустить
.Xr adjkerntz 8
(что обычно происходит при запуске системы), чтобы обновить
представление ядра о правильном смещении часового пояса.
