melkorbsd/ru-freebsd-man/man8/uathload.8
.\"
.\" Copyright (c) 2009 Weongyo Jeong.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 11, 2010
.Dt UATHLOAD 8
.Os
.Sh ИМЯ
.Nm uathload
.Nd "загрузчик прошивки для драйвера беспроводной сети Atheros USB"
.Sh КРАТКИЙ ОБЗОР
.Nm
.Op Fl v
.Fl d Ar ugen-device
.Op Ar firmware-file
.Sh ОПИСАНИЕ
.Nm
утилита предоставляет способ загрузки встроенного ПО для беспроводных
устройств Atheros USB с чипсетами AR5005UG и AR5005UX.
.Pp
Принимаются следующие параметры.
.Bl -tag -width ".Fl f Ar file"
.It Fl d Ar ugen-device
Использует определенное
.Xr ugen 4
устройство.
.It Fl v
Включает сообщения об отладке.
.El
.Pp
Если
.Ar файл прошивки
указан,
.Nm
попытается загрузить его вместо встроенного образа прошивки.
.Sh ПРИМЕРЫ
Загружает образ встроенного программного обеспечения в определенное
.Xr ugen 4
устройство:
.Pp
.Dl "uathload -d /dev/ugen0.2"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr uath 4
.Sh АВТОРЫ
.An Веонге Чжон
