melkorbsd/ru-freebsd-man/man8/uefi.8
.\" Copyright (c) 2014 The FreeBSD Foundation
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 31, 2023
.Dt UEFI 8
.Os
.Sh ИМЯ
.Nm UEFI
.Nd процедуры начальной загрузки унифицированного расширяемого интерфейса встроенного ПОbootstrapping procedures
.Sh ОПИСАНИЕ
.Nm
унифицированный расширяемый микропрограммный интерфейс предоставляет операционным системам службы загрузки и выполнения.
.Nm
является заменой устаревшего BIOS на архитектурах процессоров i386 и amd64,
а также используется на архитектурах arm, arm64 и riscv.
.Pp
Спецификация UEFI является преемницей спецификации расширяемого встроенного интерфейса (EFI).
Термины UEFI и EFI часто используются как взаимозаменяемые.
.Pp
Процесс загрузки
.Nm
загружает системный загрузочный код, расположенный в системном разделе EFI
(ESP).
ESP - это раздел GPT или MBR с определенным идентификатором, который содержит
.Xr msdosfs 5
файловую систему FAT с заданной файловой иерархией.
.Bl -column -offset indent "Partition Scheme" "ESP Identifier"
.It Sy "Partition Scheme" Ta Sy "ESP Identifier"
.It GPT Ta C12A7328-F81F-11D2-BA4B-00A0C93EC93B
.It MBR Ta 0xEF
.El
.Pp
.Nm
процесс загрузки происходит следующим образом:
.Bl -enum -offset indent -compact
.It
.Nm
прошивка запускается при включении питания и выполняет поиск загрузчика операционной системы в системном
разделе EFI.
Путь к загрузчику может быть задан переменной среды EFI, управляемой
.Xr efibootmgr 8 .
Если этот параметр не задан, используется значение по умолчанию, зависящее от архитектуры.
.Bl -column -offset indent "Architecture" "Default Path"
.It Sy Architecture Ta Sy Default Path
.It amd64 Ta Pa /EFI/BOOT/BOOTX64.EFI
.It arm Ta Pa /EFI/BOOT/BOOTARM.EFI
.It arm64 Ta Pa /EFI/BOOT/BOOTAA64.EFI
.It i386 Ta Pa /EFI/BOOT/BOOTIA32.EFI
.It riscv Ta Pa /EFI/BOOT/BOOTRISCV64.EFI
.El
.Pp
По умолчанию конфигурация
.Nm
загрузки для
.Fx
устанавливает
.Pa loader.efi
в пути по умолчанию.
.It
.Pa loader.efi
считывает конфигурацию загрузки из
.Pa /boot.config
или
.Pa /boot/config .
.It
.Pa loader.efi
загружает ядро, как описано в
.Xr loader.efi 8 .
.El
.Pp
.Xr vt 4
системная консоль автоматически выбирается при загрузке через
.Nm .
.Sh ФАЙЛЫ
.Bl -tag -width /boot/loader -compact
.Nm
начальная загрузка
.It Pa /boot/loader.efi
Завершающий этап начальной загрузки
.It Pa /boot/kernel/kernel
Ядро по умолчанию
.It Pa /boot/kernel.old/kernel
Типичное ядро, используемое не по умолчанию (необязательно)
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr vt 4 ,
.Xr boot.config 5 ,
.Xr msdosfs 5 ,
.Xr boot 8 ,
.Xr efibootmgr 8 ,
.Xr efidp 8 ,
.Xr efivar 8 ,
.Xr gpart 8 ,
.Xr loader.efi 8 ,
.Xr uefisign 8
.Sh ИСТОРИЯ
Поддержка загрузки EFI для архитектуры ia64 впервые появилась в
.Fx 5.0 .
.Nm
поддержка загрузки для amd64 впервые появилась в
.Fx 10.1 ;
для arm64 в
.Fx 11.0 ;
для armv6 и armv7 в
.Fx 12.0 ;
и для riscv в
.Fx 13.0 .
.Sh НЕИСПРАВНОСТИ
Поддержка загрузки 32-разрядного i386 через UEFI отсутствует.
