melkorbsd/ru-freebsd-man/man8/uefisign.8
.\" Copyright (c) 2014 The FreeBSD Foundation
.\"
.\" This software was developed by Edward Tomasz Napierala under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 11, 2015
.Dt UEFISIGN 8
.Os
.Sh ИМЯ
.Nm uefisign
.Nd Утилита для подписи защищенной загрузки UEFI
.Sh КРАТКОЕ ОПИСАНИЕ
.Nm
.Fl k Ar key
.Fl c Ar certificate
.Fl o Ar output
.Op Fl v
.Ar file
.Nm
.Fl V
.Op Fl v
.Ar file
.Sh ОПИСАНИЕ
The
.Nm
утилита подписывает двоичные файлы PE, используя схему Authenticode, как того требует
спецификация безопасной загрузки UEFI.
Кроме того, ее можно использовать для просмотра и проверки существующих подписей.
Доступны следующие параметры:
.Bl -tag -width ".Fl l"
.It Fl V
Определяет, подписан ли файл.
Обратите внимание, что он не проверяет правильность подписи;
только то, что файл содержит подпись.
.It Fl k
Имя файла, содержащего закрытый ключ, используемый для подписи двоичного файла.
.It Fl c
Имя файла, содержащего сертификат, используемый для подписи двоичного файла.
.It Fl o
Имя файла, в который будет записан подписанный двоичный файл.
.It Fl v
Подробно.
.El
.Sh СТАТУС ВЫХОДА
.Nm
утилита завершает работу с 0 в случае успеха и >0 в случае возникновения ошибки.
.Sh ПРИМЕРЫ
Генерирует самозаверяющий сертификат и использует его для подписи двоичного файла:
.Dl /usr/share/examples/uefisign/uefikeys testcert
.Dl uefisign -c testcert.pem -k testcert.key -o signed-binary binary
.Pp
Просмотр подписи:
.Dl uefisign -Vv binary
.Sh СМОТРИТЕ ТАКЖЕ
.Xr openssl 1 ,
.Xr loader 8 ,
.Xr uefi 8
.Sh ИСТОРИЯ
.Nm
команда появилась в
.Fx 10.2 .
.Sh АВТОРЫ
.Nm
утилита была разработана
.An Эдвардом Томашом Напиралом, уроженцем Монтаны trasz@FreeBSD.org
при спонсорской поддержке FreeBSD Foundation.
