melkorbsd/ru-freebsd-man/man8/ugidfw.8
.\" Copyright (c) 2002, 2004 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by Chris
.\" Costello at Safeport Network Services and NAI Labs, the Security
.\" Research Division of Network Associates, Inc. under DARPA/SPAWAR
.\" contract N66001-01-C-8035 ("CBOSS"), as part of the DARPA CHATS
.\" research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 24, 2004
.Dt UGIDFW 8
.Os
.Sh ИМЯ
.Nm ugidfw
.Nd "средства управления доступом к объектам файловой системы, подобные брандмауэру"
.Sh КРАТКИЙ ОБЗОР
.Nm
.Cm add
.Cm subject
.Op Cm not
.Oo
.Op Cm \&!
.Cm uid Ar uid | minuid:maxuid
.Oc
.Oo
.Op Cm \&!
.Cm gid Ar gid | mingid:maxgid
.Oc
.Oo
.Op Cm \&!
.Cm jailid Ad jailid
.Oc
.Cm object
.Op Cm not
.Oo
.Op Cm \&!
.Cm uid Ar uid | minuid:maxuid
.Oc
.Oo
.Op Cm \&!
.Cm gid Ar gid | mingid:maxgid
.Oc
.Oo
.Op Cm \&!
.Cm filesys Ad path
.Oc
.Oo
.Op Cm \&!
.Cm suid
.Oc
.Oo
.Op Cm \&!
.Cm sgid
.Oc
.Oo
.Op Cm \&!
.Cm uid_of_subject
.Oc
.Oo
.Op Cm \&!
.Cm gid_of_subject
.Oc
.Oo
.Op Cm \&!
.Cm type Ar ardbclsp
.Oc
.Cm mode
.Ar arswxn
.Nm
.Cm list
.Nm
.Cm set
.Ar rulenum
.Cm subject
.Op Cm not
.Oo
.Op Cm \&!
.Cm uid Ar uid | minuid:maxuid
.Oc
.Oo
.Op Cm \&!
.Cm gid Ar gid | mingid:maxgid
.Oc
.Oo
.Op Cm \&!
.Cm jailid Ad jailid
.Oc
.Cm object
.Op Cm not
.Oo
.Op Cm \&!
.Cm uid Ar uid | minuid:maxuid
.Oc
.Oo
.Op Cm \&!
.Cm gid Ar gid | mingid:maxgid
.Oc
.Oo
.Op Cm \&!
.Cm filesys Ad path
.Oc
.Oo
.Op Cm \&!
.Cm suid
.Oc
.Oo
.Op Cm \&!
.Cm sgid
.Oc
.Oo
.Op Cm \&!
.Cm uid_of_subject
.Oc
.Oo
.Op Cm \&!
.Cm gid_of_subject
.Oc
.Oo
.Op Cm \&!
.Cm type Ar ardbclsp
.Oc
.Cm mode
.Ar arswxn
.Nm
.Cm remove
.Ar rulenum
.Sh ОПИСАНИЕ
.Nm
утилита обеспечивает
.Xr ipfw 8 Ns -like
интерфейс для управления доступом к объектам файловой системы по UID и GID,
поддерживаемый
.Xr mac_bsdextended 4
.Xr mac 9
политикой.
.Pp
Аргументы заключаются в следующем:
.Bl -tag -width indent -offset indent
.It Xo
.Cm add
.Cm subject
.Ar ...
.Cm object
.Ar ...
.Cm mode
.Ar arswxn
.Xc
Добавляет новое правило, автоматически выбрав номер правила.
Смотрите описание
.Cm set
для получения информации о синтаксисе.
.It Cm list
Создает список всех текущих
.Nm
правил в системе.
.It Xo
.Cm set Ar rulenum
.Cm subject
.Ar ...
.Cm object
.Ar ...
.Cm mode
.Ar arswxn
.Xc
Добавляет новое правило или изменяет существующее.
Аргументы следующие:
.Bl -tag -width ".Ar rulenum"
.It Ar rulenum
Номер правила.
Сначала применяются элементы с меньшим номером правила;
размещение наиболее часто встречающихся правил в начале списка (т.е. с меньшим номером)
приведет к небольшому увеличению производительности.
.It Xo
.Cm subject
.Op Cm not
.Oo
.Op Cm \&!
.Cm uid Ar uid | minuid:maxuid
.Oc
.Oo
.Op Cm \&!
.Cm gid Ar gid | mingid:maxgid
.Oc
.Oo
.Op Cm \&!
.Cm jailid Ad jailid
.Oc
.Xc
Субъекты, выполняющие операцию, должны соответствовать всем приведенным условиям.
Ведущее
.Cm не
означает, что тема не должна соответствовать остальной части спецификации.
Условие может иметь префикс в виде
.Cm \&!
чтобы указать, что конкретное условие не должно соответствовать предмету исследования.
От субъекта может потребоваться наличие определенного
.Ar uid
и/или
.Ar gid .
Можно указать диапазон идентификаторов uids/gids, разделенных двоеточием.
От субъекта может потребоваться, чтобы он находился в определенном заключении с
.Ar jailid .
.It Xo
.Cm object
.Op Cm not
.Oo
.Op Cm \&!
.Cm uid Ar uid | minuid:maxuid
.Oc
.Oo
.Op Cm \&!
.Cm gid Ar gid | mingid:maxgid
.Oc
.Oo
.Op Cm \&!
.Cm filesys Ad path
.Oc
.Oo
.Op Cm \&!
.Cm suid
.Oc
.Oo
.Op Cm \&!
.Cm sgid
.Oc
.Oo
.Op Cm \&!
.Cm uid_of_subject
.Oc
.Oo
.Op Cm \&!
.Cm gid_of_subject
.Oc
.Oo
.Op Cm \&!
.Cm type Ar ardbclsp
.Oc
.Xc
Правило будет применяться только к объектам, соответствующим всем указанным условиям.
Ведущее
.Cm не
означает, что объект не должен соответствовать всем остальным условиям.
Условие может иметь префикс в виде
.Cm \&!
чтобы указать, что конкретное условие не должно соответствовать объекту.
Может потребоваться, чтобы объекты принадлежали пользователю и/или группе, указанным в
.Ar uid
и/или
.Ar gid .
Можно указать диапазон идентификаторов uids/gids, разделенных двоеточием.
Можно потребовать, чтобы объект находился в определенной файловой
системе, указав файловую систему с помощью
.Cm filesys .
Обратите внимание,
что если файловая система размонтирована и повторно подключена,
то, возможно, потребуется повторно применить это правило, чтобы убедиться
, что используется правильный идентификатор файловой системы.
От объекта может потребоваться наличие
.Cm suid
или
.Cm sgid
набора битов.
Может потребоваться, чтобы владелец объекта соответствовал
.Cm uid_of_subject
или
.Cm gid_of_subject ,
выполняющему операцию.
Тип объекта может быть ограничен подмножеством из
следующих типов.
.Pp
.Bl -tag -width ".Cm w" -compact -offset indent
.It Cm a
любой тип файла
.It Cm r
обычный файл
.It Cm d
каталог
.It Cm b
блочное специальное устройство
.It Cm c
специальное устройство для персонажей
.It Cm l
символическая ссылка
.It Cm s
доменный сокет unix
.It Cm p
именованный канал (FIFO)
.El
.It Cm mode Ar arswxn
Похожий на
.Xr chmod 1 ,
каждый символ представляет режим доступа.
Если применяется правило,
для объекта применяются указанные права доступа.
Если в правиле указан символ,
то правило разрешает выполнение операции.
И наоборот, если его не включить, операция
будет отклонена.
Ниже приведены определения каждого символа:
.Pp
.Bl -tag -width ".Cm w" -compact -offset indent
.It Cm a
административные операции
.It Cm r
доступ для чтения
.It Cm s
доступ к атрибутам файла
.It Cm w
доступ на запись
.It Cm x
выполнить доступ
.It Cm n
нет
.El
.El
.It Cm remove Ar rulenum
Отключает и удаляет правило с указанным номером правила.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr mac_bsdextended 4 ,
.Xr mac 9
.Sh ИСТОРИЯ
.Nm
утилита впервые появилась в
.Fx 5.0 .
.Sh АВТОРЫ
Это программное обеспечение было внесено в
.Fx
проект NAI Labs, исследовательского подразделения по безопасности Network Associates
Inc., в рамках контракта DARPA/SPAWAR N66001-01-C-8035
.Pq Dq CBOSS,
в рамках исследовательской программы DARPA CHATS.
