melkorbsd/ru-freebsd-man/man8/umount.8
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)umount.8	8.2 (Berkeley) 5/8/95
.\"
.Dd June 19, 2020
.Dt UMOUNT 8
.Os
.Sh ИМЯ
.Nm umount
.Nd размонтирует файловые системы
.Sh СИНТАКСИС
.Nm
.Op Fl fNnv
.Ar special ... | node ... | fsid ...
.Nm
.Fl a | A
.Op Fl F Ar fstab
.Op Fl fnv
.Op Fl h Ar host
.Op Fl t Ar type
.Sh ОПИСАНИЕ
Утилита
.Nm
вызывает
.Xr unmount 2
системный вызов для удаления файловой системы из дерева файловой системы.
Файловая система может быть задана ее
.Ar особым
устройством или удаленным узлом
.Pq Ar rhost Ns Cm \& : Ns Ar path ,
путем к точке монтирования
.Ar узла
или по идентификатору файловой системы
.Ar fsid , 
как сообщает
.Dq mount -v
при запуске от имени root.
.Pp
Возможны следующие параметры:
.Bl -tag -width "-F fstab"
.It Fl a
Все файловые системы, описанные в
.Xr fstab 5
размонтированы.
.It Fl A
Все подключенные в данный момент файловые системы размонтированы,
за исключением тех, которые смонтированы в
.Pa /
или
.Pa /dev .
.It Fl F Ar fstab
Указывает файл
.Pa fstab
для использования.
.It Fl f
Файловая система принудительно размонтирована.
Активные специальные устройства продолжают работать,
но все остальные файлы возвращают ошибки при попытке дальнейшего доступа.
Корневая файловая система не может быть принудительно размонтирована.
В случае NFS принудительное отключение может занять до 1 минуты или более
на не отвечающем сервере и может привести к удалению
данных, которые еще не были записаны на сервер для этого случая.
Если какой-либо процесс, например
.Nm
без флага
.Fl f
завис в точке монтирования
.Tn NFS ,
используйте флаг
.Fl N
вместо этого.
Кроме того, выполнение принудительного отключения монтирования NFSv3 при
.Xr rpc.lockd 8
выполняется небезопасно и может привести к сбою.
.It Fl h Ar host
Будут размонтированы только файловые системы, смонтированные с указанного хоста.
Этот параметр подразумевает параметр
.Fl A 
и, если иное не указано в параметре
.Fl t ,
будут размонтированы только файловые системы
.Tn NFS .
.It Fl N
Выполняет принудительный демонтаж точки монтирования
.Tn NFS
без проверки пути монтирования.
Этот параметр можно использовать только с путем к  точке монтирования
.Ar узла ,
и путь должен быть указан точно таким, каким он был во время монтирования.
Этот параметр полезен, когда процесс зависает в ожидании ответа сервера
.Tn NFS ,
удерживая блокировку vnode на подключенном vnode, так что
.Nm
с флагом
.Fl f
не может быть завершен.
Использование этого параметра может привести к потере обновлений файлов, которые не были
сброшены на сервер
.Tn NFS .
.It Fl n
Если
.Fl f
используется, то
.Nm
не размонтирует активную файловую систему.
Однако при этом будет выполнена очистка.
Этот флаг отключает такое поведение, предотвращая очистку, 
если какие-либо файлы открыты.
.It Fl t Ar type
Используется для указания действий, которые следует выполнять только с
файловыми системами указанного типа.
В списке, разделенном запятыми, может быть указано более одного типа.
Список типов файловых систем может быть дополнен префиксом
.Dq не ,
чтобы указать типы файловых систем, для которых необходимо 
.Em не
быть захваченными.
Например,
команда
.Nm :
.Bd -literal -offset indent
umount -a -t nfs,nullfs
.Ed
.Pp
размонтирует все файловые системы данного типа
.Tn NFS
и
.Tn NULLFS ,
которые перечислены в файле
.Xr fstab 5 .
.It Fl v
Подробная дополнительная информация выводится на печать по мере размонтирования каждой файловой системы.
.El
.Sh ОКРУЖЕНИЕ
.Bl -tag -width ".Ev PATH_FSTAB"
.It Ev PATH_FSTAB
Если установлена переменная окружения
.Ev PATH_FSTAB ,
все операции выполняются с указанным файлом.
.Ev PATH_FSTAB
не будет учитываться, если учитывать среду процесса или если адресное пространство памяти
.Dq испорчено .
(Смотрите
.Xr issetugid 2
для получения дополнительной информации.)
.El
.Sh ФАЙЛЫ
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
таблица файловой системы
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr autounmountd 8 ,
.Xr mount 8
.Sh ИСТОРИЯ
Утилита
.Nm
появилась в
.At v1 .
