melkorbsd/ru-freebsd-man/man8/usbconfig.8
.\"
.\" Copyright (c) 2008-2019 Hans Petter Selasky. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 29, 2022
.Dt USBCONFIG 8
.Os
.Sh ИМЯ
.Nm usbconfig
.Nd настройка подсистемы USB
.Sh СИНТАКСИС
.Nm
.Op Fl v
.Op Fl a Ar addr
.Op Fl i Ar interface_index
.Op Fl u Ar unit
.Op Ar cmds ...
.Nm
.Fl d
.Sm off
.Oo Oo Cm /dev/ Oc Cm ugen Oc Ar unit Cm \&. Ar addr
.Sm on
.Op Fl v
.Op Fl i Ar interface_index
.Op Ar cmds ...
.Sh ОПИСАНИЕ
Утилита
.Nm
используется для настройки и вывода информации о USB-подсистеме.
.Pp
Возможны следующие параметры:
.Bl -tag -width "-u unit"
.It Fl a Ar addr
Ограничивает диапазон устройств указанным индексом USB-устройства.
Следует использовать только в сочетании с аргументом unit.
.It Xo
.Fl d
.Sm off
.Oo Oo Cm /dev/ Oc Cm ugen Oc Ar unit Cm \&. Ar addr
.Sm on
.Xc
Ограничивает диапазон USB-устройств, подключенных к данному устройству и адресу.
Перед координатами устройства и адреса может быть указано слово в нижнем регистре
.Cm ugen ,
или полное имя пути
.Cm /dev/ugen .
.It Fl h
Отображает справку и доступные команды.
.It Fl i Ar interface_index
Указывает индекс интерфейса, как в описании команды.
Если этот аргумент не указан, 
в качестве индекса интерфейса будет использоваться нулевое значение.
.It Fl u Ar unit
Ограничивает диапазон USB-устройств, подключенных к данному устройству USBUS.
.It Fl v
Активирует команды
.Cm dump_device_desc ,
.Cm dump_curr_config_desc ,
и
.Cm show_ifdrv
.Pq Dq подробный режим .
.El
.Pp
Следующие команды могут быть использованы с
.Nm :
.Bl -tag -width indent
.It Cm set_config Ar cfg_index
Выберает конфигурацию для USB-устройства.
Допустимые значения варьируются от нуля до числа, указанного в качестве
.Ar bNumConfigurations
в выводе
.Cm dump_device_desc .
Специальное значение 255 отключает конфигурацию устройства, отсоединяя
драйверы интерфейса и снижая энергопотребление до минимума,
но без перехода в режим энергосбережения или отсоединения от шины.
В некоторых случаях это предотвращает зарядку устройства.
.It Cm set_alt Ar alt_index
Выберает альтернативный интерфейс для выбранного интерфейса и USB-устройства.
Альтернативные настройки для текущей конфигурации доступны в виде
.Ar bAlternateSetting
в выводе
.Cm dump_curr_config_desc .
Обычно нет необходимости изменять этот параметр.
Эта команда использует параметр
.Fl i Ar interface_index .
.It Cm set_template Ar template
Устанавливает глобальный шаблон на стороне USB-устройства.
Смотрите
.Xr usb_template 4
для получения дополнительной информации.
.It Cm get_template
Получает текущий шаблон на стороне USB-устройства.
.It Cm add_dev_quirk_vplh Ar vid Ar pid Ar lo_rev Ar hi_rev Ar quirk_name
Добавляетособенность, указав идентификатор поставщика, идентификатор продукта, номера младшей и старшей
редакций и название особенности.
Смотрите
.Xr usb_quirk 4
для получения дополнительной информации.
.It Cm remove_dev_quirk_vplh Ar vid Ar pid Ar lo_rev Ar hi_rev Ar quirk_name
Удаляет особенность.
.It Cm add_quirk Ar quirk_name
Добавляет особенность для выбранного в данный момент USB-устройства.
.It Cm remove_quirk Ar quirk_name
Удаляет особенность с выбранного в данный момент USB-устройством.
.It Cm dump_all_desc
Отображает дескрипторы устройства и конфигурации.
.It Cm dump_quirk_names
Отображает список поддерживаемых названий особенностей.
.It Cm dump_device_quirks
Отображает список текущих особенностей устройства.
.It Cm dump_device_desc
Отображает дескриптор устройства.
.It Cm dump_curr_config_desc
Отображает дескриптор текущей конфигурации.
.It Cm dump_all_config_desc
Отображает все дескрипторы конфигурации.
.It Cm dump_string Ar index
Отображает строковый дескриптор по выбранному индексу.
.It Cm dump_info
Отображает сводную информацию об устройстве.
.It Cm dump_stats
Отображает статистики передачи данных по USB.
.It Cm show_ifdrv
Отображает список драйверов интерфейса (таких как
.Xr ukbd 4
или
.Xr u3g 4 ),
подключенного в данный момент к устройству.
.It Cm detach_kernel_driver
Отключает драйвер ядра для выбранного интерфейса и USB-устройства.
Эта команда использует параметр
.Fl i Ar interface_index .
.It Cm suspend
Принудительно приостанавливает работу устройства.
.It Cm resume
Принудительно возобновляет работу устройства.
.It Cm power_off
Выключает устройство.
.It Cm power_save
Включает функцию автоматической приостановки и возобновления работы.
Это значение используется по умолчанию для USB-концентраторов.
.It Cm power_on
Включает устройство и отключает автоматическую приостановку и возобновление работы.
Это значение используется по умолчанию для устройств, не подключенных к концентратору.
.It Cm reset
Перезагружает устройство.
Это заставит USB-накопитель повторно перенумеровать шину.
.It Cm list
Перечисляет все доступные USB-устройства.
Это значение используется по умолчанию, если
.Nm
вызывается без указания команды.
.It Cm do_request Ar bmReqTyp Ar bReq Ar wVal Ar wIdx Ar wLen Ar data...
Выполняет синхронный запрос управления на указанном устройстве.
Смотрите
.Xr libusb20_dev_request_sync 3
для получения дополнительной информации.
.El
.Sh ПРИМЕРЫ
Перечисляет все подключенные USB-устройства и подключенные к ним драйверы интерфейса:
.Pp
.Dl usbconfig show_ifdrv
.Pp
Вывод устройства и дескрипторов конфигурации для устройства на шину USB 1 по адресу 2:
.Pp
.Dl usbconfig -d ugen1.2 dump_all_desc
.Pp
Выводит скрытый дескриптор устройства на шину USB 1 по адресу 2:
.Pp
.Dl usbconfig -d ugen1.2 do_request 0x81 0x06 0x2200 0 0x100
.Pp
Отключает питание устройства по шине USB 1 по адресу 2:
.Pp
.Dl usbconfig -d ugen1.2 power_off
.Sh СМОТРИТЕ ТАКЖЕ
.Xr usb 4 ,
.Xr usb_quirk 4 ,
.Xr usb_template 4
