melkorbsd/ru-freebsd-man/man8/usbdump.8

.\"
.\" Copyright (c) 2010 Weongyo Jeong.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 14, 2021
.Dt USBDUMP 8
.Os
.Sh ИМЯ
.Nm usbdump
.Nd "сбрасывает трафик на USB-хост-контроллер"
.Sh КРАТКОЕ ОПИСАНИЕ
.Nm
.Op Fl d Ar [ugen]B
.Op Fl d Ar [ugen]B.D
.Op Fl d Ar [ugen]B.D.E
.Op Fl i Ar ifname
.Op Fl r Ar file
.Op Fl s Ar snaplen
.Op Fl v
.Op Fl w Ar file
.Op Fl f Ar filter
.Op Fl b Ar file
.Op Fl h
.Sh ОПИСАНИЕ
.Nm
утилита предоставляет способ выгрузки USB-пакетов на хост-контроллеры.
.Pp
Применяются следующие параметры:
.Bl -tag -width ".Fl f Ar file"
.It Fl d Ar [ugen]bus
Кратчайший путь до
.Fl i
параметра.
Аргумент может иметь префикс "ugen".
Параметр может быть указан несколько раз, но указанная шина должна
быть одной и той же.
.It Fl d Ar [ugen]bus.device
Кратчайший путь к
.Fl i
и
.Fl f
параметрам.
Аргумент может иметь префикс "ugen".
Параметр может быть указан несколько раз, но указанная шина должна
быть одной и той же.
.It Fl d Ar [ugen]bus.device.endpoint
Кратчайший путь к
.Fl i
и
.Fl f
параметрам.
Аргумент может иметь префикс "ugen".
Параметр может быть указан несколько раз, но указанная шина должна
быть одной и той же.
.It Fl b Ar file
Сохраняет часть данных трассировки USB в двоичном формате в заданном
.Ar файле .
Этот параметр также работает с параметрами -r и -f.
.It Fl i Ar ifname
Прослушивает по интерфейсу шины USB
.Ar ifname .
.It Fl r Ar file
Считывает необработанные пакеты из
.Ar файла .
Этот параметр также работает с параметром -f.
.It Fl s Ar snaplen
Снапшот
.Ar фиксирует
байты из каждого пакета.
.It Fl v
Включает сообщения об отладке.
При многократном задании уровень детализации увеличивается.
.It Fl w Ar file
Записывает необработанные пакеты в 
.Ar файл .
Этот параметр также работает с параметрами -s и -v.
.It Fl f Ar filter
Аргумент фильтра состоит из одного или двух чисел, разделенных точкой.
Первое указывает номер устройства, который необходимо отследить.
Второе число, которое является необязательным, указывает конечную точку, которую необходимо отследить.
Чтобы получить весь трафик для контрольной конечной точки, необходимо
создать два фильтра: один для конечной точки 0 и один для конечной точки 128.
Если к номеру конечной точки добавлено 128, что означает направление "В", в противном случае подразумевается направление "ИЗ".
Значение единицы измерения устройства или конечной точки, равное -1, означает игнорирование этого поля.
Если фильтры не заданы, все пакеты проходят через фильтр по умолчанию -1,-1.
Этот параметр можно указать несколько раз.
.It Fl h
Этот параметр отображает сводку параметров командной строки.
.El
.Sh ПРИМЕРЫ
Захватывает необработанные пакеты USB на usbus2:
.Pp
.Dl "usbdump -i usbus2 -s 256 -v"
.Pp
Сбрасывает необработанные пакеты USB с usbus2 в файл без
ограничения размера пакета:
.Pp
.Dl "usbdump -i usbus2 -s 0 -w /tmp/dump_pkts"
.Pp
Сбрасывает необработанные пакеты USB на usbus2, но только трафик контрольной конечной
точки блока номер 3:
.Pp
.Dl "usbdump -i usbus2 -s 0 -f 3.0 -f 3.128 -w /tmp/dump_pkts"
.Pp
Считывает и отображает необработанные пакеты USB из предыдущего файла:
.Pp
.Dl "usbdump -r /tmp/dump_pkts -v"
.Sh ВЫХОДНОЙ ФОРМАТ
Выходной формат
.Nm
заключается в следующем:
.Pp
.Dl "<time> <bus>.<addr> <ep> <xfertype> <S/D> (<frames>/<length>) <...>"
.Pp
Значения элементов выходного формата заключается в следующем:
.Bl -tag -width "<xfertype>"
.It <time>
Временная метка, предшествующая всем строкам вывода.
Временная метка имеет формат "hh:mm:ss.frac" и является такой же точной, как
часы ядра.
.It <bus>
Номер блока шины главного контроллера USB.
.It <addr>
Уникальный номер USB-устройства, присвоенный драйвером хост-контроллера.
.It <ep>
Адрес конечной точки USB, указывающий, является ли этот адрес
.Dv выходом
или
.Dv входом .
.It <xfertype>
Тип передачи данных по USB.
Может быть
.Dv CTRL ,
.Dv ISOC ,
.Dv BULK
или
.Dv INTR .
.It <S/D>
`S' указывает на отправку по USB.
`D' указывает на выполненную передачу по USB.
.It <frames>
Количество кадров в этих пакетах.
Если это передача по USB, то ее значение равно
.Li xfer->nframes ,
что означает, сколько кадров допустимо или зарегистрировано для передачи.
Если это сделано по USB, то,
.Li xfer->aframes
- это фактическое количество кадров.
.It <length>
Общий размер пакета.
Если это передача по USB, его значение равно
.Li xfer->sumlen .
Если это сделано по USB, его значение равно
.Li xfer->actlen .
.It <...>
Необязательное поле, используемое для вывода строки с ошибкой, если пакет отправлен с USB-накопителя.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr usbconfig 8
.Sh АВТОРЫ
.An Веонге Джонг Aq Mt weongyo@FreeBSD.org
