melkorbsd/ru-freebsd-man/man8/utx.8
.\" Copyright (c) 2011-2012 Ed Schouten <ed@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 3, 2013
.Dt UTX 8
.Os
.Sh ИМЯ
.Nm utx
.Nd управление базой данных учета пользователей
.Sh КРАТКИЙ ОБЗОР
.Nm
.Cm boot
.Nm
.Cm shutdown
.Nm
.Cm rm
.Ar identifier
.Ar ...
.Sh ОПИСАНИЕ
The
.Nm
утилита может быть использована для выполнения операций с
базой данных учета пользователей, как это делается с помощью
.Xr pututxline 3 .
.Pp
Первый аргумент
.Nm
указывает на действие, которое необходимо выполнить:
.Bl -tag -width ".Cm shutdown"
.It Cm boot
Записывает запись времени загрузки в базу данных учета пользователей.
Обычно эту опцию следует использовать только
.Xr rc 8 .
.It Cm shutdown
Записывает запись о времени завершения работы в базу данных учета пользователей.
Обычно этот параметр должен использоваться только
.Xr rc 8 .
.It Cm rm
Удаляет устаревшие сеансы из
базы данных учета пользователей, обратившись к их
.Ar идентификатору .
Устаревшие сеансы могут возникать, если служба входа в систему завершает работу преждевременно или не удается
удалить сеанс из базы данных учета.
.Pp
Такие утилиты, как
.Xr w 1
не будут отображать идентификатор, соответствующий сеансу входа в систему,
поскольку его значение обычно используется только процессом, управляющим
записью.
Следующая команда может быть использована для получения всех записей из
таблицы активных сеансов базы данных учета пользователей, включая их идентификаторы:
.Pp
.Dl getent utmpx active
.Pp
Идентификаторы могут быть представлены либо в шестнадцатеричном виде, как
.Xr getent 1 ,
или в виде строки, если идентификатор допускает такое представление.
.El
.Pp
Поскольку эта утилита требует доступа на запись
к базе данных учета пользователей, ее использование ограничено суперпользователями.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr getent 1 ,
.Xr w 1 ,
.Xr pututxline 3
.Sh ИСТОРИЯ
.Nm
утилита заменила
.Nm utxrm
в
.Fx 10.0 .
.Sh АВТОРЫ
.An Эд Шоутен Aq Mt ed@FreeBSD.org
