melkorbsd/ru-freebsd-man/man8/valectl.8
.\" Copyright (c) 2016 Michio Honda.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 2, 2021
.Dt VALECTL 8
.Os
.Sh ИМЯ
.Nm valectl
.Nd управление коммутаторами VALE, предоставляемыми netmap
.Sh СИТАКСИС
.Bk -words
.Bl -tag -width "valectl"
.It Nm
.Op Fl g Ar valeSSS:PPP
.Op Fl a Ar valeSSS:interface
.Op Fl h Ar valeSSS:interface
.Op Fl d Ar valeSSS:interface
.Op Fl n Ar interface
.Op Fl r Ar interface
.Op Fl l Ar valeSSS:PPP
.Op Fl l
.Op Fl p Ar valeSSS:PPP
.Op Fl P Ar valeSSS:PPP
.Op Fl C Ar spec
.Op Fl m Ar memid
.El
.Ek
.Sh ОПИСАНИЕ
.Nm
управляет и проверяет коммутаторы
.Xr vale 4 ,
например, подключает и отключает интерфейсы, создает
и удаляет постоянные порты VALE или перечисляет существующие коммутаторы
и их порты.
In the following,
В дальнейшем,
.Ar valeSSS
это имя переключателя VALE, в то время как
.Ar valeSSS:PPP
это название порта в 
.Ar valeSSS .
.Pp
Если он выпущен без опций, в нем перечислены все существующие порты коммутатора вместе
с их внутренним номером моста и номером порта.
.Bl -tag -width Ds
.It Fl g Ar valeSSS:PPP
Выводит количество сигналов приема из
.Ar valeSSS:PPP .
.It Fl a Ar valeSSS:interface
Прикрепляет
.Ar interface
(который должен быть существующим сетевым интерфейсом) к
.Ar valeSSS
и отсоединяет его от стека хоста.
.It Fl h Ar valeSSS:interface
Прикрепляет
.Ar interface
(который должен быть существующим сетевым интерфейсом) к
.Ar valeSSS
сохраняя при этом его привязанным к стеку хоста.
Точнее, пакеты, поступающие из
стека хостов и направленные на интерфейс, будут проходить через коммутатор, откуда
они все еще могут достичь интерфейса, если это разрешено правилами коммутатора.
И наоборот, пакеты, поступающие из интерфейса, будут проходить через коммутатор и,
при необходимости, попадут в стек хостов.
.It Fl d Ar valeSSS:interface
Отсоединяет
.Ar interface
от
.Ar valeSSS .
.It Fl n Ar interface
Создает новый постоянный порт VALE с именем
.Ar interface .
Это имя должно отличаться от имени любого другого сетевого интерфейса, 
уже присутствующего в системе.
.It Fl r Ar interface
Уничтожает постоянный порт VALE с именем
.Ar interface .
.It Fl l Ar valeSSS:PPP
Показывает номер внутреннего моста и номер порта данного порта коммутатора.
.It Fl p Ar valeSSS:PPP
Включает режим опроса для
.Ar valeSSS:PPP .
В режиме опроса создается выделенный поток ядра для обработки пакетов, 
полученных от
.Ar valeSSS:PPP
и подключает их к коммутатору.
Загруженный поток ядра ожидает на порту коммутатора, не полагаясь на
прерывания или уведомления.
Режим опроса можно использовать только на физических сетевых адаптерах, подключенных к коммутатору VALE.
.It Fl P Ar valeSSS:PPP
Отключает режим опроса для
.Ar valeSSS:PPP .
.It Fl C Ar x | Ar x,y | Ar x,y,z | Ar x,y,z,w
При использовании в сочетании с
.Fl n
в нем указано количество звонков и ячеек tx и rx.
Полный формат с четырьмя числами по порядку показывает количество слотов tx, количество
слотов rx, количество звонков tx и количество звонков rx.
Форма с тремя числами использует
.Ar z
как для количества вызовов tx, так и для количества rx.
В формах, содержащих менее двух цифр, используются значения по умолчанию для количества
вызовов.
В форме с двумя цифрами указаны номера слотов tx и rx.
Форма, содержащая только один номер, использует
.Ar x
как для количества слотов tx, так и для количества слотов rx.
.Pp
При использовании в сочетании с
.Fl p
используются только первые три формы.
Первое число может быть либо 0, либо 1.
Если 0, то все интерфейсные кольца будут опрашиваться одним потоком, выполняющимся
на основе идентификатора ядра, указанного вторым номером (третье число, если присутствует,
должно быть 1).
Если первое число равно 1, то ядро будет опрашивать кольцо, обозначенное вторым номером, 
с тем же идентификатором.
Если указано третье число, то это повторяется для стольких последовательных
колец и ядер.
.It Fl m Ar memid
Используя в сочетании с
.Fl n
предоставляет идентификатор области памяти netmap для использования вместе с недавно
созданным постоянным портом VALE.
По умолчанию эти порты используют частную область памяти.
Используя этот параметр, вы можете разрешить им совместно использовать память с другими портами.
Передает 1 как
.Ar memid ,
чтобы использовать глобальную область памяти, уже разделяемую всеми
аппаратными портами netmap.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr netmap 4 ,
.Xr vale 4
.Sh АВТОРЫ
.An -nosplit
.Nm
была написана
.An Мичио Хондо
из NetApp.
