melkorbsd/ru-freebsd-man/man8/verify_krb5_conf.8
.\" Copyright (c) 2000 - 2004 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id$
.\"
.Dd December  8, 2004
.Dt VERIFY_KRB5_CONF 8
.Os HEIMDAL
.Sh ИМЯ
.Nm verify_krb5_conf
.Nd проверяет krb5.conf на наличие очевидных ошибок
.Sh КРАТКИЙ ОБЗОР
.Nm
.Ar [config-file]
.Sh ОПИСАНИЕ
.Nm
считывает конфигурационный файл
.Pa krb5.conf ,
или файл, указанный в командной строке,
анализирует его, проверяя правильность синтаксиса.
.Pp
Если файл синтаксически корректен,
.Nm
пытается убедиться, что содержимое файла имеет отношение к делу.
.Sh ОКРУЖЕНИЕ
.Ev KRB5_CONFIG
указывает на файл конфигурации для чтения.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/krb5.conf -compact
.It Pa /etc/krb5.conf
Конфигурационный файл Kerberos 5
.El
.Sh ДИАГНОСТИКА
Возможный результат из
.Nm
включает:
.Bl -tag -width "FpathF"
.It "<path>: failed to parse <something> as size/time/number/boolean"
Обычно это означает, что <что-то> написано с ошибкой или содержит
странные символы. Синтаксический анализ, выполненный
.Nm
является более строгим, чем тот, который выполняется libkrb5, поэтому строки, которые
работают в реальной жизни, могут быть помечены как плохие.
.It "<path>: host not found (<hostname>)"
Означает, что <путь> должен указывать на хост, но он не может быть
распознан как таковой.
.It <path>: unknown or wrong type
Означает, что <path> - это либо строка, когда она должна быть списком,
или наоборот, либо просто что
.Nm
запутался.
.It <path>: unknown entry
Означает, что <строка> неизвестна
.Nm .
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr krb5.conf 5
.Sh НЕИСПРАВНОСТИ
Поскольку каждое приложение может поместить в конфигурационный файл практически все, что угодно,
трудно разработать четкий процесс проверки. Большинство
настроек по умолчанию проверяются на работоспособность, но это не означает, что
обнаруживаются все проблемы или что все, о чем сообщается как
о возможной проблеме, на самом деле таковыми и являются. Таким образом, этим инструментом следует пользоваться с
некоторой осторожностью.
.Pp
Он должен предупреждать об устаревших данных или плохой практике, но в настоящее
время этого не происходит.