melkorbsd/ru-freebsd-man/man8/version.4th.8
.\" Copyright (c) 2011-2013 Devin Teske
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 6, 2013
.Dt VERSION.4TH 8
.Os
.Sh ИМЯ
.Nm version.4th
.Nd загрузочный модуль строки версии FreeBSD
.Sh ОПИСАНИЕ
Файл, который называется
.Nm
это набор команд, предназначенных для отображения версии загрузчика
в правом нижнем углу экрана.
Команды
.Nm
сами по себе недостаточны для большинства применений.
Пожалуйста, обратитесь к
приведенным ниже примерам наиболее распространенных ситуаций, а также к
.Xr loader 8
для получения дополнительных команд.
.Pp
Перед использованием любой из команд, приведенных в
.Nm ,
он должен быть включен
с помощью команды:
.Pp
.Dl include version.4th
.Pp
Эта строка присутствует в файле по умолчанию
.Pa /boot/menu.rc ,
поэтому он не нужен (и не должен быть переиздан) при обычной настройке.
.Pp
Команды, предоставляемые им, следующие:
.Pp
.Bl -tag -width disable-module_module -compact -offset indent
.It Ic print_version
Выводит содержимое переменной среды
.Va loader_version ,
выровненной по правому краю столбца
.Va loader_version_x
и строки
.Va loader_version_y .
.El
.Pp
Переменными средами, влияющими на его поведение, являются:
.Bl -tag -width bootfile -offset indent
.It Va loader_version
Устанавливается автоматически с помощью
.Xr loader 8 ,
но вы можете переопределить это с помощью настройки
.Xr loader.conf 5 .
Это должна быть используемая версия загрузчика.
.It Va loader_version_x
Устанавливает желаемое положение конечного столбца
.Va loader_version .
По умолчанию это 80.
.It Va loader_version_y
Устанавливает желаемое положение конечной строки
.Va loader_version .
По умолчанию это 24.
.It Va loader_color
Если установлено значение
.Dq Li НЕТ
(без учета регистра) или
.Dq Li 0 ,
приводит к тому, что версия печатается без цвета
.Pq по умолчанию используется ANSI Cyan .
.El
.Sh ФАЙЛЫ
.Bl -tag -width /boot/version.4th -compact
.It Pa /boot/loader
.Xr loader 8 .
.It Pa /boot/version.4th
.Nm
сама.
.It Pa /boot/loader.rc
.Xr loader 8
скрипт начальной загрузки.
.El
.Sh ПРИМЕРЫ
Переопределение версии
.Xr loader 8
в
.Xr loader.conf 5 :
.Pp
.Bd -literal -offset indent -compact
loader_version="loader 1.1"
.Ed
.Sh СМОТРИТЕ ТАКЖЕ
.Xr loader.conf 5 ,
.Xr color.4th 8 ,
.Xr loader 8
.Sh ИСТОРИЯ
Набор команд
.Nm
впервые появился в
.Fx 9.0 .
.Sh АВТОРЫ
Набор команд
.Nm
был написан
.An -nosplit
.An Дэвином Теске Aq dteske@FreeBSD.org .
