melkorbsd/ru-freebsd-man/man8/vigr.8
.\"-
.\" Copyright (c) 2014 Dag-Erling Smørgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 14, 2014
.Dt VIGR 8
.Os
.Sh ИМЯ
.Nm vigr
.Nd редактирует файл группы
.Sh КРАТКИЙ ОБЗОР
.Nm
.Op Fl d Ar directory
.Sh ОПИСАНИЕ
.Nm
утилита создает временную копию файла группы, позволяет пользователю
отредактировать ее, а затем проверяет правильность отредактированного файла перед его установкой.
.Pp
Доступны следующие параметры:
.Bl -tag -width Fl
.It Fl d Ar directory
Редактирует файл группы в указанном каталоге вместо каталога по умолчанию
.Pa /etc/group .
.El
.Sh ОКРУЖЕНИЕ
.Bl -tag -width EDITOR
.It Ev EDITOR
Редактор, который будет использоваться вместо
.Xr vi 1 .
.It Ev TMPDIR
Каталог, в котором будет храниться временная копия файла группы.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr group 5 ,
.Xr chkgrp 8 ,
.Xr vipw 8
.Sh ИСТОРИЯ
.Nm
утилита появилась в
.Fx 11.0 .
.Sh АВТОРЫ
.Nm
утилита и эта страница руководства были написаны
.An Даг-Эрлинг См\(/орграв Aq Mt des@FreeBSD.org .
