melkorbsd/ru-freebsd-man/man8/zfs-diff.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd March 16, 2022
.Dt ZFS-DIFF 8
.Os
.
.Sh ИМЯ
.Nm zfs-diff
.Nd показывает разницу между снапшотами ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm diff
.Op Fl FHth
.Ar snapshot Ar snapshot Ns | Ns Ar filesystem
.
.Sh ОПИСАНИЕ
Отображает разницу между снапшотом данной файловой системы и другим
снапшотом этой файловой системы, сделанным позже, или текущим содержимым
файловой системы.
Первый столбец - это символ, указывающий тип изменения, остальные столбцы
указывают путь, новое имя пути
.Pq в случае переименования ,
изменяет количество ссылок и, при необходимости, тип файла и/или время изменения.
Существуют следующие типы изменений:
.Bl -tag -compact -offset Ds -width "M"
.It Sy -
Путь был удален
.It Sy +
Путь был создан
.It Sy M
Путь был изменен
.It Sy R
Путь был переименован
.El
.Bl -tag -width "-F"
.It Fl F
Отображает указанный тип файла, аналогично тому, как
.Fl F
параметр в
.Xr ls 1 .
.Bl -tag -compact -offset 2n -width "B"
.It Sy B
Блочное устройство
.It Sy C
Символьное устройство
.It Sy /
Каталог
.It Sy >
Дверь
.It Sy |\&
Именованный канал
.It Sy @
Символическая ссылка
.It Sy P
Порт события
.It Sy =
Сокет
.It Sy F
Обычный файл
.El
.It Fl H
Обеспечивает более понятный для анализа вывод с разделением табуляцией, без строк заголовка и
стрелок.
.It Fl t
Отображает время изменения индексного пути в качестве первого столбца выходных данных.
.It Fl h
Не
.Sy \e0 Ns Ar ooo Ns -избегать
пути, отличные от ASCII.
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 22 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : No Отображение различий между снапшотом и набором данных ZFS
В следующем примере показано, как увидеть, что изменилось между предыдущим
снапшотом набора данных ZFS и его текущим состоянием.
.Fl F
параметр используется для указания информации о типе затронутых файлов.
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm diff Fl F Ar tank/test@before tank/test
M       /       /tank/test/
M       F       /tank/test/linked      (+1)
R       F       /tank/test/oldname -> /tank/test/newname
-       F       /tank/test/deleted
+       F       /tank/test/created
M       F       /tank/test/modified
.Ed
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-snapshot 8
