melkorbsd/ru-freebsd-man/man8/zfs-rename.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Март 16, 2022
.Dt ZFS-RENAME 8
.Os
.
.Sh ИМЯ
.Nm zfs-rename
.Nd переименовать набор данных ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm rename
.Op Fl f
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot
.Nm zfs
.Cm rename
.Fl p
.Op Fl f
.Ar filesystem Ns | Ns Ar volume
.Ar filesystem Ns | Ns Ar volume
.Nm zfs
.Cm rename
.Fl u
.Op Fl f
.Ar filesystem Ar filesystem
.Nm zfs
.Cm rename
.Fl r
.Ar snapshot Ar snapshot
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm rename
.Op Fl f
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot
.Xc
.It Xo
.Nm zfs
.Cm rename
.Fl p
.Op Fl f
.Ar filesystem Ns | Ns Ar volume
.Ar filesystem Ns | Ns Ar volume
.Xc
.It Xo
.Nm zfs
.Cm rename
.Fl u
.Op Fl f
.Ar filesystem
.Ar filesystem
.Xc
Переименовывает данный набор данных.
Новый целевой объект может быть расположен в любом месте иерархии ZFS, за исключением
снапшотов.
Снапшоты могут быть переименованы только в родительской файловой системе или томе.
При переименовании снапшота во втором аргументе необязательно указывать родительскую файловую систему моментального снапшота.
Переименованные файловые системы могут наследовать новые точки монтирования, и в этом случае они
размонтируются и повторно подключаются в новой точке монтирования.
.Bl -tag -width "-a"
.It Fl f
Принудительно размонтируйте все файловые системы, которые необходимо размонтировать в процессе.
Этот флажок не действует, если используется вместе с
.Fl u
флагом.
.It Fl p
Создает все несуществующие родительские наборы данных.
Наборы данных, созданные таким образом, автоматически монтируются в соответствии с
.Sy mountpoint
свойства, унаследованная от их родителя.
.It Fl u
Не перемонтируйте файловые системы во время переименования.
Если файловая система
.Sy mountpoint
свойство настроено на
.Sy legacy
или
.Sy none ,
файловая система не размонтируется, даже если эта опция не указана.
.El
.It Xo
.Nm zfs
.Cm rename
.Fl r
.Ar snapshot Ar snapshot
.Xc
Рекурсивно переименуйте снапшоты всех дочерних наборов данных.
Снапшоты - это единственный набор данных, который можно рекурсивно переименовать.
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 10, 15 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : Никакого продвижения клона ZFS
Следующие команды иллюстрируют, как протестировать изменения в файловой системе, а
затем заменить исходную файловую систему на измененную, используя клоны,
продвижение клонов и переименование:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm create Ar pool/project/production
  populate /pool/project/production with data
.No # Nm zfs Cm snapshot Ar pool/project/production Ns @ Ns Ar today
.No # Nm zfs Cm clone Ar pool/project/production@today pool/project/beta
  make changes to /pool/project/beta and test them
.No # Nm zfs Cm promote Ar pool/project/beta
.No # Nm zfs Cm rename Ar pool/project/production pool/project/legacy
.No # Nm zfs Cm rename Ar pool/project/beta pool/project/production
  once the legacy version is no longer needed, it can be destroyed
.No # Nm zfs Cm destroy Ar pool/project/legacy
.Ed
.
.Ss Пример 2 : Нет необходимости выполнять переходящий снапшот
В следующем примере показано, как вести журнал снапшотов с
использованием согласованной схемы именования.
Чтобы сохранить снапшот на неделю, пользователь удаляет самый старый снапшот,
переименовывает оставшиеся снапшоты и затем создает новый снапшот следующим образом:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm destroy Fl r Ar pool/users@7daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@6daysago No @ Ns Ar 7daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@5daysago No @ Ns Ar 6daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@4daysago No @ Ns Ar 5daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@3daysago No @ Ns Ar 4daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@2daysago No @ Ns Ar 3daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@yesterday No @ Ns Ar 2daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@today No @ Ns Ar yesterday
.No # Nm zfs Cm snapshot Fl r Ar pool/users Ns @ Ns Ar today
.Ed
