melkorbsd/ru-freebsd-man/man8/zfs-mount.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Февраль 16, 2019
.Dt ZFS-MOUNT 8
.Os
.
.Sh ИМЯ
.Nm zfs-mount
.Nd управление состоянием монтирования файловых систем ZFS
.Sh СИНТАКСИС
.Nm zfs
.Cm mount
.Nm zfs
.Cm mount
.Op Fl Oflv
.Op Fl o Ar options
.Fl a Ns | Ns Ar filesystem
.Nm zfs
.Cm unmount
.Op Fl fu
.Fl a Ns | Ns Ar filesystem Ns | Ns Ar mountpoint
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm mount
.Xc
Отображает все файловые системы ZFS, подключенные в данный момент.
.It Xo
.Nm zfs
.Cm mount
.Op Fl Oflv
.Op Fl o Ar options
.Fl a Ns | Ns Ar filesystem
.Xc
Смонтируйте файловую систему ZFS по пути, описанному в ее свойстве
.Sy mountpoint ,
если путь существует и пуст.
Если
.Sy mountpoint
установлен на
.Em legacy ,
вместо этого файловая система должна быть смонтирована с помощью
.Xr mount 8 .
.Bl -tag -width "-O"
.It Fl O
Выполните монтаж внахлест.
Позволяет выполнять монтаж в непустых
.Sy mountpoint .
Смотрите
.Xr mount 8
для получения дополнительной информации.
.It Fl a
Подключите все доступные файловые системы ZFS.
Запускается автоматически в процессе загрузки, если настроено.
.It Ar filesystem
Смонтируйте указанную файловую систему.
.It Fl o Ar options
Дополнительный список параметров монтирования, разделенных запятыми, который можно временно использовать на
время монтирования.
Смотрите раздел
.Em Temporary Mount Point Properties
из
.Xr zfsprops 7
для получения подробной информации.
.It Fl l
Загружайте ключи для зашифрованных файловых систем по мере их монтирования.
Это эквивалентно выполнению
.Nm zfs Cm load-key
в каждом корневом каталоге шифрования перед его подключением.
Обратите внимание, что если файловая система имеет
.Sy keylocation Ns = Ns Sy prompt ,
это приведет к интерактивной блокировке терминала после запроса ключа.
.It Fl v
Сообщайте о ходе монтажа.
.It Fl f
Попытайтесь принудительно смонтировать все файловые системы, даже те, которые обычно не
монтируются (например, отредактированные наборы данных).
.El
.It Xo
.Nm zfs
.Cm unmount
.Op Fl fu
.Fl a Ns | Ns Ar filesystem Ns | Ns Ar mountpoint
.Xc
Отключает подключенные в данный момент файловые системы ZFS.
.Bl -tag -width "-a"
.It Fl a
Отключите все доступные файловые системы ZFS.
Запускается автоматически в процессе завершения работы.
.It Fl f
Принудительно размонтируйте файловую систему, даже если она используется в данный момент.
Эта опция не поддерживается в Linux.
.It Fl u
Выгрузите ключи для всех корней шифрования, размонтированных с помощью этой команды.
.It Ar filesystem Ns | Ns Ar mountpoint
Отключите указанную файловую систему.
Команде также может быть задан путь к точке подключения файловой системы ZFS в
системе.
.El
.El
