melkorbsd/ru-freebsd-man/man8/zfs-create.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Март 16, 2022
.Dt ZFS-CREATE 8
.Os
.
.Sh ИМЯ
.Nm zfs-create
.Nd создает набор данных ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm create
.Op Fl Pnpuv
.Oo Fl o Ar property Ns = Ns Ar value Oc Ns …
.Ar filesystem
.Nm zfs
.Cm create
.Op Fl ps
.Op Fl b Ar blocksize
.Oo Fl o Ar property Ns = Ns Ar value Oc Ns …
.Fl V Ar size Ar volume
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm create
.Op Fl Pnpuv
.Oo Fl o Ar property Ns = Ns Ar value Oc Ns …
.Ar filesystem
.Xc
Создает новую файловую систему ZFS.
Файловая система автоматически монтируется в соответствии с
.Sy mountpoint
свойством, унаследованным от родителя, за исключением случаев, когда используется
.Fl u
опция.
.Bl -tag -width "-o"
.It Fl o Ar property Ns = Ns Ar value
Устанавливает указанное свойство так, как если бы команда
.Nm zfs Cm set Ar property Ns = Ns Ar value
была вызвана одновременно с созданием набора данных.
Любое редактируемое свойство ZFS также может быть установлено во время создания.
Множество
.Fl o
параметров может быть указано.
Возникает ошибка, если одно и то же свойство указано в нескольких
.Fl o
опциях.
.It Fl p
Создает все несуществующие родительские наборы данных.
Наборы данных, созданные таким образом, автоматически монтируются в соответствии с
.Sy mountpoint
свойсвами, унаследованными от их родителей.
Любое свойство, указанное в командной строке с помощью
.Fl o
параметра игнорируется.
Если целевая файловая система уже существует, операция завершается успешно.
.It Fl n
Проводит пробный запуск создания
.Pq Qq No-op
.
Наборы данных создаваться не будут.
Это полезно в сочетании с
.Fl v
или
.Fl P
флагами для проверки свойств, передаваемых через
.Fl o
параметры и те, которые подразумеваются другими параметрами.
Фактическое создание набора данных все еще может завершиться ошибкой из-за недостаточных привилегий или
доступной емкости.
.It Fl P
Подробная информация о созданном наборе данных, пригодная для машинного анализа.
Каждая строка выходных данных содержит ключ и одно или два значения, разделенные символами табуляции.
.Sy create_ancestors
и
.Sy create
ключи имеют
.Em filesystem
как их единственное значение.
.Sy create_ancestors
ключ появляется только в том случае, если используется
.Fl p
опция.
.Sy property
ключ имеет два значения: имя свойства и значение этого свойства.
.Sy property
ключ может отображаться ноль или более раз, по одному разу для каждого свойства, которое будет установлено локально
в
.Em filesystem
в связи с использованием
.Fl o
опции.
.It Fl u
Не монтирует вновь созданную файловую систему.
.It Fl v
Выводит подробную информацию о созданном наборе данных.
.El
.It Xo
.Nm zfs
.Cm create
.Op Fl ps
.Op Fl b Ar blocksize
.Oo Fl o Ar property Ns = Ns Ar value Oc Ns …
.Fl V Ar size Ar volume
.Xc
Создает том заданного размера.
Том экспортируется как блочное устройство в
.Pa /dev/zvol/path ,
где
.Em path
это имя тома в пространстве имен ZFS.
Размер представляет собой логический размер, экспортируемый устройством.
По умолчанию создается резервирование такого же размера.
.Pp
.Ar size
автоматически округляется в большую сторону до ближайшего значения, кратного
.Sy blocksize .
.Bl -tag -width "-b"
.It Fl b Ar blocksize
Эквивалентно
.Fl o Sy volblocksize Ns = Ns Ar blocksize .
Если этот параметр указан в сочетании с
.Fl o Sy volblocksize ,
результирующее поведение не определено.
.It Fl o Ar property Ns = Ns Ar value
Устанавливает указанное свойство таким образом, как если бы
.Nm zfs Cm set Ar property Ns = Ns Ar value
команда была вызвана одновременно с созданием набора данных.
Любое редактируемое свойство ZFS также может быть задано во время создания.
Множество параметров
.Fl o
может быть указано.
Возникает ошибка, если одно и то же свойство указано в нескольких
.Fl o
опциях.
.It Fl p
Создает все несуществующие родительские наборы данных.
Наборы данных, созданные таким образом, автоматически монтируются в соответствии с
.Sy mountpoint
свойство, унаследованное от родительского элемента.
Любое свойство, указанное в командной строке с помощью
.Fl o
параметр игнорируется.
Если целевая файловая система уже существует, операция завершается успешно.
.It Fl s
Создает разреженный том без резервирования.
Смотрите
.Sy volsize
в
.Em Native Properties
разделе из
.Xr zfsprops 7
для получения дополнительной информации о разреженных томах.
.It Fl n
Проводит пробный запуск
.Pq Qq No-op
создания.
Наборы данных создаваться не будут.
Это полезно в сочетании с
.Fl v
или
.Fl P
флаги для проверки свойств, передаваемых через
.Fl o
параметры и те, которые подразумеваются другими параметрами.
Фактическое создание набора данных все еще может завершиться ошибкой из-за недостаточных привилегий или
доступной емкости.
.It Fl P
Подробная информация о созданном наборе данных, пригодная для машинного анализа.
Каждая строка выходных данных содержит ключ и одно или два значения, разделенные символами табуляции.
То
.Sy create_ancestors
и
.Sy create
ключи имеют
.Em volume
как их единственное значение.
.Sy create_ancestors
ключ появляется только в том случае, если
.Fl p
используется опция.
.Sy property
ключ имеет два значения: имя свойства и значение этого свойства.
.Sy property
ключ может отображаться ноль или более раз, по одному разу для каждого свойства, которое будет установлено локально
в
.Em volume
в связи с использованием
.Fl b
или
.Fl o
опций, а также
.Sy refreservation
если объем не является разреженным.
.It Fl v
Выводит подробную информацию о созданном наборе данных.
.El
.El
.Ss ZFS for Swap
Замена на том ZFS может привести к взаимоблокировке и не рекомендуется.
Смотрите часто задаваемые вопросы по OpenZFS.
.Pp
Замена на файл в файловой системе ZFS не поддерживается.
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 1, 10 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : No Creating a ZFS File System Hierarchy
Следующие команды создают файловую систему с именем
.Ar pool/home
и файловую система с именем
.Ar pool/home/bob .
Точка монтирования
.Pa /export/home
устанавливается для родительской файловой системы и автоматически наследуется дочерней
файловой системой.
.Dl # Nm zfs Cm create Ar pool/home
.Dl # Nm zfs Cm set Sy mountpoint Ns = Ns Ar /export/home pool/home
.Dl # Nm zfs Cm create Ar pool/home/bob
.
.Ss Пример 2 : No Promoting a ZFS Clone
Следующие команды иллюстрируют, как протестировать изменения в файловой системе, а
затем заменить исходную файловую систему на измененную, используя клоны,
продвижение клонов и переименование:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm create Ar pool/project/production
  populate /pool/project/production with data
.No # Nm zfs Cm snapshot Ar pool/project/production Ns @ Ns Ar today
.No # Nm zfs Cm clone Ar pool/project/production@today pool/project/beta
  make changes to /pool/project/beta and test them
.No # Nm zfs Cm promote Ar pool/project/beta
.No # Nm zfs Cm rename Ar pool/project/production pool/project/legacy
.No # Nm zfs Cm rename Ar pool/project/beta pool/project/production
  once the legacy version is no longer needed, it can be destroyed
.No # Nm zfs Cm destroy Ar pool/project/legacy
.Ed
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-destroy 8 ,
.Xr zfs-list 8 ,
.Xr zpool-create 8
