melkorbsd/ru-freebsd-man/man8/zfs-share.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd May 17, 2021
.Dt ZFS-SHARE 8
.Os
.
.Sh ИМЯ
.Nm zfs-share
.Nd совместное использование и отмена совместного использования файловых систем ZFS
.Sh СИНТАКСИС
.Nm zfs
.Cm share
.Op Fl l
.Fl a Ns | Ns Ar filesystem
.Nm zfs
.Cm unshare
.Fl a Ns | Ns Ar filesystem Ns | Ns Ar mountpoint
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm share
.Op Fl l
.Fl a Ns | Ns Ar filesystem
.Xc
Совместно использует доступные файловые системы ZFS.
.Bl -tag -width "-a"
.It Fl l
Загружает ключи для зашифрованных файловых систем по мере их монтирования.
Это эквивалентно выполнению
.Nm zfs Cm load-key
в каждом корневом каталоге шифрования перед его установкой.
Обратите внимание, что если файловая система имеет
.Sy keylocation Ns = Ns Sy prompt ,
это приведет к интерактивной блокировке терминала после запроса ключа.
.It Fl a
Предоставляет общий доступ ко всем доступным файловым системам ZFS.
Запускается автоматически в процессе загрузки.
.It Ar filesystem
Предоставляет общий доступ к указанной файловой системе в соответствии со свойствами
.Sy sharenfs
и
.Sy sharesmb .
Файловые системы являются общими, когда установлены свойства
.Sy sharenfs
или
.Sy sharesmb .
.El
.It Xo
.Nm zfs
.Cm unshare
.Fl a Ns | Ns Ar filesystem Ns | Ns Ar mountpoint
.Xc
Отменяет совместное использование файловых систем ZFS, которые в настоящее время являются общими.
.Bl -tag -width "-a"
.It Fl a
Отключает общий доступ ко всем доступным файловым системам ZFS.
Вызывается автоматически как часть процесса завершения работы.
.It Ar filesystem Ns | Ns Ar mountpoint
Отменяет общий доступ к указанной файловой системе.
Команде также может быть задан путь к файловой системе ZFS, совместно используемой в системе.
.El
.El
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr exports 5 ,
.Xr smb.conf 5 ,
.Xr zfsprops 7
