melkorbsd/ru-freebsd-man/man8/zfs-hold.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd June 30, 2019
.Dt ZFS-HOLD 8
.Os
.
.Sh ИМЯ
.Nm zfs-hold
.Nd сохраняет снапшоты ZFS, чтобы предотвратить их удаление
.Sh СИНТАКСИС
.Nm zfs
.Cm hold
.Op Fl r
.Ar tag Ar snapshot Ns …
.Nm zfs
.Cm holds
.Op Fl rHp
.Ar snapshot Ns …
.Nm zfs
.Cm release
.Op Fl r
.Ar tag Ar snapshot Ns …
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm hold
.Op Fl r
.Ar tag Ar snapshot Ns …
.Xc
Добавляет единственную ссылку, названную с помощью аргумента
.Ar tag ,
относящуюся к указанномум снапшоту.
Каждый снапшот имеет свое собственное пространство имен тегов, и теги должны быть уникальными в пределах этого
пространства.
.Pp
Если для снапшота существует блокировка, пытается уничтожить этот снапшот используя
.Nm zfs Cm destroy
команду, возвращая
.Sy EBUSY .
.Bl -tag -width "-r"
.It Fl r
Указывает, что удержание с данным тегом рекурсивно применяется к снапшотам 
всех последующих файловых систем.
.El
.It Xo
.Nm zfs
.Cm holds
.Op Fl rHp
.Ar snapshot Ns …
.Xc
Содержит список всех существующих пользовательских ссылок для данного снапшота или снапшотов.
.Bl -tag -width "-r"
.It Fl r
Содержит список удержаний, установленных для именованных снапшотов-потомков, в дополнение к
списку удержаний для именованного снапшота.
.It Fl H
Не печатает заголовки, использует выходные данные, разделенные табуляцией.
.It Fl p
Выдает содержания временных меток в виде временных меток эпохи unix.
.El
.It Xo
.Nm zfs
.Cm release
.Op Fl r
.Ar tag Ar snapshot Ns …
.Xc
Удаляет единственную ссылку, названную с помощью аргумента
.Ar tag
из указанного снапшота или снапшотов.
Для каждого снапшота должен уже существовать тег.
Если снапшот заблокирован, пытается уничтожить этот снапшот с помощью команды
.Nm zfs Cm destroy ,
возвращая
.Sy EBUSY .
.Bl -tag -width "-r"
.It Fl r
Рекурсивно освобождает блокировку с заданным тегом для снапшотов всех
последующих файловых систем.
.El
.El
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-destroy 8
