melkorbsd/ru-freebsd-man/man8/zfs-jail.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2011, Pawel Jakub Dawidek <pjd@FreeBSD.org>
.\" Copyright (c) 2012, Glen Barber <gjb@FreeBSD.org>
.\" Copyright (c) 2012, Bryan Drewery <bdrewery@FreeBSD.org>
.\" Copyright (c) 2013, Steven Hartland <smh@FreeBSD.org>
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright (c) 2014, Xin LI <delphij@FreeBSD.org>
.\" Copyright (c) 2014-2015, The FreeBSD Foundation, All Rights Reserved.
.\" Copyright (c) 2016 Nexenta Systems, Inc. All Rights Reserved.
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd May 27, 2021
.Dt ZFS-JAIL 8
.Os
.
.Sh ИМЯ
.Nm zfs-jail
.Nd подключение или отсоединение файловой системы ZFS от FreeBSD jail
.Sh СИНТАКСИС
.Nm zfs Cm jail
.Ar jailid Ns | Ns Ar jailname
.Ar filesystem
.Nm zfs Cm unjail
.Ar jailid Ns | Ns Ar jailname
.Ar filesystem
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm jail
.Ar jailid Ns | Ns Ar jailname
.Ar filesystem
.Xc
Прикрепляет указанную
.Ar filesystem
к jail, указанному с помощью JID
.Ar jailid
или имени
.Ar jailname .
Отныне этим деревом файловой системы можно управлять из jail, если свойство
.Sy jailed
установлено.
Чтобы использовать эту функциональность, jail необходимы параметры
.Sy allow.mount
и
.Sy allow.mount.zfs ,
установленные на параметры
.Sy 1
и
.Sy enforce_statfs
с меньшим заданным значением, чем
.Sy 2 .
.Pp
Вы не можете прикрепить дочерние элементы набора данных, содержащегося в jail, к другому jail.
Вы также не можете подключить корневую файловую систему
jail или любой другой набор данных, который необходимо смонтировать перед запуском rc-скрипта zfs
внутри jail, поскольку он будет подключен немонтированным до тех пор, пока не будет
смонтирован из rc-скрипта внутри jail.
.Pp
Чтобы разрешить управление набором данных из jail,  свойство
.Sy jailed
должно быть установлено, и jail необходим доступ к устройству
.Pa /dev/zfs .
Свойство
.Sy quota
не может быть изменено из jail.
.Pp
После того, как набор данных присоединен к jail и свойство
.Sy jailed
установлено, подключенная файловая система не может быть подключена за пределами jail,
поскольку администратор jail мог установить для точки монтирования неприемлемое
значение.
.Pp
Смотрите
.Xr jail 8
для получения дополнительной информации об управлении jail.
Jails это функции
.Fx
и не актуальны на других платформах.
.It Xo
.Nm zfs
.Cm unjail
.Ar jailid Ns | Ns Ar jailname
.Ar filesystem
.Xc
Отсоединяет указанную
.Ar filesystem
от jail, которую опознал JID
.Ar jailid
или имени
.Ar jailname .
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfsprops 7 ,
.Xr jail 8
