melkorbsd/ru-freebsd-man/man8/zfs-project.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Май 27, 2021
.Dt ZFS-PROJECT 8
.Os
.
.Sh ИМЯ
.Nm zfs-project
.Nd управление проектами в файловой системе ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm project
.Oo Fl d Ns | Ns Fl r Ns Oc
.Ar file Ns | Ns Ar directory Ns …
.Nm zfs
.Cm project
.Fl C
.Oo Fl kr Ns Oc
.Ar file Ns | Ns Ar directory Ns …
.Nm zfs
.Cm project
.Fl c
.Oo Fl 0 Ns Oc
.Oo Fl d Ns | Ns Fl r Ns Oc
.Op Fl p Ar id
.Ar file Ns | Ns Ar directory Ns …
.Nm zfs
.Cm project
.Op Fl p Ar id
.Oo Fl rs Ns Oc
.Ar file Ns | Ns Ar directory Ns …
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm project
.Oo Fl d Ns | Ns Fl r Ns Oc
.Ar file Ns | Ns Ar directory Ns …
.Xc
Перечислите идентификатор проекта (ID) и флаг наследования файлов и каталогов.
.Bl -tag -width "-d"
.It Fl d
Показывать идентификатор проекта каталога и флаг наследования, а не его дочерние элементы.
.It Fl r
Рекурсивно перечислять подкаталоги.
.El
.It Xo
.Nm zfs
.Cm project
.Fl C
.Oo Fl kr Ns Oc
.Ar file Ns | Ns Ar directory Ns …
.Xc
Снимите флажок наследования проекта и/или идентификатор для файлов и каталогов.
.Bl -tag -width "-k"
.It Fl k
Оставьте идентификатор проекта неизменным.
Если он не указан, идентификатор проекта будет обнулен.
.It Fl r
Рекурсивно очищайте флаги подкаталогов.
.El
.It Xo
.Nm zfs
.Cm project
.Fl c
.Oo Fl 0 Ns Oc
.Oo Fl d Ns | Ns Fl r Ns Oc
.Op Fl p Ar id
.Ar file Ns | Ns Ar directory Ns …
.Xc
Установите флажок project ID и inherit для файлов и каталогов:
укажите записи без флажка project inherit или с идентификаторами проектов, отличающимися
от идентификатора
проекта в целевой директории или от того, который указан с помощью
.Fl p .
.Bl -tag -width "-p id"
.It Fl 0
Разделяйте имена файлов нулевым байтом вместо новой строки, не выводите диагнозы.
.It Fl d
Проверьте идентификатор проекта каталога и флаг inherit, а не его дочерние элементы.
.It Fl p Ar id
По сравнению с
.Ar id
вместо идентификаторов проекта целевых файлов и каталогов.
.It Fl r
Рекурсивно проверяйте подкаталоги.
.El
.It Xo
.Nm zfs
.Cm project
.Fl p Ar id
.Oo Fl rs Ns Oc
.Ar file Ns | Ns Ar directory Ns …
.Xc
Установите идентификатор проекта и/или флаг наследования для файлов и каталогов.
.Bl -tag -width "-p id"
.It Fl p Ar id
Установите для идентификатора проекта заданное значение.
.It Fl r
Устанавливается в подкаталогах рекурсивно.
.It Fl s
Установите флажок project inherit для заданных файлов и каталогов.
Обычно используется для настройки квот дерева с
.Fl r .
В этом случае идентификатор проекта каталога
будет установлен для всех его потомков, если только он явно не указан с помощью
.Fl p .
.El
.El
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-projectspace 8
