melkorbsd/ru-freebsd-man/man8/zfs-snapshot.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd March 16, 2022
.Dt ZFS-SNAPSHOT 8
.Os
.
.Sh ИМЯ
.Nm zfs-snapshot
.Nd создание снапшотов наборов данных ZFS
.Sh СИНТАКСИС
.Nm zfs
.Cm snapshot
.Op Fl r
.Oo Fl o Ar property Ns = Ns Ar value Oc Ns …
.Ar dataset Ns @ Ns Ar snapname Ns …
.
.Sh ОПИСАНИЕ
Все предыдущие изменения, произведенные в результате успешных системных вызовов файловой системы, являются
частью снапшотов.
Снапшоты делаются атомарно, так что все снапшоты соответствуют одному и тому же
моменту времени.
.Nm zfs Cm snap
может использоваться в качестве псевдонима для
.Nm zfs Cm snapshot .
Смотрите раздел
.Sx Snapshots
в
.Xr zfsconcepts 7
для получения подробной информации.
.Bl -tag -width "-o"
.It Fl o Ar property Ns = Ns Ar value
Устанавливает указанное свойство; смотрите
.Nm zfs Cm create
для получения подробной информации.
.It Fl r
Рекурсивно создаёт снапшоты всех дочерних наборов данных
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 2, 3, 10, 15 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : No Создание снапшота ZFS
Следующая команда создает снапшот с именем
.Ar yesterday .
Этот снапшот монтируется по требованию в каталог
.Pa .zfs/snapshot
в корне файловой системы
.Ar pool/home/bob .
.Dl # Nm zfs Cm snapshot Ar pool/home/bob Ns @ Ns Ar yesterday
.
.Ss Пример 2 : No Создание и уничтожение нескольких снапшотов
Следующая команда создает моментальные снимки с именем
.Ar yesterday No для Ar pool/home
и всех его дочерних файловых систем.
Каждый снапшот монтируется по требованию в
каталоге 
.Pa .zfs/snapshot
в корне файловой системы.
Вторая команда уничтожает вновь созданные снапшоты.
.Dl # Nm zfs Cm snapshot Fl r Ar pool/home Ns @ Ns Ar yesterday
.Dl # Nm zfs Cm destroy Fl r Ar pool/home Ns @ Ns Ar yesterday
.
.Ss Пример 3 : No Продвижение клона ZFS
Следующие команды иллюстрируют, как протестировать изменения в файловой системе, а
затем заменить исходную файловую систему на измененную, используя клоны,
продвижение клонов и переименование:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm create Ar pool/project/production
  populate /pool/project/production with data
.No # Nm zfs Cm snapshot Ar pool/project/production Ns @ Ns Ar today
.No # Nm zfs Cm clone Ar pool/project/production@today pool/project/beta
  make changes to /pool/project/beta and test them
.No # Nm zfs Cm promote Ar pool/project/beta
.No # Nm zfs Cm rename Ar pool/project/production pool/project/legacy
.No # Nm zfs Cm rename Ar pool/project/beta pool/project/production
  once the legacy version is no longer needed, it can be destroyed
.No # Nm zfs Cm destroy Ar pool/project/legacy
.Ed
.
.Ss Пример 4 : No Выполнение движущегося снапшота
В следующем примере показано, как вести журнал снапшотов с
использованием согласованной схемы именования.
Чтобы сохранить снапшоты на неделю, пользователь удаляет самый старый снапшот,
переименовывает оставшиеся снапшоты и затем создает новый снапшот следующим образом:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm destroy Fl r Ar pool/users@7daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@6daysago No @ Ns Ar 7daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@5daysago No @ Ns Ar 6daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@4daysago No @ Ns Ar 5daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@3daysago No @ Ns Ar 4daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@2daysago No @ Ns Ar 3daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@yesterday No @ Ns Ar 2daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@today No @ Ns Ar yesterday
.No # Nm zfs Cm snapshot Fl r Ar pool/users Ns @ Ns Ar today
.Ed
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-bookmark 8 ,
.Xr zfs-clone 8 ,
.Xr zfs-destroy 8 ,
.Xr zfs-diff 8 ,
.Xr zfs-hold 8 ,
.Xr zfs-rename 8 ,
.Xr zfs-rollback 8 ,
.Xr zfs-send 8
