melkorbsd/ru-freebsd-man/man8/zfs-rollback.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Март 16, 2022
.Dt ZFS-ROLLBACK 8
.Os
.
.Sh ИМЯ
.Nm zfs-rollback
.Nd откат набора данных ZFS обратно к снапшоту
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm rollback
.Op Fl Rfr
.Ar snapshot
.
.Sh ОПИСАНИЕ
При откате набора данных все данные, которые изменились с момента создания
снапшота, удаляются, и набор данных возвращается к состоянию на момент создания снапшота.
По умолчанию команда отказывается выполнять откат к снапшоту, отличному от самого
последнего.
Для этого все промежуточные снапшоты и закладки должны быть уничтожены путем
указания
.Fl r
опции.
.Pp
.Fl rR
параметры не позволяют рекурсивно уничтожать дочерние снапшоты рекурсивного снапшота.
При использовании любого из этих параметров уничтожаются только прямые снапшоты указанной файловой системы.
Чтобы полностью откатить рекурсивный снапшот, необходимо выполнить откат отдельных
дочерних снапшотов.
.Bl -tag -width "-R"
.It Fl R
Уничтожьте все более свежие снапшоты и закладки, а также любые клоны этих
снапшотов.
.It Fl f
Используется с
.Fl R
возможность принудительного размонтирования любых файловых систем-клонов, которые подлежат уничтожению.
.It Fl r
Уничтожьте все снапшоты и закладки, более свежие, чем указанные.
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 8 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 8 : Нет возможности отката файловой системы ZFS
Следующая команда возвращает содержимое
.Ar pool/home/anne
к снапшоту с именем
.Ar yesterday ,
удаление всех промежуточных снапшотов:
.Dl # Nm zfs Cm rollback Fl r Ar pool/home/anne Ns @ Ns Ar yesterday
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-snapshot 8
