melkorbsd/ru-freebsd-man/man8/zfs-list.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Март 16, 2022
.Dt ZFS-LIST 8
.Os
.
.Sh ИМЯ
.Nm zfs-list
.Nd список свойств наборов данных ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm list
.Op Fl r Ns | Ns Fl d Ar depth
.Op Fl Hp
.Oo Fl o Ar property Ns Oo , Ns Ar property Oc Ns … Oc
.Oo Fl s Ar property Oc Ns …
.Oo Fl S Ar property Oc Ns …
.Oo Fl t Ar type Ns Oo , Ns Ar type Oc Ns … Oc
.Oo Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Oc Ns …
.
.Sh ОПИСАНИЕ
Если указано, вы можете указать информацию о свойствах в виде абсолютного или
относительного пути.
По умолчанию отображаются все файловые системы и тома.
Снапшот отображается, если
.Sy listsnapshots
свойства на пул находится
.Sy on
.Po the default is
.Sy off
.Pc ,
или если бы
.Fl t Sy snapshot
или
.Fl t Sy all
указаны параметры.
Отображаются следующие поля:
.Sy name , Sy used , Sy available , Sy referenced , Sy mountpoint .
.Bl -tag -width "-H"
.It Fl H
Используется для скриптового режима.
Не печатайте заголовки и разделяйте поля одной табуляцией вместо произвольного
пробела.
.It Fl d Ar depth
Рекурсивно отображать все дочерние элементы набора данных, ограничивая рекурсию
.Ar depth .
A
.Ar depth
от
.Sy 1
будет отображаться только набор данных и его прямые дочерние элементы.
.It Fl o Ar property
Отображаемый список свойств, разделенных запятыми.
Свойство должно быть:
.Bl -bullet -compact
.It
Одно из свойств, описанных в
.Sx Native Properties
разделе из
.Xr zfsprops 7
.It
Свойство пользователя
.It
Ценность
.Sy name
для отображения имени набора данных
.It
Ценность
.Sy space
для отображения свойств использования пространства в файловых системах и томах.
Это ярлык для указания
.Fl o Ns \ \& Ns Sy name , Ns Sy avail , Ns Sy used , Ns Sy usedsnap , Ns
.Sy usedds , Ns Sy usedrefreserv , Ns Sy usedchild
.Fl t Sy filesystem , Ns Sy volume .
.El
.It Fl p
Отображение чисел в притче
.Pq exact
ценности.
.It Fl r
Рекурсивно отображать все дочерние элементы набора данных в командной строке.
.It Fl s Ar property
Свойство для сортировки выходных данных по столбцам в порядке возрастания на основе
значения свойства.
Свойство должно быть одним из свойств, описанных в
.Sx Properties
разделе из
.Xr zfsprops 7
или ценность
.Sy name
для сортировки по названию набора данных.
Несколько свойств могут быть заданы одновременно с помощью нескольких
.Fl s
свойств опций.
Множественные
.Fl s
параметры оцениваются слева направо в порядке убывания важности.
Ниже приведен список критериев сортировки:
.Bl -bullet -compact
.It
Числовые типы сортируются в числовом порядке.
.It
Строковые типы сортируются в алфавитном порядке.
.It
Типы, неподходящие для строки, сортируют эту строку в нижней части литерала независимо от
указанного порядка.
.El
.Pp
Если параметры сортировки не заданы, то существующее поведение
.Nm zfs Cm list
сохраняется.
.It Fl S Ar property
То же, что
.Fl s ,
но отсортированы по свойствам в порядке убывания.
.It Fl t Ar type
Список отображаемых типов, разделенных запятыми, где
.Ar type
является одним из
.Sy filesystem ,
.Sy snapshot ,
.Sy volume ,
.Sy bookmark ,
или
.Sy all .
Например, указание
.Fl t Sy snapshot
отображает только снапшота.
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 5 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : Нет списка наборов данных ZFS
Следующая команда выводит список всех активных файловых систем и томов в системе.
Снимки отображаются, если
.Sy listsnaps Ns = Ns Sy on .
Значение по умолчанию равно
.Sy off .
Видите
.Xr zpoolprops 7
для получения дополнительной информации о свойствах пула.
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm list
NAME                      USED  AVAIL  REFER  MOUNTPOINT
pool                      450K   457G    18K  /pool
pool/home                 315K   457G    21K  /export/home
pool/home/anne             18K   457G    18K  /export/home/anne
pool/home/bob             276K   457G   276K  /export/home/bob
.Ed
.
.Sh SEE ALSO
.Xr zfsprops 7 ,
.Xr zfs-get 8
