melkorbsd/ru-freebsd-man/man8/zfs-inherit.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd March 16, 2022
.Dt ZFS-SET 8
.Os
.
.Sh ИМЯ
.Nm zfs-set
.Nd устанавливает свойства для наборов данных ZFS
.Sh СИНТАКСИС
.Nm zfs
.Cm set
.Op Fl u
.Ar property Ns = Ns Ar value Oo Ar property Ns = Ns Ar value Oc Ns …
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Ns …
.Nm zfs
.Cm get
.Op Fl r Ns | Ns Fl d Ar depth
.Op Fl Hp
.Oo Fl o Ar field Ns Oo , Ns Ar field Oc Ns … Oc
.Oo Fl s Ar source Ns Oo , Ns Ar source Oc Ns … Oc
.Oo Fl t Ar type Ns Oo , Ns Ar type Oc Ns … Oc
.Cm all Ns | Ns Ar property Ns Oo , Ns Ar property Oc Ns …
.Oo Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Ns | Ns Ar bookmark Oc Ns …
.Nm zfs
.Cm inherit
.Op Fl rS
.Ar property Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Ns …
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm set
.Op Fl u
.Ar property Ns = Ns Ar value Oo Ar property Ns = Ns Ar value Oc Ns …
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Ns …
.Xc
Можно редактировать только некоторые свойства.
Смотрите
.Xr zfsprops 7
для получения дополнительной информации о том, какие свойства можно задать, и о допустимых
значениях.
Числовые значения могут быть указаны как точные значения или в читаемой для человека форме
с суффиксом
.Sy B , K , M , G , T , P , E , Z
.Po для байтов, килобайт, мегабайт, гигабайт, терабайт, петабайт, эксабайт
или зеттабайт, соответственно
.Pc .
Пользовательские свойства могут быть установлены для снапшотов.
Для получения дополнительной информации смотрите раздел
.Em User Properties
в
.Xr zfsprops 7 .
.Bl -tag -width "-u"
.It Fl u
Обновляет свойства mountpoint, sharenfs, sharesmb, но не подключает и не предоставляет общий доступ к
набору данных.
.El
.It Xo
.Nm zfs
.Cm get
.Op Fl r Ns | Ns Fl d Ar depth
.Op Fl Hp
.Oo Fl o Ar field Ns Oo , Ns Ar field Oc Ns … Oc
.Oo Fl s Ar source Ns Oo , Ns Ar source Oc Ns … Oc
.Oo Fl t Ar type Ns Oo , Ns Ar type Oc Ns … Oc
.Cm all Ns | Ns Ar property Ns Oo , Ns Ar property Oc Ns …
.Oo Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Ns | Ns Ar bookmark Oc Ns …
.Xc
Отображает свойства для заданных наборов данных.
Если наборы данных не указаны, команда отображает свойства для всех
наборов данных в системе.
Для каждого свойства отображаются следующие столбцы:
.Bl -tag -compact -offset 4n -width "property"
.It Sy name
Имя набора данных
.It Sy property
Название свойства
.It Sy value
Значение свойства
.It Sy source
Источник свойства
.Sy локальный , по умолчанию , унаследованный , временный , полученный , No или Sy - Pq нет .
.El
.Pp
По умолчанию отображаются все столбцы, хотя этим можно управлять с помощью параметра
.Fl o .
Эта команда использует список свойств, разделенных запятыми, как описано в разделах
.Sx Native Properties
и
.Sx User Properties
в
.Xr zfsprops 7 .
.Pp
Значение
.Sy all
можно использовать для отображения всех свойств, применимых к
данному типу набора данных
.Pq Sy файловая система , том , снапшот , No или Sy закладка .
.Bl -tag -width "-s source"
.It Fl H
Отображает выходные данные в форме, более удобной для анализа скриптами.
Все заголовки опущены, а поля явно разделены одной табуляцией,
а не произвольным пространством.
.It Fl d Ar depth
Рекурсивно отображает все дочерние элементы набора данных, ограничивая рекурсию
.Ar глубиной .
При глубине
.Sy 1
будут отображаться только
набор данных и его прямые дочерние элементы.
.It Fl o Ar field
Отображаемый список столбцов, разделенных запятыми, по умолчанию равен
.Sy имени , Ns Sy свойству , Ns Sy значению , Ns Sy источнику .
.It Fl p
Отображает числа в понятных
.Pq точных
значениях.
.It Fl r
Рекурсивно отображает свойства для любых дочерних элементов.
.It Fl s Ar source
Отображаемый список источников, разделенных запятыми.
Свойства, полученные из источника, отличного от указанного в этом списке, игнорируются.
Каждый источник должен быть одним из следующих:
.Sy локальный , по умолчанию , унаследованный , временный , полученный , No или Sy нет .
Значение по умолчанию - все источники.
.It Fl t Ar type
Список отображаемых типов, разделенных запятыми, где
.Ar тип
один из
.Sy файловая система , снапшот , том , закладка , No или Sy все .
.El
.It Xo
.Nm zfs
.Cm inherit
.Op Fl rS
.Ar property Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot Ns …
.Xc
Очищает указанное свойство, в результате чего оно наследуется от предка,
восстанавливается по умолчанию, если ни у одного из предков это свойство не задано, или с помощью параметра
.Fl S
возвращается к полученному значению, если таковое существует.
Смотрите
.Xr zfsprops 7
для получения списка значений по умолчанию и подробной информации о том, какие свойства могут быть
унаследованы.
.Bl -tag -width "-r"
.It Fl r
Рекурсивно наследует данное свойство для всех дочерних элементов.
.It Fl S
Возвращает свойству полученное значение, если таковое существует;
в противном случае, для свойств, не подлежащих наследованию, - значение по умолчанию;
в противном случае действуеттак, как если бы параметр
.Fl S
не был указан.
.El
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 1, 4, 6, 7, 11, 14, 16 from zfs.8
.\" Make sure to update them bidirectionally
.Ss ПРИМЕР 1 : No Создание иерархии файловой системы ZFS
Следующие команды создают файловую систему с именем
.Ar pool/home
и файловую систему с именем
.Ar pool/home/bob .
Точка монтирования
.Pa /export/home
устанавливается для родительской файловой системы и автоматически наследуется дочерней
файловой системой.
.Dl # Nm zfs Cm create Ar pool/home
.Dl # Nm zfs Cm set Sy mountpoint Ns = Ns Ar /export/home pool/home
.Dl # Nm zfs Cm create Ar pool/home/bob
.
.Ss Пример 2 : No Отключение и включение сжатия файловой системы
Следующая команда отключает
.Sy compression
свойство для всех файловых систем, находящихся в
.Ar pool/home .
Следующая команда явно включает
.Sy compression
для
.Ar pool/home/anne .
.Dl # Nm zfs Cm set Sy compression Ns = Ns Sy off Ar pool/home
.Dl # Nm zfs Cm set Sy compression Ns = Ns Sy on Ar pool/home/anne
.
.Ss Пример 3 : No Установка квоты в файловой системе ZFS
Следующая команда устанавливает квоту в 50 Гбайт для
.Ar pool/home/bob :
.Dl # Nm zfs Cm set Sy quota Ns = Ns Ar 50G pool/home/bob
.
.Ss Пример 4 : No Список свойств ZFS
Следующая команда выводит список всех свойств для
.Ar pool/home/bob :
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm get Sy all Ar pool/home/bob
ИМЯ           СВОЙСТВО              ЗНАЧЕНИЕ                 ИСТОЧНИК
pool/home/bob  type                  filesystem             -
pool/home/bob  creation              Tue Jul 21 15:53 2009  -
pool/home/bob  used                  21K                    -
pool/home/bob  available             20.0G                  -
pool/home/bob  referenced            21K                    -
pool/home/bob  compressratio         1.00x                  -
pool/home/bob  mounted               yes                    -
pool/home/bob  quota                 20G                    local
pool/home/bob  reservation           none                   default
pool/home/bob  recordsize            128K                   default
pool/home/bob  mountpoint            /pool/home/bob         default
pool/home/bob  sharenfs              off                    default
pool/home/bob  checksum              on                     default
pool/home/bob  compression           on                     local
pool/home/bob  atime                 on                     default
pool/home/bob  devices               on                     default
pool/home/bob  exec                  on                     default
pool/home/bob  setuid                on                     default
pool/home/bob  readonly              off                    default
pool/home/bob  zoned                 off                    default
pool/home/bob  snapdir               hidden                 default
pool/home/bob  acltype               off                    default
pool/home/bob  aclmode               discard                default
pool/home/bob  aclinherit            restricted             default
pool/home/bob  canmount              on                     default
pool/home/bob  xattr                 on                     default
pool/home/bob  copies                1                      default
pool/home/bob  version               4                      -
pool/home/bob  utf8only              off                    -
pool/home/bob  normalization         none                   -
pool/home/bob  casesensitivity       sensitive              -
pool/home/bob  vscan                 off                    default
pool/home/bob  nbmand                off                    default
pool/home/bob  sharesmb              off                    default
pool/home/bob  refquota              none                   default
pool/home/bob  refreservation        none                   default
pool/home/bob  primarycache          all                    default
pool/home/bob  secondarycache        all                    default
pool/home/bob  usedbysnapshots       0                      -
pool/home/bob  usedbydataset         21K                    -
pool/home/bob  usedbychildren        0                      -
pool/home/bob  usedbyrefreservation  0                      -
.Ed
.Pp
Следующая команда возвращает единственное значение свойства:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm get Fl H o Sy value compression Ar pool/home/bob
on
.Ed
.Pp
Следующая команда выводит список всех свойств с локальными настройками для
.Ar pool/home/bob :
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm get Fl r s Sy local Fl o Sy name , Ns Sy property , Ns Sy value all Ar pool/home/bob
ИМЯ            СВОЙСТВО              ЗНАЧЕНИЕ
pool/home/bob  quota                 20G
pool/home/bob  compression           on
.Ed
.
.Ss Пример 5 : No Наследование свойств ZFS
Следующая команда вызывает
.Ar pool/home/bob No и Ar pool/home/anne
чтобы унаследовать
.Sy checksum
свойство от их родителя.
.Dl # Nm zfs Cm inherit Sy checksum Ar pool/home/bob pool/home/anne
.
.Ss Пример 6 : No Настройка пользовательских свойств
В следующем примере задается определенный пользователем
.Ar com.example : Ns Ar department
свойство для набора данных:
.Dl # Nm zfs Cm set Ar com.example : Ns Ar department Ns = Ns Ar 12345 tank/accounting
.
.Ss Пример 7 : No Настройка параметров свойств sharenfs в файловой системе ZFS
Следующие команды показывают, как установить параметры свойств
.Sy sharenfs ,
позволяющие разрешить доступ на чтение и запись для набора IP-адресов и разрешить root-доступ для системы
.Qq neo
к файловой системе
.Ar tank/home :
.Dl # Nm zfs Cm set Sy sharenfs Ns = Ns ' Ns Ar rw Ns =@123.123.0.0/16:[::1],root= Ns Ar neo Ns ' tank/home
.Pp
Если вы используете DNS для разрешения имен хостов,
укажите полное имя хоста.
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfsprops 7 ,
.Xr zfs-list 8
