melkorbsd/ru-freebsd-man/man8/zfs-wait.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012, 2018 by Delphix. All rights reserved.
.\" Copyright (c) 2012 Cyril Plisko. All Rights Reserved.
.\" Copyright (c) 2017 Datto Inc.
.\" Copyright (c) 2018 George Melikov. All Rights Reserved.
.\" Copyright 2017 Nexenta Systems, Inc.
.\" Copyright (c) 2017 Open-E, Inc. All Rights Reserved.
.\"
.Dd May 31, 2021
.Dt ZFS-WAIT 8
.Os
.
.Sh ИМЯ
.Nm zfs-wait
.Nd дождаться прекращения активности в файловой системе ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm zfs
.Cm wait
.Op Fl t Ar activity Ns Oo , Ns Ar activity Ns Oc Ns …
.Ar filesystem
.
.Sh ОПИСАНИЕ
Ожидает, пока в данной файловой системе не прекратятся все фоновые действия заданных типов.
Действие может прекратиться из-за его завершения или из-за того, что файловая
система была уничтожена или размонтирована.
Если не указано никаких действий, команда ожидает, пока фоновая активность
каждого из перечисленных ниже типов не прекратится.
Если действия указанных типов не выполняются, команда
немедленно возвращается.
.Pp
Это возможные значения
.Ar активности ,
а также то, чего ожидает каждый из них:
.Bl -tag -compact -offset Ds -width "deleteq"
.It Sy deleteq
Внутренняя очередь удаления файловой системы опустеет
.El
.Pp
Обратите внимание, что внутренняя очередь удаления не завершает работу до тех пор, пока не
будут полностью уничтожены все большие файлы и не будут закрыты все открытые файловые
дескрипторы для несвязанных файлов.
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr lsof 8
