melkorbsd/ru-freebsd-man/man8/zfs-upgrade.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd June 30, 2019
.Dt ZFS-UPGRADE 8
.Os
.
.Sh BVZ
.Nm zfs-upgrade
.Nd управление дисковой версией файловых систем ZFS
.Sh СИНТАКСИС
.Nm zfs
.Cm upgrade
.Nm zfs
.Cm upgrade
.Fl v
.Nm zfs
.Cm upgrade
.Op Fl r
.Op Fl V Ar version
.Fl a Ns | Ns Ar filesystem
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm upgrade
.Xc
Отображает список файловых систем, которые не являются самыми последними версиями.
.It Xo
.Nm zfs
.Cm upgrade
.Fl v
.Xc
Отображает список поддерживаемых в данный момент версий файловой системы.
.It Xo
.Nm zfs
.Cm upgrade
.Op Fl r
.Op Fl V Ar version
.Fl a Ns | Ns Ar filesystem
.Xc
Обновляет файловые системы до новой версии на диске.
Как только это будет сделано, файловые системы больше не будут доступны в системах, работающих под управлением более старых версий ZFS.
Потоки
.Nm zfs Cm send ,
сгенерированные из новых снапшотов этих файловых систем, недоступны в
системах, работающих под управлением более старых версий ZFS.
.Pp
Как правило, версия файловой системы не зависит от версии пула.
Смотрите
.Xr zpool-features 7
для получения информации о функциях пулов хранения ZFS.
.Pp
В некоторых случаях версия файловой системы и версия пула взаимосвязаны, и
версия пула должна быть обновлена до того, как можно будет
обновить версию файловой системы.
.Bl -tag -width "filesystem"
.It Fl V Ar version
Обновление
.Ar версии .
Если не указано, обновите до самой последней версии.
Этот
параметр можно использовать только для увеличения номера версии и только до самой
последней версии, поддерживаемой данной версией ZFS.
.It Fl a
Обновите все файловые системы во всех импортированных пулах.
.It Ar filesystem
Обновите указанную файловую систему.
.It Fl r
Обновите указанную файловую систему и все последующие файловые системы.
.El
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zpool-upgrade 8
