melkorbsd/ru-freebsd-man/man8/zfs-promote.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Март 16, 2022
.Dt ZFS-PROMOTE 8
.Os
.
.Sh ИМЯ
.Nm zfs-promote
.Nd сделайте так, чтобы набор данных клонирования больше не зависел от исходного снапшота
.Sh СИНТАКСИС
.Nm zfs
.Cm promote
.Ar clone
.
.Sh ОПИСАНИЕ
Команда
.Nm zfs Cm promote
позволяет уничтожить набор данных, на основе которого был создан
клон.
Отношение родительской и дочерней зависимостей клонирования меняется на противоположное, так что исходный
набор данных становится клоном указанного набора данных.
.Pp
Снапшот, который был клонирован, и все снапшоты, предшествующие этому снапшоту,
теперь принадлежат расширенному клону.
Пространство, которое они используют, перемещается из исходного набора данных в расширенный клон, поэтому
для размещения этих снапшотов должно быть достаточно места.
При выполнении этой операции новое пространство не используется, но корректируется учет занимаемого пространства.
У продвигаемого клона не должно быть собственных имен снапшотов, противоречащих друг другу.
Подкоманду
.Nm zfs Cm rename
можно использовать для переименования любых конфликтующих снапшотов.
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 10 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : Никакого продвижения клона ZFS
Следующие команды иллюстрируют, как протестировать изменения в файловой системе, а
затем заменить исходную файловую систему на измененную, используя клоны,
продвижение клонов и переименование:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm create Ar pool/project/production
  заполнение /pool/project/production with data
.No # Nm zfs Cm snapshot Ar pool/project/production Ns @ Ns Ar today
.No # Nm zfs Cm clone Ar pool/project/production@today pool/project/beta
  внесите изменения в /pool/project/beta и протестируйте их
.No # Nm zfs Cm promote Ar pool/project/beta
.No # Nm zfs Cm rename Ar pool/project/production pool/project/legacy
.No # Nm zfs Cm rename Ar pool/project/beta pool/project/production
  как только устаревшая версия больше не понадобится, ее можно будет уничтожить
.No # Nm zfs Cm destroy Ar pool/project/legacy
.Ed
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-clone 8 ,
.Xr zfs-rename 8
