melkorbsd/ru-freebsd-man/man8/zfs-receive.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd Март 12, 2023
.Dt ZFS-RECEIVE 8
.Os
.
.Sh ИМЯ
.Nm zfs-receive
.Nd создание снапшота из потока резервных копий
.Sh СИНТАКСИС
.Nm zfs
.Cm receive
.Op Fl FhMnsuv
.Op Fl o Sy origin Ns = Ns Ar snapshot
.Op Fl o Ar property Ns = Ns Ar value
.Op Fl x Ar property
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot
.Nm zfs
.Cm receive
.Op Fl FhMnsuv
.Op Fl d Ns | Ns Fl e
.Op Fl o Sy origin Ns = Ns Ar snapshot
.Op Fl o Ar property Ns = Ns Ar value
.Op Fl x Ar property
.Ar filesystem
.Nm zfs
.Cm receive
.Fl A
.Ar filesystem Ns | Ns Ar volume
.Nm zfs
.Cm receive
.Fl c
.Op Fl vn
.Ar filesystem Ns | Ns Ar snapshot
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm receive
.Op Fl FhMnsuv
.Op Fl o Sy origin Ns = Ns Ar snapshot
.Op Fl o Ar property Ns = Ns Ar value
.Op Fl x Ar property
.Ar filesystem Ns | Ns Ar volume Ns | Ns Ar snapshot
.Xc
.It Xo
.Nm zfs
.Cm receive
.Op Fl FhMnsuv
.Op Fl d Ns | Ns Fl e
.Op Fl o Sy origin Ns = Ns Ar snapshot
.Op Fl o Ar property Ns = Ns Ar value
.Op Fl x Ar property
.Ar filesystem
.Xc
Создает снапшот, содержимое которого соответствует указанному в потоке, предоставляемом при
стандартном вводе.
Если получен полный поток, то также создается новая файловая система.
Потоки создаются с использованием подкоманды
.Nm zfs Cm send ,
которая по умолчанию создает полный поток.
.Nm zfs Cm recv
может использоваться в качестве псевдонима для
.Nm zfs Cm receive .
.Pp
Если получен инкрементный поток, то конечная файловая система должна
уже существовать, а ее самый последний снапшот должен соответствовать
источнику инкрементного потока.
Для
.Sy zvols ,
ссылка на целевое устройство уничтожается и создается заново, что означает, что
.Sy zvol
недоступен во время операции
.Cm receive .
.Pp
Когда поток пакетов репликации снапшотов, созданный с помощью команды
.Nm zfs Cm send Fl R ,
при получении команды все снапшоты, которых нет в месте отправки, уничтожаются с помощью команды
.Nm zfs Cm destroy Fl d .
.Pp
Возможность отправлять и получать дедуплицированные потоки сообщений была удалена.
Однако дедуплицированный поток сообщений, созданный с помощью устаревшего программного обеспечения, можно преобразовать
в обычный (не дедуплицированный) поток с помощью команды
.Nm zstream Cm redup .
.Pp
Если
.Fl o Em property Ns = Ns Ar value
или
.Fl x Em property
указано, оно применяется к эффективному значению свойства во
всем поддереве реплицируемых наборов данных.
Будут установлены эффективные значения свойства
.Pq Fl o
или унаследованны
.Pq Fl x
в самом верхнем в реплицируемом поддереве.
В наборах данных‐потомках, если
свойство задано потоком отправки, оно будет переопределено путем принудительного
наследования свойства из самой верхней файловой системы.
Полученные свойства сохраняются, несмотря на то, что они были переопределены, и могут быть восстановлены с помощью
.Nm zfs Cm inherit Fl S .
Определяющий
.Fl o Sy origin Ns = Ns Em snapshot
это особый случай, потому что, даже если свойство
.Sy origin
доступно только для чтения и не может быть установлено, оно позволяет получать поток отправки
как клон данного снапшота.
.Pp
Необработанные зашифрованные потоки отправки (созданные с помощью
.Nm zfs Cm send Fl w )
могут быть получены только как есть и не могут быть повторно зашифрованы, расшифрованы или
сжаты в процессе получения.
Незашифрованные потоки могут быть получены в виде
зашифрованных наборов данных либо путем наследования, либо путем указания
параметров шифрования с помощью параметра
.Fl o .
Обратите внимание, что свойство
.Sy keylocation
не может быть переопределено на
.Sy prompt
во время приема.
Это связано с тем, что сам процесс получения уже использует
стандартные входные данные для потока отправки.
Вместо этого свойство может быть переопределено после завершения приема.
.Pp
Дополнительная защита, обеспечиваемая необработанными отправками, накладывает некоторые ограничения на процесс отправки
и получения.
ZFS не разрешает смешивать необработанные и не-необработанные поступления.
В частности, любые необработанные инкрементные поступления, которые будут предприняты после
получения, не являющегося необработанным, завершатся неудачей.
На получение данных в необработанном виде это ограничение не распространяется, и
поэтому оно всегда возможно.
Поэтому рекомендуется всегда
использовать либо raw sense для обеспечения безопасности, либо non-raw sense для обеспечения
гибкости при работе с зашифрованными наборами данных, но не их комбинацию.
.Pp
Причина этого ограничения кроется в ограничениях, присущих
шифрам AEAD, которые ZFS использует для шифрования данных.
При использовании встроенного шифрования ZFS
каждый блок данных шифруется с помощью случайно сгенерированного номера, известного как
"вектор инициализации" (IV), который хранится в метаданных файловой системы.
Этот номер требуется алгоритмам шифрования всякий раз, когда данные должны
быть расшифрованы.
Вместе взятые, все значения IV, предоставленные для всех блоков в
данном снапшоте, в совокупности называются "набором IV".
Когда ZFS выполняет необработанную отправку, набор IV передается из источника
к получателю в потоке отправки.
Когда ZFS выполняет отправку без обработки исходных данных, данные расшифровываются исходной
системой и повторно шифруются целевой системой, создавая снапшот, содержащий
фактически те же данные, но с другим набором IV.
Чтобы дешифрование работало после необработанной отправки, ZFS должна убедиться, что
набор IV, используемый как на стороне источника, так и на стороне получателя, совпадает.
Когда добавочный необработанный прием выполняется
поверх существующего снапшота, ZFS проверяет, чтобы подтвердить, что снапшот "from"
как в источнике, так и в получателе использовал один и тот же набор IV,
гарантируя согласованность нового набора IV.
.Pp
Название снапшота
.Pq и файловой системы, если получен полный поток
то, что создает эта подкоманда, зависит от типа аргумента и использования параметров
.Fl d
или
.Fl e .
.Pp
Если аргументом является имя снапшота, то указанный
.Ar snapshot
создается.
Если аргументом является имя файловой системы или тома, в течение указанного времени создается снапшот с тем же именем, что и отправленный снапшот.
.Ar filesystem
или
.Ar volume .
Если ни один из параметров
.Fl d
или
.Fl e
не указан, предоставленное имя снапшота используется точно так, как
указано.
.Pp
.Fl d
или
.Fl e
параметры определяют имя файловой системы снапшота путем
добавления части имени отправленного снимка к указанному целевому
.Ar filesystem .
Если указан параметр
.Fl d ,
указывающий все, кроме первого элемента
пути к файловой системе отправленного снапшота
.Pq usually the pool name
используется и создаются все необходимые промежуточные файловые системы
в пределах указанной.
Если указан параметр
.Fl e ,
то используется только последний элемент
имени файловой системы отправленного снапшота
.Pq i.e. the name of the source file system itself
используется в качестве имени целевой файловой системы.
.Bl -tag -width "-F"
.It Fl F
Принудительно выполните откат файловой системы к самому последнему снапшоту перед
выполнением операции получения.
При получении потока добавочной репликации
.Po например, один из них, сгенерированный с помощью
.Nm zfs Cm send Fl R Op Fl i Ns | Ns Fl I
.Pc ,
уничтожьте снапшоты и файловые системы, которые не существуют на стороне отправителя.
.It Fl d
Удалите первый элемент имени файловой системы отправленных снапшотов, используя
оставшиеся элементы для определения имени целевой файловой системы для нового
снапшота, как описано в параграфе выше.
.It Fl e
Удалите все элементы имени файловой системы отправленных снапшотов, кроме последнего, используя
этот элемент для определения имени целевой файловой системы для нового
снапшота, как описано в предыдущем абзаце.
.It Fl h
Пропустите получение отложенных сообщений.
Если отложенные сообщения не отправляются, эффект не будет достигнут.
.It Fl M
Принудительно отключите файловую систему при получении снапшота.
Эта опция не поддерживается в Linux.
.It Fl n
Фактически не получают поток.
Это может быть полезно в сочетании с
.Fl v
возможностью проверить имя, которое будет использоваться в операции получения.
.It Fl o Sy origin Ns = Ns Ar snapshot
Принудительно принимает поток как клон данного снапшота.
Если поток является полным потоком отправки, файловая
система, описываемая потоком, будет создана как клон указанного снапшота.
То, какой снапшот был указан, не повлияет на успешность или неуспешность
получения, пока снапшот существует.
Если поток является инкрементным потоком отправки, будет выполнена вся обычная проверка.
.It Fl o Em property Ns = Ns Ar value
Устанавливает указанное свойство так, как если бы команда
.Nm zfs Cm set Em property Ns = Ns Ar value
была вызвана непосредственно перед получением.
При получении потока из
.Nm zfs Cm send Fl R ,
приводит к тому, что свойство наследуется всеми наборами данных-потомков, как через
.Nm zfs Cm inherit Em property
был запущен на любых наборах данных-потомках, для которых это свойство установлено в
отправляющей системе.
.Pp
Если поток отправки был отправлен с
.Fl c
затем, переопределяя свойство
.Sy compression
не окажет никакого влияния на полученные данные, но будет установлено свойство
.Sy compression .
Чтобы данные были сжаты при получении, удалите флаг
.Fl c
из потока отправки.
.Pp
Во время получения можно задать любое редактируемое свойство.
Однократно устанавливаемые свойства, привязанные
к полученным данным, такие как
.Sy normalization
и
.Sy casesensitivity ,
не могут быть установлены во время получения, даже если наборы данных были созданы заново пользователем.
.Nm zfs Cm receive .
Кроме того, оба настраиваемых свойства
.Sy version
и
.Sy volsize
не могут быть установлены во время приема.
.Pp
.Fl o
параметр может быть указан несколько раз для разных свойств.
Если одно и то же свойство указано в нескольких параметрах
.Fl o
или
.Fl x .
.Pp
.Fl o
опция также может использоваться для переопределения свойств шифрования при первоначальном получении.
Это позволяет получать незашифрованные потоки в виде зашифрованных наборов данных.
Чтобы полученный набор данных (или корневой набор данных рекурсивного потока) был
получен в качестве корневого файла шифрования, укажите свойства шифрования таким же
образом, как это требуется для
.Nm zfs Cm create .
Например:
.Dl # Nm zfs Cm send Pa tank/test@snap1 | Nm zfs Cm recv Fl o Sy encryption Ns = Ns Sy on Fl o Sy keyformat Ns = Ns Sy passphrase Fl o Sy keylocation Ns = Ns Pa file:///path/to/keyfile
.Pp
Обратите внимание, что
.Fl o Sy keylocation Ns = Ns Sy prompt
здесь может не указываться, поскольку стандартный ввод
уже используется для потока отправки.
После завершения приема вы можете использовать
.Nm zfs Cm set ,
чтобы изменить этот параметр постфактум.
Аналогичным образом, вы можете получить набор данных в качестве зашифрованного дочернего элемента, указав
.Fl x Sy encryption ,
чтобы принудительно унаследовать свойство.
Переопределение свойств шифрования (за исключением
.Sy keylocation )
это невозможно при использовании необработанных потоков отправки.
.It Fl s
Если прием прерван, сохраните частично полученное состояние, а
не удаляйте его.
Прерывание может быть вызвано преждевременным завершением потока
.Po e.g. due to network failure or failure of the remote system
если поток считывается по сетевому соединению
.Pc ,
ошибка контрольной суммы в потоке, прекращает действие
.Nm zfs Cm receive
процесса или неправильное завершение работы системы.
.Pp
Прием может быть возобновлен с помощью потока, сгенерированного
.Nm zfs Cm send Fl t Ar token ,
где
.Ar token
является значением свойства
.Sy receive_resume_token
файловой системы или тома, в который поступает сообщение.
.Pp
Чтобы использовать этот флаг, пул хранения должен иметь функцию включения
.Sy extensible_dataset .
Смотрите подробную информацию о флагах функций ZFS в
.Xr zpool-features 7 .
.It Fl u
Файловая система, связанная с полученным потоком, не подключена.
.It Fl v
Выведите подробную информацию о потоке и времени, необходимом для выполнения
операции приема.
.It Fl x Em property
Гарантирует, что действительное значение указанного свойства после
получения не зависит от значения этого свойства в потоке отправки (если таковое имеется),
как если бы это свойство было исключено из потока отправки.
.Pp
Если указанное свойство отсутствует в потоке отправки, этот параметр
ничего не делает.
.Pp
Если полученное свойство необходимо переопределить, то будет
установлено или унаследовано действующее значение, в зависимости от того, является ли это свойство наследуемым или нет.
.Pp
В случае постепенного обновления,
.Fl x
оставляет без изменений все существующие локальные настройки или явное наследование.
.Pp
Все ограничения
.Fl o
(например, установленные один раз) в равной степени распространяются на
.Fl x .
.El
.It Xo
.Nm zfs
.Cm receive
.Fl A
.Ar filesystem Ns | Ns Ar volume
.Xc
Прервать прерванное
.Nm zfs Cm receive Fl s ,
удаление его сохраненного частично полученного состояния.
.It Xo
.Nm zfs
.Cm receive
.Fl c
.Op Fl vn
.Ar filesystem Ns | Ns Ar snapshot
.Xc
Попытайтесь восстановить поврежденные данные в указанном наборе данных,
используя предоставленный поток в качестве источника исправных данных.
Этот метод восстановления позволяет восстановить только блоки данных, присутствующие в потоке.
Метаданные не могут быть восстановлены с помощью корректирующего приема.
После восстановления рекомендуется выполнить очистку, чтобы убедиться, что все повреждения данных были
устранены.
.Pp
В первую очередь важно понять, почему произошло повреждение.
Если у вас медленно выходит из строя оборудование, периодическое восстановление данных
не спасет вас от потери данных в дальнейшем, когда оборудование
полностью выйдет из строя.
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 12, 13 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : Отсутствие удаленной репликации данных ZFS
Следующие команды отправляют полный поток, а затем добавочный поток на
удаленный компьютер, восстанавливая их в
.Em poolB/received/fs@a
и
.Em poolB/received/fs@b ,
соответственно.
.Em poolB
должен содержать файловую систему
.Em poolB/received ,
и изначально не должен содержать
.Em poolB/received/fs .
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm send Ar pool/fs@a |
.No "   " Nm ssh Ar host Nm zfs Cm receive Ar poolB/received/fs Ns @ Ns Ar a
.No # Nm zfs Cm send Fl i Ar a pool/fs@b |
.No "   " Nm ssh Ar host Nm zfs Cm receive Ar poolB/received/fs
.Ed
.
.Ss Пример 2 : Нет возможности использовать файл приема Nm zfs Cm Без регистрации
Следующая команда отправляет полный поток
.Ar poolA/fsA/fsB@snap
на удаленный компьютер, получая его в
.Ar poolB/received/fsA/fsB@snap .
.Ar fsA/fsB@snap
часть имени полученных моментальных снимков определяется на основе имени отправленного
моментального снимка.
.Ar poolB
должен содержать файловую систему
.Ar poolB/received .
Если
.Ar poolB/received/fsA
не существует, она создается как пустая файловая система.
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm send Ar poolA/fsA/fsB@snap |
.No "   " Nm ssh Ar host Nm zfs Cm receive Fl d Ar poolB/received
.Ed
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-send 8 ,
.Xr zstream 8
