melkorbsd/ru-freebsd-man/man8/zfs-destroy.8
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or https://opensource.org/licenses/CDDL-1.0.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2011 Joshua M. Clulow <josh@sysmgr.org>
.\" Copyright (c) 2011, 2019 by Delphix. All rights reserved.
.\" Copyright (c) 2013 by Saso Kiselkov. All rights reserved.
.\" Copyright (c) 2014, Joyent, Inc. All rights reserved.
.\" Copyright (c) 2014 by Adam Stevko. All rights reserved.
.\" Copyright (c) 2014 Integros [integros.com]
.\" Copyright 2019 Richard Laager. All rights reserved.
.\" Copyright 2018 Nexenta Systems, Inc.
.\" Copyright 2019 Joyent, Inc.
.\"
.Dd March 16, 2022
.Dt ZFS-DESTROY 8
.Os
.
.Sh ИМЯ
.Nm zfs-destroy
.Nd уничтожает набор данных ZFS, снапшоты или закладки
.Sh СИНТАКСИС
.Nm zfs
.Cm destroy
.Op Fl Rfnprv
.Ar filesystem Ns | Ns Ar volume
.Nm zfs
.Cm destroy
.Op Fl Rdnprv
.Ar filesystem Ns | Ns Ar volume Ns @ Ns Ar snap Ns
.Oo % Ns Ar snap Ns Oo , Ns Ar snap Ns Oo % Ns Ar snap Oc Oc Oc Ns …
.Nm zfs
.Cm destroy
.Ar filesystem Ns | Ns Ar volume Ns # Ns Ar bookmark
.
.Sh ОПИСАНИЕ
.Bl -tag -width ""
.It Xo
.Nm zfs
.Cm destroy
.Op Fl Rfnprv
.Ar filesystem Ns | Ns Ar volume
.Xc
Уничтожает данный набор данных.
По умолчанию команда отменяет общий доступ ко всем файловым системам, которые в данный момент являются общими,
размонтирует все файловые системы, которые в данный момент подключены, и отказывается уничтожать
набор данных, у которого есть активные зависимые элементы
.Pq дочерние или клоны .
.Bl -tag -width "-R"
.It Fl R
Рекурсивно уничтожает все зависимые системы, включая клонированные файловые системы за пределами
целевой иерархии.
.It Fl f
Принудительно размонтирует файловые системы.
Этот параметр не влияет на нефайловые системы или несмонтированные файловые системы.
.It Fl n
Проводит пробный запуск удаления
.Pq Qq No-op .
Никакие данные не будут удалены.
Это полезно в сочетании с флагами
.Fl v
или
.Fl p ,
определяющими, какие данные будут удалены.
.It Fl p
Выдает подробную информацию об удаленных данных, поддающуюся машинному анализу.
.It Fl r
Рекурсивно уничтожает все дочерние элементы.
.It Fl v
Выводит подробную информацию об удаленных данных.
.El
.Pp
Следует соблюдать крайнюю осторожность при нанесении любого параметра
.Fl r
или
.Fl R ,
поскольку они могут уничтожить большую часть пула и вызвать непредвиденное
поведение подключенных файловых систем в процессе использования.
.It Xo
.Nm zfs
.Cm destroy
.Op Fl Rdnprv
.Ar filesystem Ns | Ns Ar volume Ns @ Ns Ar snap Ns
.Oo % Ns Ar snap Ns Oo , Ns Ar snap Ns Oo % Ns Ar snap Oc Oc Oc Ns …
.Xc
Данные снапшоты будут немедленно уничтожены тогда и только тогда, когда команда
.Nm zfs Cm destroy
без параметра
.Fl d
уничтожила бы их.
Такое немедленное уничтожение произошло бы, например, если бы в снапшоте не
было клонов, а количество ссылок, инициированных пользователем, было равно нулю.
.Pp
Если снапшот не подходит для немедленного уничтожения, он помечается для
отложенного удаления.
В этом состоянии он существует как доступный для использования, видимый снапшот до тех пор, пока не будут выполнены оба
перечисленных выше предварительных условия, после чего он будет уничтожен.
.Pp
Можно указать полный диапазон снапшотов, разделив первый и
последний снапшоты знаком процента.
Первый и/или последний снапшоты можно оставить незаполненными, в этом случае
будет указан самый старый или самый новый снапшот файловой системы.
.Pp
Несколько снапшотов
.Pq или диапазоны снапшотов
одной и той же файловой системы или тома могут быть указаны в списке
снапшотов, разделенных запятыми.
Только краткое название снапшота
.Po the part after the
.Sy @
.Pc
следует указывать при использовании диапазона или списка, разделенного запятыми, для идентификации
нескольких моментальных снапшотов.
.Bl -tag -width "-R"
.It Fl R
Рекурсивно уничтожает все клоны этих снапшотов, включая клоны,
снапшоты и дочерние элементы.
Если этот флаг указан, то флаг
.Fl d
не будет иметь никакого эффекта.
.It Fl d
Немедленное уничтожение.
Если снапшот не может быть уничтожен сейчас, отмечает его для отложенного уничтожения.
.It Fl n
Проводит пробный запуск удаления
.Pq Qq No-op .
Никакие данные не будут удалены.
Это полезно в сочетании с флагами
.Fl p
или
.Fl v ,
определяющими, какие данные будут удалены.
.It Fl p
Выдает подробную информацию об удаленных данных, поддающуюся машинному анализу.
.It Fl r
Уничтожает
.Pq или отмечает для отложенного удаления
все снапшоты с таким именем в последующих файловых системах.
.It Fl v
Выводит подробную информацию об удаленных данных.
.Pp
Следует соблюдать крайнюю осторожность при применении любого параметра
.Fl r
или
.Fl R ,
поскольку они могут уничтожить большую часть пула и вызвать непредвиденное
поведение подключенных файловых систем в процессе использования.
.El
.It Xo
.Nm zfs
.Cm destroy
.Ar filesystem Ns | Ns Ar volume Ns # Ns Ar bookmark
.Xc
Данная закладка уничтожена.
.El
.
.Sh ПРИМЕРЫ
.\" These are, respectively, examples 3, 10, 15 from zfs.8
.\" Make sure to update them bidirectionally
.Ss Пример 1 : No Создание и уничтожение нескольких снапшотов
Следующая команда создает снапшоты с именами
.Ar yesterday No в Ar pool/home
и все его дочерние файловые системы.
Каждый снапшот монтируется по требованию в
.Pa .zfs/snapshot
каталог в корне его файловой системы.
Вторая команда уничтожает вновь созданные снапшоты.
.Dl # Nm zfs Cm snapshot Fl r Ar pool/home Ns @ Ns Ar yesterday
.Dl # Nm zfs Cm destroy Fl r Ar pool/home Ns @ Ns Ar yesterday
.
.Ss Пример 2 : No Продвижение клона ZFS
Следующие команды иллюстрируют, как протестировать изменения в файловой системе, а
затем заменить исходную файловую систему на измененную, используя клоны,
продвижение клонов и переименование:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm create Ar pool/project/production
  populate /pool/project/production with data
.No # Nm zfs Cm snapshot Ar pool/project/production Ns @ Ns Ar today
.No # Nm zfs Cm clone Ar pool/project/production@today pool/project/beta
  make changes to /pool/project/beta and test them
.No # Nm zfs Cm promote Ar pool/project/beta
.No # Nm zfs Cm rename Ar pool/project/production pool/project/legacy
.No # Nm zfs Cm rename Ar pool/project/beta pool/project/production
  once the legacy version is no longer needed, it can be destroyed
.No # Nm zfs Cm destroy Ar pool/project/legacy
.Ed
.
.Ss Пример 3 : No Выполнение движущегося снапшота
В следующем примере показано, как вести журнал снапшотов с
помощью согласованной схемы именования.
Чтобы сохранить снапшоты за неделю, пользователь удаляет самый старый снапшот,
переименовывает оставшиеся снапшоты и затем создает новый снапшот следующим образом:
.Bd -literal -compact -offset Ds
.No # Nm zfs Cm destroy Fl r Ar pool/users@7daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@6daysago No @ Ns Ar 7daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@5daysago No @ Ns Ar 6daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@4daysago No @ Ns Ar 5daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@3daysago No @ Ns Ar 4daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@2daysago No @ Ns Ar 3daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@yesterday No @ Ns Ar 2daysago
.No # Nm zfs Cm rename Fl r Ar pool/users@today No @ Ns Ar yesterday
.No # Nm zfs Cm snapshot Fl r Ar pool/users Ns @ Ns Ar today
.Ed
.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr zfs-create 8 ,
.Xr zfs-hold 8
