melkorbsd/ru-freebsd-man/man8/zfsboot.8
.\" Copyright (c) 2014 Andriy Gapon <avg@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd Март 27, 2018
.Dt ZFSBOOT 8
.Os
.Sh ИМЯ
.Nm zfsboot
.Nd загрузочный код для ZFS на компьютерах с BIOS
.Sh ОПИСАНИЕ
.Nm
используется на компьютерах на базе BIOS для загрузки из файловой системы в
объединении ZFS.
.Nm
устанавливается в двух частях на диск или раздел, используемый объединеним ZFS.
Первая часть, односекторный стартовый загрузочный блок, устанавливается
в начале диска или раздела.
Вторая часть, основной загрузочный блок, устанавливается со специальным смещением
внутри диска или раздела.
Обе области зарезервированы спецификацией ZFS on-disk для использования при загрузке.
Если
.Nm
устанавливается в раздел, затем этот раздел следует сделать
загрузочным, используя соответствующую конфигурацию и загрузочные блоки, описанные в
.Xr boot 8 .
.Sh ЗАГРУЗКА
Процесс зашрузки
.Nm
очень похож на процесс
.Xr gptzfsboot 8 .
Одно из существенных отличий заключается в том, что
.Nm
в настоящее время не поддерживает схему секционирования GPT.
Таким образом, только целые диски и MBR-разделы, традиционно называемые
фрагментами, проверяются на наличие меток дисков ZFS.
Смотрите раздел об ошибках в
.Xr gptzfsboot 8
из-за некоторых ограничений поддержки схемы MBR.
.Sh ИСПОЛЬЗОВАНИЕ
.Nm
поддерживает все те же аргументы командной строки и файла конфигурации, что и
.Xr gptzfsboot 8 .
.Sh ФАЙЛЫ
.Bl -tag -width /boot/zfsboot -compact
.It Pa /boot/zfsboot
двоичный загрузочный код
.It Pa /boot.config
параметры для загрузочного блока
.Pq необязательно
.It Pa /boot/config
альтернативные параметры для загрузочного блока
.Pq необязательно
.El
.Sh ПРИМЕРЫ
.Nm
обычно устанавливается с помощью
.Xr dd 1 .
Установка
.Nm
на
.Pa ada0
диск:
.Bd -literal -offset indent
dd if=/boot/zfsboot of=/dev/ada0 count=1
dd if=/boot/zfsboot of=/dev/ada0 iseek=1 oseek=1024
.Ed
.Pp
Если диск в данный момент используется, функция GEOM safety предотвратит запись
данных и должна быть отключена перед выполнением вышеуказанных команд:
.Bd -literal -offset indent
sysctl kern.geom.debugflags=0x10
.Ed
.Pp
.Nm
также может быть установлен в MBR-срез:
.Bd -literal -offset indent
gpart create -s mbr ada0
gpart add -t freebsd ada0
gpart bootcode -b /boot/boot0 ada0
gpart set -a active -i 1 ada0
dd if=/dev/zero of=/dev/ada0s1 count=2
dd if=/boot/zfsboot of=/dev/ada0s1 count=1
dd if=/boot/zfsboot of=/dev/ada0s1 iseek=1 oseek=1024
.Ed
.Pp
Обратите внимание, что команды для создания и заполнения пула
в приведенном выше примере не показаны.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr dd 1 ,
.Xr boot.config 5 ,
.Xr boot 8 ,
.Xr gptzfsboot 8 ,
.Xr loader 8 ,
.Xr zpool 8
.Sh ИСТОРИЯ
.Nm
появился во FreeBSD 7.3.
.Sh АВТОРЫ
Эта страница руководства была написана
.An Андрей Гапон Aq avg@FreeBSD.org .
.Sh ПРОБЛЕМЫ
Установка
.Nm
с
.Xr dd 1
это взлом.
Для правильной установки ZFS 
.Nm
требуется команда на диск или раздел, управляемый ZFS.
