melkorbsd/ru-freebsd-man/man8/zfsbootcfg.8
.\" Copyright (c) 2016 Andriy Gapon
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 22, 2020
.Dt ZFSBOOTCFG 8
.Os
.Sh ИМЯ
.Nm zfsbootcfg
.Nd "указывает параметры zfsboot для следующей загрузки"
.Sh КРАТКИЙ ОБЗОР
.Nm
.Ao Ar options Ac
.Nm
.Op Fl n Ar name
.Op Fl k Ar key
.Op Fl p
.Op Fl t Ar type
.Op Fl v Ar value
.Op Fl z Ar pool
.Nm
.Sh ОПИСАНИЕ
.Nm
используется для установки
.Xr boot.config 5 Ns -style
опциq, которые будут использоваться
.Xr zfsboot 8 ,
.Xr gptzfsboot 8
или
.Xr loader 8
при следующей загрузке компьютера.
Однажды
.Xr zfsboot 8
или
.Xr gptzfsboot 8
или
.Xr loader 8
при считывании информации она удаляется.
Если загрузка завершается неудачно, компьютер автоматически возвращается к предыдущей
конфигурации загрузки.
Информация сохраняется в специальной области среды загрузки в пула ZFS.
.Pp
Если используется без аргументов,
.Nm
выведет текущую конфигурацию загрузки, если она задана.
.Pp
Следующие опции поддерживаются
.Nm :
.Bl -tag -width indent
.It Fl k Ar key
Определяет ключ для
.Ao key , value Ac
пары.
.It Fl n Ar name
Обновляет список nvlist
.Ar name .
.It Fl p
Печатает всю информацию, хранящуюся в области загрузка пула ZFS.
.It Fl t Ar type
Устанавливает тип
.Ar value
используемый в
.Ao key , value Ac
паре.
В настоящее время поддерживаются следующие типы:
.Bl -tag -width indent -compact
.It Ar DATA_TYPE_BYTE
.It Ar DATA_TYPE_INT8
.It Ar DATA_TYPE_UINT8
.It Ar DATA_TYPE_INT16
.It Ar DATA_TYPE_UINT16
.It Ar DATA_TYPE_INT32
.It Ar DATA_TYPE_UINT32
.It Ar DATA_TYPE_INT64
.It Ar DATA_TYPE_UINT64
.It Ar DATA_TYPE_BOOLEAN_VALUE
.It Ar DATA_TYPE_STRING
.El
.Pp
Если не указано, то по умолчанию используется
.Ar DATA_TYPE_STRING .
.It Fl v Ar value
Определяет значение для
.Ao key , value Ac
пары.
.It Fl z Ar pool
Работает с
.Ar pool .
.El
.Sh ОКРУЖЕНИЕ
.Bl -tag -width vfs.root.mountfrom -compact
.It Ev vfs.root.mountfrom
.Xr kenv 1
переменная, определяющая пул, для которого записаны параметры.
.El
.Sh ПРИМЕРЫ
Попробуем загрузить на новый
.Em boot environment
без изменения
.Cm bootfs
свойство пула:
.Pp
.Dl "zfsbootcfg ""zfs:tank/ROOT/newbe:""
.Pp
Чтобы очистить параметры загрузки:
.Pp
.Dl "zfsbootcfg """"
.Sh СМОТРИТЕ ТАКЖЕ
.Xr boot.config 5 ,
.Xr bectl 8 ,
.Xr gptzfsboot 8 ,
.Xr loader 8 ,
.Xr zfsboot 8
.Sh ИСТОРИЯ
.Nm
появился в
.Fx 11.1 .
.Sh АВТОРЫ
Эта страница руководства была написана
.An Андрей Гапон Aq Mt avg@FreeBSD.org .
