melkorbsd/ru-freebsd-man/man8/zfsd.8
.\"-
.\" Copyright (c) 2016 Allan Jude
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 18, 2020
.Dt ZFSD 8
.Os
.Sh ИМЯ
.Nm zfsd
.Nd Демон управления сбоями ZFS
.Sh КРАТКИЙ ОБЗОР
.Nm
.Op Fl d
.Sh ОПИСАНИЕ
.Nm
пытается устранить ошибки ZFS, которые ядро не может устранить самостоятельно.
Оно прослушивает
.Xr devctl 4
события, с помощью которых ядро уведомляет пользователей о таких событиях, как ошибки ввода
-вывода и удаление диска.
.Nm
пытается устранить эти неисправности, активируя или деактивируя горячие запасные
части и подключая автономные vdevs в режиме онлайн.
.Pp
Доступны следующие параметры:
.Bl -tag -width indent
.It Fl d
Запускается на переднем плане вместо демонстрации.
.El
.Pp
Системные администраторы никогда не взаимодействуют с
.Nm
непосредственно..
Вместо этого они управляют его поведением косвенно через конфигурацию zpool.
Есть два способа повлиять на
.Nm :
назначением горячих точек и настройкой свойств пула.
В настоящее время только свойство
.Em автоматического замещения
имеет какой-либо эффект.
Смотрите
.Xr zpool 8
для получения подробной информации.
.Pp
.Nm
пытается устранить следующие типы неисправностей:
.Bl -tag -width a
.It device removal
Когда лист vdev исчезает,
.Nm
активирует любой доступный hotspare.
.It device arrival
При появлении нового устройства GEOM,
.Nm
попытается прочитать его ZFS-метку, если таковая имеется.
Если она соответствует ранее удаленному vdev в активном пуле,
.Nm
подключит его к сети.
Как только повторное подключение завершится, все активные hotspare будут автоматически отключены.
.Pp
Если у нового устройства нет метки ZFS, но его физический путь совпадает с
физическим путем к ранее удаленному vdev в активном пуле и для этого
пула установлено свойство autoreplace, то
.Nm
заменит отсутствующий vdev на вновь поступившее устройство.
После завершения повторного подключения все активные hotspare будут автоматически отключены.
.It vdev degrade or fault events
Если vdev становится неисправным,
.Nm
активирует любой доступный hotspare.
.It I/O errors
Если конечный vdev генерирует более 50 ошибок ввода-вывода за 60 секунд, то
.Nm
пометит этот vdev как
.Em FAULTED .
ZFS больше не будет выполнять никаких операций ввода-вывода для него.
.Nm
активирует резервную копию, если таковая имеется.
.It Checksum errors
Если конечный vdev генерирует более 50 ошибок контрольной суммы за 60
секунд, то
.Nm
пометит этот vdev как
.Em DEGRADED .
ZFS по-прежнему будет использовать его, но zfsd все равно активирует запасной.
.It Spare addition
Если системный администратор добавляет hotspare в пул, который уже поврежден,
.Nm
активирует запасной.
.It Resilver complete
.Nm
отсоединит все запасные части, как только будет завершена постоянная замена.
.It Physical path change
Если физический путь к существующему диску изменится,
.Nm
попытается заменить любой отсутствующий диск тем же физическим путем,
если задано свойство autoreplace для его пула.
.El
.Pp
.Nm
будет легко регистрировать интересные события и свои действия в системном журнале
.Em демона
и идентично
.Op zfsd .
.El
.Sh ФАЙЛЫ
.Bl -tag -width a -compact
.It Pa /var/db/zfsd/cases
Когда
.Nm
завершает работу, он сериализует все неразрешенные файлы обращений здесь,
а затем считывает их обратно при следующем запуске.
.El
.Sh СМОТРИТЕ ТАКЖЕ
.Xr devctl 4 ,
.Xr zpool 8
.Sh ИСТОРИЯ
.Nm
впервые появился в
.Fx 11.0 .
.Sh АВТОРЫ
.Nm
первоначально была написана
.An Джастином Гиббсом, штат Массачусетс gibbs@FreeBSD.org
и
.An Аланом Сомерсом, штат Массачусетс asomers@FreeBSD.org
.Sh В РАЗРАБОТКЕ
В будущем,
.Nm
должна быть возможность возобновить работу пула, который был приостановлен из-за
удаления устройств, если было возвращено достаточное количество отсутствующих устройств.
